[{"id":124404,"title":"Preview: Spirit Week to kick off with Theme Day","permalink":"http:\/\/palyvoice.com\/2016\/10\/16\/preview-spirit-week-to-kick-off-with-theme-day\/","content":"The most anticipated week of the year, Spirit Week, kicks off this Monday at Palo Alto High School with Theme Day.\r\n\r\nOn Theme Day, students from each grade dress up based on a theme voted on by their class. Each theme corresponds with each class’ color: orange for freshmen, red for sophomores, yellow for juniors and green for seniors.\r\n\r\nThis year, the freshman theme is “Eye of the Tiger,” the sophomore theme is “Firefighters,” the junior theme is “Boxing” and the senior theme is “Game Over.” Rather than wearing clothes that correspond to their theme, due to Paly tradition, seniors instead wear 90s apparel on Monday.\r\n\r\nThis year, Spirit Week festivities open at lunch on the football field with the lunchtime rally, which will feature three main events: Knee Trembler, Banana Bump and Pass the Water.\r\n\r\nKnee Trembler, a new event to Paly Spirit Week, is a mini relay race consisting of three students from each grade. Using only their knees, students must pick up an orange and hop over to a hula hoop placed on the ground. Whoever has placed the most oranges in the hoop at the end of a minute will win.\r\n\r\nFollowing the Knee Trembler game, the Banana Bump event will take place. This time, only one student from each grade will participate. The student will have a banana tied around his or her waist and must bump an orange, using the banana, past the finish line.\r\n\r\n\"The other new game is Pass the Water,\" ASB Spirit Commissioner Michaela Fogarty said. \"Participants line up and transfer water from one bucket to another by passing it to each other over their heads with cups. The grade with the most water in the final bucket wins.\"\r\n\r\nAccording to Fogarty, the results of the events are unpredictable.\r\n\r\n\"None of the grades are projected to win any of the games,\" Fogarty said. \"It should be very competitive and exciting to watch.\"\r\n\r\nIn addition to the points awarded for the events, class cheers and scores for best dressed will award each grade with extra points. Cheers at each rally can earn up to 800 points for first place and up to 500 points for the best dressed contest.\r\n\r\nUp to 150 points of deductions are possible for sportsmanship and cleanliness.\r\n\r\nFor more information on lunchtime rallies and the Spirit Week scoring system, refer to the <a href=\"https:\/\/sites.google.com\/site\/pahsasb\/sw2016\" target=\"_blank\">ASB master schedule<\/a>. And don't forget to use #palyspirit on all of your social media posts for a chance to have it featured on the Paly Voice website.","excerpt":"The most anticipated week of the year, Spirit Week, kicks off this Monday at Palo Alto High School with Theme Day.","date":"2016-10-16 21:28:00","author":"Isabella Marcus","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/DSC_0197.jpg","categories":["News","Spirit Week 2016","Spotlight"],"tags":["#palyspirit","#spiritweek","90s","boxing","eye of the tiger","firefighters","palo alto high school","paly","paly spirit week","Spirit Week"]},{"id":124407,"title":"Use the hashtag #palyspirit to have your Spirit Week photos featured on the Paly Voice","permalink":"http:\/\/palyvoice.com\/2016\/10\/16\/use-the-hashtag-palyspirit-to-have-your-spirit-week-photos-featured-on-the-paly-voice\/","content":"","excerpt":"","date":"2016-10-16 15:59:14","author":"Chirag Akella","categories":["Ticker"],"tags":[]},{"id":124260,"title":"School board to discuss weighted vs. unweighted transcripts","permalink":"http:\/\/palyvoice.com\/2016\/10\/16\/school-board-to-discuss-weighted-vs-unweighted-transcripts\/","content":"The Palo Alto Unified School District Board of Education will be discussing whether PAUSD high schools will be submitting weighted or unweighted grade point averages to colleges at <a href=\"http:\/\/www.boarddocs.com\/ca\/pausd\/Board.nsf\/goto?open=&amp;id=AEETTD772CFC\">6:30 Tuesday, Oct. 18 at the district office.<\/a>\r\n\r\nThe meeting will include a discussion of grade reporting after concerns were raised by parents and students. The full discussion agenda can be found <a href=\"http:\/\/www.boarddocs.com\/ca\/pausd\/Board.nsf\/goto?open=&amp;id=AEETTD772CFC\">here<\/a>.\r\n\r\nA number of Palo Alto parents and students are pushing for the option of reporting weighted GPAs, and have sent numerous messages to Paly administration and the school board, according to Principal Kim Diorio.\r\n\r\nPTSA President Katie Shade sent an e-mail to Paly parents on Wednesday to inform them of Paly's <a href=\"https:\/\/docs.google.com\/document\/d\/1dgRurvVuzDXtwWqByW2LQgKYiFhHWuQ84r_lCxhSteY\/edit\">position statement<\/a> in response to the message.\r\n\r\nPaly's position paper states that the administration and faculty \"feel strongly that when schools use weighted grades, a culture of competition and stress develops\" and stand against submitting weighted GPAs. Stating there should be no submitting of weighted GPAs for this years' graduating class, which has caused uproar from some parents and students\r\n\r\nIn a meeting with the Paly Associated Student Body, Diorio outlined her concerns with submitting weighted GPAs.\r\n\r\n\"By having an unweighted transcript, it draws focus away from student competition and will help reduce stress,\" Diorio said. \"[Gunn Principal] Dr. [Denise] Herrmann and I have <span style=\"font-weight: 400;\">big goals in redefining success and strengthening Gunn and Paly culture. We want to have a<\/span><span style=\"font-weight: 400;\">lternate pathways to success, where students are more than their GPA.\"<\/span>\r\n\r\nAccording to Diorio, for the past 35 years Paly has been exclusively reporting unweighted grades. Neither Gunn nor Paly report weighted grades on transcripts, and Gunn reports weighted grades within applications.\r\n\r\nGunn School Board Representative senior Ankit Ranjan says this difference between the schools' reporting methods has pushed students from both PAUSD high schools to voice their opinions on the matter at the upcoming board meeting.\r\n\r\n\"Gunn students can ask to have either their weighted or unweighted GPA reported [to colleges],\" Ranjan said. \"We're currently working with members of the Paly community with [Paly senior] Maya Katz in getting more students involved at Tuesday's board meeting.\"\r\n\r\nAccording to the <a href=\"http:\/\/www.boarddocs.com\/ca\/pausd\/Board.nsf\/goto?open&amp;id=AEPV5U7F1FB4\">School Board agenda<\/a>, the primary argument in support of weighted grades to this point has revolved around scholarships for out of state public schools, particularly University of Oregon. Scholarship money is important, and according to counselors, is increasingly more of a factor for students making decisions as to what institutions they will apply to and attend.  The discussion around weighted grading arose from a conversation several months ago regarding the University of Oregon’s practices for awarding merit scholarships.  The University awards an automatic $36,000 Summit Scholarship for out of state students with a GPA of 3.8 or higher, and an automatic $16,000 Apex Scholarship for a GPA of 3.6 or higher.  They do not recalculate GPAs and only use what is on the transcript.\r\n\r\nConcerns raised by parent and students of the Paly community are primarily represented by Katz and her family. Katz has recently reached out to Paly and Gunn Student Executive Council (SEC) in bringing more student voice into the issue.\r\n\r\nIn a subsequent meeting with Paly ASB, Katz articulated her position on the issue, stating the need for the submission of weighted GPAs for students seeking scholarships.\r\n\r\n\"I've come to ASB to get more students informed on the issue, and to make sure students are able to understand what is at stake,\" Katz said. \"By releasing only unweighted GPAs we become ineligible for merit-based scholarships for universities. Students with an unweighted GPA of 3.75, for example, and a weighted GPA of 4.0 will not be eligible for scholarships that require a 3.8. That's $36,000 or more just because of the report. I've spoken to the admissions staff for universities like University of Oregon and they blatantly said they would not accept this GPA for a scholarship. If a weighted GPA were submitted, this wouldn't be the case.\"\r\n\r\nKatz says she wants all students to have a say regardless of if they agree or disagree with her opinion, and is currently working with her family and a community of parents in doing research to better inform members of the Paly community of the issue.\r\n\r\n\"There are a lot of parents involved in this, and it's important to be getting more students involved,\" Katz said. \"It will affect them directly.\"\r\n\r\nKatz will be speaking at the upcoming board meeting this Tuesday.\r\n\r\nMcGee recommends that the board not make any change for this years' graduating seniors (class of 2017), and then make a decision after community involvement. He has mentioned that he is predisposed to not offering a weighted grade option in order to limit our emphasis on honors and AP classes, but doesn't want to make a decision without consulting students, according to statements made by Ranjan, Diorio and Paly School Board Representative David Tayeri.\r\n\r\nAccording to McGee, the board meeting will not feature a vote on the issue that day, but will instead be a chance for an open discussion that could lead to a vote in the future.\r\n\r\n\"Please let everyone know that there is no action item on the agenda for the 18th,\" McGee stated according to the email from Shade. \"[The meeting] is an information[al] discussion item that may or may not lead to action at a future date.”\r\n\r\nMcGee is interested in receiving comprehensive student input, according to Tayeri. McGee has contacted Tayeri in providing an outlet for students to voice their concerns.\r\n\r\n\"Until a couple years ago, board members would buy pizza and invite students to discuss their views on issues,\" Tayeri said. \"They'd have time to talk to board members one-on-one. They haven't done this in a few years, but I think it would be a good idea to bring that back. There is enough student engagement that we would have a good turnout.\"","excerpt":"The Palo Alto Unified School District Board of Education will be discussing whether PAUSD High Schools' will be submitting weighted or unweighted grade point averages (GPAs) to colleges at 6:30 Tuesday Oct. 18. at the district office.","date":"2016-10-16 15:52:33","author":"Bianca Al-Shamari","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2012\/10\/IMG_0070.jpg","categories":["News","Spotlight"],"tags":["ASB","board meeting","college","diorio","gpa","grades","gunn","herrmann","high school","McGee","paly","sec","tayeri","transcipts","unweighted","weighted"]},{"id":124267,"title":"Vikings defeat Gunn to redeem themselves","permalink":"http:\/\/palyvoice.com\/2016\/10\/16\/vikings-defeat-gunn-to-redeem-themselves\/","content":"[caption id=\"attachment_124368\" align=\"alignnone\" width=\"602\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Celebration1.jpg\"><img class=\" wp-image-124368\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Celebration1.jpg\" alt=\"The Vikings celebrate last night in the Gunn High School gym. According to Viking head coach Jekara Wilson, the match was an emotional and mental ordeal for the team. &quot;Obviously emotions are running high,&quot; Wilson said. &quot;It's definitely a mental match more than anything.&quot;\" width=\"602\" height=\"401\" \/><\/a> The Vikings celebrate Friday night after winning a point in the Gunn High School gym. According to Viking head coach Jekara Wilson, the match was an intense ordeal for the team. \"Obviously, emotions are running high,\" Wilson said. \"It's definitely a mental match more than anything.\" Photo: William Sallomi[\/caption]\r\n\r\nA few days after their first league loss of the season, the Palo Alto High School volleyball team (15-7, 8-1) defeated the Gunn High School Titans (14-12, 8-1) in three nail-biting sets Friday night in the Gunn gym.\r\n\r\nThe team narrowly took each set by only two points. The Vikings won the first set (26-24), the second set (28-26) and the third set (26-24).\r\n\r\nViking head coach Jekara Wilson said she is proud of the group's performance against a team as strong as Gunn.\r\n\r\n\"I think they performed well,\" Wilson said. \"I think that [a close game] is going to happen any time we [Paly and Gunn] play each other,\" Wilson said.\r\n\r\nAccording to Wilson, the Vikings excelled offensively by finding a rhythm and sticking with it.\r\n\r\n\"Offensively, we just got in a really good groove and kept with it,\" Wilson said.\r\n\r\nJunior outside hitter Avery Wooten said that strong individual performances allowed the Vikings to overcome struggles with communication.\r\n\r\n\"Individually, we played really well, but as a team we started out slow and we weren't communicating in the beginning,\" Wooten said.\r\n\r\nAccording to Wooten, improving the team's communication is crucial in enhancing its performance.\r\n\r\n\"We definitely need to work on communication and keeping our energy levels up,\" Wooten said.\r\n\r\nSenior outside hitter Fiona Green said that the Vikings stayed consistent in the face of pressure and overall played a solid game.\r\n\r\n\"I think we played pretty consistently throughout the night,\" Green said. \"There were some ups and downs, but ultimately we played well.\"\r\n\r\nAccording to Green, the energetic Viking crowd helped pump the team up.\r\n\r\n\"We haven't really played any games with such a large crowd or had that much support,\" Green said. \"It was really exciting to have those people here.\"\r\n\r\nThe Vikings aim to continue their success in a match against the Homestead High School Mustangs (8-15, 3-5) at 6:45 pm on Oct. 18 at the Homestead gym.","excerpt":"A few days after their first league loss of the season, the Palo Alto High School volleyball team (15-7, 8-1) defeated the Gunn High School Titans (14-12, 8-1) in three nail-biting sets Friday night in the Gunn gym.\r\n","date":"2016-10-16 12:11:51","author":"William Sallomi","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Celebration1.jpg","categories":["Sports","Spotlight","Volleyball"],"tags":["Avery Wooten","Chelsea Fan","fiona green","Jekara Wilson","sports","vikings","volleyball"]},{"id":124262,"title":"Liveblog: Football hopes to bounce back against Wilcox after consecutive losses","permalink":"http:\/\/palyvoice.com\/2016\/10\/14\/liveblog-football-hopes-to-bounce-back-against-wilcox-after-consecutive-losses\/","content":"[liveblog]The Palo Alto High School football team (1-2, 2-5) looks to defeat the Wilcox High School Chargers (3-0, 4-3) in rainy weather at home. The Vikings hope to snap their 2-game losing streak with a win tonight.","excerpt":"The Palo Alto High School football team (1-2, 2-5) looks to defeat the Wilcox High School Chargers (3-0, 4-3) in rainy weather at home. The <a href=\"http:\/\/palyvoice.com\/2016\/10\/14\/liveblog-football-hopes-to-bounce-back-against-wilcox-after-consecutive-losses\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2016-10-14 17:57:00","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/08\/pauljackson11.jpg","categories":["Uncategorized"],"tags":["chargers","football","vikings","wilcox"]},{"id":124119,"title":"Robotics wins big at off-season competition","permalink":"http:\/\/palyvoice.com\/2016\/10\/13\/robotics-wins-big-at-off-season-competition\/","content":"The Palo Alto High School robotics team looks forward to a promising year after winning multiple awards at the CalGames competition at Fremont High School this past weekend.\r\n\r\n<span style=\"font-weight: 400;\">According to senior Lauren Nolen, the robotics team’s Strategic Director, the competition was off-season, and was hosted by the Western Region Robotics Forum in the style of a \"For Inspiration and Recognition of Science and Technology\" <a href=\"http:\/\/www.firstinspires.org\/robotics\/frc\">robotics game.<\/a> <\/span>\r\n\r\nPaly robotics, otherwise known as \"Team Eight,\" won the Entrepreneurship Award.\r\n\r\n<span style=\"font-weight: 400;\">As described by the <a href=\"http:\/\/wrrf.org\/calgames\/calgames-2016\/\">CalGames<\/a> website, the Entrepreneurship Award, won by Team Eight, is awarded to the team “that demonstrates a business organization and execution that help its team succeed on the field.” <\/span>\r\n\r\nThe Space Cookies, a Paly student all-girls robotics team, won the overall competition as well as the Design and CAD Award and Paly student Terrance Tech team won the Rookie Award.\r\n\r\nAccording to the <a href=\"http:\/\/wrrf.org\/calgames\/calgames-2016\/\">CalGames<\/a> website, the Design Award and the CAD award, won by the Space Cookies in addition to winning the whole competition, are awarded to a team with \"exceptional design element\" and \"exceptional use and connections from CAD design to implementation,\" respectively. The Rookie Award, won by the Terrance Tech team, is described the award for the \"first-timer teams\" at the competition, for a team who \"inspires us all with its efforts and accomplishments as a team.\"\r\n\r\n[caption id=\"attachment_124178\" align=\"alignleft\" width=\"359\"]<img class=\"wp-image-124178\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Screenshot-2016-10-13-at-8.36.47-AM-3.png\" alt=\"Screenshot 2016-10-13 at 8.36.47 AM-3\" width=\"359\" height=\"313\" \/> Participates of pose with their awards at the 2016 CalGames competition. Photo: Natalie Bruster[\/caption]\r\n\r\nAccording to Space Cookies member senior Erin Mittman, after the teams are ranked in certain qualification rounds, top teams will from alliances of three teams and move on to the playoffs.\r\n\r\n\"Whichever team wins two matches advances,\" Mittman said. \"There are eight alliances to start with and one at the end. The final alliance wins the competition.\"\r\n\r\n<span style=\"font-weight: 400;\">Junior Annalee Soohoo, Team Eight business captain, explains that the process for competing at the CalGames competition requires the teams to submit their applications for the award a month in advance, and then present their business plan at the competition.<\/span>\r\n\r\n“We applied for an interview slot around a month ago, and we presented our plan this Saturday at 10 a.m.,\" Soohoo said. \"Team Captain senior Kenneth Cheung, Business Project Manager senior Jennifer Xu, and I presented to the judges for 15 minutes and gave the judges our <a href=\"https:\/\/drive.google.com\/file\/d\/0B_sAFWYnsl_WazJfakkySWwtaHM\/view?usp=sharing\">business plan<\/a>, budget, and project management schedules for review,”  “We were notified that we won the award at around 7 p.m. that night.”\r\n\r\nCheung, says that the team's business plan was centered around its growth.\r\n\r\n“We framed the presentation around the story of how our team has grown from being a last-place-team in 2014 to a world-class one that not only performs better on the field, but is also dedicated to STEM outreach,” Cheung said. “We talked about the creation and success of our art and business subteams, and our extensive project management system that enables us to manage projects for 85 members. We also talked about the free <a href=\"http:\/\/paly.io\/v\/121100\">summer camp<\/a> we ran this past summer, which was developed and taught completely by students.”\r\n\r\n[caption id=\"attachment_124181\" align=\"alignright\" width=\"364\"]<img class=\"wp-image-124181\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Screenshot-2016-10-13-at-8.36.41-AM.png\" alt=\"Screenshot 2016-10-13 at 8.36.41 AM\" width=\"364\" height=\"374\" \/> Space Cookie members senior Erin Mittmann and sophomore Grace Lam pose with their robot. The Space Cookies won the competition as well as the Design Award and CAD Award. Photo: Ushana Goyal[\/caption]\r\n\r\nAccording to Cheung, this is not the first time <a href=\"http:\/\/palyvoice.com\/2015\/03\/17\/robotics-team-wins-entrepreneurship-award-at-regional-competition\/\">Paly robotics has won the entrepreneurship award<\/a>, but the first time winning it at the CalGames competition.\r\n\r\n“This is the third Entrepreneurship Award Paly robotics has won in the past two years,” Cheung said. “And this upcoming season, we are aiming even higher for the Engineering Inspiration Award and Chairman's Awards; the two most prestigious awards in the FIRST Robotics Competition.”\r\n\r\nThis is also not the first win for the Space Cookies, who have won in past competitions awards such as the Chairman's award for embodying <a href=\"http:\/\/www.firstinspires.org\/about\/vision-and-mission\">FIRST<\/a> values and doing outreach, among many others, according to Mittman.\r\n\r\n\"I hope we can win this Chairman's Award again along with continuing to expand our outreach,\" Mittman said. \"We also hope to build an equally successful robot for the next year.\"","excerpt":"The Palo Alto High School robotics team looks forward to a promising year after winning multiple awards at the CalGames competition at Fremont High School this past weekend.","date":"2016-10-13 21:15:11","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Screenshot-2016-10-13-at-8.36.47-AM-3.png","categories":["News","Spotlight"],"tags":["Award","CalGames","entrepreneurship award","robotics"]},{"id":124182,"title":"Car crashes into Town &#038; Country store window","permalink":"http:\/\/palyvoice.com\/2016\/10\/13\/car-crashes-into-town-country-store-window\/","content":"Hudson Grace, a Town &amp; Country Village decor store, will be closed until further notice after a car crashed into its front window at approximately 3 p.m. yesterday.\r\n\r\nA woman driving a Mercedes-Benz CLA 250 crashed into the front entrance of Hudson Grace causing damage inside the store, but no injuries were reported. Authorities have not released her name nor her age.\r\n\r\n[caption id=\"attachment_124251\" align=\"alignleft\" width=\"393\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/14699685_325250784500401_25283707_o.jpg\"><img class=\"wp-image-124251 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/14699685_325250784500401_25283707_o.jpg\" alt=\"14699685_325250784500401_25283707_o\" width=\"393\" height=\"295\" \/><\/a> A car struck the front window and toppled over shelves full of glassware and ceramic pieces at Town &amp; Country store Hudson Grace, leaving the floor covered in debris. Photo by Rachel Code.[\/caption]\r\n\r\nWhen pulling into a parking spot in front of Hudson Grace, the driver reported that she tried to stop but the car kept moving forward. Diners at a next door restaurant, Calafia Café &amp; Market A Go Go, said the driver was pulling into a parking spot in front of Hudson Grace when the accident occurred. Fire officials and police responded to the scene shortly after 3 p.m.\r\n\r\nThe driver had steered her car inside into the store, knocking over a display of housewares, including ceramic bowls and serving platters, according to fire officials at the scene. The driver and her passenger sustained no injuries, the Palo Alto Police Department reported.\r\n\r\nAfterwards, broken glass shards littered the floor, and ceramic vases and pots lay in pieces across the small decor store. No customers were in the store at the time of the accident and employees present at the scene were not injured, police said.\r\n\r\nHudson Grace has put a wooden board in place of the broken front window.","excerpt":"Hudson Grace, a Town & Country Village decor store, will be closed until further notice after a car crashed into its front window at approximately 3 p.m. yesterday.","date":"2016-10-13 16:09:32","author":"Bianca Al-Shamari","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/53691_full.jpg","categories":["News","Spotlight"],"tags":["Car Crash","hudson grace","mercedes-benz","palo alto","Town and Country","woman"]},{"id":124134,"title":"Stanford University teams up with Paly athletic trainers","permalink":"http:\/\/palyvoice.com\/2016\/10\/13\/stanford-university-teams-up-with-paly-athletic-trainers\/","content":"[caption id=\"attachment_124242\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9488.jpg\"><img class=\"wp-image-124242\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9488.jpg\" alt=\"A stanford Athletic Supervisor mans the check-in desk for Palo Alto student athletes receiving their physicals through the Young Athletes Academy program. Photo by Bianca Al-Shamari.\" width=\"600\" height=\"400\" \/><\/a> A Stanford athletic supervisor mans the check-in desk for Palo Alto student athletes receiving their physicals through the Young Athletes Academy program. Photo by Bianca Al-Shamari.[\/caption]\r\n\r\nStanford University will be expanding a new program that will provide Palo Alto High School athletic teams with dual game coverage and low-cost sports physicals. By working hand-in-hand with Palo Alto Unified School District athletic trainers and coaches, Stanford aims to provide medical care for Palo Alto and Gunn High School athletic teams through the creation of the <a href=\"http:\/\/www.stanfordchildrens.org\/en\/service\/young-athletes-academy\">Young Athletes Academy<\/a>.\r\n\r\nLast spring, the Children’s Orthopedic &amp; Sports Medicine Center launched this community outreach program in an effort to bring easily accessible sports medicine resources to partnered schools and clubs.\r\n\r\nThe team consists of 10 athletic trainers, a group of physical therapists and physicians who provide the many services offered by the Young Athletes Academy. These include sideline sports medicine care, access to specialty care, pre-participation physical evaluations, <a href=\"http:\/\/www.stanfordchildrens.org\/en\/service\/sports-medicine\/injury-prevention-resources\">injury prevention programs<\/a> and educational opportunities, according to the Young Athletes Academy <a href=\"http:\/\/www.stanfordchildrens.org\/en\/service\/young-athletes-academy?\">website<\/a>.\r\n\r\n[caption id=\"attachment_124243\" align=\"alignleft\" width=\"380\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9479.jpg\"><img class=\"wp-image-124243\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9479.jpg\" alt=\"Justine Iogini and a volunteer with the Palo Alto High School athletics department work together with Stanford in providing athletes sports-med services at Gunn High School. Photo by Bianca Al-Shamari. \" width=\"380\" height=\"253\" \/><\/a> Justine Iogini and a volunteer with the Palo Alto High School athletics department work together with Stanford in providing athletes sports-med services at Gunn High School. Photo by Bianca Al-Shamari.[\/caption]\r\n\r\nAccording to Courtney Beverine, an athletic trainer with Stanford Children's Health, this program will be giving students throughout the area a cheaper option for their sports-related medical exams, especially if a student does not have insurance.\r\n\r\n\"This partnership with local high schools will allow students to be able to use Stanford's clinic if an injury is in need of more attention than an athletic trainer is able to provide, such as screening or one-on-one with a physician,\" Beverine said.\r\n\r\nAs a result of the recent partnership with PAUSD, on Monday Oct. 10, the Young Athletes Academy provided $10 sports physicals at Gunn High School for Gunn and Palo Alto High School students.\r\n\r\nInsurance, or lack of insurance, will not be a problem in receiving services and medical information for student athletes.\r\n\r\n\"You don't need any type of insurance to be able to do this. We are hosting this as a sort of community service,\" Beverine said. \"We're trying to help out those families that don't have insurance, or have a limited insurance plan. If someone is paying out of pocket, the price can be $50 or more for a physical. We're doing it for $10 and the money we raise we send back to the high schools.\"\r\n\r\nJustine Iongi, the head athletic trainer for Paly is one of the many high school athletic trainers partnered with the program. Every trainer has a direct line with the Stanford athletic trainers, giving them the ability to call Stanford when they are in need of their services at the press of a button.\r\n\r\n\"This [program] unified us as a team to be better able to catch small things that we might have been unable to catch before,\" Iongi said. \"We can now send our athletes for more detailed screenings and get them the care they need faster. It's a quick process that will help a lot of people that either don't have insurance or just want an affordable resource for sports related injuries and information.\"\r\n\r\n[caption id=\"attachment_124246\" align=\"alignright\" width=\"441\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9477.jpg\"><img class=\"wp-image-124246\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9477.jpg\" alt=\"Stanford Physicians hold one-on-one conferences with student athletes as a final assessment of their health for sports physicals. Photo by Bianca Al-Shamari \" width=\"441\" height=\"294\" \/><\/a> Stanford Physicians hold one-on-one conferences with student athletes as a final assessment of their health for sports physicals. Photo by Bianca Al-Shamari[\/caption]\r\n\r\nThe Young Athletes Academy is currently partnered with Palo Alto High School, Gunn High School, San Mateo High School, Burlingame High School, Capuchino High School, Aragon High School, the Hillsdale Fighting Knights football team, Ballistic Soccer Club and Rage Soccer Club.\r\n\r\n\"We will be expanding to more [sports] clubs on the Peninsula side as well,\" Beverine said. \"Since we are still building we don't have the manpower yet to cover more clubs as well because they need more attention than the high schools because they don't have athletic trainers.\"\r\n\r\nAnother big part of the program is their sports medicine lectures and injury prevention programs.\r\n\r\n\"We're in the process of coming up with more structured times of the year so we can hold larger amounts of people,\" Beverine said. \"We also want to provide conferences and educational events for the community, and students in partnered high schools would pay a discounted price to come in.\"\r\n\r\nIn the coming months, the Young Athletes Academy looks to expand, create more educational events, and to make their services occur on an annual basis, according to Beverine.\r\n\r\n\"For the future, we are looking to grow and partner with more local schools and clubs,\" Beverine said. \"Our goal is everyone knows who are, and that people know they can come by and see us.\"\r\n\r\nTo find out more about upcoming events and provided services, contact the Youth Athletes Academy at  <strong><a href=\"mailto:sports@stanfordchildrens.org\">sports@stanfordchildrens.org<\/a><\/strong>","excerpt":"Stanford University will be expanding a new program that will provide Palo Alto High School athletic teams with dual game coverage and low-cost sports physicals. ","date":"2016-10-13 15:30:35","author":"Bianca Al-Shamari","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9488.jpg","categories":["News","Sports","Spotlight"],"tags":["Athletic trainers","beverine","justine Iongi","stanford","stanford university","young athletes academy"]},{"id":124125,"title":"Teen Arts Council to host third Poetry Jam","permalink":"http:\/\/palyvoice.com\/2016\/10\/13\/teen-arts-council-to-host-third-poetry-jam\/","content":"[caption id=\"attachment_124175\" align=\"alignnone\" width=\"617\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/14650505_10154615008424806_4589139196814844696_n.jpg\"><img class=\"wp-image-124175\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/14650505_10154615008424806_4589139196814844696_n.jpg\" alt=\"14650505_10154615008424806_4589139196814844696_n\" width=\"617\" height=\"410\" \/><\/a> Senior Co-founder of Point B, Teddie Stewart passionately performs a poem at the first Point B poetry Jam. Photo by Claire Eberhart.[\/caption]\r\n\r\nThe Teen Arts Council will host its third Poetry Jam from 7:30 p.m. to 9:30 p.m. Friday, Oct. 14 at the Mitchell Park Community Center.\r\n\r\n<span style=\"font-weight: 400;\">Palo Alto High School seniors Teddie Stewart and Claire Eberhart are organizing the event, which is described by its <a href=\"https:\/\/www.facebook.com\/events\/222931494789416\/?notif_t=plan_user_invited&amp;notif_id=1476214743005468\">Facebook page<\/a> as being a “nonjudgmental environment” where anyone from a “verse novice to a poetry expert” is welcome to perform poetry. The event will feature “amazing poetry, good vibes, and yummy food” and is free to the public, according to Stewart. <\/span>\r\n\r\nIn the past the event has been held at the Palo Alto Children's Theatre but due to construction the event will take place at the Mitchell Park Community Center.\r\n\r\nThe Facebook page explains that the event’s title, “Point B\" comes from the idea that “you are Point A and we are Point b. We will always be here for you as an open place for emotional and artistic expression.”\r\n\r\nAccording to the Facebook page, the event is an open place for emotional and artistic expression.\r\n\r\nAccording to Stewart, the Poetry Jam started three years ago, when Stewart and Eberhart were sophomores.\r\n\r\n<span style=\"font-weight: 400;\">“We started it because there was no place for teenagers to share their poetry that wasn't monitored or run by adults,” Stewart said. “We also wanted to emphasize that it’s a poetry jam, <\/span><span style=\"font-weight: 400;\">not<\/span><span style=\"font-weight: 400;\"> a poetry competition.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Stewart encourages all students to come watch the performances, and is confident there will be something for everyone to enjoy at the event.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I have seen people open up and also really value and listen to other poetry,” Stewart said. “I have seen people become so inspired through this art form that they didn't really know was a thing before they came and watched other perform. It was one of the best moments of my life when Claire and I hosted the first Point B because I saw inspiration spark in people, and there is nothing better than that.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Those interested in performing a poem should contact Eberhart or Stewart at teenartscouncil@gmail.com or message them on Facebook. Eberhart and Stewart ask that the poems “not offend anyone or exceed an extremely long period of time.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Stewart, poems will also be provided at the event for anyone who wants to read them. <\/span>\r\n\r\n<span style=\"font-weight: 400;\"><a href=\"https:\/\/www.facebook.com\/events\/222931494789416\/?active_tab=about\">Students must be aged 13-18 to attend, and can RSVP here.<\/a> <\/span>","excerpt":"The Teen Arts Council will be hosting its third Poetry Jam from 7:30 to 9:30 p.m. this Friday, Oct. 14, at the Mitchell Park Community Center.","date":"2016-10-13 09:25:14","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/14650505_10154615008424806_4589139196814844696_n.jpg","categories":["News","Spotlight"],"tags":["poetry jam","point b teen poetry jam"]},{"id":123889,"title":"The pumpkin spice hype: Peet&#8217;s Coffee fall drinks review","permalink":"http:\/\/palyvoice.com\/2016\/10\/12\/the-pumpkin-spice-hype-peets-coffee-fall-drinks-review\/","content":"<span style=\"font-weight: 400;\">The trees in Palo Alto have begun their rusting transition from green to red, leaves are slowly collecting in multicolored piles to run through and crunch underfoot and the weather is steadily getting chillier.  It's safe to say fall has truly begun. However, besides these climate changes, the true quintessential signifier of autumn’s beginning comes in the form of pumpkin spice. <\/span>\r\n\r\nBusinesses around the Bay Area, complying with the mass hype surrounding pumpkin spice, are busy producing ridiculous assortments of pumpkin drinks, snacks and desserts. Unlike themed holiday products, pumpkin spice is not in celebration of any particular event, but the excitement  that seems to follow it seems to be worthy of its own form of holiday.\r\n\r\nPeet's Coffee and Tea has recently released a completely new menu with an assortment of pumpkin drinks. These include the Pumpkin Latte, the Pumpkin Chai, the Pumpkin Mocha, and the Pumpkin Javiva.\r\n\r\nIs this seasonal collection really equivalent to “fall in a cup”? Does pumpkin really go with everything, even chocolate? The Paly Voice decided to test out what this pumpkin spice craze was all about.\r\n\r\nBelow we<span style=\"line-height: 1.5;\"> have picked three areas to judge: Aesthetic, Taste and finally Fall spirit.<\/span>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/new-piktochart_16805121_3eaf1771b375b8abbf09622cf012db5473431e79.jpeg\"><img class=\"wp-image-123898 aligncenter\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/new-piktochart_16805121_3eaf1771b375b8abbf09622cf012db5473431e79.jpeg\" alt=\"new-piktochart_16805121_3eaf1771b375b8abbf09622cf012db5473431e79\" width=\"600\" height=\"550\" \/><\/a>\r\n\r\n<span style=\"font-weight: 400;\">We started off with the Pumpkin Latte ($3.75 for a small), a creamy coffee topped with a small peak of white foam. It looked like your average Peet's latte, with equally creamy blend of milk, and strong coffee but with slight hint of what could be inferred to be pumpkin flavor. The reality was that it tasted like a strangely bitter sugar sweetener with maybe a hint of cinnamon. We were all quite unimpressed with the drinks unassuming appearance and lackluster taste. It was a decent latte, but a poor pumpkin drink.<\/span>\r\n\r\n&nbsp;\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/new-piktochart_16961221_bc47b73daafaf6251d89b8161e01a80b24da3a4c.jpeg\"><img class=\"wp-image-123899 aligncenter\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/new-piktochart_16961221_bc47b73daafaf6251d89b8161e01a80b24da3a4c.jpeg\" alt=\"new-piktochart_16961221_bc47b73daafaf6251d89b8161e01a80b24da3a4c\" width=\"600\" height=\"550\" \/><\/a>\r\n\r\nThe Pumpkin Chai, $4 for a small comes in a solid white paper cup and is topped with equally bland and slightly droopy white cream. However, the aromatic scents of cinnamon, chai spices, and pumpkin wafting up from this drink were enough to leave our mouths watering. Taking a sip of this drink was like taking in fall in a mouthful. A wonderful warmth fills each sip, the thick taste of cinnamon creating the picture the warm fireplaces and changing leaves hued in a kaleidoscope of color. However, there was still a slight bitterness from the artificial pumpkin that accompanied the warm aftertaste of this drink that kept us from enjoying it fully.\r\n\r\n&nbsp;\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/new-piktochart_16961404_06e42013541a35e79d2eb78eb0ff77db29a44603.jpeg\"><img class=\"wp-image-123901 aligncenter\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/new-piktochart_16961404_06e42013541a35e79d2eb78eb0ff77db29a44603.jpeg\" alt=\"new-piktochart_16961404_06e42013541a35e79d2eb78eb0ff77db29a44603\" width=\"600\" height=\"550\" \/><\/a>\r\n\r\nThe Pumpkin Mocha $4 was an elegant ensemble of fluffy whipped cream topped with a colorful sprinkling of cinnamon and chocolate powder. It was by far the most creative presentation of the four new drinks on the fall menu. We were all quite skeptical of a pumpkin-chocolate combination, but the two flavors combined surprisingly well. The thick coffee accentuated the flavoring of dark chocolate and the small accents of pumpkin were pleasant and subtle, however, not overpowered by the coffee and chocolate flavoring. With fun presentation and the unusual flavor combination, it felt like the perfect drink to order as a festive fall treat.\r\n\r\n&nbsp;\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/new-piktochart_172_d3b99e9882cac3ed669182be65c95f72fd230b60.jpeg\"><img class=\"wp-image-123902 aligncenter\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/new-piktochart_172_d3b99e9882cac3ed669182be65c95f72fd230b60.jpeg\" alt=\"new-piktochart_172_d3b99e9882cac3ed669182be65c95f72fd230b60\" width=\"600\" height=\"550\" \/><\/a>\r\n\r\n<span style=\"font-weight: 400;\">The Pumpkin Javiva ($4 for a small), was a decadent swirling of toppling whipped cream served in a clear plastic cup revealing the drinks frothy caramel coloring. With each sip, you were overwhelmed by a fury of cinnamon, pumpkin and sugar. The taste was a perfect match for the desired seasonal flavoring, but after the third or fourth sip, the drink grew too sweet for our tastes. However, if in the mood for a Javiva, we consider this the perfect option. The pumpkin and cinnamon tones in this drink make it a great option for an autumn drink.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Pumpkin Chai, with its rich cinnamon flavoring and comforting warmth, came out as a clear winner in terms of how authentically “fall” it was. However, in terms of taste and a fun presentation, we would recommend the Pumpkin Mocha, an unusual match of flavorings to spice up these increasingly chilly weeks. Overall, even if you are a more traditional coffee drinker, we still recommend giving these drinks a try. Although pumpkin spice did not totally live up to its legendary hype, these drinks are great for the occasional treat and a fun way to get into the autumn spirit. <\/span>","excerpt":"It's safe to say fall has truly begun. However, besides climate changes, the truly quintessential signifier of autumn’s beginning comes in the form of pumpkin spice.","date":"2016-10-12 19:59:49","author":"Aisha Chabane","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9132.jpg","categories":["Lifestyle","Spotlight"],"tags":["Autmun","Chai","Fall","Javiva","Mocha","Peets","Peets Coffe and Tea","pumpkin","pumpkin spice","Taste Test"]}]