[{"id":120171,"title":"Performing Arts Center ushers in a new era","permalink":"http:\/\/palyvoice.com\/2016\/05\/06\/performing-arts-center-ushers-in-a-new-era\/","content":"[caption id=\"attachment_120173\" align=\"aligncenter\" width=\"592\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Screen-Shot-2016-05-05-at-6.15.59-PM.png\"><img class=\" wp-image-120173\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Screen-Shot-2016-05-05-at-6.15.59-PM.png\" alt=\"new performing arts center \" width=\"592\" height=\"395\" \/><\/a> Palo Alto High School's orchestra plays for the first time in the new Performing Arts Center to test and adjust the new acoustic audio system of the building. Instrumental Music teacher Jeff Willner experiments with the space, moving students while working with the sound technician to create the best settings for the band and orchestra. Photo: Zahra Muzaffar.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Palo Alto High School’s new Performing Arts Center is opening this week for the first time after nearly two years of construction. The new PAC will replace the historic Haymarket Theatre that has been a trademark of Paly history since 1917, according to <a href=\"http:\/\/www.paly.net\/paly-history\">paly.net<\/a>.\r\n<\/span>\r\n\r\n<span style=\"font-weight: 400;\">As the final touches are made to the building, Paly's various performing groups have begun rehearsing with the new sound system and work to manage the sound settings to calibrate it with each individual ensemble.\r\n<\/span>\r\n\r\nChoir, band and orchestra have all been given the chance to perform in the new building and work alongside the sound technicians, though the center is only open for students during school practices, according to choir teacher Michael Najar.\r\n\r\n<span style=\"font-weight: 400;\">One new aspect of the center are the audio settings. The building has a <a href=\"http:\/\/www.meyersound.com\/product\/constellation\/\">Constellation sound system<\/a>, which is a digitally acoustic environment that can change depending on the performer and what type of sound they want, according to Najar.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It changes the audience's perspective of the sound,” Najar said. “The system doesn't feel inauthentic and the bottom line is that it creates delay and strength without them even knowing it. You can feel like you’re in a 16th century chapel or an intimate jazz setting depending on which ensemble is on stage.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Paly's student performers are also very excited about its opening and how it will contribute to their shows and productions in the future.\r\n<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It's just a beautiful space,” junior choir member Anisha Patwardhan said. “The acoustic panels allowed our acapella groups to have the perfect opportunity to sing and be able to hear each other.”  <\/span>\r\n\r\nAlthough the building will not be officially opening until the fall of 2016, it will be used for the next choir concert and have soft openings for previewing the space, according to Najar.\r\n\r\n“As someone who has had many opportunities to stand on many different stages, it was a beautiful and unique experience,” Najar said. \"I encourage everyone to experience the theater. For me this [process] has been a magical experience.\"","excerpt":"Palo Alto High School’s new Performing Arts Center is opening this week for the first time after nearly two years of construction. The new PAC will replace the historic Haymarket Theatre that has been a trademark of Paly history since 1917, according to paly.net.","date":"2016-05-06 17:18:44","author":"Morgan Keller","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Screen-Shot-2016-05-05-at-6.15.59-PM.png","categories":["News"],"tags":["arts","band","building","center","construction","najar","new","open","paly","Performing","performing arts center","practice","sound","student","testing","willner"]},{"id":120200,"title":"Liveblog: Girls&#8217; lacrosse plays Pioneer on Senior Night","permalink":"http:\/\/palyvoice.com\/2016\/05\/06\/liveblog-girls-lacrosse-plays-pioneer-on-senior-night\/","content":"Check back at 5:30 p.m. for live updates as Palo Alto High School girls' lacrosse (14-4, 12-1) takes on Pioneer High School (2-11, 2-11). The Vikings will celebrate their seniors tonight in a ceremony before the game tonight at Paly's field.\r\n\r\n[liveblog]","excerpt":"Check back at 5:30 p.m. for live updates as Palo Alto High School girls' lacrosse (14-4, 12-1) takes on Pioneer High School (2-11, 2-11). The Vikings will celebrate their seniors tonight in a ceremony before the game tonight at Paly's field.","date":"2016-05-06 17:17:57","author":"Claire Krugler","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/390.jpg","categories":["Sports"],"tags":[]},{"id":120005,"title":"Robotics team excels at World Championships","permalink":"http:\/\/palyvoice.com\/2016\/05\/05\/robotics-team-excels-at-world-championships\/","content":"[caption id=\"attachment_120152\" align=\"alignnone\" width=\"628\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/unspecified1.jpg\"><img class=\"wp-image-120152 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/unspecified1.jpg\" alt=\"unspecified1\" width=\"628\" height=\"185\" \/><\/a> The Palo Alto High School Robotics team prepares its robot for its match at the FIRST Robotics Competition World Championships last weekend in St. Louis. The team's robot, clothed in blue with the number eight on its side, is set up among many other teams' robots. Photo: Eli Zucker[\/caption]\r\n\r\nThe Palo Alto High School Robotics team looks to continue this year's success after scoring in the top 30 in its division at last weekend’s FIRST Robotics Competition World Championships in St. Louis.\r\n\r\nThe team, also known as Team 8, ranked 27 out of 75 teams in their division. According to sophomore team member Bert Davies, 600 teams around the world, including nations such as Canada and Israel, participated in the competition.\r\n\r\nDuring the competition, teams are randomly matched together and work with each other to score the most points in a certain amount of time, according to Davies. Teams can score points by crossing barriers with their robots or shooting balls into a tower. Robots are controlled remotely by drivers. The alliance that wins the match gets points added to its cumulative score. The top three teams from each of the eight divisions advance to the playoffs.\r\n\r\nTeam 8 qualified to the competition through a series of wild cards during the <a href=\"http:\/\/palyvoice.com\/2016\/04\/18\/robotics-team-to-compete-at-world-championship\/\">Central Valley Regional<\/a>, according to Davies. At Regionals, the top 10 teams were selected to go compete at Worlds. However, some of the top 10 teams were already guaranteed a spot at Worlds, leaving empty spots up for grabs. Therefore, even though Paly was not in the top 10, Team 8 filled the empty spots, thereby giving them a place to compete at Worlds.\r\n\r\nAt Worlds, although Team 8 did not end up placing in the finals, team members say that they are still very grateful for the experience.\r\n\r\n“We were able to watch exciting matches of all of the world-class teams,” sophomore scouting and strategy captain Shota Yamamoto said. “The experience was great because we got to talk to teams from all over the world and learn about how their teams function in terms of team structure, their design phase and many other things.”\r\n\r\nTeam members were also able to learn more about robotics and different design tips and tricks.\r\n\r\n“There were a ton of really cool workshops discussing how to improve your robot,” Davies said.\r\n\r\nLooking towards next year, the team is looking to make changes to improve the team's efficiency.\r\n\r\n“We want to have a stronger team structure and stay a bit more organized,” Yamamoto said. “Another thing we are aiming for is more diversity on the team, with a better ratio of guys to girls.”\r\n\r\nRobotics students have started a <a href=\"http:\/\/palyrobotics.com\/summercamp\">summer outreach program<\/a> for middle school students from around the Bay Area to attend, according to Yamamoto. The camp will teach different skills for robotics, including data analysis and coding. They have also separately created a <a href=\"http:\/\/www.firstinspires.org\/robotics\/fll\">FIRST Lego League<\/a> team for middle school students to build and compete with Lego robots.\r\n\r\nAccording to team members, robotics provides a great place for students to learn about robotics and build a community.\r\n\r\n“I love robotics because the people on the team are really nice to each other,” Yamamoto said. “Everyone on the team is really close with each other too. Another thing is that it is not just about building a robot. At competition ... each team has to compete with two other random teams [as allies]. In order to succeed in these matches, your alliance has to communicate with each other ... I love robotics because I have gained and learned so much about technical skills, leadership skills and communication skills.”\r\n\r\nWith members hoping to advance to Worlds again next year, they have already started preparing and tinkering with their current robot.\r\n\r\n“For the next step, I want to build a whole new robot for practice, using the information and tips we gained at Worlds,” Davies said.\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School Robotics team looks to continue this year's success after scoring in the top 30 in its division at last weekend’s FIRST Robotics Competition World Championships in St. Louis.","date":"2016-05-05 17:47:54","author":"Julia Qiao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Chris-Linn-image-95.jpeg","categories":["News","Spotlight"],"tags":["Bert Davies","First Lego League","FIRST Robotics World Championships","paly robotics","Shota Yamamoto","team 8","Worlds"]},{"id":119985,"title":"One Acts to showcase student creativity","permalink":"http:\/\/palyvoice.com\/2016\/05\/05\/one-acts-to-showcase-student-creativity\/","content":"[caption id=\"attachment_120100\" align=\"alignleft\" width=\"323\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/13169814_1123054514425884_1449289915_o.jpg\"><img class=\"wp-image-120100\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/13169814_1123054514425884_1449289915_o.jpg\" alt=\"13169814_1123054514425884_1449289915_o\" width=\"323\" height=\"431\" \/><\/a> Sophomore Peter King (left) and junior Declan Flanders (right) act as cows for the one act \"Cow Play,\" directed by senior Ophir Sneh. \"Cow Play\" is the only student-written play this year. Photo by Takaaki Sagawa.[\/caption]\r\n\r\nThe Palo Alto High School theater department will showcase a realm of student-run plays in its annual One Acts production from Thursday to Saturday in the Haymarket Theatre.\r\n\r\nThe production will consist of seven one-act plays, all of which feature student producers, directors and actors. According to producer and senior Matt O'Reilly, student directors are given autonomy, which adds personal flavor to each play.\r\n\r\n<span style=\"font-weight: 400;\">“<\/span>I was interested in having each director do what felt right to them,<span style=\"font-weight: 400;\">” <\/span>O'Reilly said. “When you come and get to see your friends on stage or your friends who are directing them [the plays], you will really get a feel for that individual and how that individual wanted his actors to be portrayed on stage.”\r\n\r\nJunior Jason Pollack, who will be directing “Do Engineers Dream of Androids?” as a third-year One Acts director, has utilized the opportunity to experiment by implementing new developments in his play.\r\n\r\n“There's lots of things we wouldn't usually be able to do in a theater production, but Matt [O'Reilly] has given us the ability to spread out and come up with our own ideas, so we have much more creative freedom,” Pollack said.\r\n\r\nOne Acts will include one student-written play “Cow Play” by senior Ophir Sneh, junior Leanne Miron and Paly alumnus Ido Gal. The scripts “Horse Girls” by former student Lily Dodd and “Do Engineers Dream of Androids?” by Paly alumna Miranda Cohn will also be featured.\r\n\r\n“It's much more fun to work on the student-written scripts because it's not so rigid,” O'Reilly said. “If you want to do something fun and exciting on one of the plays that is student-written, it's just a matter of asking that person.”\r\n\r\nUnlike the traditional fall and spring Paly theater productions, One Acts encourages students who are not usual participants of the arts to perform, according to O'Reilly. For senior Clara Chiu who took part in theater as a child, this production is the perfect occasion to explore acting once more through her role in “Love (Awkwardly).”\r\n\r\n“I think One Acts is awesome because it presents the opportunity for people who haven't really done theater or aren't really experienced to have that opportunity to explore it,” Chiu said.\r\n\r\nOne Acts will be performed at 7:30 p.m. on Thursday, Friday and Saturday. Tickets will be available at the door for $5 each.","excerpt":"The Paly theatre department will showcase a realm of student-run plays in its annual One Acts production opening on Thursday, May 5.","date":"2016-05-05 16:56:46","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/13170670_1123054557759213_1181578285_o.jpg","categories":["Entertainment","Spotlight"],"tags":["haymarket","one acts","original","paly","production","script","theater","theatre"]},{"id":119996,"title":"Ode to teachers: Tribute and appreciation","permalink":"http:\/\/palyvoice.com\/2016\/05\/05\/ode-to-teachers-tribute-and-appreciation\/","content":"Students often turn to teachers for guidance, whether it be for additional help on course material or broader advice in life. Yet what may go unnoticed is how teachers can look to each other for help. In honor of Teacher Appreciation Week, The Paly Voice asked Palo Alto High School teachers who they appreciated and why.\r\n\r\n<div style=\"left: 0px; width: 100%; height: 0px; position: relative; padding-bottom: 75%;\"><iframe class=\"iframely-widget iframely-iframe\" src=\"https:\/\/mako.sonardesign.com\/embed-preview\/cc98cc2f-67b8-454d-be09-436045c03a15\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\" webkitallowfullscreen=\"true\" mozallowfullscreen=\"true\" style=\"top: 0px; left: 0px; width: 100%; height: 100%; position: absolute; overflow: hidden;\"><\/iframe>","excerpt":"In honor of Teacher Appreciation Week, The Paly Voice asked Palo Alto High School teachers who they appreciated and why.","date":"2016-05-05 11:34:29","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Screen-Shot-2016-05-05-at-11.02.31-AM.png","categories":["Multimedia","Spotlight"],"tags":["Teacher","teacher appreciation week","teachers"]},{"id":120114,"title":"Baseball beats Los Altos in SCVAL playoffs","permalink":"http:\/\/palyvoice.com\/2016\/05\/04\/baseball-beats-los-altos-in-scval-playoffs\/","content":"[caption id=\"attachment_120116\" align=\"alignnone\" width=\"450\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/baseball-beats-los-altos.jpg\"><img src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/baseball-beats-los-altos.jpg\" alt=\"Senior pitcher Alec Olmstead warms up with Senior catcher Lawrence Han before a regular season game against Los Gatos High School. Han has been a dependable plate general for the Vikings all season. Photo by Cooper Lou. \" width=\"450\" height=\"518\" class=\"size-full wp-image-120116\" \/><\/a> Senior pitcher Alec Olmstead warms up with Senior catcher Lawrence Han before a regular season game against Los Gatos High School. Han has been a dependable plate general for the Vikings all season. Photo by Cooper Lou. [\/caption]\r\nThe Palo Alto High School baseball team (20-4-1, 12-2) crushed the Los Altos Eagles (15-12-0, 8-6) 9-0 yesterday at home in the first round of the Santa Clara Valley Athletic League playoffs. \r\n\r\nA strong performance by senior starting pitcher Justin Hull enabled the Vikings to beat the Eagles and take a 1-0 lead in the three-game series. Hull said that he was able to succeed thanks to an aggressive mentality on the mound. \r\n\r\n“I felt pretty good,” Hull said. “I was ready. Playoffs are always fun. [I] just try to attack hitters.”\r\n\r\nPaly struck first with an RBI single by senior right fielder Owen Plambeck, allowing senior third baseman Riley Schoeben to score. \r\n\r\nThe Vikings continued to stretch the lead in the second inning with a triple by senior Lawrence Han, scoring sophomore second baseman Max Jung-Goldberg and senior first baseman Alec Olmstead. Junior center fielder Ben Cleasby also singled, bringing Han home to make the score 4-0.\r\n\r\nPaly piled on five more runs in the third inning, building up a cushion that allowed the Vikings cruise through the rest of the game. \r\n\r\nDespite losing to Los Altos 1-0 earlier in the season, the Vikings felt prepared to take on the Eagles from the get-go, according to Hull.\r\n\r\n“I think we were all pretty ready, pretty pumped up about this game, playoffs are obviously a little more high-stakes,” Hull said. “I think we were just confident going in, and we got to them early, and kind of cruised on from there.”\r\n\r\nThe team’s win puts them in a good position for their overall ranking at Leagues. \r\n\r\n“If we win [Leagues], we have Finals next week, and then on to CCS,” Plambeck said. “[We] got them again on Thursday; you have to put them away with a sweep.”\r\n\r\nHull said that the Vikings will be able to win the second game, and thus the series, if they continue their performance from yesterday.\r\n\r\n“Looking ahead to Thursday, hopefully we’ll do something that’s pretty similar: go out, score runs early, and keep doing it,” Hull said.\r\n\r\nThe Vikings will play game two against the Eagles at 4 p.m. on Thursday at home. \r\n\r\n\r\n\r\n\r\n\r\n","excerpt":"The Palo Alto High School baseball team (20-4-1, 12-2) crushed the Los Altos Eagles (15-12-0, 8-6) 9-0 yesterday at home in the first round of the Santa Clara Valley Athletic League playoffs. ","date":"2016-05-04 22:35:48","author":"Peyton Wang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/baseball-beats-los-altos.jpg","categories":["Baseball","Uncategorized"],"tags":["altos","Baseball","eagles","hull","los","Olmstead","palo alto","vikings"]},{"id":120059,"title":"District to hear preliminary CDC suggestions","permalink":"http:\/\/palyvoice.com\/2016\/05\/03\/district-to-hear-preliminary-cdc-suggestions\/","content":"The Palo Alto High School and Gunn High School administrations will meet with a group of county health officials tomorrow to learn about the preliminary findings from the Epi-Aid investigation led by the Center for Disease Control and Prevention.\r\n\r\nPrincipal Kim Diorio says she hopes the <a href=\"http:\/\/palyvoice.com\/2016\/02\/13\/county-to-begin-health-investigation\/\">CDC investigation<\/a> and health officials recognize that the community is heading in the right direction.\r\n\r\n“I would expect that [the CDC and county officials] would say that we are doing a lot of positive work in this area,” Diorio said. “When I started my principalship three years ago, we weren’t doing any of this and [now] we’re working to strengthen the culture.”\r\n\r\nThe information will be provided to the Palo Alto Unified School District through a series of committee meetings, according to Diorio.\r\n\r\n“The [recommendations] will come in a series and provide us some information for next steps,” Diorio said. “It will be interesting to see if there are any surprise findings or something that we’re all missing.”\r\n\r\nJonathan Frecceri, Paly’s mental health and wellness coordinator, explained how one of the first initiatives in response to the suicide epidemic, Project Safety Net, will collaborate with the district to carry out the suggestions.\r\n\r\n“An advisory group of people is being put together with Project Safety Net to figure out how to distill this sort of information to the community and how to roll out the recommendations the CDC provides in the coming weeks,” Frecceri said.“They were here for 10 days in late February collecting synthesized data from clusters dating back to the early 2000s and in 2009 the community pulled together and created Project Safety Net.”\r\n\r\nProject Safety Net is a collaborative community network that formed in hopes of fostering youth well-being and implementing a mental health plan, according to the <a href=\"http:\/\/www.psnpaloalto.com\/\">organization’s website<\/a>.\r\n\r\n“This collaborative consists of all the non-profit based organizations in Palo Alto, parents in the community, as well as students, including attendees at both Gunn and Paly,” Frecceri said. “It’s really working to mitigate this phenomenon of youth suicide.”\r\n\r\n<em>Additional reporting by Bianca Al-Shamari.<\/em>","excerpt":"The Palo Alto High School and Gunn High School administrations will meet with a group of county health officials tomorrow to learn about the preliminary findings from the Epi-Aid investigation led by the Center for Disease Control and Prevention.","date":"2016-05-03 21:07:02","author":"Zahra Muzaffar","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0979.jpg","categories":["News","Spotlight"],"tags":["cdc","county","diorio","epi-aid","Frecceri","gunn","palo alto","palo alto high school","paly","PAUSD","principal","Santa Clara Health"]},{"id":120027,"title":"Video: Students react to pro-Trump, racist graffiti","permalink":"http:\/\/palyvoice.com\/2016\/05\/03\/video-students-react-to-pro-trump-racist-graffiti\/","content":"The Paly Voice asked Palo Alto High School students about their reactions to pro-Donald Trump, racist graffiti on campus. <a href=\"http:\/\/paly.io\/v\/119322\" target=\"_blank\">The graffiti<\/a> included the phrases \"Trump 1237\" and \"Black Lives Suck,\" appearing on April 18 in multiple locations.\r\n\r\n<iframe src=\"https:\/\/www.youtube.com\/embed\/PEgEYYbbF_I\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Paly Voice asked Palo Alto High School students about their reactions to pro-Donald Trump, racist graffiti on campus.","date":"2016-05-03 18:26:51","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Screen-Shot-2016-05-03-at-2.50.31-PM.png","categories":["Multimedia","Spotlight","Video"],"tags":["cameron huard","charlotte cheng","eoin o'farrell","graffiti","mariah poitier","noor navaid","reaction","student","Trump","video","voice verbatim"]},{"id":119943,"title":"DECA ends season on a high note","permalink":"http:\/\/palyvoice.com\/2016\/05\/03\/deca-ends-season-on-a-high-note\/","content":"[caption id=\"attachment_119957\" align=\"alignnone\" width=\"661\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/13115613_1153956011301681_1538395278_n.jpg\"><img class=\" wp-image-119957\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/13115613_1153956011301681_1538395278_n.jpg\" alt=\"Palo Alto High School and Gunn High School students pose together at the International DECA competition in Nashville, Tenn. Four of the six Paly students pictured above were the first to ever qualify for the competition. Students from left to right: Hannah Pan (Paly), Allison Wu (Paly), ---, Stephanie Cong (Paly), \" width=\"661\" height=\"496\" \/><\/a> Palo Alto High School and Gunn High School students pose together at the International DECA competition in Nashville, Tenn. Four of the six Paly students pictured above were the first to ever qualify for the competition. Students pictured from left to right: Hannah Pan (Paly), Allison Wu (Paly), Dana Zhao (Gunn), Stephanie Cong (Paly), Jocelyn Liu (Gunn), Nicholas Zhao (Paly), Kevin Xi (Gunn), Lucas Hu (Gunn), Kellen Liu (Gunn), and Gunn advisor Daljeet Gill. Above from left to right: Bo Rasmussen (Gunn), Emily Cao (Gunn), TJ Sears (Gunn), and Andrew Schloss (Gunn). Photo by: Nicholas Zhao.[\/caption]\r\n\r\nPalo Alto High School's DECA club is optimistic for its next season after sending six members to the International Career Development Conference from April 23 through April 26 in Nashville, Tennessee.\r\n\r\nThe club itself is only two years old, so the students were the first from Paly to qualify and attend the competition, according to Paly DECA co-president and senior Stephanie Cong.\r\n\r\n“I was able to place in the top ten in my event, which was awesome, but it was really cool to just be able to see and meet people from DECA worldwide,” Cong said.\r\n\r\nAccording to Cong, the competition hosts students from all over the world who are then separated by their respective events. The individuals then compete in groups of 20, from which the top two of each heat move on as finalists. The top ten overall, from all of the groups for each event, place internationally.\r\n\r\n“At the international level, we represent California DECA more than anything, all the chapters from each school in the three regions of California unite as one and support each other no matter their attachments to their schools or districts,” Cong said.\r\n\r\nStudents had to have qualified at the state level before representing California in the international competition, according to Cong.\r\n\r\n“We qualified by placing in the top 4 for our [individual] event at the state competition,” Cong said. “I competed in the Financial Consulting Event, Josh and Samarth competed in the Public Relations Project, Nicholas in Accounting Applications Series and Hannah and Allison in Hospitality and Tourism Operations Research.”\r\n\r\nClub members prepare for competitions, such as ICDC, throughout the year through various methods, including working on written projects or presentations, mock events and role playing, as well as practicing for the multiple choice tests that are included in many events, according to Cong.\r\n\r\nAccording to junior Josh Code, the events contain a mixture of presentations, multiple choice tests and reports.\r\n\r\n“[For our project] a judge read our report, evaluated it and then evaluated our 15 minute presentation,” Code said.\r\n\r\nSophomore Nicholas Zhao echoed Cong’s sentiments and excitement about the opportunity of attending the international competition.\r\n\r\n“Representing Paly DECA was surreal, especially since it is the first time our school has had people qualify for ICDC,” Zhao said.“The most memorable moment would be walking into opening ceremony and seeing the 18,000 students that had come from across the globe. Going to ICDC is an amazing experience that every student has the opportunity to have by joining DECA, and I definitely recommend that students join next year.” ","excerpt":"Palo Alto High School's DECA club is optimistic for its next season after sending six members to the International Career Development Conference from April 23 through April 26 in Nashville, Tennessee.","date":"2016-05-03 15:38:26","author":"Zahra Muzaffar","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/13115613_1153956011301681_1538395278_n.jpg","categories":["News","Spotlight"],"tags":["competition","DECA","ICDC","International","josh code","Nashville","nicholas zhao","paly","PalyDECA","stephanie cong","student"]},{"id":119726,"title":"ASB puts on annual intramural volleyball tournament","permalink":"http:\/\/palyvoice.com\/2016\/05\/03\/asb-puts-on-annual-intramural-volleyball-tournament\/","content":"The Palo Alto High School Associated Student Body wrapped up another successful year of the annual intramural volleyball tournament on the Quad from April 25 to April 29, a popular event that attracts many students.\r\n\r\nThis year, 18 teams competed throughout the week at lunch time. The Dab Daddies won the championship round on Friday, taking down team Garbanzo 21-16.\r\n\r\n“I think overall it [the tournament] was a success,” senior Spirit Commissioner Ariya Momeny said. “We had a few teams drop out or not have players from every grade, but people seemed to enjoy it.”\r\n\r\nASB encountered issues with scheduling in such a busy time of year, which it hopes to avoid in the future, according to Momeny.\r\n\r\n“Scheduling was a bit strange with everything going [with] CIOS [Change In Our Schools week, prom, APs [Advanced Placement exams] and finals,” Momeny said. “They were all at different dates this year and that threw us off a bit.”\r\n\r\n<iframe style=\"overflow-y: hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/13058873-2016-vball-tournament-bracket\" width=\"620\" height=\"842\" frameborder=\"0\" scrolling=\"no\"><\/iframe>","excerpt":"The Palo Alto High School Associated Student Body facilitated the annual intramural volleyball tournament on the Quad from April 25 to April 29, a popular event that attracts many students.","date":"2016-05-03 14:32:44","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/11150390_1007433645936061_1201410094792382774_n.jpg","categories":["News","Spotlight"],"tags":["ASB","associate student body","dab daddies","intramural volleyball","momeny","volleyball"]}]