[{"id":114947,"title":"Girls&#8217; soccer dominates Homestead","permalink":"http:\/\/palyvoice.com\/2016\/02\/02\/girls-soccer-dominates-homestead\/","content":"[caption id=\"attachment_115393\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/GIRLS-SOCCER-Season-recap.png\"><img class=\"size-full wp-image-115393\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/GIRLS-SOCCER-Season-recap.png\" alt=\"Senior Alison Lu cuts past Homestead defense after shutting down a goal attempt by Homestead sophomore holding mid Laura Salvaggio. Photo by Ethan Kao.\" width=\"800\" height=\"600\" \/><\/a> Senior Alison Lu cuts past Homestead defense after shutting down a goal attempt by Homestead sophomore holding midfielder Laura Salvaggio. Photo by Ethan Kao.[\/caption]\r\n\r\nThe Palo Alto High School girls' soccer team (12-0-1, 7-0-1) shut down the Homestead High School Mustangs (6-8, 2-6) last Friday with an impressive final score of 5-0.\r\n\r\nThe Vikings demonstrated their deft performance in defense and inter-team communication with three assists from senior center-midfielder Ansley Queen throughout the game and another assist from senior forward Nika Woodfill to center midfielder Emily Tomz who then scored the first goal of the match. Seemingly in a continuous streak of back-to-back goals the Paly girls' went on to score a second goal 15 minutes in by Junior defender Talia Malchin and a third and fourth goal, both by Woodfill, within the first 35 minutes. By the 36 minute mark Alison Lu finished with the fifth goal, setting the score to an impressive 5-0.\r\n\r\n\"We have been really successful so far this year, our defense is phenomenal\" Tomz said in an interview following the match. \"Our team communication on the field has been pretty good this season, and has greatly improved by being positive and motivational. A lot of that is because of our captains, Jacey Pederson and Heidi Moeser, who are extremely nice, funny and bring the team together on and off the field.\"\r\n\r\nSenior Captain Moeser described some initial difficulty given the team already had two games previously in the week, leaving little energy for the Friday match.\r\n\r\n\"We came off two games this week, so it was initially difficult given we were so tired, but we really battled and stayed strong,\" Moeser said. \"I would say this was one of our better games, and morale is high given our undefeated status.\"\r\n\r\nHomestead players,junior forward Christina Klariss and sophomore left-mid Laura Salvaggio shared their thoughts on their teams performance during the match.\r\n\r\n\"Palo Alto is a really good team, and it was difficult to keep up with their speed,\" said Klariss, \"We've hadn't played our best the first half and Palo Alto definitely took advantage of that, but for the second half we really showed what we are capable of. Paly didn't score on us in the second half at all, and I think that really demonstrated how we can rise above a previously negative situation.\"\r\n\r\n\"We came into the game preparing for defeat,\" said Salvaggio. \"But we still kept in mind that we needed to prove our skill, which we really did during the second half.\"\r\n\r\nThe Paly girls' will have their next match at 3:30pm this coming Wednesday at Milpitas.","excerpt":"Palo Alto High School girls' soccer defeats Homestead Mustangs 5-0, continuing undefeated streak.","date":"2016-02-02 22:37:42","author":"Bianca Al-Shamari","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Screen-Shot-2016-01-09-at-8.58.40-PM.png","categories":["Sports"],"tags":["girls soccer","heidi moeser","homestead","paly","Soccer"]},{"id":115403,"title":"Preview: Boys&#8217; basketball to take on Milpitas tomorrow","permalink":"http:\/\/palyvoice.com\/2016\/02\/02\/preview-boys-basketball-to-take-on-milpitas-tomorrow\/","content":"[caption id=\"attachment_115475\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_58031-1.jpg\"><img class=\" wp-image-115475\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_58031-1.jpg\" alt=\"Junior guard Miles Tention rises up to take a outside three in the third quarter against Gunn High School at Gunn. Photo by Victor Carlsson.\" width=\"600\" height=\"400\" \/><\/a> Junior guard Miles Tention rises up to take an outside three during the Vikings' 74-56 victory over Gunn High School on Jan. 8. Photo by Victor Carlsson.[\/caption]\r\n\r\nThe Palo Alto High School boys' basketball team (12-7, 3-4) will play Milpitas High School (8-10, 2-5) at 7 p.m. tomorrow at Gunn High School.\r\n\r\nThe Vikings are currently on a four-league-game losing streak, after a disappointing 72-59 loss to Gunn High School on Friday. Junior guard Jack Simison believes that the key for success against Milpitas is the team's energy.\r\n\r\nThe Vikings have five games left in their regular season and are currently sitting in fifth place in the De Anza League. The Vikings should make it to playoffs as long as they win one of the five games left this season.\r\n\r\n\"We are on a four-league-game losing streak and we seriously need to turn that around,\" Simison said. \"We need to be able to play unselfishly and as a team.\"\r\n\r\nMilpitas is coming off of a 57-38 loss to Fremont High School.\r\n\r\nSimison says that the Vikings have the upper edge, but still believes Milpitas has a chance.\r\n\r\n\"We've beaten them before so we should have the upper hand when it comes to confidence,\" Simison said. \"We just need to come out strong and carry that throughout the game. My expectations would be that we would win but with how we've been playing I think it'll be anyone's game.\"","excerpt":"The Palo Alto High School boys' basketball team (12-7, 3-4) will play Milpitas High School (8-10, 2-5) at 7 p.m. tomorrow at Gunn High School.","date":"2016-02-02 20:37:18","author":"Victor Carlsson","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_5822.jpg","categories":["Sports"],"tags":["2015","2016","basketball","Boys","Jack Simison","milpitas","Mipitas"]},{"id":115280,"title":"School gears up for Super Bowl traffic","permalink":"http:\/\/palyvoice.com\/2016\/02\/02\/school-gears-up-for-super-bowl-traffic\/","content":"[caption id=\"attachment_115412\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/DSC00202.jpg\"><img class=\" wp-image-115412\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/DSC00202.jpg\" alt=\"A hired security officer examines a student's parking permit. The Paly administration has upped security measures in light of Super Bowl 50 traffic.\" width=\"600\" height=\"400\" \/><\/a> A hired security officer examines a student's parking permit in the Embarcadero parking lot of Palo Alto High School. The Paly administration has upped security measures in light of Super Bowl 50 traffic. Photo by Cooper Lou.[\/caption]\r\n\r\nIn anticipation of increased traffic due to Super Bowl 50 this Sunday at Levi's Stadium in Santa Clara, local law enforcement and the Palo Alto High School administration are taking additional measures to ensure public safety.\r\n\r\nAccording to Lt. Zachary Perron of the Palo Alto Police Department, law enforcement has extended police officers' hours and is working in conjunction with other agencies to deal with the influx of visitors.\r\n\r\n\"We’ve moved all field personnel to 12-hour shifts this week, as opposed to their normal 11-hour shifts,\" Perron said. \"They’ll be supplemented by our SWAT team personnel and downtown officers. Other personnel will be on standby if needed, but at this point, we don’t anticipate any problems.\"\r\n\r\nThroughout this week, the Paly parking lots are being monitored due to predicted congestion, as the Denver Broncos, one of the teams competing in the Super Bowl, are practicing at Stanford University. According to Assistant Principal Jerry Berkson, the school has anticipated increased traffic around the Palo Alto area and possible attempts to gain access to parking space in the Paly and Palo Alto Unified School District office parking lots.\r\n\r\n“Because the Denver Broncos are practicing at Stanford, there’s probably going to be a lot of people here,” Berkson said.\r\n\r\nTo combat this, the PAUSD has hired security personnel to monitor cars entering parking lots from Monday through Friday, according to Berkson.\r\n\r\n“To prevent them [non-Paly students, faculty and visitors] from parking in our lots and prevent riff raff, hopefully, from coming through, the district has hired security at all the entrances to all the lots,” Berkson said. “They will be here just for the week, through Friday. They are making sure people have parking permits.”\r\n\r\nAccording to Berkson, the security’s presence should not affect students, staff or parents dropping off or picking up students.\r\n\r\n“I’m hoping that they [security personnel] use enough common sense [to tell] that between 7:45 [a.m.] to 8:15 [a.m.] that that’s probably people dropping off their kids,” Berkson said. “If someone drives in wearing a Broncos beanie and jersey, those are the people that are probably not dropping off their kids. This should not affect students.”\r\n\r\nDespite the effort to avoid traffic, these measures have made entrance into the Paly parking lots much more time-consuming, according to senior Kelly Branson.\r\n\r\n“There's more traffic,” Branson said. “Today there was a ton of traffic because we [the cars] couldn't get in [to the lots] as fast, so I was 15 minutes late to class.”","excerpt":"In anticipation of increased traffic due to Super Bowl 50 this Sunday at Levi Stadium in Santa Clara, local law enforcement and the Palo Alto High School administration will be taking additional measures to ensure public safety. ","date":"2016-02-02 18:04:24","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/resized.jpg","categories":["News","Spotlight"],"tags":["Berkson","denver broncos","palo alto high school","paly","parking","permits","security","stanford","stanford university","super bowl","vice principal"]},{"id":114757,"title":"The truth behind GMOs","permalink":"http:\/\/palyvoice.com\/2016\/02\/02\/the-truth-behind-gmos\/","content":"[caption id=\"attachment_115482\" align=\"alignnone\" width=\"662\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/DSC00208.jpg\"><img class=\"wp-image-115482\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/DSC00208.jpg\" alt=\"DSC00208\" width=\"662\" height=\"441\" \/><\/a> Trader Joe's sells non-genetically modified limes across the street from Palo Alto High School. Trader Joe's is one of many supermarkets and food distributors that takes part in the anti-GMO movement. Photo by Cooper Lou.[\/caption]\r\n\r\nWhen over 50 percent of Americans believe that it is “unsafe to eat genetically modified foods,” you would think they would know what genetically modified foods are. Shockingly, they don’t. This is evident by the fact that 70 to 80 percent of U.S. foods are considered to contain GM products in them, and yet 60 percent of Americans think that they have never eaten a GM food before. How is it that so many people are uneducated about a topic they speak so strongly about?\r\n\r\n<span style=\"font-weight: 400;\">The term GMO often refers to an organism that contains recombinant DNA, meaning an organism that has DNA from other species inserted into their genome. This addition of recombinant DNA can cause a modified organism to display new traits and characteristics, which often contribute to the organism’s survival and\/or nutritional value. Some common examples of GM foods are corn, canola oil and soybeans. Despite the high percentage of U.S. foods with GM products in them, the general public remains wary of them, largely because of false advertising, misinterpretation of GMO studies and a disconnect between everyday people and scientists.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">When biotech crops first hit the market in the late '90s, they were not a major concern to most people, and the topic remained under the radar for many years. What truly brought the public’s attention to GMOs were the sellers of natural foods and organic products, who took advantage of the public’s lack of education about GMOs and began labeling foods as “Non-GMO” in order to scare consumers into buying their organic products. Today, the anti-GMO movement is continuing to grow stronger, with large supermarkets and food distributors such as Trader Joe's and Chipotle swearing off GMOs. These food distributors are incredibly popular among the general public, and their actions have influenced millions of people to blindly reject genetically modified foods. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">As the general public’s negative views on genetically modified organisms grow stronger, anti-GMO websites are starting to pop up all over the Internet. These sites spread false information and misinterpreted studies, many of which end up going viral and causing the development of concerns about the safety of GMOs. Despite the World Health Organization and the U.S. Food and Drug Administration (FDA) both declaring GM foods as safe to eat, almost 90 percent of American Association for the Advancement of Science scientists believing GMOs are safe, and hundreds of published studies that back up that conclusion, many people still believe that genetically modified organisms are unsafe for consumption. People point to fraudulent and\/or misinterpreted studies, and claim that Monsanto (an agriculture company that profits from GMOs) is trying to cover up their negative side effects. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">One such example of a misinterpreted study is when multiple anti-GMO sites wrote <a href=\"http:\/\/articles.mercola.com\/sites\/articles\/archive\/2011\/10\/06\/dangerous-toxins-from-gmo-foods.aspx\" target=\"_blank\">articles<\/a> that described a 2010 study in which traces of the Bt protein Cry1Ab were found in fetal and maternal blood. At first glance, these results seem alarming, as they seem to imply that GMOs are harming fetuses. However, the articles failed to mention many key points, the most important ones being that<\/span><span style=\"font-weight: 400;\"> there was no proof the Cry1AB protein came from the GM food (Cry1AB is used in \"natural insecticide\" formulations and so the protein could have also come from eating other organic foods), and that mammals lack the receptor for the Cry1Ab protein, meaning that Bt does not affect humans in <\/span><i><span style=\"font-weight: 400;\">any<\/span><\/i><span style=\"font-weight: 400;\"> way. Despite the study’s obvious flaws and the fact that the U.S. Environmental Protection Agency had already approved Bt potatoes, corn and cotton in 1995, the article went viral and caused an outpouring of public outcry. <\/span><span style=\"font-weight: 400;\">Hundreds of these types of articles exist, most of which can be completely discredited if the time is taken to dissect them properly. However, most people do not do further research on the scientific articles they read, and so the information spreads throughout the Internet, misinforming thousands of people and causing an irrational fear of GMOs. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">There is no doubt that the issue of GMOs is a complicated one; however, at this moment in time, it is abundantly clear that the GMOs in question have both been determined safe by the FDA and can be used to help millions of people worldwide. For example, “Golden Rice,” rice that has been engineered to contain more Vitamin A, has been shown to help prevent people from going blind due to Vitamin A deficiency, a common occurrence among kids in Southeast Asia. At the time of its invention, even Bill Clinton supported “Golden Rice,” exclaiming: “If we could get more of this Golden Rice … out to the develop[ing] world ... It could save 40,000 lives a day.” However, 16 years after the invention that has the potential to save millions of kids’ lives, \"Golden Rice\" still is not commercially available due to the ludicrous claims made by big companies. It is evident that genetically modified foods have the potential to help millions of people around the world, yet the public outcry and big business interference has stalled the development of life-saving technology.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">You may be wondering, \"Why should I care about anti-GMO activists? <\/span><i><span style=\"font-weight: 400;\">This doesn’t affect me<\/span><\/i><span style=\"font-weight: 400;\">.” Palo Alto is in the heart of Silicon Valley and is leading the way in scientific and technological advancement.<\/span><span style=\"font-weight: 400;\"> It is our job to stay educated on the matter, and to encourage the development of genetically modified organisms. The acceptance of GM foods will take a long time, but it will happen in <\/span>our<span style=\"font-weight: 400;\"> generation. It is our<\/span><span style=\"font-weight: 400;\"> responsibility to not only hold pro-GMO stances, but to actively promote scientific advancements such as GMOs, so that we create an environment in which life-saving scientific and technological advancements that hold the potential to save millions of lives worldwide, can continue to be developed.<\/span>","excerpt":"When over 50 percent of Americans believe that it is “unsafe to eat genetically modified foods,\" you would think they would know what genetically modified foods are. Shockingly, they don’t. ","date":"2016-02-02 13:43:56","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Screen-Shot-2016-01-30-at-5.57.07-PM.png","categories":["Opinion"],"tags":["50 percent","affect","americans","anti","articles","bt protein","canola oil","chipotle","corn","develop","dna","genetically","genetically modified foods","gmo","joesp","limes","lives","millions","modified","non gmo","organism","palo alto","soybeans","statistics","studies","study","trader","trader joes","worldwide"]},{"id":114533,"title":"News in Review: January 2016","permalink":"http:\/\/palyvoice.com\/2016\/02\/02\/news-in-review-january-2016\/","content":"<em>This is the ninth installment of the News in Review series, which summarizes the most important news stories and events from the month of January in a timeline format.<\/em>\r\n\r\n<iframe src=\"\/\/cdn.knightlab.com\/libs\/timeline3\/latest\/embed\/index.html?source=1mB1wSAHlcj9nXWBjxk1sQMWpqvjE2w4e-FNxS7UXzCs&amp;font=Default&amp;lang=en&amp;initial_zoom=2&amp;width=720&amp;height=650\" width=\"800\" height=\"650\" frameborder=\"0\"><\/iframe>","excerpt":"A timeline summary of the most noteworthy news and events from the month of January.","date":"2016-02-02 13:15:55","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/untitled-infographic-1.jpg","categories":["News"],"tags":["January","news","news in review"]},{"id":115290,"title":"Girls&#8217; basketball tops Gunn for third straight win","permalink":"http:\/\/palyvoice.com\/2016\/02\/01\/girls-basketball-tops-gunn-for-third-straight-win\/","content":"[caption id=\"attachment_115295\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/julie-jumpman.jpg\"><img class=\"alignnone wp-image-115295\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/julie-jumpman.jpg\" alt=\"Junior forward Julie Chandler leaps in the air as she goes up for an acrobatic layup against Gunn late in the fourth quarter on Friday at Gunn. The Vikings beat the Titans, 40-28. Photo by Sam Lee.\" width=\"600\" height=\"547\" \/><\/a> Junior forward Julie Chandler leaps in the air as she goes up for an acrobatic layup against Gunn late in the fourth quarter on Friday at Gunn. The Vikings beat the Titans, 40-28. Photo by Sam Lee.\r\n\r\nThe Palo Alto High School girls’ basketball team (12-6, 5-2) stretched its winning streak to three after routing crosstown rival Gunn High School (11-7, 2-5) for the second time this season, 40-28, on Friday night at Gunn.\r\n\r\nJunior guard Lauren Koyama led the Vikings with 12 points throughout the game, and senior Alexis Harris added nine points, with eight of them coming from the fourth quarter.\r\n\r\n“We were really motivated to win this game because we were playing our rival Gunn, and that reflected in our play,” Koyama said. “The crowd’s presence was also sensational, and we really wanted to give our fans a win.”\r\n\r\nHead coach Scott Peters praised Harris's phenomenal performance.\r\n\r\n“Harris really wanted this game, and she worked really hard,” Peters said. “She had four fouls, but she played very hard with effort. She wanted it so she went and got that ball and put it in. That was all on her own her effort.”\r\n\r\nThe Vikings overall played very consistently, with eight points in the first quarter, 10 in both of the second and third and 12 in the fourth.\r\n\r\nA key aspect to winning the game was the pressure defense, according to Peters.\r\n\r\n“We put a lot of pressure, made them run around a lot and work for their scores,” Peters said.\r\n\r\nThe Vikings were able to hold the Titans to 10 points or less each quarter.\r\n\r\nDespite the low scoring, the Vikings’ defense was vital to the victory, junior forward Julie Chandler said.\r\n\r\n“Overall I think we played fairly well,\" Chandler said. \"We played good defense and played hard the whole game. Our offense wasn't at its best, but we were able to fight through and pull out the win.”\r\n\r\nThe win against Gunn was also special for the players, especially for the seniors, according to Chandler.\r\n\r\n“Playing against Gunn is always our most exciting game and beating them is a great feeling, no matter what the score is,” Chandler said. “This being the last Gunn game for our seniors made us want to win even more.”\r\n\r\nSenior forward Courtney Lovely shared Chandler's enthusiasm.\r\n\r\n“The win was amazing and a great way to start the second half of the season,” Lovely said.\r\n\r\nThe Vikings hope to extend their winning streak to four at 7 p.m. Tuesday at Gunn against Saratoga High School (12-7, 3-4), who they lost to back in January.","excerpt":"The Palo Alto High School girls’ basketball team (12-6, 5-2) stretched its win streak to three after routing crosstown rival Gunn High School (11-7, 2-5) 40-26 on Friday night at Gunn.","date":"2016-02-01 22:18:59","author":"Sam Lee","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/julie-jumpman.jpg","categories":["Sports"],"tags":["alexis harris","basketball","defense","girls","gunn","hoops","julie chandler","lauren koyama","Quad Night","scott peters","sports","titans","victory","vikings","win"]},{"id":115314,"title":"Fire alarm caused by science class demonstration","permalink":"http:\/\/palyvoice.com\/2016\/02\/01\/fire-alarm-caused-by-science-class-demonstration\/","content":"[caption id=\"attachment_115316\" align=\"alignright\" width=\"341\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_72081.jpg\"><img class=\" wp-image-115316\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_72081.jpg\" alt=\"Chemistry teacher Ron Bowditch holds up a small strip of magnesium, similar to the one ignited today during 7th period that caused the fire alarm to go off. Bowditch has performed the demonstration many times before and has never encountered issues with the fire alarm.\" width=\"341\" height=\"455\" \/><\/a> Chemistry teacher Ron Bowditch holds up a small strip of magnesium, similar to the one ignited today during 7th period that set off the fire alarm. Bowditch says he has performed the demonstration many times before and has never encountered issues with the fire alarm. Photo by Emma van der Veen.[\/caption]\r\n\r\nThe Palo Alto High School fire alarm went off due to a science classroom demonstration today during 7th period, according to Assistant Principal Jerry Berkson.\r\n\r\nAccording to Berkson, room 1704 set off the alarm, the classroom of chemistry teacher Ron Bowditch.\r\n\r\n“Mr. Bowditch says that he lit a small piece of magnesium and the alarm went off,” Berkson said. “Whether it was [caused by] that or not, the control panel said that it was from 1704. We called maintenance just to let them know what happened, and if there is something to look into, they will look into it.”\r\n\r\nAccording to Bowditch, he had been performing a simple experiment, in which a small strip of magnesium is set on fire so students can observe a reaction, a demonstration he says he has performed many times in the past.\r\n\r\n\"That little tiny piece of magnesium set off the alarm, which we have ignited many times in this class,\" Bowditch said. \"I’m not sure how it set it off, but it did. I knew it was me because the second I lit it, the fire alarm went off.”\r\n\r\nStudents evacuated from their classrooms to the football field in the middle of 7th period, disrupting class lessons, tests and other activities. Junior Jackson Kienitz is one of many students to have class plans delayed due to the fire alarm, though the activity was not pertinent to his learning.\r\n\r\n“I was in theater class when the fire alarm went off, and we were supposed to be performing graded scenes,” Kienitz said. “However, with the alarm, we weren’t able to perform all the scenes, forcing us to reschedule class activities. Others have certainly not been as lucky.”","excerpt":"The Palo Alto High School fire alarm went off due to a science classroom demonstration today during 7th period.","date":"2016-02-01 22:13:13","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_7208-2.jpg","categories":["News"],"tags":["alarm","Berkson","Bowditch","chemistry","fire","fire alarm","jackson","kienitz","magnesium","palo alto high school","science"]},{"id":115278,"title":"Out of state college presentation is at 7 p.m. this Thursday, Feb. 4 in the LCC","permalink":"http:\/\/palyvoice.com\/2016\/02\/01\/out-of-state-college-presentation-is-at-7-p-m-this-thursday-feb-4-in-the-lcc\/","content":"","excerpt":"","date":"2016-02-01 14:49:53","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":115274,"title":"Club Day 2 is during lunch this Friday, Feb. 5","permalink":"http:\/\/palyvoice.com\/2016\/02\/01\/club-day-2-is-during-lunch-this-friday-feb-5\/","content":"","excerpt":"","date":"2016-02-01 14:47:23","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":115272,"title":"First half of third quarter ends this Friday, Feb. 5","permalink":"http:\/\/palyvoice.com\/2016\/02\/01\/first-half-of-third-quarter-ends-this-friday-feb-5\/","content":"","excerpt":"","date":"2016-02-01 14:46:08","author":"Josh Yuen","categories":["Ticker"],"tags":[]}]