[{"id":120948,"title":"District plans overhaul of standardized test administration","permalink":"http:\/\/palyvoice.com\/2016\/05\/25\/district-plans-overhaul-of-standardized-test-administration\/","content":"[caption id=\"attachment_120958\" align=\"aligncenter\" width=\"562\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/IMG_5419.png\"><img class=\"wp-image-120958\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/IMG_5419.png\" alt=\"IMG_5419\" width=\"562\" height=\"421\" \/><\/a> Gunn High School school board representative senior Grace Park expressed her thoughts regarding students' frustration of retaking AP exams in her last board meeting. \"The atmosphere on campus is that students are dealing with this simply because that is the only option,\" Park said. Photo by Takaaki Sagawa.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">In response to the <a href=\"http:\/\/palyvoice.com\/2016\/05\/23\/gunn-students-plan-sit-in-teacher-salary-decision-looms\/\" target=\"_blank\">errors in the administration of Advanced Placement exams at Gunn High School<\/a> the Palo Alto Unified School District Board of Education is looking to implement a new five point plan to prevent mistakes in standardized testing procedures.\r\n<\/span>\r\n\r\nSupt. Max McGee briefly outlined the procedure during a school board meeting on Tuesday.\r\n\r\n<span style=\"font-weight: 400;\">“Christopher Kolar [director of research and evaluation] and Janine Penney will review all testing procedure for the SAT, ACT, and AP tests,” McGee said. “Chris [Kolar] and Janine [Penney] will supervise the training of all proctors every year. There will only be one student per table and at least one certificated staff member will serve as a proctor for each exam. The administration will review the full list of proctors and their experience and cycle through individuals providing a form of a sabbatical when necessary.\"<\/span>\r\n\r\n[caption id=\"attachment_120949\" align=\"alignright\" width=\"443\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/IMG_5417.jpg\"><img class=\"wp-image-120949\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/IMG_5417.jpg\" alt=\"IMG_5417\" width=\"443\" height=\"296\" \/><\/a> Supt. Max McGee briefs the audience on Gunn High School's current situation with AP examination retakes, as well as its causes. “The mistake was self-reported to the College Board, which I think is a hallmark of integrity of Gunn High School and PAUSD,” McGee said. Photo by Takaaki Sagawa.[\/caption]\r\n\r\nIn addition, McGee attended a meeting with the staff and administration of Gunn to discuss student stress in response to the rescheduled AP exams.\r\n\r\n“I got to hear how much everyone of those teachers was concerned for their students,” McGee said. “We continue to check-in with students, teachers and counselors on a daily basis to make sure students do have the necessary flexibility regarding their assignments, projects and tests.”\r\n\r\n<span style=\"font-weight: 400;\">Gunn’s student school board representative, senior Grace Park, echoed similar sentiments, but explained that most students, despite the available refund, will retake exams.<\/span>\r\n\r\n“Over the past few days I've talked to many teachers and students,” Park said. “Not all, but the vast majority of teachers are being very flexible and understanding. Many students have no choice but to retake them [AP exams]. These courses serve as college credit and for some students thinking about their future, not taking it just isn’t a feasible option.”\r\n\r\n<span style=\"font-weight: 400;\">According to Park, Gunn’s Student Executive Council is working to reschedule events that have become annual senior traditions.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"End of the year events have been rescheduled and the student body is coping,” Park said. “Events like the paper toss cannot be done at the usual time because seniors are scheduled to retake AP exams.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">McGee hopes to prevent future incidents and expressed his sympathy for the Gunn students, partly compensating by offering free ice cream for students after AP exams.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"Ice cream sundaes is our way of saying we believe in you, we are proud of you, and regret what happened,” McGee said.<\/span>","excerpt":"The Palo Alto Unified School District Board of Education is implementing a new five point plan to prevent mistakes in standardized testing procedure.","date":"2016-05-25 22:53:25","author":"Zahra Muzaffar","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/IMG_5419.png","categories":["News","Spotlight"],"tags":["ap","apgate","district","gunn","McGee","PAUSD","School Board"]},{"id":120673,"title":"Get Involved Palo Alto to provide student internships over the summer","permalink":"http:\/\/palyvoice.com\/2016\/05\/25\/get-involved-palo-alto-to-provide-student-internships-over-the-summer\/","content":"<span style=\"font-weight: 400;\">Get Involved Palo Alto, an organization focused on engaging high school students in the community through community service, internships and career education, is accepting applications for its Summer Service Learning Internship Academy until May 29.<\/span>\r\n\r\n[caption id=\"attachment_120912\" align=\"alignnone\" width=\"615\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/GetInvolvedPA.jpg\"><img class=\"wp-image-120912\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/GetInvolvedPA.jpg\" alt=\"Juniors Candace Wang, and Vivian Wu collaborate with Christina Owen during a Get Involved Palo Alto meeting. &quot;&quot;Photo by Daniella Maydan\" width=\"615\" height=\"461\" \/><\/a> Juniors Candace Wang and Vivian Wu, and freshman Grace Lam collaborate with Christina Owen during a Get Involved Academy meeting. Photo: Daniella Maydan[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Summer Internship Academy is a one-month internship which will run from June 6 to June 30, according to the <a href=\"link: http:\/\/www.getinvolvedpa.com\/\">Get Involved Palo Alto website<\/a>. Participating students will be matched with mentors at any of the 25 local partner organizations that relate to their talents and interests. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">A few of the partner organizations include, but are not limited to the <a href=\"http:\/\/www.paloaltochamber.com\/\">Chamber of Commerce<\/a>, <a href=\"http:\/\/www.dreamcatchersyouth.org\/\">Dream Catchers<\/a>, <a href=\"http:\/\/readingpartners.org\/\">Reading Partners<\/a>, <a href=\"http:\/\/onemillionlights.org\/blog\/2010\/10\/04\/mission\/\">One Million Lights<\/a>, <a href=\"http:\/\/www.abilitiesunited.org\/\">Abilities United<\/a> and <a href=\"http:\/\/www.penvol.org\/\">Peninsula Volunteers<\/a>. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Depending on the specific organization students are matched to, they can expect to work five to six hours a day during the week, in either the Palo Alto, Menlo Park or Los Altos area. Additionally, participating students will be awarded the President’s Award for Volunteer Services, according to the Get Involved Palo Alto website. <\/span>\r\n\r\nAccording to junior Candace Wang, Get Involved Academy's project manager, the internship program is a great way for people to get working experience in the community.\r\n\r\n\"I don't know of any other program out there that actively works to match you with a summer internship with a mentor with similar interests as you and that gives you the opportunity to do meaningful work for an entire month,\" Wang said. \"At the end of the day, I think this is one of those opportunities that should not be passed up because it's the best way to get real world experience with the least hassle, and at the same time be able to contribute in the field of the participant's interest.\"\r\n\r\n<span style=\"font-weight: 400;\">In order to be eligible to apply, students must be currently in high school, according to the Get Involved PA website. The cost of attendance is $1880 per student, and financial assistance will be given to those who need it.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Students can visit the web pages about the <a href=\"http:\/\/www.getinvolvedpa.com\/info-for-students.html\">program<\/a> and <\/span><span style=\"font-weight: 400;\"><a href=\"http:\/\/www.getinvolvedpa.com\/application-steps.html\">application process<\/a> for more information, <\/span>and can contact Get Involved PA at <a href=\"mailto:internships@getinvolvedpa.com\">internships@getinvolvedpa.com<\/a>.","excerpt":"Get Involved Palo Alto, an organization focused on engaging high school students in the community through community service, internships and career education, is accepting applications for its Summer Service Learning Internship Academy until May 29.","date":"2016-05-25 22:50:30","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Screen-Shot-2016-05-20-at-8.38.52-PM.png","categories":["News","Spotlight"],"tags":["abilities united","candace wang","chamber of commerce","dream catchers","get involved palo alto","internships","juniors","los altos","menlo park","one million lights","outgoing seniors","palo alto","penninsula volunteers","reading partners","seniors","sophmores","studens","summer","Summer Service Learning Internship Academy","work"]},{"id":120678,"title":"Time for a second draft: Alignment reform needed in Paly’s English department","permalink":"http:\/\/palyvoice.com\/2016\/05\/25\/time-for-a-second-draft-alignment-reform-needed-in-palys-english-department\/","content":"<span style=\"font-weight: 400;\">English is a class about interpretation. People either love it or hate it for existing outside the black-and-white world. It only takes a few fishbowls and Socratic Seminars to see that it’s often just as easy to prove the converse of a theme using slightly different evidence. Still, exploring all the avenues available to find the hidden meaning in a text can be rewarding.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">As such, English is a class that is inherently subjective. When analyzed under different rubrics, the same work gets different credit. Distorted by layers of partiality, from interpretation to writing style to a teacher’s own opinion of a thesis, we feel that at Palo Alto High School, equality before the gradebook is not a sufficiently enforced policy. In short, the differences in grading and expectations in English classes at Paly are detrimental to students and ultimately result in inaccurate representations of both talent and effort. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Before we get into the horizontal and vertical alignment alluded to above, we’d like to clarify something. We do not intend to call out any specific English teacher in this article, and we don’t believe any of these teachers are consciously biased. We are extremely grateful to all our English teachers for everything they’ve taught us, from the x-y-z’s of thesis writing to the MLA format of a final paper. The Paly faculty is a passionate, talented group of teachers who all want their students to succeed. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">But if students are to succeed, Paly needs to have a new policy enforcing alignment, so that every student is given an equal opportunity to learn and excel. Additionally, this kind of adaptation to Paly’s current alignment efforts would also help fulfill the most recent <a href=\"http:\/\/palyvoice.com\/2015\/02\/22\/wasc-team-announces-results-of-self-study-report\/\">WASC goals<\/a> of systems alignment, student engagement and innovation in the English department.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Horizontal alignment is the educational practice of ensuring that students taking the same course under different teachers are still learning the same material. This doesn’t solely mean they read similar literature, but that they are taught the same writing techniques and organizational formats. Vertical alignment holds teachers accountable for adequately preparing their students to succeed in the next level course, meaning that if a junior year course is open to both regular and honors sophomore students, both should be able to effectively complete the course junior year. <\/span>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/english-horizontal-alignment.jpeg\"><img class=\"aligncenter size-full wp-image-120858\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/english-horizontal-alignment.jpeg\" alt=\"english-horizontal-alignment\" width=\"800\" height=\"490\" \/><\/a>\r\n\r\n<span style=\"font-weight: 400;\">Imagine this scenario. You read the required book for your class, and after discussions and analysis, you receive an essay prompt, the prompt given to all students in your lane. You write an essay, using the instructions given to you by your teacher. Then you add it to the pile of essays for a different teacher teaching a different period of the same class. Would you be confident your work would get the grade it deserved? Would you bet 10 or 15 or 20 percent of your grade on it? We wouldn’t.\r\n<\/span>\r\n\r\n<span style=\"font-weight: 400;\">What isolates English as the least horizontally aligned subject is the lack of common material shared between classes. In STEM classes, differences between two teachers can be frustrating, but at least students have a common textbook or common notes. Reading the same book in two different classes does not guarantee the same knowledge, as the material used to analyze the book can completely change your perspective of the literature.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Paly’s current departmental policy requires that English teachers hold bimonthly grade-level meetings to discuss how credit should be awarded in each class and other aspects of student learning. Instructional Supervisor Shirley Tokheim finds the grade-level teams to be useful in facilitating cohesion. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“When we have collaboration, teachers meet in their grade-level teams and ... talk about creating common assessments, creating a common syllabus … and [calibrating] essays,” Tokheim said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Despite acknowledging room for improvement, Tokheim feels that alignment is not an issue that can be corrected quickly. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It’s something that takes years and years .… It’s something that you’re constantly working on and something that our department is constantly working on,” Tokheim said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Unfortunately, we feel that this approach is too passive for such a pervasive problem within the English department. The fact that certain teachers within the same lane are infamous for their intense discussion groups or their emphasis on participation screams inconsistency. Teachers have their own style, and we value learning to adapt to different learning methods, but in past courses we’ve compared our assignments to find completely different resources and templates available. The difference between the basic writing materials provided to us can only mean that our writing is graded differently. The fact that colleges will see the same course on our transcripts, when in actuality our courses are far from the same, is not okay. It’s pretty misleading.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">English teacher Julia Taylor cautions that complete uniformity is a dangerous goal when it comes to English alignment.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“In English class we have to be really careful because there is a way to take alignment a little bit too far,” Taylor said. “When all the teachers decide that they’re going to be using the exact same terminology …  it’s a little problematic because what happens when students go to colleges all over the place and someone uses different terminology? The students don’t have flexibility of thinking.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">We feel that there must be a way to achieve this flexibility of thinking while maintaining consistency between classes. English is meant to be a creative subject, but there are ways to find a balance between creativity and structure. As a first step, we suggest all potential biases are eliminated from the gradebook. We invite teachers to try our scenario above, and adopt Advanced Placement Psychology’s policy of identifying written work by student ID, not name. We personally do not think teachers are biased against students, but this method would prevent students from blaming grades on subjectivity, instead initiating a conversation about what’s actually wrong with poorly graded work.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Grades aren’t the only thing hurt by insufficient vertical alignment. Psychology shows that a student’s self-esteem, their confidence in their ability, and their intrinsic motivation to succeed are all damaged when they’re thrown into a class unprepared. Ninth grade English teacher Mimi Park explains that this problem is being tackled in the form of Thursday collaborations between the ninth and 10th grade levels.<\/span>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/english-vertical-alignment.jpeg\"><img class=\"aligncenter size-full wp-image-120865\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/english-vertical-alignment.jpeg\" alt=\"english-vertical-alignment\" width=\"800\" height=\"480\" \/><\/a>\r\n\r\n“With ninth and 10th grade discussions, and really this is all I can speak to just on personal experience, we have meetings where we talk about expectations and the transition from ninth grade to 10th grade, the skill sets that we’re seeing,” Park said.\r\n\r\n<span style=\"font-weight: 400;\">While we applaud the department’s increasing focus on vertical alignment, this focus seems to be struggling to reach the 11th and 12th grade classes, years with a particularly significant increase in academic rigor. If collaboration in these teacher teams is more difficult, we suggest a set of uniform handouts to set expectations between lanes. A teacher could then prepare students for next year, teaching a few lessons in advance, the same way some math classes spend the last weeks of school going over materials that will be seen in next year’s lane.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">While most teachers seem to be working towards goals of alignment, an increase of student feedback could help them get there. Right now, mandatory end-of-year surveys question a single teacher’s skills, but rarely touch on the alignment between classes in the same lane or reflections of students’ satisfaction with their previous class’ preparation for their course. Teachers should do more than just look at the responses to these surveys; there should at least be a department meeting to discuss the results. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">We attribute some of these alignment issues to flaws in the department’s solicitation of student feedback. Some of the burden is on students to actually provide constructive feedback instead of just venting. We also suspect that part of the difficulty stems from teachers' resistance to examine criticism, and part of it comes from the logistical challenges of collecting this kind of feedback.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Sometimes, inconvenient truths can only be faced when they come with a side of data, and we hope that the upcoming end-of-year survey is used to evaluate not only individual performance, but the orchestrations of the department as a whole. Alignment may require trial and error, from trying out student IDs on essays to improving standardized grade-level expectations, but we believe the Paly English department will handle it well. After all, if there is one thing that English has taught us, it's that the best work always needs multiple drafts. <\/span>","excerpt":"Imagine this scenario. You read the required book for your class, and write an essay, using the instructions given to you by your teacher. Then you add it to the pile of essays for a different teacher teaching a different period of the same class. Would you be confident your work would get the grade it deserved? Would you bet 10 or 15 or 20 percent of your grade on it? We wouldn’t.","date":"2016-05-25 21:46:30","author":"Maya McNealis","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/english-alignment-featured-image1.jpeg","categories":["Opinion","Spotlight"],"tags":["alignment","english","opinion","park","reform","taylor","tokheim","WASC"]},{"id":120840,"title":"Season recap: Girls&#8217; and boys&#8217; teams finish strong for both swimming and diving","permalink":"http:\/\/palyvoice.com\/2016\/05\/25\/season-recap-girls-and-boys-teams-finish-strong-for-both-swimming-and-diving\/","content":"The Palo Alto High School boys' and girls' swimming teams wrapped up their seasons after the girls' swimming team placed second and the boys placed fourth at the California Interscholastic Federation State Swimming and Diving Championships last weekend in Clovis. The diving team did exceptionally well too, with senior diver Mimi Lin placing first at the Central Coast Section Championships and the state meet as well. Senior diver Reed Merritt also captured the boys' diving CCS title.\r\n\r\nAccording to senior swim captain Kayleigh Svensson, the team has done a great job this season and has worked extremely hard to do well.\r\n\r\n“It was a wonderful end to the season, and to my time here at Paly,” Svensson said. “I'm incredibly proud of our girls this year. We've worked through a lot of hardships, but we did well.”\r\n\r\nAccording to Svensson, junior swimmer Alex Liang won two events in Clovis, setting state records in the 500-yard freestyle and the 200-yard freestyle.\r\n\r\nAlthough the boys swim team did not place first, junior swimmer Andrew Jozefov said that this season was more than just getting the best times. It was also about bonding with the team.\r\n\r\n\"A lot of people had some huge time drops and although we came up just short of our goals we can't be unhappy with [our] new best times,\" Jozefov said. \"It was a lot of fun spending time with my teammates this season.\"\r\n\r\nAs for the diving team, senior diving captain Mimi Lin said that she believes this was the best year for the diving team that she has seen at Paly.\r\n\r\n\"I think this is one of the most successful seasons since I've been here,\" Lin said. \"Not because of the placings, but because of how much we improved as a team.\"\r\n\r\nSvensson echoed the same sentiment for the swimming team.\r\n\r\n\"I think we had a great season as a team. I'll miss having them around next year,\" Svensson said.","excerpt":"The Palo Alto High School boys' and girls' swimming teams wrapped up their seasons after the girls' swimming team placed second and the boys placed fourth at the California Interscholastic Federation State Swimming and Diving Championships last weekend in Clovis.","date":"2016-05-25 19:35:15","author":"Victor Carlsson","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/IMG_6264.jpg","categories":["Sports","Spotlight"],"tags":["boys swimming","CCS","Diving","girls' swimming"]},{"id":120836,"title":"Tuesday Tunes: Jenny Xin","permalink":"http:\/\/palyvoice.com\/2016\/05\/24\/tuesday-tunes-jenny-xin\/","content":"[caption id=\"attachment_120937\" align=\"aligncenter\" width=\"605\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/DSC_00081.jpg\"><img class=\" wp-image-120937\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/DSC_00081.jpg\" alt=\"Senior Jenny Xin describes her muical ventures and prefrences during her sit own with the Paly Voice. Photo by Nika Woodfill. \" width=\"605\" height=\"403\" \/><\/a> Senior Jenny Xin sits down with the Paly Voice to discuss her musical ventures and favorite songs. Photo by Nika Woodfill.[\/caption]\r\n\r\nThis week the Paly Voice sat down with music enthusiast and Vikapella member senior Jenny Xin, to discuss pop music, her perfect pitch and choir.\r\n\r\nXin has participated in choir for all four years of high school, but claims it has not influenced her music taste substantially, despite its importance to her musical education.\r\n\r\n“My music taste is independent from choir,” Xin said. “However, choir has exposed me to a lot of new ideas musically, and stylistically, and I’ve kind of learned what makes the songs I like listening to catchy. And kind of been able to learn about popular music throughout the ages. Even though I don't listen to a lot of the songs we sing in choir it is definitely really interesting to learn about them and perform and that has definitely broadened my musical horizons.”\r\n\r\nOver the course of Xin’s musical career, she has been able to develop something called perfect pitch.\r\n\r\n“So perfect pitch is generally like being a glorified tuning fork,” Xin said. “Basically perfect pitch or relative pitch means just being able to identify notes by their name, so if you hear the letter C or E or A flat you'll be able to hear that note in your head.”\r\n\r\nDespite the talent that stems from having perfect pitch, Xin explains that it is more of an annoyance when it comes to listening to music.\r\n\r\n“It gets kind of annoying. It’s not really a help as much as it is a giant pain,” Xin said. “I’ll listen to a radio station and sometimes they'll pitch their songs to avoid copyright issues and so I can kind of realize that it annoys me the whole time.”\r\n\r\nAccording to Xin, she most enjoys listening to high tempo upbeat songs, however, her individual music taste is difficult to categorize.\r\n\r\n“A lot of the songs I listen to are so different I'm not really sure what the underlying theme is,” Xin said.\" For me, it is to an extent lyrical but also the production behind the song. But mostly I tend to like really upbeat catchy music.”\r\n\r\nAdditionally, Xin described how her music preference has evolved in high school.\r\n\r\n“I used to think listening to mainstream pop was kind of a guilty pleasure thing, but I think I enjoy more now without too much shame, and I have gotten more into musicals,” Xin said. “My music taste has definitely developed. Before I would mostly be listening to classical or pop music but now I listen to everything.”\r\n\r\n<iframe src=\"https:\/\/embed.spotify.com\/?uri=spotify%3Auser%3Aclairekrugler%3Aplaylist%3A3Z3oH0xrxcXRUJQij2AQbv\" width=\"300\" height=\"380\" frameborder=\"0\"><\/iframe>","excerpt":"This week the Paly Voice sat down with music enthusiast and Vikapella member senior Jenny Xin, to discuss pop music, her perfect pitch and choir. <a href=\"http:\/\/palyvoice.com\/2016\/05\/24\/tuesday-tunes-jenny-xin\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2016-05-24 23:31:31","author":"Claire Krugler","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/DSC_00081.jpg","categories":["Entertainment","Spotlight","Tuesday Tunes"],"tags":["choir","Jenny Xin","music","perfect pitch","Tuesday Tunes","vikapella","wombats"]},{"id":120788,"title":"Students to perform music on the Quad during lunch","permalink":"http:\/\/palyvoice.com\/2016\/05\/24\/students-to-perform-music-on-the-quad-during-lunch\/","content":"Student musicians will be performing on the Palo Alto High School Quad during lunch as part of this week's program hosted by the Associated Student Body.\r\n\r\nThe performances will include original pieces and covers, according to ASB School Board representative senior Emma Cole. Many genres of music will be represented, including rock, alternative, rap and hip hop.\r\n\r\nASB is putting on this event to alleviate some of the stresses of finals week, according to Cole.\r\n\r\n“We just wanted to put this event on because we love seeing Paly students relaxing and enjoying free time on the Quad, even when school is stressful and hectic,” Cole said. “It is nice to just take a break on the Quad on a beautiful sunny day and listen to great music. It is a very low key, calm event, but hopefully students will just see it as a chance to wind down and relax a little bit.”\r\n\r\nIn the past, the Paly band has performed on the Quad, however, ASB expanded the event to allow for student musicians to play, according to Cole. Students from a variety of musical backgrounds signed up to perform in front of their peers and show off their talent.\r\n\r\n“This week gave us a reason to get a group together and try playing some styles of music we do not usually play,” senior Peter Willits said. “We are using this week of music as a method to spread some music to people who may need it and hopefully to get some people dancing.”\r\n\r\nWillits and his band will be playing covers of reggae, ska and funk songs.\r\n\r\nOther hope that this week will help bring some publicity to their work.\r\n\r\n“I want to perform because I have been writing and producing original songs for years and want this to help me get more exposure,” senior Martin Manasherob said. He will be performing a series of hip-hop and rhythm and blues songs, all self-written and produced.\r\n\r\nManasherob says he hopes that his music will help students relax and have fun.\r\n\r\n“I think that this will be good for the campus because it is music that gives off a good vibe,” Menasherob said. “It [the music] is positive for people who might be having a tough day or maybe just want to enjoy some good music.”\r\n\r\nBelow is the tentative list of performance dates, according to Cole. Dates are subject to change.\r\n\r\nMay 20: Russell Star-lack and Jer Samos (\"RAJ\")\r\n\r\nMay 23: Peter Willits\r\n\r\nMay 24: Clara Chiu and Claire Krugler (first half), Martin Manasherob (second half)\r\n\r\nMay 25: Andrew Huang\r\n\r\nMay 26: Gabe Cohen\r\n\r\nMay 27: Dillon Scheel\r\n\r\n&nbsp;","excerpt":"Student musicians will be performing on the Palo Alto High School Quad during lunch as part of this week's program hosted by the Associated Student Body.","date":"2016-05-24 21:38:53","author":"Julia Qiao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/0000\/00\/7_0.jpg","categories":["News","Spotlight"],"tags":["ASB","emma cole","lunch","Martin Manasherob","music","perform","Peter Willits","quad"]},{"id":120741,"title":"Season recap: Despite hot start, boys&#8217; golf ends in disappointment","permalink":"http:\/\/palyvoice.com\/2016\/05\/24\/season-recap-despite-hot-start-boys-golf-ends-in-disappointment\/","content":"<dl id=\"attachment_120830\" class=\"wp-caption alignnone\" style=\"width: 1016px;\"><dd class=\"wp-caption-dd\">\r\n\r\n[caption id=\"attachment_120842\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/IMG_97531.jpg\"><img class=\"size-full wp-image-120842\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/IMG_97531.jpg\" alt=\"Senior captain Henry Gordon tees off in a match early in the season against Los Altos High School. Gordon will play golf next year at Occidental College. Photo by Cooper Lou.\" width=\"800\" height=\"534\" \/><\/a> Senior captain Henry Gordon tees off in a match early in the season against Los Altos High School. Gordon will play golf next year at Occidental College. Photo: by Cooper Lou.[\/caption]\r\n\r\n<\/dd><\/dl>The Palo Alto High School boys' golf team officially concluded its season on Monday when sophomore Ahmed Ali missed the cut for the state competition by one stroke at the NorCal Golf Championships in Salinas.\r\n\r\nAli, who shot three over par in the final competition of the season at Corral de Tierra Golf Course, competed without the rest of his teammates after the team as a whole finished in eighth place out of eight teams at the CCS Finals last Tuesday.\r\n\r\n\"I just wasn't as sharp as I needed to be [today],\" Ali said.\r\n\r\nDespite the disappointing finish, the Vikings accomplished a lot of their initial goals. They completed an undefeated regular season by finishing 14-0 overall heading into the postseason. According to captain junior Timothy Liu, the Vikings cruised into the CCS finals with a lot of confidence, but were unable to execute.\r\n\r\n\"We played very well at Leagues and CCS Regionals, which led up to last week's CCS championship,\" Liu said. \"Unfortunately, we didn't play as well as we would have hoped during the CCS championships and we were eliminated from the competition sooner than we would have liked.\"\r\n\r\nLiu attributes the Vikings' success to senior leadership and a consistent group of underclassmen.\r\n\r\n\"I'm still incredibly proud of how well we played as a team this year,\" Liu said. \"The seniors really held their ground and anchored the team and a talented group of sophomores kept the team's engine churning all year long.\"\r\n\r\nTeam captain, senior Henry Gordon, who has committed to playing golf at Occidental College, agreed with Liu, saying that he excited about where the team currently stands.\r\n\r\n\"It feels good to cap off four years confidently knowing that we are one of the top public teams in the state,\" Gordon said.\r\n\r\nHead coach Doyle Knight will look to build off of this season's strong performance. The Vikings will be led next year by Ali, Liu and sophomore Sergi Mata, among others.\r\n\r\n\"Next year, we're looking to keep up the overall positive season we had this year and hopefully turn the tide during CCS and win it all,\" Liu said.\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School boys' golf team officially concluded its season on Monday when sophomore Ahmed Ali missed the cut for the state competition by one stroke at the NorCal Golf Championships in Salinas.","date":"2016-05-24 14:28:52","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/13184547_1720898391485755_1901.jpg","categories":["Sports","Spotlight"],"tags":["#norcal","ahmed ali","boys' golf","CCS","doyle knight","henry gordon","matthew lewis","season recap","timothy liu"]},{"id":120508,"title":"Buy a seat in the Performing Arts Center","permalink":"http:\/\/palyvoice.com\/2016\/05\/24\/buy-a-seat-in-the-performing-arts-center\/","content":"[caption id=\"attachment_120511\" align=\"aligncenter\" width=\"587\"]<img class=\"wp-image-120511\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/PAC.jpg\" alt=\"PAC\" width=\"587\" height=\"393\" \/> The Palo Alto High School Performing Arts Boosters are currently selling seat nameplates in the new Performing Arts Center to raise funds to purchase additional amenities that were not included in the building costs. They hope to raise around $400,000, according to PAB President Holly Ward. Photo by Zahra Muzaffar.[\/caption]\r\n\r\nLooking for a great graduation gift or want to contribute to a school fundraiser? If so, then you may be interested in purchasing a seat nameplate in the <a href=\"http:\/\/palyvoice.com\/2016\/05\/06\/performing-arts-center-ushers-in-a-new-era\/\">new Performing Arts Center.<\/a>\r\n\r\nThe Performing Arts Boosters hope the fundraiser will reach a large audience, according PAB President Holly Ward.\r\n\r\n“The PAC will be used by the entire school from assemblies to lectures and presentations, so all parents and students should support the fundraising,” Ward said.\r\n\r\nThe money that is raised from the seat sales will go towards additional amenities that were not included in the building costs of the PAC, according to Ward.\r\n\r\n“Selling seats is a time-honored way to raise funds for a new theater,” Ward said. “The Performing Arts staff have compiled lists of items they need for the new building. Examples are new risers for choir, new music stands for band, and new wireless mics for theater. The most expensive single item is a new grand piano, which will make the PAC an appealing venue for so many people in our community.”\r\n\r\n[caption id=\"attachment_120531\" align=\"alignright\" width=\"381\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/13241672_1064745550263864_182915756_o.jpg\"><img class=\" wp-image-120531\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/13241672_1064745550263864_182915756_o.jpg\" alt=\"The Paly Symphonic Band, conducted by Jeff Willner, was the first to perform in the new PAC on Thursday May 12. Photo: Emma van der Even.\" width=\"381\" height=\"285\" \/><\/a> The Paly Symphonic Band, conducted by Jeff Willner, was the first to perform in the new PAC on Thursday May 12. Photo: Emma van der Veen.[\/caption]\r\n\r\nWard explains exactly what purchasing a seat entails.\r\n\r\n“The donor's money does not actually purchase the seat or the right to sit in the seat,” Ward said. “Instead, the donor gets an engraved nameplate on the chair.\"\r\n\r\nPurchases are tax deductible and the nameplates can be customized, according to Ward.\r\n\r\n“Because the donor receives nothing of value for their gift, the donation is fully tax deductible,” Ward said. “Most donors request their name or the name of their student on the brass plate. Others have chosen quotes from plays or songs.”\r\n\r\n[caption id=\"attachment_120509\" align=\"alignright\" width=\"383\"]<img class=\"wp-image-120509\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/MAB-birds-eye-v2.jpg\" alt=\"PalyPAC DSA-Approved Drawings.pdf\" width=\"383\" height=\"368\" \/> \"Seats located in the orchestra center cost $1,000, orchestra side seats cost $500 and the parterre seats are $250,\" Ward said. Photo: Performing Arts Boosters.[\/caption]\r\n\r\nThe Performing Arts Boosters are hoping to continue the fundraiser for a several years, according to Ward.\r\n\r\n“The financial goal is $400,000,” Ward said. “$200,000 in year one, $100,000 in year year and $100,000 in year 3. We received our first donation in early November so year one will end on October 31, 2016. To date, we have raised $75,000. The total cost of the items on the teacher's wish lists is approximately $485,000.”\r\n\r\nThe pricing of chairs will vary on their location, according to Ward.\r\n\r\n“The most popular seats, the orchestra center, cost $1,000 for the naming right,” Ward said. “The orchestra side seats cost $500 and the parterre seats are $250. We are also soliciting direct donations and donations in any amount are greatly appreciated. We plan to install a donor recognition wall in the lobby of the theater [which will include names of donors who contributed over $100].”\r\n\r\nDespite the large effort required to fundraise, Ward is excited for the future of the PAC.\r\n\r\n“I was Theater Boosters president from 2007 to 2011 and my daughters both loved theater,” Ward said. “When I learned that a group of parents had raised funds for the Media Arts Center, I felt compelled to help raise funds for the PAC and I want to see it through to the end and make sure that it will provide a first class setting for the outstanding performing artists at Paly. All the hard work is worthwhile when I see the positively giddy expressions on the Performing Arts staff as they walk through the PAC and talk about the features of this state of the art facility.”\r\n\r\nTo purchase a seat or donate directly to the Performing Arts Boosters, please visit <a href=\"http:\/\/www.palypab.com\">www.palypab.com<\/a>","excerpt":"Looking for a great graduation gift or want to contribute to a school fundraiser? If so, then you may be interested in purchasing a seat nameplate in the new Performing Arts Center.","date":"2016-05-24 10:45:41","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/PAC.jpg","categories":["News"],"tags":["Community","construction","Holly Ward","new","orchestra","pac","palo alto high school","paly","Performing Arts Boosters","performing arts center"]},{"id":118156,"title":"Environmentalist extroadinaire: Jack Kearns","permalink":"http:\/\/palyvoice.com\/2016\/05\/24\/environmentalist-extroadinaire-jack-kearns\/","content":"[caption id=\"attachment_120657\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/kearns.jpg\"><img class=\"wp-image-120657\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/kearns.jpg\" alt=\"Jack Kearns, Palo Alto High School's new AP Environmental Science teacher, has an extensive background in ecology. He worked for the Environmental Protection Agency and as a wildlife biologist prior to teaching. Photo by Dhara Yu.\" width=\"600\" height=\"449\" \/><\/a> Jack Kearns, Palo Alto High School's new AP Environmental Science teacher, has an extensive background in ecology. He worked for the Environmental Protection Agency and as a wildlife biologist prior to teaching. Photo by Dhara Yu.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Jack Kearns points out an oak tree located on the edge of Palo Alto High School's campus Quad. “It reminds me of a baobab,” he says, referring to the bizarre-looking tree that graces the savannas of Africa, and spouts off a few facts about that plant. To most onlookers the tree is unremarkable, but to Kearns, Palo Alto High School's new Advanced Placement Environmental Science teacher, it's evocative of the Serengeti and worthy of more than a cursory glance. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Standing well over six feet tall, with the burly frame of an ex-football player, Kearns is genial and outgoing — he’s the type to give a vigorous wave to passing students and staff, or start up a game of volleyball on the Quad after school. It’s not hard to see why the administration thought him a suitable replacement for Kenyon Scott, the <a href=\"http:\/\/palyvoice.com\/2016\/01\/22\/trust-and-respect-remembering-kenyon-scott\/\" target=\"_blank\">beloved Paly AP Environmental Science teacher<\/a> who suddenly passed away in January. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It’s an honor to go forward with Kenyon’s mantle, to follow in his shadow, to carry on what he had started,” Kearns said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Kearns’ path to Paly was certainly a serendipitous one. He was working toward his teaching certification when one of his professors in teaching school informed him that there was an opening at Palo Alto High School in environmental science, which would be his first full-time teaching job — he soon connected with Paly administration and interviewed for the position. But to Kearns, the logistical details are irrelevant.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“What matters is that this came together at the right moment,” he said. “I decided to become a teacher because I felt a calling, from a higher power, and I finally had the opportunity to follow that voice.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Kearns keeps a folded envelope in his pocket, scrawled with the quote, “May God give you entrance to the hearts of those you teach, and then make you know that as you enter there, you stand in holy places.” His teaching philosophy, he says, is to imbue his students with a sense of respect and reverence for the natural world by keeping his class lighthearted and enjoyable, and relating environmental science to their daily lives. As the final assignment for his class, students created chalk drawings with slogans underscoring the importance of preserving the natural world.<\/span>\r\n\r\n\"He's very interested in active learning, and having his kids get out and experience the environment,\" said science department instructional supervisor Kelli Hagen about Kearns. \"Whether it's on-campus field trips, which he's done a lot of, or off-campus, he wants his students to be engaged.\"\r\n\r\nJunior Mason Wittman, one of Kearns' students, echoes this sentiment, underscoring Kearns' commitment to instilling an admiration for the outdoors in his students. \"It's not just in the classroom,\" Wittman said. \"We get to go out, and I've really developed a passion for environmental science. I might even pursue it.\"\r\n\r\nBut Kearns himself has realized that his style of education may be at odds with certain perceptions of the community’s tradition of academic rigor. “I sense an academic intensity here,” he said. “It’s been a challenge to reconcile that.”\r\n\r\n<span style=\"font-weight: 400;\">Kearns brings with him an extensive background in ecology — he’s worked as a wildlife biologist and for the Environmental Protection Agency. His career has taken him across the world, to the Mojave Desert, the Alaskan glaciers, East Africa and Japan. The plains of Kenya and Tanzania, in particular, hold a special place in his heart.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The landscape was my favorite part,” he said. “Sitting in the Serengeti — which means endless plains, it just extends forever, as far as the eye can see — and watching a lightning and thunder storm. Images like that were my favorite — just taking everything in and being in awe.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">His specialties as a wildlife biologist, Kearns says, are the small carnivores of Africa and birds of prey. <\/span><span style=\"font-weight: 400;\">“If anyone has a question about mongooses or raptors, they can ask me,” he said with a laugh.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Though Kearns, as he describes it, lives and breathes environmental science, he also has an avid interest in sports.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I played football, basketball, rugby, volleyball, beach volleyball, martial arts, swimming, you name it,” he said. “That’s actually how I got to college, on a football scholarship. I’ve coached on and off for the last ten years.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Kearns is very much a family man: he is married, with a 15-year-old daughter and a 1-year-old son. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Spending time with them is <\/span><i><span style=\"font-weight: 400;\">mucho, mucho divertido<\/span><\/i><span style=\"font-weight: 400;\">,” he said, invoking a bit of Spanish. When asked about his foreign language ability, he said he knows a few words of Swahili, Tongan — he played on a Tongan rugby team — and Japanese. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">He keeps mementos from his cultural experiences, and on his first day of teaching at Paly he brought in two: a warrior's club and a lion's tooth, given to him by a nomadic Maasai tribe in the Serengeti. <\/span>\r\n\r\n\"To become a Masaai warrior, you have to kill a lion,\" Kearns said. \"It's not about animal cruelty. It's about demonstrating that they can protect their family and their tribe.\"\r\n\r\nAs the school year draws to a close, Kearn's future at Paly remains uncertain — his teaching contract with the district goes only through this academic year — but he has clearly earned the respect of many his students. It's no easy task to stand in as a replacement for a teacher, particularly one who was so universally admired, but according to Wittman, Kearns has done so seamlessly, bringing his own experiences into the fold while maintaining the buoyant, optimistic spirit that has characterized this class.\r\n\r\n\"I think Paly did a great job,\" Wittman said. \"They probably found the best possible replacement. We all loved Mr. Scott, but I think everyone loves Mr. Kearns too.\"\r\n\r\nAnd without a doubt, that appreciation is reciprocated, says Kearns. <span style=\"font-weight: 400;\">“Let me put it this way,” he said. “I am living the dream. This is my dream job.\"<\/span>","excerpt":"The Paly Voice profiled AP Environmental Science teacher Jack Kearns, who spoke about his athletic prowess, expertise in small African carnivores and passion for teaching.","date":"2016-05-24 10:37:31","author":"Dhara Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/kearns.jpg","categories":["Features","Spotlight"],"tags":["AP environmental science","apes","ecology","environmental protection agency","Jack Kearns","Kenyon Scott","what is a mongoose","wildlife biology"]},{"id":120766,"title":"Gunn students plan sit-in; teacher salary decision looms","permalink":"http:\/\/palyvoice.com\/2016\/05\/23\/gunn-students-plan-sit-in-teacher-salary-decision-looms\/","content":"Students at Gunn High School are planning a sit-in protest at Tuesday night's school board meeting. The meeting will also address the topic of teacher salaries and the possible ratification of a landmark three-year contract that would involve multiple raises.\r\n\r\nAccording to the <a href=\"https:\/\/gunnoracle.com\/2016\/05\/20\/ap-tests-invalidated-due-to-irregularities\/\">Gunn Oracle<\/a> The protest stems from problems that occured with the Advanced Placement (AP) test. Proctor errors, including incorrect distance between students, caused the cancellation of test scores for Calculus BC, Biology, Environmental Science, Physics C, Physics 1, Spanish, Psychology, Computer Science A, Chemistry and English Literature.\r\n\r\nThe canceled test scores require students to either retake the test or forego any scores from invalidated exams. Students received this information several weeks after taking their tests, requiring them to review and study once again even as final tests and projects begin to pile up.\r\n\r\nGunn senior Ben Lee is one of the students affected by this.\r\n\r\n\"I have to retake a three-hour AP Lit [English Literature] test and write three essays again,\" Lee said.\r\n\r\nAccording to Lee, the sit-in is an attempt to get students a voice in these situations, and to hold the Gunn administration responsible for its errors in proctoring.\r\n\r\n\"I'd say it's to show the school board and general community that students want to be heard and students are visibly affected and care about this issue,\" Lee said. \"A main goal is to get the administration to actually be held accountable and for the school board to take some action regarding the procedures of administering APs and also how the administration functions.\"\r\n\r\nStudents have also put forth a <a href=\"https:\/\/www.change.org\/p\/the-gunn-administration-the-annulment-of-final-assignments-for-2016-gunn-school-year\">petition<\/a> asking for flexibility with final projects and tests. According to Gunn junior Aidan Lilani, most teachers are fairly receptive to accommodating students' needs.\r\n\r\n\"Most teachers have been really chill,\" Lilani said. \"They've been making finals optional or just lowering the work load.\"\r\n\r\nThe AP mess only serves to reignite tensions between the Gunn students and administration. According to Lilani, the tension comes from the Gunn administration making significant changes to the Gunn system without student input.\r\n\r\n\"I would say there has been tension since they have been making a bunch of changes last year,\" Lilani said. \"First would have been the schedule change, and then getting rid of zero period.\"\r\n\r\nSchool board member Terry Godfrey says the students have made a major step forward by organizing themselves to protest the problems.\r\n\r\n\"I think the students have shown a lot of maturity by being clear through the petition what their expectations for a solution are,\" Godfrey said. \"This is a really tough situation for the students; the mistake was unfortunate but not deliberate and I imagine it will result in more solid procedures for the proctors going forward.\"\r\n\r\nAccording to the school board agenda, Supt. McGee will address the AP retake situation in his superintendent's report.\r\n\r\nTeacher salaries are also a topic of debate at the meeting. The school board will vote for a plan that would enact a 5 percent salary raise retroactively from July 2015, a 4 percent raise for the 2016-17 school year, and a 3 percent raise the following year. The plan also institutes bonuses depending on property tax growth.\r\n\r\nAccording to Godfrey, the salary change should not be seen as a “money grab by teachers.” Several board members pointed to the importance of attracting high-caliber teachers and the high cost of living in the area as rationale for the salary raise.\r\n\r\nThe school board meeting starts at 6:30 p.m Tuesday at the district office.","excerpt":"Students at Gunn High School are planning a sit-in protest at Tuesday night's school board meeting. The meeting will also address the topic of teacher salaries and the possible ratification of a landmark three-year contract that would involve multiple raises.\r\n","date":"2016-05-23 21:43:37","author":"Jackson Doerr","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/schoolboard051016.jpg","categories":["News","Spotlight"],"tags":["aidan lilani","ap tests","ben lee","gunn","School Board","sit-in protest"]}]