[{"id":125652,"title":"Liveblog: 2016 elections results","permalink":"http:\/\/palyvoice.com\/2016\/11\/08\/liveblog-2016-elections-results\/","content":"Voters across the United States will be selecting their future president along with an array of local and state politicians today.\r\n\r\nTune in to see The Paly Voice's liveblog of all local, state and national elections.\r\n\r\n<hr \/>\r\n\r\n<strong>11:33 p.m.<\/strong>\r\n\r\nTrump will be the 45th president of the United States.\r\n\r\n<strong>9:56 p.m.<\/strong>\r\n\r\nThanks for tuning in to The Paly Voice's liveblog! Stay tuned on major networks to see the final election results. Check out the in-depth state election results <a href=\"http:\/\/apps.mercurynews.com\/election-results-2016\/#santaclaracounty\">here<\/a>.\r\n\r\n<strong>9:33 p.m.<\/strong>\r\n\r\nNevada, with six electoral votes, goes to Clinton. Clinton has 215 votes to Trump's 244.\r\n\r\n<strong>9:25 p.m.<\/strong>\r\n\r\nThe Dow Jones has dropped more than 800 points, and the NASDAQ is stumbling, according to NBC.\r\n\r\n<strong>9:21 p.m.<\/strong>\r\n\r\nClinton leads in Nevada, though it is too close to project a winner.\r\n\r\n<strong>9:13 p.m.<\/strong>\r\n\r\nTrump is only 26 electoral votes from becoming the next president of the United States.\r\n\r\n<strong>9:10 p.m.<\/strong>\r\n\r\nIn comparison to 2012, fewer people voted for third party candidates than in this year's election.\r\n\r\n<strong>9:09 p.m.<\/strong>\r\n\r\n\"He [Trump] won this by trashing the press. He won this by saying things we thought you couldn't say,\" says an NBC reporter.\r\n\r\n<b>9:07 p.m.<\/b>\r\n\r\nFun Fact #9: It is important to note that the electoral college can vote for whomever they want, even if the voters in their state choose otherwise. Throughout American history, although there have been instances where electoral members have voted for someone other than who the public voted for, it has never changed the outcome of the election.\r\n\r\n<strong>9:02 p.m.<\/strong>\r\n\r\nClinton's popular vote is at 47% to Trump's 48%.\r\n\r\nAs of now, Maine, Minnesota, Nevada, Arizona and Pennsylvania are too close to call. However, Trump is still projected to win.\r\n\r\n<strong>8:47 p.m.<\/strong>\r\n\r\nProposition 53, which requires statewide voter approval for bonds over 2 billion dollars, is split by 50%.\r\n\r\n<b>8:44 p.m.<\/b>\r\n\r\nJohnson and Stein take up a total of 2.7% of popular votes. Could this have swayed the election results?\r\n\r\n<strong>8:37 p.m.<\/strong>\r\n\r\nCrowds of Trump supporters can be seen jumping and cheering, while Clinton supporters seem to be quiet.\r\n\r\n<b>8:35 p.m.<\/b>\r\n\r\nDemocrats lag in the presidential, Senate, and House of Representatives races.\r\n\r\n<strong>8:33 p.m.<\/strong>\r\n\r\nFun Fact #8: Kamala Harris is the second African-American woman to be elected to the US Senate.\r\n\r\n<strong>8:31 p.m.<\/strong>\r\n\r\nTrump just won Utah, NBC says. He leads with 228 electoral votes over Clinton's 209.\r\n\r\n<strong>8:27 p.m.<\/strong>\r\n\r\nIf Trump takes Michigan and Arizona, ABC predicts Trump will win the presidency.\r\n\r\n<strong>8:26 p.m.<\/strong>\r\n\r\nThe Dow Jones is down around 700 points, which is the largest dip since the Great Recession.\r\n\r\n<b>8:25 p.m.<\/b>\r\n\r\nProposition 64 in California is projected to pass, which may legalize the use of recreational marijuana. Kamala Harris has just been elected to the US Senate.\r\n\r\n<strong>8:19 p.m.<\/strong>\r\n\r\nTrump leads in Utah, Montana, and Iowa.\r\n\r\n<b>8:17 p.m.<\/b>\r\n\r\nFun Fact #7: Clinton was a part of Wellesley Young Republicans Club, and grew up in a conservative Illinois household.\r\n\r\n<strong>8:12 p.m.<\/strong>\r\n\r\nTrump takes North Carolina.\r\n\r\n<strong>8:11 p.m.<\/strong>\r\n\r\nFun Fact #6: If Clinton wins the presidency, daughter Chelsea Clinton will be the first person to have both parents in the White House.\r\n\r\n<strong>8:01 p.m.<\/strong>\r\n\r\nCalifornia, Oregon and Washington voted for Clinton; Idaho voted for Trump.\r\n\r\n<strong>7:57 p.m.<\/strong>\r\n\r\nElection website 270 to Win appears to have crashed.\r\n\r\n<strong>7:54 p.m.<\/strong>\r\n\r\nTrump has won Florida. This makes Clinton's path to victory much more difficult.\r\n\r\n<strong>7:47 p.m.<\/strong>\r\n\r\nIn order for Clinton to win, she must win Wisconsin AND Michigan, along with either New Hampshire or Nevada.\r\n\r\n<strong>7:42 p.m.<\/strong>\r\n\r\nIn Michigan, Trump has 49 percent to Clinton's 46 percent. Trump's lead has shrank by a little bit, but is it enough?\r\n\r\n<strong>7:37 p.m.<\/strong>\r\n\r\nAP hasn't updated the results in a long time. It looks like Trump has the edge.\r\n\r\n<strong>7:28 p.m.<\/strong>\r\n\r\nNBC reports that Virginia has gone for Clinton. This was a state she needed to win.\r\n\r\n<strong>7:24 p.m.<\/strong>\r\n\r\nOhio has gone for Trump. Polls in California close in about half an hour.\r\n\r\n<strong>7:18 p.m.<\/strong>\r\n\r\nThere are many states too close to call.  Wisconsin is slowing inching towards Clinton. New Hampshire remains red.\r\n\r\n<strong>7:08 p.m.<\/strong>\r\n\r\nAt this point, it looks like it will be very difficult for Democrats to capture the Senate. Republicans have 44 seats; Democrats 42.\r\n\r\n<strong>7:06 p.m. <\/strong>\r\n\r\nNBC calls New Mexico for Clinton; Missouri for Trump.\r\n\r\n<strong>6:54 p.m.<\/strong>\r\n\r\nNBC reporting that Clinton has taken the lead in Virginia. Minnesota also trending blue. Wisconsin and Michigan still trending red.\r\n\r\n<strong>6:48 p.m.<\/strong>\r\n\r\nClinton is slowly gaining votes in Virginia. Minnesota, Michigan and Wisconsin are all trending red. I think we may be seeing the Brexit effect in the United States.\r\n\r\n<strong>6:43 p.m.<\/strong>\r\n\r\nWith 90 percent voting in Virginia, Trump is ahead by 16,000 votes.\r\n\r\n<strong>6:41 p.m.<\/strong>\r\n\r\nIf Trump wins the election, I will be very disappointed in many the polls that showed Clinton ahead.\r\n\r\n<strong>6:38 p.m.<\/strong>\r\n\r\nClinton can afford to lose North Carolina, Florida, Ohio, Iowa, New Hampshire and Arizona if Clinton holds her other firewall states. Unfortunately for Clinton, Virginia currently leans red. So does Minnesota and Michigan.\r\n\r\n<strong>6:33 p.m.<\/strong>\r\n\r\nIs anyone else really surprised by how close the results are so far? I thought Clinton had it in the bag.\r\n\r\n<strong>6:28 p.m.<\/strong>\r\n\r\nClinton still trails Trump, this time 97 to 129 electoral votes, according to AP.\r\n\r\n<strong>6:20 p.m.<\/strong>\r\n\r\n\"It's incredibly how tight all these races are,\" an NBC reporter says.\r\n\r\n<strong>6:13 p.m.<\/strong>\r\n\r\nMichigan is extremely close, with Trump in the lead by a few hundred votes.\r\n\r\n<strong>6:05 p.m.<\/strong>\r\n\r\nClinton now trails in the electoral college with 97 votes to Trump's 123, after Wyoming, North Dakota, South Dakota, Nebraska, Kansas and Texas voted red while New York voted blue.\r\n\r\n<strong>6:00 p.m.<\/strong>\r\n\r\nAccording to AP,\r\n\r\nClinton has won: DE, DC, MD, MA, NJ, RI, IL and VT (68 electoral votes)\r\n\r\nTrump has won: AL, IN, KY, MS, OK, SC, TN and WV (66 electoral votes)\r\n\r\nOther news organizations are reporting different demographics.\r\n\r\n<strong>5:56 p.m.<\/strong>\r\n\r\nAccording to ABC News, Republicans will retain control of the House of Representatives.\r\n\r\n<strong>5:52 p.m.<\/strong>\r\n\r\nClinton has lead in Virginia all night. This will concern her supporters, as the state was considered by many pundits to be a safe state for her.\r\n\r\n<strong>5:44 p.m.<\/strong>\r\n\r\nFun Fact #5: Hillary was part of the presidential impeachment inquiry of President Richard Nixon.\r\n\r\n<strong>5:42 p.m.<\/strong>\r\n\r\nClinton leads in Michigan and Pennsylvania, both of which are too early to call. Trump and Clinton are both beginning to solidify leads in a plethora of other states.\r\n\r\n<strong>5:35 p.m.<\/strong>\r\n\r\n\"We are feeling really good ... It's still early, but we're feeling really good about the ground we have mustered,\" a Clinton spokeswoman says.\r\n\r\n<strong>5:32 p.m.<\/strong>\r\n\r\nNBC reporters are highlighting the importance of Florida, where Trump currently has a slight edge. \"It becomes increasingly difficult for Trump to win without Florida.\"\r\n\r\n<strong>5:29 p.m.<\/strong>\r\n\r\nTrump has won Tennessee and Alabama, securing 60 electoral votes to Clinton's 44.\r\n\r\n<strong>5:18 p.m.<\/strong>\r\n\r\nAP shows that Trump now has a slight lead in the electoral college, with 51 votes to Clinton's 44.\r\n\r\n<strong>5:17 p.m.<\/strong>\r\n\r\nIn the Senate race, Democrats lead in New Hampshire, North Carolina and have won Connecticut and Maryland. Republicans have won Ohio, Kentucky, Oklahoma, South Carolina and Florida and are leading in Indiana, Alabama and Georgia.\r\n\r\n<strong>5:14 p.m.<\/strong>\r\n\r\nNote: The Paly Voice will not be able to begin reporting on local polls until at least 8 p.m., as that is when polls here closed.\r\n\r\n<strong>5:09 p.m.<\/strong>\r\n\r\nTrump is ahead in Texas, Tennessee and Alabama. Clinton wins Delaware. Clinton is ahead overall, 44 electoral votes to 31, according to Associated Press.\r\n\r\n<strong>5:07 p.m.<\/strong>\r\n\r\nElection Fun Fact #3: If elected, Trump would be the second president to be divorced.\r\n\r\n<strong>5:02 p.m.<\/strong>\r\n\r\nAssociated Press reports that Trump won Oklahoma; Clinton won Maryland, New Jersey &amp; Massachusetts.\r\n\r\n<strong>4:55 p.m.<\/strong>\r\n\r\n\"All eyes are on New York, where the polls are closing,\" an NBC reporter says.\r\n\r\n<strong>4:51 p.m.<\/strong>\r\n\r\nNBC has called South Carolina for Trump.\r\n\r\n<strong>4:41 p.m.<\/strong>\r\n\r\nClinton now leads in New Hampshire; Trump leads in Ohio.\r\n\r\n<strong>4:37 p.m.<\/strong>\r\n\r\nTrump is leading in Florida, Georgia, South Carolina, North Carolina, Virginia &amp; New Hampshire.\r\n\r\n<strong>4:34 p.m.<\/strong>\r\n\r\nElection Fun Fact #2: A candidate has lost the election after winning the popular vote four times. The last was Al Gore versus George W. Bush in 2000. The others are: Grover Cleveland in 1888; Samuel Tilden in 1876; and Andrew Jackson in 1824.\r\n\r\n<strong>4:32 p.m.<\/strong>\r\n\r\nTrump has won West Virginia (with five electoral votes). According to NBC, Trump supporters should be worried by Clinton's current lead in Florida.\r\n\r\n<strong>4:31 p.m.<\/strong>\r\n\r\nPolls have closed in Ohio, North Carolina and West Virginia. South Carolina is leaning towards Trump.\r\n\r\n<strong>4:30 p.m.<\/strong>\r\n\r\nFlorida is now leaning blue again. Is it just me, or does Florida always make elections 10 times more wild?\r\n\r\n<strong>4:28 p.m.<\/strong>\r\n\r\nIf you are in the Bay Area and still need to vote, polls will be open for 3.5 more hours.\r\n\r\n<strong>4:22 p.m.<\/strong>\r\n\r\nAs the votes come in, many swing states are flipping back and forth in terms of who is in the lead. Trump takes the lead in Virginia and Georgia. Florida is extremely competitive; Trump is ahead by three percent.\r\n\r\n<strong>4:21 p.m.<\/strong>\r\n\r\nAccording to NBC, the candidates are the least popular Presidential candidates in history.\r\n\r\n<strong>4:16 p.m.<\/strong>\r\n\r\nResults from Virginia are beginning to be revealed. Clinton leads, 50 percent to 45 percent, with about 7,000 votes counted.\r\n\r\n<strong>4:12 p.m.<\/strong>\r\n\r\nTrump is leading Clinton, 57 percent to 28 percent, in Florida. However, Florida's major liberal cities have not tallied their votes yet.\r\n\r\n<strong>4:10 p.m.<\/strong>\r\n\r\nSenator Marco Rubio (aka \"Little Marco\") is currently ahead in the Florida senate race.\r\n\r\n<strong>4:07 p.m.<\/strong>\r\n\r\nTo pass the time, we will be peppering this liveblog with election fun facts!\r\n\r\nFun fact #1: At 70, Donald Trump would be the oldest candidate to be elected as a first-term president. Ronald Reagan was 69 when he won his first term, and 73 when he won for the second time.\r\n\r\n<strong>4:03 p.m.<\/strong>\r\n\r\nClinton has won Vermont; Trump wins Indiana. Trump leads with 19 electoral votes to Clinton's three.\r\n\r\n<strong>4:01 p.m.<\/strong>\r\n\r\nTrump has officially won Kentucky (no surprise)!\r\n\r\n<strong>3:36 p.m. <\/strong>\r\n\r\nTrump's lead in Kentucky and Indiana is rapidly growing. In New Hampshire, only 57 votes have been counted.\r\n\r\n<strong>3:23 p.m.<\/strong>\r\n\r\nTrump is now leading in Indiana—Not a surprise, given that Trump's running mate Mike Pence is the governor of the state.\r\n\r\n<strong>3:14 p.m.<\/strong>\r\n\r\nPresidential results are slowing coming in in Kentucky and New Hampshire. Donald Trump is leading in both, but few votes have been counted.\r\n\r\n<strong>3:09 p.m.<\/strong>\r\n\r\nThe very first results are coming through, but they don't relate to California. Republican Senate candidates Kelly Ayotte and Rand Paul lead in New Hampshire and Kentucky, respectively.\r\n\r\n<strong>3:05 p.m.<\/strong>\r\n\r\nThank you for tuning into The Paly Voice's liveblog! Polls on the East Coast began closing at 3 p.m. so some states' results will be published soon.","excerpt":"Voters across the United States will be selecting their future president along with an array of local and state politicians today. Tune in to see The Paly Voice's liveblog of all local, state and national elections.","date":"2016-11-08 09:23:15","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/voting-booth1.jpg","categories":["Election 2016","Spotlight"],"tags":["2016","assembly","California","city council","Donald Trump","election","Hillary Clinton","house of representatives","Politics","President","School Board","senate","spooky"]},{"id":125630,"title":"Grin and bear it: America should rally behind the next president","permalink":"http:\/\/palyvoice.com\/2016\/11\/07\/grin-and-bear-it-america-should-rally-behind-the-next-president\/","content":"In a race commonly referred to as the \"ugliest election season of all time,\" many voters are just as eager to express their readiness for it to all be over as they are to tell of their fear for America's future.\r\n\r\nRegardless of whether you're \"with her\" or if you want to \"make America great again,\" it is our duty as citizens of the United States to support our president, even if we have to grin and bear it.\r\n\r\nThis election has been far from civil. The Morning Conduct carried out a <a href=\"https:\/\/morningconsult.com\/trump-clinton-unpopular\/\">survey<\/a> asking voters who disapproved of the two candidates about the reasons for their views. To nobody's surprise, Clinton haters called her a liar, and 56 percent of voters think Trump is a racist. So why should anyone look up to either of these two as our president?\r\n\r\nWell, the answer lies in our country's roots. America has always been a nation driven by compromise: it is what allows us to function and thrive as a country. Our unique ability to work together despite sometimes having starkly differing opinions is imperative for finding middle ground on important issues and ultimately solving them.\r\n\r\nGenerally we live in a country where there is a division of power amongst the two major political parties. It is rare for Democrats or Republicans to hold the White House as well as a majority in both houses of Congress, meaning that most of American history has been comprised of inter-party collaboration.\r\n\r\nWhen we sacrifice our willingness to cooperate we give up our power to solve problems and continue to move forward as a nation. Part of what makes our political system so special is that we don't quit. Every four years roughly half the population is disappointed by the outcome of the presidential election, and that's just the nature of the system. However upsetting the result may be to some people, we all continue to work together in the meantime, and the losers simply try again in four years.\r\n\r\nThe worst decision Americans can truly make is to fail to honor the sacred electoral system that holds our great nation together. These next four years will be one the most consequential periods of modern American history, and we cannot look at issues like the war on terror and restoring the American economy with minds turned away from the idea of collaboration.\r\n\r\nWe could all spend the next four years complaining about how this November forced us to choose between the lesser of two evils, but where would that get us? I implore you, in an election season overrun by paranoia and hate, to see our next president as the leader of our nation, not the face of the party you didn't vote for.","excerpt":"Regardless of whether you're \"with her\" or if you want to \"make America great again,\" it is our duty as citizens of the United States to support our president, even if we have to grin and bear it.","date":"2016-11-07 22:01:50","author":"William Sallomi","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/Trump-and-Clinton.jpg","categories":["Opinion","Spotlight"],"tags":["Clinton","Donald Trump","election 2016","Hillary Clinton","Politics","Trump","voting"]},{"id":125467,"title":"Paly students: Who&#8217;s voting and why","permalink":"http:\/\/palyvoice.com\/2016\/11\/07\/paly-students-whos-voting-and-why\/","content":"<span style=\"font-weight: 400;\">The 2016 presidential election will no doubt go down in history as one of the most intense, controversial and chaotic elections in the history of the United States, but also as one of the most important national decisions. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Americans are tasked with choosing between presidential candidates Hillary Clinton and Donald Trump, both of whom have run campaigns riddled with scandals, leaving some voters with an extremely difficult decision to make.<\/span>\r\n\r\n[caption id=\"attachment_43954\" align=\"alignright\" width=\"478\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2012\/11\/2012-11-06-08.09.12.jpg\"><img class=\"wp-image-43954\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2012\/11\/2012-11-06-08.09.12.jpg\" alt=\"Voters wait in line inside Palo Alto High School's Tower Building to cast their vote. Photo by Phoebe So.\" width=\"478\" height=\"359\" \/><\/a> Voters wait in line inside Palo Alto High School's Tower Building to cast their vote in the 2012 elections, as many will this year as well. Photo by Phoebe So.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">That decision also rests on the shoulders of approximately 60 Palo Alto High School students, according to Karla Larson, Guidance Tech Assistant. Within just weeks — and in some cases, days — of turning 18 years old, a few lucky juniors and seniors have the chance to utilize their newfound rights and leave their mark on this year's election.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">For senior Tanner Newell, who turned 18 this past September, the decision to vote was difficult. He ultimately decided against voting in both the presidential and local elections. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I’m not going [to vote],” Newell said. “I don’t have enough time and I have other responsibilities.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">However, Newell emphasized that if he did find the time to vote come Nov. 8, he still would not participate in the local elections, because he will be moving out soon.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“If I do vote, it will just be to the presidential,” Newell said. “I'm not going to be in Palo Alto for the local elections to affect me.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">However, many eligible Paly students have decided to vote in the local and presidential elections this Tuesday. <\/span>Senior Matthew Seto credits his duty to vote in both elections to his time as a Boy Scout.\r\n\r\n“As Boy Scouts, we were taught about a duty to our nation, and voting was one of those obligations,” Seto said. \"It helps determine the future of your local community, as well as [the nation's.] Getting youth to vote is also very important as voting turnout in California is lower than the national average.”\r\n\r\nSeto emphasized that this specific election was not the basis of his decision to vote.\r\n\r\n“I think I still would have voted, regardless of the candidates or propositions on each ballot,” Seto said. “Even though California is dominantly Democratic, each vote for a policy or candidate still carries weight and importance.”\r\n\r\nOthers, like senior Ibby Day, feel that this presidential election is especially crucial to vote in.\r\n\r\n“I'm voting because this election matters to my future, and my peers' futures. Every vote does count, especially in this election,” Day said. “I'm voting for Hillary Clinton because I respect her as a candidate, and my political priorities align with her priorities the most. The President is essentially the most powerful person in the world, and to think that Trump, someone who is careless with his words and actions, might be in a position to make crucial decisions is absolutely terrifying.”\r\n\r\nSenior Ethan Bundy also feels that voting is essential, despite the unlikelihood of his candidate winning in California.\r\n\r\n\"Although I know my vote most likely won't make a difference because my political views are the opposite of approximately 99 percent of the people in California, I am still going to vote because people have died to give me the right to do so and in a lot of countries around the world people don't have that right, so I think it is disrespectful for people not to give their vote,\" Bundy said. \"Also, I am not voting for Hillary because I cannot vote for someone who is supposed to uphold the law when time after time she exhibits behavior that shows she believes she is above the law.\"\r\n\r\nMany view voting as a good way to remain informed about politics.\r\n\r\n\"Before I vote, I have to be reasonably well versed in current politics,\" senior Brian Tracy said. \"This is good information to stay up to date on and it allows me to have interesting discussions with my friends.\"\r\n\r\n<span style=\"font-weight: 400;\">And for other students, it only takes a small incentive to motivate them to get to the polls on Nov. 8.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I'm just looking forward to voting so I can get the ‘I voted’ sticker,” senior Andrew Vargha said. <\/span>","excerpt":"Within just weeks — and in some cases, days — of turning 18 years old, a few lucky juniors and seniors have the chance to utilize their newfound rights and leave their mark on this year's election.","date":"2016-11-07 17:47:52","author":"Maya Reuven","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2012\/11\/2012-11-06-08.09.12.jpg","categories":["Election 2016","News","Spotlight"],"tags":["18","Andrew Vargha","brian tracy","Clinton","day","donald","election","election 2016","ethan bundy","hilary","ibby day","local elections","matthew seto","President","presidential","propositions","seniors","Seto","student voters","Trump","Vargha","voting"]},{"id":125512,"title":"The education argument — why students should support Clinton","permalink":"http:\/\/palyvoice.com\/2016\/11\/06\/the-education-argument-why-students-should-support-clinton\/","content":"In a presidential election torn between unpopular candidates Hillary Clinton and Donald Trump, many voters will be holding their noses as they vote or won’t be voting at all. This is especially true for younger demographics, who have the <a href=\"http:\/\/www.npr.org\/2016\/05\/16\/478237882\/millennials-now-rival-boomers-as-a-political-force-but-will-they-actually-vote\">lowest voter turnout rates<\/a> in the nation. While the candidates’ policies have been largely overshadowed by political scandals and heated bickering, their views on primary and higher education will no doubt have lasting impacts on American students.\n\nClinton’s education plans, while flawed, provide much greater benefits to students and most Americans as a whole. Trump’s plans, on the other hand, will degrade the public school system and have limited effects on nearly all college students.\n\nClinton is pursuing a <a href=\"https:\/\/www.hillaryclinton.com\/issues\/college\/\">bold and expensive plan <\/a>on making higher education more accessible. According to her website, her top priorities include making community college free, funding minority-majority colleges and assisting student parents. Most notably, she plans to make public colleges tuition free for families with incomes at or below $125,000 by 2021. On the topic of student debt, Clinton has proposed cracking down on predatory schools and lenders, cutting loan interest rates and offering a three-month moratorium on student loan payments to federal loan borrowers.\n\nClinton’s plans will no doubt be an asset to lower-income families who cannot afford to send their children to college as well as to students buried in debt. Her plans have also earned her the <a href=\"http:\/\/www.aft.org\/resolution\/endorsement-hillary-clinton\">endorsement<\/a> of the American Federation of Teachers union. By making college more accessible to all students, her plan will greatly increase the number of students completing some form of higher education.\n\nThe main problems with Clinton’s plans are cost-related. According to the higher education writer and political analyst Kevin Carey, Clinton’s original education plan, based on making community college free, was economically feasible. However, after adopting many of Bernie Sanders’ policies, <a href=\"http:\/\/www.nytimes.com\/2016\/07\/20\/upshot\/the-trouble-with-hillary-clintons-free-tuition-plan.html\">her new plan became extremely expensive and would reward states that spend the least money on students.<\/a> An increase in tax rates on the wealthy would likely be needed to fund her ambitious program.\n\nTrump, on the other hand, has no specific plan on student debt or even college in general. His claim that the federal government shouldn’t profit from student loans is a positive statement but far from the set of policies that America needs. In September, <a href=\"http:\/\/www.slate.com\/articles\/life\/inside_higher_ed\/2016\/09\/what_is_donald_trump_s_plan_on_college_affordability.html\">he revealed his goal <\/a>of pressuring academic institutions with large endowments to spend more on students or lose their tax-exempt status. This would be a helpful action for some college students, but only for those who attend universities with multi-billion dollar endowments. Moreover, it is impossible to judge Trump’s plan for college education because he doesn’t even have one outside of the two simple statements outlined above.\n\nTrump’s primary education plans are significantly better than his college education plans, but that isn't saying much. An enthusiastic proponent of “school choice,” Trump believes that students should be able to attend any school they wish, public or private. This policy choice is interesting and could have the power to improve the educations of lower-income, minority students. However, it carries some significant flaws. Though Trump has touted such plans time and time again, he has never specifically stated how he will finance the $20 billion initiative. Given his opposition to raising taxes, the costs would likely either add to the federal debt or result in cuts to other parts of the current education budget.\n\nSchool choice also furthers the degradation of public schools by taking money away from the public school system. Furthermore, because many private schools are religious, allowing tax dollars to pay for private schools that subscribe to a particular faith is a blatant violation of the constitutional separation of church and state, according to <a href=\"http:\/\/www.publicschoolreview.com\/blog\/the-ongoing-debate-over-school-choice\">Public School Review<\/a>.\n\nTrump’s opposition to Common Core is a plus, as its standards are <a href=\"http:\/\/www.westernjournalism.com\/common-core-fundamental-flaws\/\">not based on sound research<\/a> and have resulted in<a href=\"http:\/\/www.westernjournalism.com\/common-core-fundamental-flaws\/\"> lower test scores<\/a>, according to Western Journalism. However, the United States president has no power to repeal these standards, as they were adopted at a state level, according to <a href=\"http:\/\/www.npr.org\/sections\/ed\/2016\/09\/25\/494740056\/donald-trumps-plan-for-americas-schools\">NPR<\/a>. Furthermore, ending Common Core is not a magical solution to America’s education problems. By basing nearly his entire education platform on denouncing these standards, Trump is ignoring issues plaguing American students that are not affected by the Common Core, such as nationwide achievement gaps and student debt.\n\nClinton’s K-12 plans, on the other hand, are probably more expensive yet simultaneously more far-reaching. While Trump’s school choice would push students to leave public schools, Clinton aims to go to the root of the problem by improving public schools themselves. <a href=\"https:\/\/www.hillaryclinton.com\/briefing\/factsheets\/2016\/02\/18\/ending-the-school-to-prison-pipeline\/\">Her website outlines specific policies <\/a>on elevating the quality of teaching, investing in run-down schools and helping each student learn computer science. When compared to Trump’s simple viewpoints on K-12, Clinton's plans help combat a broader range of education problems.\n\nUnfortunately, Clinton has never stated how she will finance these new plans, and given the billions of dollars she has pledged to invest in this area, it is unlikely that simply reprioritizing the current budget will allow her to pursue these policies. As a result, Clinton’s extensive K-12 education plan will help students at the expense of higher taxes on the upper class—a consequence that is arguably relatively minor as it will likely affect few people.\n\nClinton’s policies have their own expensive flaws, but they greatly outweigh Trump’s college and K-12 education plans as they actively attempt to limit student debt and address primary education problems ranging from run-down schools to teaching quality. In the end Americans will have the final say: By casting a vote, we will choose either debt reduction and college accessibility or a bleak future for students.","excerpt":"Clinton’s education plans, while flawed, provide much greater benefits to students and most Americans as a whole while Trump’s plans will degrade the public school system and have limited effects on most college students.","date":"2016-11-06 20:34:17","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/Screenshot-2016-11-06-at-4.01.42-PM.png","categories":["Election 2016","Opinion","Spotlight"],"tags":["2016","Clinton","college","Community","donald","education","election","Hillary","K-12","Trump","University"]},{"id":125463,"title":"Football clinches spot in CCS with victory over Mountain View","permalink":"http:\/\/palyvoice.com\/2016\/11\/06\/football-clinches-spot-in-ccs-with-victory-over-mountain-view\/","content":"<span style=\"font-weight: 400;\">The Palo Alto High School football team (4-6, 3-3) is preparing for its first game in the Central Coast Section playoffs after it defeated the Mountain View Spartans (5-5, 2-4) on Friday night, earning the Vikings a spot in the playoffs. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">After a tough loss to Los Gatos High School (7-3, 6-0) on Oct. 21, and a bye week, the Vikings bounced back and beat the Spartans. The victory secured the Vikings a fourth place finish in league and pushed them out of a potential tie with Mountain View. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Viking head coach Danny Sullivan, the bye week following the Vikings' loss to Los Gatos was crucial to its success.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We got a couple guys back that we needed and we were able to put in some new things that we wanted to try, and it worked out,” Sullivan said. “We challenged the kids a little bit and made sure they were ready to go.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Vikings and the Spartans fought hard throughout the game, trading two touchdowns each, with junior running back Paul Jackson III scoring both touchdowns for the Vikings. Jackson went on to score the fourth touchdown as well. The first half ended with a spectacular rush by sophomore running back Paul Thie for a touchdown. The Vikings led, 22-13, at the end of the first half.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Throughout the game, the offensive line showcased strong play, according to Jackson III.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We went hard every rep [play],” Jackson III said. “Sometimes we let things go, but offensively, we played great.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Paly fell behind during the third quarter after Mountain View scored two consecutive touchdowns, but the Vikings battled hard and fought back. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The third quarter was strange,” Sullivan said. “We needed to keep pushing, keep putting the petal to the metal and we did the complete opposite. I had to really stick to them and say we need some energy right now. Luckily, we found it and the kids responded well.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The energy was dwindling, but the players brought it back up.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We managed to not put our heads down and keep them down,” senior defensive lineman Alec Cohen-Schisler said. “In the past we’ve had issues with getting down by one or two touchdowns or even just a couple of points, and really getting our heads down. I really made an effort to hype up our sideline, keep us in the game and make sure no one was giving up.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">At the end of the second half, the Vikings and Spartans were neck and neck, with with the Vikings up, 30-26. With the clock winding down, junior running back Sione Latu ran the ball for the final touchdown in the game. The Vikings won the match with a final score of 36-29.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Sione’s got the ability to rip off a huge run which he did to clinch it at the end,” Sullivan said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Jackson III says he feels confident that the Vikings will do well in its next matchup, the first round of CCS playoffs.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We shocked a lot of people with this win tonight,” Jackson III said. “Going into the playoffs, I’ve never felt better. I have a lot of confidence in these boys.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">With its season on the line, Paly will face off against the Los Gatos Wildcats (7-3, 6-0) at 7pm on Nov. 11 at Los Gatos High School for the first round of CCS playoffs.<\/span>","excerpt":"The Palo Alto High School football team (4-6, 3-3) is preparing for its first game in the Central Coast Section (CCS) playoffs after it defeated the Mountain View Spartans (5-5, 2-4) on Friday night, earning the Vikings a spot in the playoffs.","date":"2016-11-06 19:01:13","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/A6F1852.jpg","categories":["Sports","Spotlight"],"tags":["alec cohen-schisler","CCS","de anza league","football","jackson","mountain view","palo alto high school","paul jackson","paul thie","playoffs","spartans","Sullivan","vikings"]},{"id":125424,"title":"Profile: California&#8217;s 24th District State Assembly candidates","permalink":"http:\/\/palyvoice.com\/2016\/11\/05\/profile-californias-24th-district-state-assembly-candidates\/","content":"[caption id=\"attachment_125428\" align=\"alignnone\" width=\"570\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/14937843_888612964608899_1431028650_n.jpg\"><img class=\" wp-image-125428\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/14937843_888612964608899_1431028650_n.jpg\" alt=\"Candidates Vicki Veenker and Marc Berman are campaigning to represent the 24th District in the State Assembly. \" width=\"570\" height=\"380\" \/><\/a> Candidates Vicki Veenker and Marc Berman are campaigning to represent the 24th District of California in the State Assembly.[\/caption]\r\n\r\nWith election day coming up Tuesday, the State Assembly race sees two former attorneys campaigning to next represent the 24th district of California.\r\n\r\nThe candidates, Marc Berman and Vicki Veenker, are pushing to replace retiring assemblyman Rich Gordon, who will be stepping down after six years.\r\n\r\nIn an attempt to hear the candidates' thoughts on certain issues affecting the 24th District, The Paly Voice sat down to interview both.\r\n\r\nDespite having similar ideas on many topics, both Berman and Veenker have focused on different issues in their respective campaigns.\r\n\r\nAccording to Berman, a Palo Alto High School alum, an attorney by training and current Palo Alto City Council member, he plans on focusing on improving education, making housing more affordable and fixing the infrastructure.\r\n\r\nOn the other hand, according to Veenker, a Palo Alto High School parent and fellow attorney by training, she plans on limiting greenhouse gases to protect the environment, protecting the water supply and increasing education funding.\r\n\r\nWith the Nov. 8 election day coming up soon, citizens will be casting their ballots. Not sure who to vote for? Check out these profiles on both candidates' positions to help make your decision.\r\n\r\n<a href=\"http:\/\/paly.io\/v\/125336\">Vicki Veenker on the issues<\/a>\r\n\r\n<a href=\"http:\/\/paly.io\/v\/125365\">Marc Berman on the issues<\/a>\r\n\r\n&nbsp;","excerpt":"With election day coming up Tuesday, the State Assembly race sees two former attorneys campaigning to next represent the 24th district of California.","date":"2016-11-05 14:55:27","author":"Chirag Akella","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/14937843_888612964608899_1431028650_n.jpg","categories":["Features","Spotlight"],"tags":["2016","berman","education","election","issues","state assembly","veenker"]},{"id":125336,"title":"Profile: Vicki Veenker, State Assembly candidate","permalink":"http:\/\/palyvoice.com\/2016\/11\/05\/profile-vicki-veenker-state-assembly-candidate\/","content":"[caption id=\"attachment_125347\" align=\"aligncenter\" width=\"501\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/Screen-Shot-2016-11-03-at-2.40.04-PM.png\"><img class=\" wp-image-125347\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/Screen-Shot-2016-11-03-at-2.40.04-PM.png\" alt=\"Vicki Veenker speaks to the Chirag Akella and Sid Sharma during an interview. Veenker stated her top three priorities as securing the water supply, increasing education funding, and reducing greenhouse gas emissions. \" width=\"501\" height=\"305\" \/><\/a> Vicki Veenker speaks to The Paly Voice during an interview two weeks before the election at the Palo Alto High School Media Arts Center. Veenker stated that her top three priorities are securing the water supply, increasing education funding, and reducing greenhouse gas emissions.[\/caption]\r\n\r\nVicki Veenker, a Palo Alto High School parent, well-respected attorney and member of the Silicon Valley Law Foundation, believes that her prior knowledge representing low-income individuals and uniform support from environmental leaders will lead to success in Sacramento, despite her lack of elected experience.\r\n\r\nShe is running for District 24 against Palo Alto City Council member Marc Berman to replace retiring assemblyman Rich Gordon.\r\n\r\nAccording to Veenker, if elected, her top three priorities would be reducing greenhouse gases through aggressive petroleum and energy regulations, securing water supply through agriculture subsidy reductions and conservation and increasing education funding through commercial tax increases, income tax extensions and lower sentences for non-violent offenders.\r\n\r\n<strong>Education<\/strong>\r\n\r\nIn an attempt to improve consistently <a href=\"http:\/\/www.sfgate.com\/education\/article\/California-s-school-system-ranked-9th-worst-in-6410633.php\">low-ranked California education<\/a>, Veenker has a lofty multi-pronged approach.\r\n\r\n“If we spend $8,000 per student, when the national average is around $11,000, that is embarrassing for a state like ours,\" Veenker said. \"We have to reduce class sizes by attracting good teachers and hiring and retaining them.”\r\n\r\nShe is also in support of universal pre-kindergarten and STEM education and upholding the role of charter schools, but with the need for more accountability and transparency.\r\n\r\nThese extensive education plans come at a huge cost, which has forced Veenker to propose a number of tax raises. She wants Prop. 55 or the extension of income taxes (without the sales tax increase), a split role for property taxes where only commercial property taxes are raised and saving money through criminal justice reform.\r\n\r\nVeenker expressed concern about the achievement gap in schools and offers a slightly different approach than her opponent. She believes that although the local funding control formula is a good start — which gives extra allocation of funds for English learners and low-income students — there needs to be a continued monitoring of the districts that receive that money.\r\n\r\nVeenker conveyed problems with University of California’s reliance on out-of-state enrollment, partially stemming from her daughter’s own experience. She wants to shift the share of educational costs from 30 percent covered by the state to 80 percent. She did not, however, express a specific funding source for these goals.\r\n\r\n<strong>Criminal Justice<\/strong>\r\n\r\nLike her opponent Marc Berman, Veenker wants to see the death penalty repealed.\r\n\r\nVeenker has made the phrase “education over incarceration” a major plank of her campaign. On the issue of criminal justice reform, she supports “realignment from jails and reducing the length of non-violent offenses.”\r\n\r\nShe has supported marijuana legalization in the past, calling it “inevitable,\" but believes in regulating it “at least like alcohol or tobacco.\"\r\n\r\nWhile Veenker did not express any specific marijuana regulations she wants included, she did advocate for learning from other states along the way. She also expressed great concern in how law enforcement assesses sobriety, because technology does not currently exist to assess marijuana intoxication in real time. One of her main reasons for supporting legalization is to reduce jail sentences and to stop illegal marijuana farming in state parks.\r\n\r\n<b>Environment<\/b><strong> and Climate Change<\/strong>\r\n\r\nVeenker has made climate change a major issue of her campaign and says her differentiating factor is her “uniform support by environmental leaders for my campaign.\"\r\n\r\nShe is in support of requiring 50 percent of electricity to come from renewable sources by 2030 and reducing petroleum use as well to cut greenhouse emissions by 50 percent by 2030. Veenker additionally wants to continue the landmark cap-and-trade program in California.\r\n\r\nVeenker said she she believes in both a residential and agricultural approach when addressing the water issue in California.\r\n\r\n“Conservation is great but I don’t think that will get us all the way to where we want to go on this issue,\" Veenker said. \"We should decrease the subsidization of water prices to farmers, which they aren’t going to like at the get-go.\"\r\n\r\nShe felt that we should \"subsidize their adoption of this sort of water-saving technology.\" Veenker also believed that California should channel money towards Silicon Valley to research innovative ways of saving water.\r\n\r\n<strong>Affordable Housing<\/strong>\r\n\r\nVeenker supports a more aggressive approach to affordable housing but has some reservations about some of the currently proposed models. She supports a state housing bonds and tax incentives to encourage affordable housing, a one-time spinoff of the budget surplus to fund housing projects and wants a more regional approach to housing. She did not support requiring where and how much a municipality has to build.\r\n\r\n<b>Infrastructure<\/b>\r\n\r\nGovernor Jerry Brown’s high speed rail project has become a controversial issue as the costs have increased by 50 percent and obstacles have grown, according to The Economist. Veenker supports an extremely modified version of the high speed rail while her opponent is fully opposed to it.\r\n\r\nAccording to Veenker, her main concern is the increase in costs, which has pushed up estimates by 50 percent. Instead of connecting the high speed rail to San Francisco which she feels is futile, she wants to see it blended into the Caltrain at San Jose with a “common platform.” While not stating outright opposition to the high speed rail, she stated that she wants to see “a new plan and appropriate oversight to make sure we do better this time in living into the plan.”\r\n\r\nVeenker wants to use some of these high speed rail savings combined with bond measures and tax increases to help solve the Bay Area’s gridlock.\r\n\r\n“We have a crisis in transportation right now, today, in the Bay Area and we have to get busy fixing that,\" Veenker said. \"We are starting to with the measures in Santa Clara County, the half cent sales tax, helping electrifying Caltrain and getting BART down the East Bay.”\r\n\r\n<b>Follow the Money<\/b>\r\n\r\nCampaign finance has become a hot issue in Sacramento with various reform bills going in front of the assembly, the most notable being the DISCLOSE Act. According to the Secretary of Election’s official site, Veenker has received the largest donations from the Silicon Valley Progressive Women for Equity and Oportunidad Supporting Vicki PAC (near $200,000). The <a href=\"http:\/\/opensecrets.org\/pacs\/pacfaq.php\">PAC<\/a> is comprised of $25,000 from both the Consumer Attorneys of California Independent Campaign Committee and the Commercial Workers Western States Council Independent Expenditure PAC. Her opponent has benefited from more than two million dollars in outside spending.\r\n\r\nTo learn more about her opponent, Marc Berman, click <a href=\"http:\/\/paly.io\/v\/125365\">here<\/a>.","excerpt":"Vicki Veenker, a well-respected attorney and member of the Silicon Valley Law Foundation, believes that her prior knowledge representing low-income individuals and uniform support from environmental leaders will lead to success in Sacramento, despite her lack of elected experience. ","date":"2016-11-05 14:55:17","author":"Siddarth Sharma","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/Screen-Shot-2016-11-03-at-2.40.04-PM.png","categories":["Features","Uncategorized"],"tags":["election","Marc Berman","November 8","rich gordon","state assembly","Vicki Veenker"]},{"id":125365,"title":"Profile: Marc Berman, State Assembly candidate","permalink":"http:\/\/palyvoice.com\/2016\/11\/05\/profile-marc-berman-state-assembly-candidate\/","content":"[caption id=\"attachment_125396\" align=\"alignnone\" width=\"551\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/14971164_888089307994598_371845627_n.jpeg\"><img class=\" wp-image-125396\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/14971164_888089307994598_371845627_n.jpeg\" alt=\"The Paly Voice interviewed State Assemblyman candidate Marc Berman ahead of the election to represent the 24th district. According to Berman, his top three priorities are education, housing and infrastructure. Photo: Chirag Akella\" width=\"551\" height=\"416\" \/><\/a> The Paly Voice interviewed State Assembly candidate Marc Berman ahead of Tuesday's election to choose a new representative for the 24th district of California. According to Berman, his top three priorities are education, housing and infrastructure. Photo: Chirag Akella.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Marc Berman, a Palo Alto High School alum, attorney by training and current Palo Alto City Council member, plans to use his breadth of political experience to represent the 24th District if elected to the State Assembly on Nov. 8.<\/span>\r\n\r\nBerman is running against Vicki Veenker, a fellow attorney by training, for the open spot in the 24th District that will be vacated by retiring assemblyman Rich Gordon.\r\n\r\n<span style=\"font-weight: 400;\">According to Berman, his top three priorities are minimizing the achievement gap by funding statewide preschool, creating more affordable housing by implementing a statewide affordable housing bond and improving infrastructure. <\/span>\r\n\r\n<strong>Education<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">In an attempt to address the current achievement gap in California, Berman hopes to fund preschool to help low-income children enter kindergarten at the same level of their more affluent peers. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">”I think it starts with preschool,” Berman said. “Ninety percent of a child's brain develops before they turn five, but they start kindergarten at five years old, so low-income children are starting kindergarten 18 months behind their more affluent peers here in Santa Clara County. I think that universal preschool for all four-year olds is critically important, starting with low-income four-year olds. Expanding learning opportunities for youth from birth to three is going to be critical to closing the achievement gap.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Berman also expressed concern for the lack of in-state students being accepted into the University of California system in recent years. He plans to focus on increasing the accessibility to the UC system for California students. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I was talking to the chancellor of UC Santa Cruz about this,” Berman said. “And he said ‘Let's take a wholesale review of the master plan for education, which promised accessibility to an affordable high quality education for California students who qualify.’ We still have the high quality part but we don’t have the affordable and accessible. We definitely need to revisit it.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">With plans to create more educational opportunities for students, Berman recognized the need for additional funding. Despite not citing any specific parts he would address, he said he plans to reform the current tax structure to create more tax revenue.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I think there really needs to be a broader look at our tax structure as a whole to identify how much funding we want,\" Berman said. \"We need to identify a tax structure that is as stable as possible so that every year we generate money as close to that as possible without the wild swings that we currently get.\" <\/span>\r\n\r\n<strong>Campaign Finance<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">Campaign finance has become an big issue in this campaign, as Berman's opponent, Veenker, and many others, including congresswoman Anna Eshoo, have voiced concerns over the amount of donation money Berman has received from special interest groups. Despite significant donation money from a realtors group, Berman said that the enormous sum won’t sway his policies and priorities, insisting that the group's major priorities align with his. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"The three issues that the realtors really care about a lot, which align with mine, are education, housing, the need for smart growth, housing supply and infrastructure because the better the parks, the better the community and the higher the house values are,\" Berman said. \"My platform just very well happens to align.\"<\/span>\r\n\r\n<b>Affordable Housing<\/b>\r\n\r\n<span style=\"font-weight: 400;\">To combat rising house prices, Berman hopes to involve the state in the funding process with an affordable housing bond to help non-profit organizations like Palo Alto Housing attempt to make housing more affordable. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"We need a statewide affordable housing bond,\" Berman said. \"They [Palo Alto Housing] need funding from numerous different sources including the state. Right now, San Mateo County and Santa Clara County have affordable housing bonds on the ballot. That is great, but the state needs to do likewise to really be a partner to solve our problem in affordable housing deficit.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Berman also voiced his disapproval of rent control, a topic supported by his opponent. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"A place where my opponent and I disagree is on rent control,\" Berman said. \"I don’t support rent control and I definitely support increasing the supply of housing. I think that is what we need to do to stabilize rental rates and hopefully bring them down a little bit.\"<\/span>\r\n\r\n<strong>Infrastructure<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">Berman stressed the importance of improving California's infrastructure and promised to allocate resources to fix it. To raise the funds needed to undergo such projects, Berman cited multiple proposed taxes, including one on electric vehicle owners. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"Sen. Jim Bell, who is a state senator for San Jose and surrounding areas, has put forth a short-term proposal that gets funding from a variety of different methods,\" Berman said. \"One is increasing the gas tax which hasn’t been increased in a couple of decades and another is increasing the vehicle license and registration fees a small amount. Also, I believe having a fee of 100 dollars a year for EV owners is totally viable and reasonable to help collect money. Long-term, I believe we need to have a vehicle miles traveled system to help get taxes to repair our roads. It will take some upfront money, but it will save us money if we get our roads up to high quality.\"<\/span>\r\n\r\nBerman additionally supported a split role tax plan to prevent property taxes from rising while still bringing in tax revenue from commercial property.\r\n\r\n<span style=\"font-weight: 400;\">\"I support a split role, which would be having commercial property, assessed on a more regular basis and not changing it for regular property, because that would have a detrimental effect on a lot of seniors on fixed incomes,\" Berman said.<\/span>\r\n\r\n<b>Bullet Train<\/b>\r\n\r\nBerman also discussed his concerns with Gov. Jerry Brown's current plan to build a bullet train for transport from Los Angeles to San Francisco and expressed a desire to focus on local transportation first.\r\n\r\n“I don’t support the bullet train as it is right now because I think we need to address our regional transportation problems,\" Berman said. \"In 12, 14, 16 or 18 years from now, I believe that we will have better technology to get us from San Francisco to Los Angeles and so I think we have to focus on helping people get from Alameda to Palo Alto.”\r\n\r\n<b>Death Penalty<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Berman expressed a desire to move towards incarceration and away from the death penalty, citing issues such as mistakes, cost and length of time.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It [the death penalty] takes a long time, it is expensive and I think that life without the possibility of parole is a legitimate punishment for people who have done terrible crimes,” Berman said.<\/span>\r\n\r\n<b>Marijuana Legalization<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Berman is in favor of marijuana legalization, as he hopes that being able to regulate it can lead to more tax revenue and fewer sales to younger demographics. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I do support the legalization of marijuana because I think we are better off regulating it, taxing it and enforcing it,\" Berman said. \"Let’s legalize it so that we make sure only people who are 21 and older can purchase it in a well-regulated climate.” <\/span>\r\n\r\n<b>Water Supply<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Water conservation has become a hot topic in California with the prolonged drought. Berman said that he believes rainwater needs to be caught and used more effectively and more technology needs to be used to efficiently use water in farming to grow crops. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Berman believes that his vast experiences, including serving as a Palo Alto City Council member, has set him up perfectly to represent the 24th District. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"I think it’s the breadth of experience that I have across all three sectors that really prepares me to step in on day one and be an effective member for the 24th assembly district and for all of California,\" Berman said.<\/span>\r\n\r\nTo learn more about his opponent, Vicki Veenker, click <a href=\"http:\/\/paly.io\/v\/125336\">here<\/a>.\r\n\r\n&nbsp;","excerpt":"Marc Berman, an attorney by training and current Palo Alto City Council member, plans to use his breadth of political experience to represent the 24th District if elected to the State Assembly on Nov. 8.","date":"2016-11-05 14:33:57","author":"Chirag Akella","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/14971164_888089307994598_371845627_n.jpeg","categories":["Features"],"tags":["24th District","berman","election","state assembly","veenker"]},{"id":125385,"title":"Admin alters GPA weighting action","permalink":"http:\/\/palyvoice.com\/2016\/11\/04\/school-board-alters-gpa-weighting-action\/","content":"Palo Alto High School will not — at least not yet — be sending weighted grade point average’s to schools who seniors have submitted early applications, contrary to the Board of Education’s <a href=\"http:\/\/palyvoice.com\/2016\/11\/02\/board-votes-for-weighted-on-mid-year-transcripts-for-class-of-2017\/\">ruling on Tuesday<\/a> and the announcement given to seniors during Advisory on Thursday, according to a statement released by Principal Kim Diorio during 5th period on Schoology.\r\n\r\n<span style=\"font-weight: 400;\">According to Diorio’s statement, this change has come because of newly found, unspecified data that shows how many Paly students’ GPAs will decrease when weighted with the UC system compared to their unweighted GPAs. Administrators and members of the Board of Education Agenda Setting committee reviewed the information and have suggested that “we do need to return to the Board with a short-term recommendation for second semester transcripts,\" according to the statement on Schoology. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Diorio confirmed stating that there <\/span>\"will be no further action before the next Board of Education meeting.\"\r\n\r\n<span style=\"font-weight: 400;\">Despite stated, students will be given the option to send their weighted GPAs to schools to which they have submitted early applications. To do this, students must submit a <a href=\"https:\/\/docs.google.com\/forms\/d\/e\/1FAIpQLSdfgd9XwZzUSNIjZ4ecyeFSfZnfQ1NaG_HnhKgbJMZKir5Fsw\/viewform?c=0&amp;w=1\">google form<\/a>.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">--<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Diorio’s statement as is posted on Schoology:<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Good afternoon and TGIF! <\/span>\r\n\r\n<span style=\"font-weight: 400;\">I'm writing with <\/span><b>new information<\/b><span style=\"font-weight: 400;\"> regarding the Board of Education's vote earlier this week to report weighted CSU\/UC grades on our senior's mid-year transcripts. Please read this info carefully. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Yesterday afternoon, our district Department of Technology Services, led by Chief Technology Officer Derek Moore, was able to pull the data for the Paly class of 2017 to determine the exact number of students whose weighted CSU\/UC GPAs are lower than the cumulative unweighted GPA. The data were very compelling.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">After reviewing this new information, Superintendent Dr. McGee, Derek Moore, and I consulted with the Board of Education Agenda Setting committee and determined that we do need to return to the Board with a short-term recommendation for second semester transcripts. .  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">In an e-mail sent to the Board of Education last evening, here is what Superintendent Dr. McGee and I recommend instead:<\/span>\r\n\r\n<i><span style=\"font-weight: 400;\">\"We will not be sending WGPA transcripts to schools to which students applied for early decision or have already been admitted on a rolling basis unless the student fills out a written request that we do so. <\/span><\/i>\r\n\r\n<i><span style=\"font-weight: 400;\">...We are reconsidering the necessity for reporting both weighted and unweighted grades on second semester transcripts because we do not want to disadvantage any student's college application or scholarship opportunities and will report back to our students and families following the next Board meeting. <\/span><\/i>\r\n\r\n<i><span style=\"font-weight: 400;\">Prior to the next Board meeting, we will strive to have a staff recommendation for the short term that will assure the best possible outcomes for our students, assure we continue to have a credible relationship with our colleges and universities, and assure that we take into account all voices.\"<\/span><\/i>\r\n\r\n<span style=\"font-weight: 400;\">To reiterate, <\/span><b>we will be taking no further action before the next Board of Education meeting. <\/b><span style=\"font-weight: 400;\">However, if you have already submitted a college application and would like to send a revised transcript that contains the weighted CSU\/UC GPA to colleges before January 1, we will do so.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">To request for us to send a hard copy of your revised transcript, please complete <\/span><a href=\"https:\/\/goo.gl\/forms\/vosHIPazYfkudhHN2\"><span style=\"font-weight: 400;\">this google form<\/span><\/a><span style=\"font-weight: 400;\">. Keep in mind the deadline for us to send this information is<\/span><b>December 2nd<\/b><span style=\"font-weight: 400;\">, so please be sure to let us know before then. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Finally, I apologize for the confusion and any anxiety this week has caused and am grateful for your continued support and understanding as we work toward an optimal solution. We love our seniors and have confidence that in the end, things will work out. Remember, \"college is a match to be made, not a prize to be won.\"  In my time at Paly, I've seen over 4,000 seniors graduate from our school and \"find their match.\" I have faith that the class of 2017 will distinguish itself with amazing accomplishments beyond graduation too. I am so proud of our seniors. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">And boy, am I looking forward to an extra hour of sleep this weekend!  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Take care,<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Ms. D”<\/span>\r\n\r\n<em>Editor's note: Previously, the headline of this article suggested that the PAUSD School Board made the decision to revoke the motion they passed on Tuesday evening, to include unweighted and weighted GPAs on student transcripts. It was in fact Paly Principal Kim Diorio and PAUSD Supt. Max McGee who ultimately made the decision to hold off on sending students' weighted GPAs. The headline has been altered to reflect this.<\/em>","excerpt":"Palo Alto High School will not be sending weighted grade point average’s to schools to which seniors have submitted early applications, contrary to the Board of Education’s ruling on Tuesday and the announcement given to seniors during Advisory on Thursday, according to a statement released by Principal Kim Diorio during 5th period on Schoology.","date":"2016-11-04 15:39:27","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/IMG_5419.png","categories":["News","Spotlight"],"tags":["administration","Board of Education","college","college applications","diorio","drama","google form","gpa","max mcgee","McGee","palo alto high school","Palo Alto Unified School District","PAUSD","School Board","unweighted","weighted"]},{"id":125323,"title":"Editorial: The costs of a premature school board decision","permalink":"http:\/\/palyvoice.com\/2016\/11\/03\/editorial-the-costs-of-a-premature-school-board-decision\/","content":"A contentious debate has arisen in the Palo Alto Unified School District over the advantages and drawbacks of including weighted grade point averages on student transcripts for college applications. While administrators at both Palo Alto High School and Gunn High School have spoken in favor of adopting Supt. Max McGee’s proposed district-wide policy of reporting unweighted GPAs only, many students and parents have vehemently argued against it, on the grounds that such a policy disadvantages students for certain merit scholarships and represents an infringement on student freedom.\r\n\r\n<span style=\"font-weight: 400;\">On Tuesday night, the Board of Education <\/span><a href=\"http:\/\/palyvoice.com\/2016\/11\/02\/board-votes-for-weighted-on-mid-year-transcripts-for-class-of-2017\/\"><span style=\"font-weight: 400;\">passed a motion<\/span><\/a><span style=\"font-weight: 400;\"> to change the GPA reporting practice for the Class of 2017 at both Paly and Gunn - seniors who are currently in the midst of the college application process. For the mid-year report that will be sent to colleges, both the unweighted and weighted GPAs will be recorded on transcripts.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">At first glance, this may seem like a simple solution; reporting weighted GPAs eliminates any risk, however infinitesimal it may be, of a student being disadvantaged for scholarships. Additionally, weighted GPAs will emphasize the AP and honor classes that students take and supposedly give them the appropriate credit for challenging coursework. But what is ostensibly a straightforward solution will in reality open up a Pandora’s box of other issues, and we urge community members to critically consider the long term repercussions.<\/span>\r\n\r\n<b>Considering the consequences<\/b>\r\n\r\n<span style=\"font-weight: 400;\">To begin, the practice of reporting weighted GPAs will almost certainly reinforce the excessively competitive academic culture that has become associated with Palo Alto. Weighting GPAs will encourage people to take AP- and honors-heavy course loads, at the expense of regular lane and\/or elective classes. Furthermore, since Paly and Gunn offer far more weighted STEM classes than humanities and social science classes, the practice of reporting weighted GPAs in effect diminishes the value of non-STEM courses. And alarmingly, reporting weighted GPAs is just a step away from ranking students, either formally or in a de facto manner, because weighted GPAs make it far easier to delineate between students’ GPAs. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The programs that board members have touted as examples of educational innovation, such as Advanced Authentic Research, the Social Justice Pathway and the journalism program, as well as performing and visual arts classes, will likely see declining enrollment as a result of the GPA decision. When forced to compete with peers and choose between programs that will add to their overall high school experience or boost their GPA, many will choose the latter.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Additionally, the recording of weighted GPAs on transcripts could exacerbate another dogged problem in our district: the achievement gap. Only relatively wealthy students will be able to afford the outside tutoring for honors and AP courses, or off-campus instruction that allows them to accumulate more weighted credit, creating an even larger chasm between the privileged and the underserved in our community.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The concern about the practice of weighting GPAs harming our most vulnerable students isn’t a hypothetical one; it is very much grounded in anecdotal evidence. Because most weighted GPA methodologies do not take into account classes such as Living Skills and Physical Education, students who have earned high grades in those courses but have struggled in academic core classes may have lower weighted GPAs than unweighted GPAs. At the board meeting on Tuesday night, Paly Principal Kim Diorio reported that the administration has identified approximately 50 Paly students for whom this is the case. These students are disproportionately ethnic minorities, come from low-income families and have Individualized Education Programs. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Weighted GPAs also present a whole host of logistical issues and unnecessary confusion. For the updated reports that will be sent out to all schools students have applied to early, in addition to the mid-year reports that will be sent out for the Class of 2017, Paly will adopt the UC\/CSU methodology to calculate students' GPAs, while Gunn will be sticking with the algorithm it has been using for the past several years. Though board members claimed they prioritized standardizing practices between the two schools, their proposal doesn’t even address the problem: there is <\/span><i><span style=\"font-weight: 400;\">still<\/span><\/i><span style=\"font-weight: 400;\"> a disparity between Paly and Gunn. And if the schools were to continue weighting students’ grades, what weighting methodology would they employ? Would they use the UC system, which doesn’t consider many underclassmen honors classes for weighted credit and caps students to a maximum of eight semesters of weighted courses? Or would they devise another methodology, that would ultimately be arbitrary because colleges recalculate GPAs on their own? This is just a small sampling of the never-ending stream of questions that would arise.<\/span>\r\n\r\n<b>Dispelling fictions<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Though we are concerned about the effects of this decision on our school climate, we would like to emphasize that current seniors should not be concerned about the change in GPA reporting practices affecting their chances for college applications.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">College admissions officers across the nation will unequivocally say that your transcript is considered within the context of your high school, and obviously, a Paly student’s unweighted GPA is not being compared, from a purely numerical standpoint, with another applicant’s weighted GPA. At the most recent school board meeting, proponents of weighted GPAs presented evidence that seemed to show that students with weighted GPAs receive a boost in college admissions. But those sources are misleading, because information was selectively cherry-picked. And significantly, our college counseling professionals and various admissions officers have told us the complete opposite: they state that high schools' GPA reporting practices do not have bearing on students' chances for acceptance.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">In addresses to the school board, some people have mentioned the scholarship opportunities that students will be deprived of if the district does not report weighted GPAs. We strongly believe that the district should do everything in its capacity to help students procure financial aid. However, it is nonsensical to use merit scholarships as a justification for changing the GPA practice because administrators have yet to find a college that will not accept a letter vouching for a student's weighted GPA in place of it on a transcript. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">In the case of a Paly student missing the GPA cutoff for a merit scholarship at the University of Oregon because her unweighted GPA was reported, Kim Diorio contacted an admissions officer at Oregon and resolved the issue; the student is now eligible to receive the scholarship. According to Diorio, the admissions representative did not want Paly to change its GPA reporting policy for one student, and as such, Oregon has agreed to accept letters from Paly and Gunn administrators vouching for weighted GPAs.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Lastly, many in the pro-weighted GPA camp have said that reporting unweighted GPAs de-incentivizes students from challenging themselves academically. But this cannot be true, because many people at Paly and in general have taken difficult class loads knowing full well that only their unweighted GPAs will be reported to colleges. What reporting weighted GPAs could do, however, is compel students who aren’t prepared for or interested in the content of AP classes to take them, and further contribute to a hyper-competitive academic atmosphere.<\/span>\r\n\r\n<b>Moving forward<\/b>\r\n\r\n<span style=\"font-weight: 400;\">The choice to report weighted GPAs is a drastic one, and likely irrevocable; we believe it will be near impossible to revert to the old system if the district elects to formally adopt reporting weighted GPAs.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Perhaps the most appalling part about this decision is that students and parents were assured in writing that nothing would change for this college admissions cycle, and the school board, in unanimously voting to put weighted GPAs on our transcripts, has completely walked back on that promise. <\/span><span style=\"font-weight: 400;\">A letter sent out to parents by the Parent Teacher Student Association on Oct. 13 stated, “As parents, we ask that you please share with your teen that for this school year, nothing will change. Anything about the issue will not affect the Class of 2017.” Supt. McGee expressed similar sentiments in his weekly message published on Oct. 28, stating “<\/span><span style=\"font-weight: 400;\">For this year we are not recommending changing the current practices for grade reporting at either Gunn or Paly.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Suffice to say, <\/span><span style=\"font-weight: 400;\">w<\/span><span style=\"font-weight: 400;\">e are deeply disappointed with the board members — who have run on platforms of promoting student wellbeing — for ignoring the recommendations of professional educators and proceeding with a motion that has the potential to increase stress among the student body. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The extremely abrupt school board decision also failed to follow previously established norms of evaluating both sides of the issue prior to making tangible changes. In the past, PAUSD has spent months forming committees, fostering discussion and reviewing board reports when making a decision affecting students. It is shocking that the board did not follow the same procedure in considering the GPA issue — what should have been a thoughtful and comprehensive evidence-gathering process became a rushed political maneuver to satiate the demands of an aggressive lobby.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">But while this hasty short-term proposal has been agreed on for this year's senior class, it is not too late for the district to reevaluate this decision and thoroughly examine the consequences that this will have on the culture of Palo Alto high schools for years to come.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">We’ve worked so hard, for so long, to fundamentally address the issue of student stress across Palo Alto schools. We take great pride in our community but far too many of us have felt the effects of a suffocatingly competitive environment that overemphasizes academic achievement and contributes to a reduced sense of self-worth. The practice of r<\/span>eporting weighted GPAs is a multifaceted issue that has the potential to affect our school culture — and it certainly deserves more than the cursory consideration it received.\r\n\r\n<i>Editor's Note: To avoid a conflict of interest with his involvement in this issue, The Paly Voice's adviser disengaged himself from the writing of this editorial. He has not participated in class discussions about the editorial nor seen any drafts prior to publishing<\/i>","excerpt":"Though the hasty short-term proposal to report students' weighted and unweighted GPAs has been agreed on for this year's senior class, it is not too late for the district to reevaluate this decision and thoroughly examine the consequences that this will have on the culture of Palo Alto high schools for years to come.","date":"2016-11-03 22:41:20","author":"The Paly Voice","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0979.jpg","categories":["Editorial","Opinion","Opinion Editor's Pick","Spotlight"],"tags":["gpa","gunn","paly","PAUSD","School Board","unweighted","weighted"]}]