[{"id":114598,"title":"Video: Staff defeats students in Winter Rally soccer game","permalink":"http:\/\/palyvoice.com\/2016\/01\/20\/video-staff-defeats-students-in-winter-rally-soccer-game\/","content":"With ongoing gym construction at Palo Alto High School, the 2016 Winter Rally featured a staff-vs.-student soccer game. The staff beat the seniors, 3-2, and the Associated Student Body announced the Prom 2016 location to be the Design Galleria in San Francisco. Watch the highlights of the game.\r\n\r\nhttps:\/\/youtu.be\/QhNuIAZT9xg\r\n\r\n&nbsp;","excerpt":"With ongoing gym construction, Winter Rally 2016 featured a staff vs. student soccer game. The staff beat the seniors 3-2 and the Associated Student Body announced the Prom 2016 location to be the Design Galleria in San Francisco. Watch the highlights of the game.\r\n\r\n \r\n","date":"2016-01-20 22:58:58","author":"Aisha Chabane","categories":["News"],"tags":["paly cheer","paly dance","seniors vs. staff","Soccer","winter rally 2016"]},{"id":114605,"title":"Power outage affects Palo Alto community","permalink":"http:\/\/palyvoice.com\/2016\/01\/20\/power-outage-affects-palo-alto-community\/","content":"[caption id=\"attachment_114606\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12575823_784888971616653_143733276_n.jpg\"><img class=\"wp-image-114606\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12575823_784888971616653_143733276_n.jpg\" alt=\"Students gather at the football field after a fire alarm went off. According to Assistant Principal Jerry Berkson, the alarm was set off by rewiring the electricity. Photo by Adele Bloch\" width=\"600\" height=\"276\" \/><\/a> Students gather at the football field after a fire alarm went off during third period at Palo Alto High School. According to Assistant Principal Jerry Berkson, rewiring of the electricity set the alarm off. Photo by Adele Bloch.[\/caption]\r\n\r\nMore than 5,000 citizens at Palo Alto High School and surrounding neighborhoods are regaining power after a power outage occurred this morning.\r\n\r\nAccording to the City of Palo Alto Utilities Twitter account, 2,921 people, not including teachers and students at Paly, lost power in various neighborhoods around Palo Alto. City utility workers restored power at around 11:07 a.m. after a blown fuse caused the outage at 10:20 a.m. While the majority of Paly's electricity is restored, several buildings continue to lack full power as of 4:00 p.m.\r\n\r\n“There are still a few spots in the math department and the 800s Building that are not working yet,” Assistant Principle Jerry Berkson said.\r\n\r\nPower went out sporadically around Paly, with classrooms across campus losing power.\r\n\r\n“It [the outage] is kind of weird because it’s school-wide,” Berkson said. “But it’s not all school-wide and it’s not necessarily all of one building. Some of the building might have electricity, some of one might not.”\r\n\r\nAt Paly, classes were disturbed by both the outage and a fire alarm that went off during fifth period. According to Berkson, the fire alarm was a side effect of restoring the electricity.\r\n\r\nDespite the disturbance caused by the outage, Berkson feels that Paly is all right.\r\n\r\n\"There are a few rooms that are still lacking light,\" Berkson said. \"But for the most part the school’s set.\"","excerpt":"More than 5,000 citizens at Palo Alto High School and surrounding neighborhoods are regaining power after a power outage occurred this morning.\r\n","date":"2016-01-20 21:20:51","author":"Jackson Doerr","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12575823_784888971616653_143733276_n-2.jpg","categories":["News","Spotlight"],"tags":["electricity outage","outage","paly","power outage"]},{"id":114266,"title":"County opens nation&#8217;s first LGBTQ Affairs Office","permalink":"http:\/\/palyvoice.com\/2016\/01\/19\/county-opens-nations-first-lgbtq-affairs-office\/","content":"[caption id=\"attachment_114467\" align=\"aligncenter\" width=\"680\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/2296055722_3ab87f0f1a1.jpg\"><img class=\" wp-image-114467\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/2296055722_3ab87f0f1a1.jpg\" alt=\"The Santa Clara County gov prepares to open a new LGBTQ Office of Affairs to the public on Jan 19. Photo courtesy of Santa Clara County government website.\" width=\"680\" height=\"476\" \/><\/a> The Santa Clara County government center will house a new LGBTQ Affairs Office similar to previous efforts to reach out to other minority groups. Photo: Santa Clara County government website.[\/caption]\r\n\r\nSanta Clara's County opens the first office of Lesbian, Gay, Bisexual, Transgender and Questioning Affairs in the nation today, Jan. 19 at the county government center.\r\n\r\nSanta Clara’s LGBTQ Affairs office will serve the community by assisting local community members with services such as the health and hospital system, reentry services, probation, corrections and social services, according to office manager Maribel Martinez. The office will train staff members on LGBTQ issues and provide case-specific assistance, according to Santa Clara County supervisor Ken Yeager.\r\n\r\nThe office employees hope that the establishment of the office will inspire all counties to open similar offices, according to Yeager.\r\n\r\n“For many years, Santa Clara has been a leader in addressing the needs of underserved populations that require the services of the county,” Yeager said. “It is my hope that by establishing the nations first county office dedicated to the needs of LGBTQ residents, Santa Clara County will serve as an example for other counties looking to do the same.”\r\n\r\nIn March 2015, Yeager sent a referral to the Board of Supervisors for the creation of the LGBTQ office.  The board approved the plan and funded it later in the summer, officially establishing the office on Jan. 7, according to Yeager.\r\n\r\nAccording to Yeager, the office will be led by Martinez and management analyst Ashley Scarborough.\r\n\r\nMartinez is a director of the associated students at San Jose State University, while Scarborough works for the California STD and HIV Prevention Training Center in Oakland.\r\n\r\n“I hope to continue to serve as an advocate for community needs and a bridge to services,” Martinez said. “Also, I hope to support local leaders in creating programs, services and policies that create a just and welcoming community for all residents.”\r\n\r\nCounty officials hope this opportunity will improve the lives of the LGBTQ community in Santa Clara County, according to Yeager.\r\n\r\n“In recent years, the county has created individual offices to serve women, veterans, racial and ethnic minorities and soon immigrants,” Yeager said. “By focusing particular attention on these groups, we are able to better serve them.  It is my hope that this will be the case with the office of LGBTQ affairs.”","excerpt":"Santa Clara County’s Lesbian, Gay, Bisexual, Transgender, and Questioning Affairs office, the first county office in the nation, will be opening on Jan. 19 at the county government center.","date":"2016-01-19 21:02:29","author":"Zahra Muzaffar","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/2296055722_3ab87f0f1a1.jpg","categories":["News"],"tags":["bisexual","board","county","establishment","first office","gay","Ken Yeager","lesbiang","lgbtq","Maribel Martinez","office","questioning","santa clara","santa clara county","transgender"]},{"id":114404,"title":"Wrestling to compete at first home dual meet","permalink":"http:\/\/palyvoice.com\/2016\/01\/19\/wrestling-to-compete-at-first-home-dual-meet\/","content":"[caption id=\"attachment_114527\" align=\"alignnone\" width=\"558\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Screen-Shot-2016-01-19-at-9.12.25-AM.png\"><img class=\" wp-image-114527\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Screen-Shot-2016-01-19-at-9.12.25-AM.png\" alt=\"Sophomore Calvin Grewal, freshman [[]], junior Seth Goyal and freshman [[]] pose for a picture after placing at the \" width=\"558\" height=\"429\" \/><\/a> Sophomore Calvin Grewal, freshman Andrew Wang, junior Seth Goyal and freshman Callum Day Ham pose for a picture after placing at the Bianchini Varsity Tournament. According to coach Jonathan Kessler, Goyal was awarded with the title \"Most Outstanding Wrestler.\" Photo by Kessler.[\/caption]<span style=\"font-weight: 400;\">After a strong showing in the <\/span><span style=\"font-weight: 400;\">Bianchini Varsity Tournament, the Palo Alto High School Wrestling team is gearing up for its first home dual meet tomorrow at Gunn High School, the team's home gym for the season.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Junior Seth Goyal won the 132-pound weight class and was voted \"Most Outstanding Wrestler\" at the Bianchini Varsity tournament, according Kessler. <\/span><span style=\"font-weight: 400;\">Other notable performances include sophomore Calvin Grewal, who won the consolation final for the 113-pound bracket. Freshman Andrew Wang took 5th place in the 120-pound bracket, while freshman Callum Day Ham placed 6th in the 106-pound weight class.<\/span>\r\n\r\n“We are happy with the way the team competed there,” coach Jonathan Kessler said. “We only entered five wrestlers in the Cupertino Bianchini Varsity tournament. Four of the five wrestlers competed in their first varsity tournament.”\r\n\r\n<span style=\"line-height: 1.5;\">Despite these wins, Kessler says that the season has been tough so far with wrestlers quitting and getting injured.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Most of our varsity lineup is comprised of freshmen,” Kessler said. “This gives them an opportunity to start their varsity career at an early age.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Goyal, the team has been training hard in practice for its first home dual meet against Los Gatos High School.<\/span>\r\n\r\n“We believe our wrestlers have a chance at winning their respective weight classes but they understand nothing is given in this sport,” Kessler said.\r\n\r\n<span style=\"font-weight: 400;\">The Vikings will face off against Los Gatos at 6:30 p.m. tomorrow at Gunn. <\/span>","excerpt":"After a strong showing in the Bianchini Varsity Tournament on Saturday, the Palo Alto High School Wrestling team is gearing up for its first home dual meet tomorrow at Gunn High School, the team's home gym for the season.\r\n","date":"2016-01-19 11:24:19","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Screen-Shot-2016-01-15-at-5.55.17-PM.png","categories":["Sports"],"tags":["goyal","jonathan","kessler","paly","seth","tournament","wrestling"]},{"id":114454,"title":"Boys&#8217; soccer routs Mountain View","permalink":"http:\/\/palyvoice.com\/2016\/01\/18\/boys-soccer-routs-mountain-view\/","content":"[caption id=\"attachment_114456\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/IMG_7940.jpg\"><img class=\"size-full wp-image-114456\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/IMG_7940.jpg\" alt=\"Senior outside defender Roberto Sotelo slides to keep the ball in bounds during the second half of the Vikings' game against Mountain View High School.\" width=\"600\" height=\"425\" \/><\/a> Senior outside defender Roberto Sotelo slides to keep the ball in bounds during the second half of the Vikings' game against Mountain View High School. Sotelo assisted on one goal against the Spartans. Photo by Emma van der Veen.[\/caption]\r\n\r\nThe Palo Alto High School boys' soccer team (8-0-1, 4-0) dominated the Mountain View High School Spartans (5-2-4, 0-1-1) on Friday at the Paly soccer field by a score of 5-0.\r\n\r\nThe Vikings controlled the ball throughout the game, using possession to keep the other team chasing them. According to head coach Don Briggs, this allowed him to change the lineup later in the game, when Paly was leading 3-0.\r\n\r\n“We were able to possess the ball when we needed to,” Briggs said. “Ten minutes into the second half, we started putting people in different positions. Doing that is actually good for them because it gives them the chance to work on different things.”\r\n\r\nThe Vikings took advantage of their offensive opportunities much better than in previous matches, with goals by senior midfielder Cole Tierney, senior defender Cam Huard, senior forward Max Hallberg, senior midfielder Dami Bolarinwa and senior forward Ariya Momeny.\r\n\r\n“We got five goals and we capitalized on most of our opportunities, which is an improvement from our other games,” Tierney said. “I definitely have more confidence now and I think a lot of people do because there was a wealth of goals. That’s always good to build confidence and have confidence in other people too.”\r\n\r\nAccording to Mountain View head coach Jim Mcguirk, the Spartans struggled to adjust their defensive strategy against Paly.\r\n\r\n“Defensively, we’ve played pretty good all year, but we didn’t play as good today,” Mcguirk said. “We didn’t adjust to how fast they were. There were things we could’ve done, like changed positioning to be in the right spots. We were in the spots that we’re in against other teams, but we didn’t adjust to their speed and get into different positions where we could handle their speed better.”\r\n\r\nThe Vikings worked together more effectively in this game than they had in previous weeks, according to Bolarinwa.\r\n\r\n\"We moved the ball, got open, found the time to pass and hold the ball,” Bolarinwa said. “It was really good to see how our team is finally clicking together.”\r\n\r\nPaly will play Fremont High School (2-4-3, 1-1-1) at 3:30 p.m. on Wednesday at Fremont.","excerpt":"The Palo Alto High School boys' soccer team (8-0-1, 4-0) dominated the Mountain View High School Spartans (5-2-4, 0-1-1) on Friday at the Paly soccer field by a score of 5-0.","date":"2016-01-18 22:38:20","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/IMG_7965.jpg","categories":["Sports","Sports Recap"],"tags":["ariya momeny","boys soccer","cam huard","cole tierney","dami bolarinwa","don briggs","jim mcguirk","max hallberg","mountain view","palo alto high school","roberto sotelo","Soccer","spartans","vikings"]},{"id":114478,"title":"Advisory this week is for all sophomores and select freshmen (A-K)","permalink":"http:\/\/palyvoice.com\/2016\/01\/17\/advisory-this-week-is-for-all-sophomores-and-select-freshmen-a-k\/","content":"","excerpt":"","date":"2016-01-17 23:33:14","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":114273,"title":"Palo Alto teen center to celebrate grand opening","permalink":"http:\/\/palyvoice.com\/2016\/01\/16\/palo-alto-teen-center-to-celebrate-grand-opening\/","content":"The Mitchell Park Community Center will host food, games and a DJ in honor of <a href=\"https:\/\/www.facebook.com\/pages\/Mitchell-Park-Teen-Center\/475685722572832\">Fridays at the Drop's grand opening<\/a> next Friday.\r\n\r\n<span style=\"font-weight: 400;\">“The Drop,” a teen center specially designed for high school students in Palo Alto, is a drop-in space for those looking to relax, hang out with friends or play sports and video games, according to the <a href=\"http:\/\/www.cityofpaloalto.org\/gov\/depts\/csd\/recreation\/teens\/drop.asp\">City of Palo Alto website<\/a>. While The Drop has been open for several months, the center will formally open its doors next week.<\/span>\r\n\r\n[caption id=\"attachment_114451\" align=\"alignright\" width=\"323\"]<img class=\"wp-image-114451\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12562775_1724082504487664_591649073_o.jpg\" alt=\"12562775_1724082504487664_591649073_o\" width=\"323\" height=\"431\" \/> High school students in Palo Alto can play foosball, along with a variety of other games, at the Drop. Photo by Amal Aziz.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The center is regularly open Mondays through Thursdays until 6 p.m., Fridays until 9 p.m. and weekends from noon to 5 p.m. at 3700 Middlefield Rd.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Upon surveying teens in the Palo Alto community, there was an overwhelming amount of teens that felt they never had the opportunity to stop, relax and just be,” said Amal Aziz, The City of Palo Alto’s recreation coordinator. “The Drop works to provide a space to do just that. It’s the perfect place to take a break from the demands of the day.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Aziz, a multitude of activities are available at The Drop.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Teens can play ping pong, catch their favorite team play, test their hand at Super Smash Bros. or Just Dance, work on their three-pointer or hang out with friends,” Aziz said.\r\n<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The grand opening will feature a DJ from radio station WiLD 94.9, as well as food, goodie bags, games, prizes and a photo booth.<\/span>\r\n\r\nHigh school students can <a href=\"https:\/\/apm.activecommunities.com\/paloalto\/Membership?package_id=11\">register for a membership pass<\/a> for The Drop at no cost.\r\n\r\n<span style=\"font-weight: 400;\">“I think that it would be a good place to meet people from other schools,” freshman Bridget Li said. “I hope they [high schoolers] use it because it seems like the city has put a lot of thought into it. It would be cool to see other events like this in Palo Alto.”<\/span>","excerpt":"The Mitchell Park Community Center will host food, games and a DJ in honor of Fridays at the Drop's grand opening next Friday.","date":"2016-01-16 13:25:42","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/lobbyoflibrary-e1412307388414.jpeg","categories":["News"],"tags":["amal aziz","bridget li","community center","fridays at the drop","high school","mitchell park","palo alto","so much lettuce","teenager","teens","the drop"]},{"id":113811,"title":"Prom 2016 details revealed","permalink":"http:\/\/palyvoice.com\/2016\/01\/15\/prom-2016-details-revealed\/","content":"[caption id=\"attachment_114333\" align=\"alignnone\" width=\"598\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/IMG_19951.jpg\"><img class=\" wp-image-114333\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/IMG_19951.jpg\" alt=\"ASB members Cezzane Lane (left) and Natalie Maloney (right) display a banner stating 'Design Galleria'. The prom location announcement was made during the Winter Rally earlier today.\" width=\"598\" height=\"219\" \/><\/a> Associated Student Body members junior Spirit Commissioner Cezanne Lane (left) and junior Vice President Natalie Maloney (right) display a banner sharing the Prom location 'Design Galleria' for 2016 at the Winter Rally yesterday. The announcement was made at the end of the student vs. staff soccer game which ended with a 3-2 victory for the staff. Photo by Mary McNamara.[\/caption]\r\n\r\nPalo Alto High School's Prom 2016 will be at The San Francisco Galleria Design Center, according to an Associated Student Body announcement at the Winter Rally yesterday.\r\n\r\n\"The Galleria is four stories and gives a comfortable amount of room for everyone,\" Senior Class President Eli Friedlander said.\r\n\r\n<a href=\"http:\/\/www.sfvenues.com\/galleria\/overview.html\">The Galleria<\/a> is a popular venue location in the design district of San Francisco, according to Friedlander. With three balconies, a spacious layout, a hardwood dance floor and a retractable skylight, Junior Class President Noa Ben-Afraim says she believes, \"It is going to be fantastic.\"\r\n\r\nAccording to Ben-Efraim, the theme for this year is \"Fly Me to the Moon.\"\r\n\r\n\"You can expect classy lighting and decor,\" Ben-Efraim said.\r\n\r\nFriedlander highlights the flexibility benefits of the new venue as opposed to last year's venue.\r\n\r\n\"The venue this year is very different from last years venue in terms of restrictions,\" Friedlander said. \"Since it was San Francisco City Hall, we had our own security protocols added on to that of the state and city marshals. This year we have a lot of leniency and have more opportunity for what we want to do and organize.\"\r\n\r\nSenior Karina Chan looks forward to having Prom at the Design Center.\r\n\r\n\"I think it's going to be an amazing venue because the retractable skylight sounds like something that is going to be very cute and romantic,\" Chan said.\r\n\r\nAccording to Friedlander, Prom will be held on April 16 and <a href=\"http:\/\/www.djhightop.com\/\">DJ Hightop<\/a> will provide the music again this year. The majority of the plans will be finalized by the end of February, according to Ben-Efraim, and further details will be released in the upcoming weeks regarding theme, ticket sales and an upcoming asking competition.\r\n\r\n\"We're going to try to make this the best prom yet,\" Ben-Efraim said.","excerpt":"Palo Alto High School's Prom 2016 will be held at The San Francisco Galleria Design Center, according to an Associated Student Body announcement at the Winter Rally yesterday.","date":"2016-01-15 19:28:53","author":"Bianca Al-Shamari","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/IMG_19951.jpg","categories":["News"],"tags":["2016","ben-efraim","design center","friedlander","prom","prom location","San Francisco","winter rally"]},{"id":114255,"title":"Residents protest airplane noise at &#8216;Sky Posse&#8217; meeting","permalink":"http:\/\/palyvoice.com\/2016\/01\/15\/residents-protest-airplane-noise-at-sky-posse-meeting\/","content":"Palo Alto residents are talking to the City of Palo Alto to protest loud and low-flying airplanes after a “Sky Posse” meeting Wednesday night at the Lucie Stern Community Center.\r\n\r\nSky Posse is an organization founded in early 2014 by Palo Altans wishing to address increased plane noise in the Bay Area. According to <a href=\"http:\/\/www.skypossepaloalto.org\">Sky Posse’s website<\/a>, changes by the Federal Aviation Administration have led to increased air traffic over Palo Alto neighborhoods, and many residents claim this lowers the city's standard of living and causes unneeded distractions.\r\n\r\nThe meeting included information regarding Sky Posse’s website, methods for reporting airplanes as well as general information and an update from the City of Palo Alto. According to the update from senior management analyst Kashayar \"Cash\" Alaee, the city plans on implementing a study on airplane noise and cooperating with locals in Palo Alto.\r\n\r\n[caption id=\"attachment_114305\" align=\"alignright\" width=\"375\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12513623_10203895767433452_8899129206085221806_o.jpg\"><img class=\"wp-image-114305\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12513623_10203895767433452_8899129206085221806_o.jpg\" alt=\"12513623_10203895767433452_8899129206085221806_o\" width=\"375\" height=\"281\" \/><\/a> Sky Posse leaders Rachel Kellerman and Jennifer Landesmann presented a series of statistics and solutions at the organization's meeting Wednesday night. \"Working with the FAA is the only way to stop the plane noise,\" Landesmann said. Photo by Aidan Maese-Czeropski.[\/caption]\r\n\r\n“Every neighborhood has been impacted,” Sky Posse co-leader and Palo Alto High School librarian <a href=\"http:\/\/www.paloaltoonline.com\/news\/2015\/08\/22\/guest-opinion-a-groundlings-lament-151-and-call-to-action\">Rachel Kellerman<\/a> said.\r\n\r\nCo-leader Jennifer Landesmann outlined two of the organization’s major goals at the meeting: holding California elected officials responsible and giving the community a voice.\r\n\r\n“We’re the worst hit out of all of the cities that are affected,” Landesmann said.\r\n\r\nAccording to Landesmann, airplane noise in Palo Alto has increased nearly 200 percent in the past several years. Although traffic at nearby airports in San Jose and San Francisco is growing, this newfound noise mainly results from the new Next Generation Air Transportation System, which shortens flight distances and times and saves fuel while simultaneously increasing flights over urban areas.\r\n\r\nSince NextGen’s implementation, complaints against airplane noise from Palo Altans has mushroomed. Wednesday night’s meeting represented the culmination of months of research and lobbying for reduced sound, according to Landesmann.\r\n\r\nWhile Sky Posse mainly aims to address noise pollution, the organization also points out potential health risks associated with numerous low-flying aircrafts. According to <a href=\"http:\/\/news.nationalgeographic.com\/news\/2010\/10\/101005-planes-pollution-deaths-science-environment\/\">National Geographic<\/a>, plane emissions cause 10,000 deaths in the world each year. Landesmann says that the benefits of shifted flight routes outweighs the loss of jet fuel that could be saved by simply flying straight over the Bay Area.\r\n\r\n[caption id=\"attachment_114304\" align=\"alignright\" width=\"336\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12473653_10203895766273423_6465419346657067747_o1.jpg\"><img class=\"wp-image-114304\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12473653_10203895766273423_6465419346657067747_o1.jpg\" alt=\"12473653_10203895766273423_6465419346657067747_o\" width=\"336\" height=\"367\" \/><\/a> Sky Posse co-leader Rachel Kellerman poses with a board mapping airplane noise complaints in the Peninsula. \"Nothing will change ... If the citizens and the city do not fight for it,\" Kellerman said. Photo by Aidan Maese-Czeropski.[\/caption]\r\n\r\nSince Sky Posse’s founding in 2014, residents have lodged complaints and made petitions to reduce plane noise. Kellerman says she hopes to work with both Palo Alto and the FAA to cause faster results.\r\n\r\n“The longer this program [NextGen] goes on, the harder it is to stop,” Kellerman said.\r\n\r\nIn the long term, Sky Posse aims to shift flight routes away from Bay Area towns as much as possible, not just Palo Alto, according to Kellerman.\r\n\r\n“We need to have a redesign of our airspace,” Kellerman said.\r\n\r\nIn the meantime, Sky Posse will continue to petition the local government to take action and may attend City Council meetings in the future, according to Landesmann\r\n\r\n“Our city is going to have to fight really hard,” Landesmann said.","excerpt":"Palo Alto residents are taking to the City of Palo Alto to protest loud and low-flying airplanes after a “Sky Posse” meeting Wednesday night at the Lucie Stern Community Center.","date":"2016-01-15 16:34:58","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12473653_10203895766273423_6465419346657067747_o1.jpg","categories":["News"],"tags":["airplane noise","community center","faa","jennifer landesmann","lucie stern","nextgen","palo alto","palo alto high school","paly","quiet skies","rachel kellerman","sky posse","transportation"]},{"id":114247,"title":"Boys&#8217; soccer takes down Gunn","permalink":"http:\/\/palyvoice.com\/2016\/01\/15\/boys-soccer-takes-down-gunn\/","content":"[caption id=\"attachment_114249\" align=\"alignnone\" width=\"607\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/IMG_7689.jpg\"><img class=\" wp-image-114249\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/IMG_7689.jpg\" alt=\"Junior midfielder Jack Stoksik overcomes his defender in the first half of the match against the Vikings' cross town rivals, the Gunn Titans. Stoksik provided two of the critical passes that led to the Vikings' first two goals of the game. Photo by Emma van der Veen.\" width=\"607\" height=\"448\" \/><\/a> Junior midfielder Jack Stoksik overcomes his defender in the first half of the match against the Vikings' cross town rivals, the Gunn Titans. Stoksik provided two of the critical passes that led to the Vikings' first two goals of the game. Photo by Emma van der Veen.[\/caption]\r\n\r\nThe Palo Alto High School boys’ soccer team (7-0-1, 3-0) took down its cross-town rival, Gunn High School (0-0-8, 0-2), 3-1 on Wednesday at Gunn.\r\n\r\nThe match was full of action, with three yellows cards and one red card for Paly and two yellow cards for Gunn. The red card, given to junior center defender Neil Verwillow, also resulted in a free kick play right outside of the goal box. The free kick resulted in Gunn’s only goal, allowing them to get back into the game, down by one goal with a score of 2-1 with 25 minutes left in the second half.\r\n\r\n“We got that red card and then they scored a goal,” head coach Don Briggs said. “It felt like ‘Oh my gosh, we’re in a dog fight now, 2-1.’”\r\n\r\nThe Vikings were able to come into the game with a lot of energy, according to junior forward Michel Ange Siaba.\r\n\r\n“We came on the field very pumped because, you know, this is Gunn,” Siaba said. “It’s the ultimate game. The energy was really high up, which is probably our greatest strength right now: coming onto the field with energy and challenging the opponent.”\r\n\r\nAfter a roughly even first half, the Vikings led 1-0 on a goal scored by senior midfielder Dami Bolarinwa, finished off of a slowed breakaway by senior forward Alessandro Reale. Despite leading in score, both teams struggled with keeping possession during the first half.\r\n\r\n“That first half was a little sketchy,” Briggs said. “I don’t know if the kids were a little bit nervous, but it seemed like they were holding onto the ball and waiting for the perfect pass, and then they’d make a bad pass. We make three or four or five good passes and then we make one bad pass and give it up, and we’re back on our heels again.”\r\n\r\nAccording to Gunn head coach Ken Luis, facing Paly was a challenge, but the Titans performed well.\r\n\r\n“A lot of the players were really up for the Palo Alto rivalry,” Luis said. “This is always a big game. I could tell that, this week, the guys were really excited for this game. We had our moments, but it was overall probably one of our better games this season.”\r\n\r\nPaly’s third and final goal, scored on a free kick by senior midfielder Roberto Sotelo to Bolarinwa and finished by senior forward Max Hallberg, shifted the game’s momentum back into Paly’s favor, helping the team to finish on a strong note, according to Briggs.\r\n\r\n“We scored the next goal and it kind of ended that feeling [of panic],” Briggs said.\r\n\r\nDespite being able to finish on multiple chances, including an early goal in the second half by Siaba, Paly struggled with finishing their offensive chances, according to Briggs.\r\n\r\n“We had so many opportunities we just need to put the ball in the net when we have those crosses,” Briggs said.\r\n\r\nPaly will face off against the Mountain View Spartans (5-1-4, 0-0-1) at 3:30 p.m. on Friday at the Vikings’ field.","excerpt":"The Palo Alto High School boys’ soccer team (7-0-1, 3-0) took down its cross-town rival, Gunn High School (0-0-8, 0-2), 3-1 on Wednesday at Gunn.","date":"2016-01-15 14:20:11","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/IMG_7813.jpg","categories":["Sports","Sports Recap","Spotlight"],"tags":["bolarinwa","briggs","gunn high school","hallberg","ken luis","palo alto high school","reale","siaba","Soccer","stoksik","titans","verwillow","vikings"]}]