[{"id":120635,"title":"Déjà vu: Juniors opt out of Smarter Balanced test, again","permalink":"http:\/\/palyvoice.com\/2016\/05\/19\/deja-vu-juniors-opt-out-of-smarter-balanced-test-again\/","content":"[caption id=\"attachment_120638\" align=\"alignright\" width=\"452\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/13225152_1706672769592750_1831332758_o.jpg\"><img class=\"wp-image-120638\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/13225152_1706672769592750_1831332758_o.jpg\" alt=\"13225152_1706672769592750_1831332758_o\" width=\"452\" height=\"339\" \/><\/a> Out of around 40 students, only eight were present in this classroom at the first day of Smarter Balanced testing. The next day, the number in this class had dwindled to around seven students. Photo: Adrienne Kwok.[\/caption]\r\n\r\nApproximately 75 percent of Palo Alto High School juniors opted out of the Smarter Balanced test on Tuesday and Wednesday.\r\n\r\n“We had roughly 25 percent of the students show up,” Assistant Principal Adam Paulson said. “It seemed like it was a little bit less this year. … We’ve done these [California Standardized] tests for many years, and we’ve never got this non-turn out before. I guess we’re [admin] trying to grapple with why people are opting out.”\r\n\r\nCalifornia Education Code §60615 permits students to opt out of California tests if their school receives a note of excuse from their parents. Last year about 50 percent of juniors <a href=\"http:\/\/palyvoice.com\/2015\/04\/27\/where-is-everyone-students-opt-out-of-smarter-balanced-test\/\">opted out of the SBAC<\/a>.\r\n\r\nWith such a small number of student participants, the administration will not be able to receive an accurate score of how the student body is performing academically.\r\n\r\n“We need a 95 percent threshold to get a score for the school to get accurate data, which obviously we didn’t hit,” Paulson said.\r\n\r\nAccording to Paulson, the administration can do little to ensure that students take the test.\r\n\r\n“Obviously we want more kids to participate, but a lot of it is out of our hands,” Paulson said. “It’s a cultural thing. Students don’t see the benefit in it [the SBAC].”\r\n\r\nLast week, Principal Kim Diorio <a href=\"http:\/\/palyvoice.com\/2016\/05\/16\/smarter-balance-testing-to-begin-tomorrow\/\">encouraged students<\/a> to take the test via a Schoology message.\r\n\r\n\"Smarter Balanced Testing is a low stakes assessment for students but a high-stakes test for our high school and it's state-wide and national rankings, as well as being the primary source for school-wide data to inform our WASC continuous improvement process,\" Diorio wrote.\r\n\r\nJunior Dani Macuil says she opted out of the test as it occurred shortly after Advanced Placement exams and a few weeks before final exams.\r\n\r\n“I didn’t go to Smarter Balance testing because I felt like it was unfair to ask students to do another week of testing on top of APs and getting ready for finals,” Macuil said. “I also knew that 95 percent of students wouldn’t show up; therefore, it would be pointless to go anyways because it still wouldn’t meet the requirements.”\r\n\r\nAccording to junior Lydia Miller, her class experienced several technical issues on the first day of testing.\r\n\r\n“Most of the computers didn’t have it [the exam] on there,” Miller said. “We had to go from computer to computer to see which had the test on it.”\r\n\r\nAt the beginning of the test, classes partook in discussions about the parts of a coffee cup to help solve math equations about a cup. On the second day, English teachers conducted a discussion about the definition of poetry and prose before starting the exam. While some students found the introduction helpful, others including junior Isabella Bernard found the discussions unhelpful in solving the problems and said they only wasted time.\r\n\r\n“They [the discussions] weren't even relevant to the problems,” Bernard said. “You didn’t need to know any of it to do the problems.”","excerpt":"Approximately 75 percent of Palo Alto High School juniors opted out of the Smarter Balanced test on Tuesday and Wednesday.","date":"2016-05-19 22:29:35","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/13225152_1706672769592750_1831332758_o.jpg","categories":["News","Spotlight"],"tags":["balanced","exam","sbac","smarter","test"]},{"id":120344,"title":"City ordinance prohibits inflatables during Field Day","permalink":"http:\/\/palyvoice.com\/2016\/05\/19\/city-ordinance-prohibits-inflatables-during-field-day\/","content":"[caption id=\"attachment_72113\" align=\"alignleft\" width=\"440\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/photo-3.jpg\"><img class=\"wp-image-72113\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/photo-3.jpg\" alt=\"Junior Meera Bhide exits a large, blow-up slide that is included at every field day. Photo by Amanda Carlsson.\" width=\"440\" height=\"330\" \/><\/a> A student exits a large, inflatable slide that has been included in every Field Day prior to this year, according to ASB Vice President Anmol Nagar. This year, Palo Alto is enforcing a revised city ordinance that prohibits inflatable objects on campus, forcing ASB to rethink their routine Field Day activities. Photo by Amanda Carlsson.[\/caption]\r\n\r\nThe Associated Student Body will no longer offer inflatable objects or a full meal during Field Day, an annual extended lunch event tomorrow on the Quad.\r\n\r\nA recently revised <a href=\"http:\/\/www.cityofpaloalto.org\/civicax\/filebank\/documents\/25688\">Palo Alto city ordinance<\/a> prohibits inflatable structures \"except in designated areas of Mitchell Park.\"\r\n\r\nBecause previous years' games often included inflatable objects, ASB members sought to compile a list of alternative games this year, including a dunk tank, a rock wall, euro bungee and human foosball.\r\n\r\n\"There was a new city ordinance which is why we can't have all the normal inflatables,\" Senior Vice President Bryn Carlson said. \"But we worked really hard to find other solutions so we think that it's still going to be a good event.\"\r\n\r\nAnd unlike previous years, ASB will no longer provide a full lunch in its attempt to reduce waste, according to ASB Vice President Anmol Nagar.\r\n\r\n\"From the past, we've had a lot of leftovers, so we wanted to avoid the waste,\" Nagar said. \"People go to Town and Country, and then they come back to hangout and play games on the Quad anyway.\"\r\n\r\nInstead, Sports Commissioner Ariya Momeny said that ASB will offer large Otter Pops.\r\n\r\n\"We decided that a lot of people aren't on campus during Field Day, so we didn't want to spend a lot of money on burgers,\" Momeny said. \"So instead we're doing Otter Pops.\"\r\n\r\nDespite the changes this year, many students are looking forward to the annual event as a time to unwind during their end of year exams.\r\n\r\n\"Even though there are no inflatables, I think this will be a great way to relax after APs [Advanced Placement testing],\" junior Maddie Frick said.","excerpt":"The Associated Student Body will no longer offer inflatable objects or a full meal during Field Day, an annual extended lunch this Friday on the Quad.","date":"2016-05-19 16:58:26","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/0000\/00\/Field-Day-097.jpg","categories":["News","Spotlight"],"tags":["advanced","advanced placement","anmol","anmol nagar","ap","aps","ariya","ariya momeny","ASB","associated","body","bryn","bryn carlson","carlson","city","country","design","dunk tank","extended","field day","foosball","friday","games","human","inflatables","lunch","mitchell park","momeny","nagar","objects","ordinance","otter pops","placement","President","quad","rock wall","structures","student","testing","town","Town and Country","vice","vice president"]},{"id":119679,"title":"Album Review: The visual album &#8220;Lemonade&#8221;","permalink":"http:\/\/palyvoice.com\/2016\/05\/19\/album-review-the-visual-album-lemonade\/","content":"<p style=\"text-align: left;\">Music is often used to bring emotion to life, and although it can sometimes tell a story, other times catharsis is the goal for both the artist and the fans. What makes a release of emotions beautiful is when an artist is able to spin it into a more positive, hopeful message. Beyoncé’s visual album \"Lemonade,\" released in late April, has a meaningful message that goes beyond the topic of her husband's infidelity. It is an empowering visual album that showcases the strength of women and African Americans.<\/p>\r\n<p style=\"text-align: left;\">Her hour-long music video incorporates all of the songs in the album with each song representing a different emotional stage. In between and throughout each song Beyoncé provides moving narration that includes religious references, reflections on her life and historical events. Although sometimes it can be hard to understand the entire message, the variety of ways to analyze the composition makes \"Lemonade\" a literature geek's dream.<\/p>\r\nThe stages of grief represented in the album include intuition, denial, anger, apathy, emptiness, accountability, reformation, forgiveness, resurrection, hope and redemption. Although all of these stages include a unique and powerful message, here are some of the most memorable components in Beyoncé's visual album.\r\n\r\nAfter the first song “Pray You Catch Me,” which is in the intuition stage and is the introduction to her visual album, Beyoncé provides narration as she is captured swimming in an underwater bedroom. The tempo is very slow, providing an eerie effect to the scene as Beyoncé sings a variety of melodious harmonies. The lyrics add to the sinister tone with phrases like \"pray to catch you whispering.\"\r\n\r\nShe then transitions into the next song — “Hold Up,” the denial stage. “Hold Up” begins with Beyoncé wearing a striking yellow dress as she opens the doors and water floods out from the bedroom. This is one of the most famous clips from her music video and she is seen smashing cars with a bat strutting down the street. “Hold Up” provides a reggae vibe that is peaceful and soothing, which is a striking contrast to her violent actions in the video when she smashes cars while swinging a bat.  The medium pace of the song is well thought out, making the scene just the right tempo instead of too rushed. Throughout the denial stage, Beyoncé portrays herself as delighted as she destroys the cars and the streets. Towards the end of this scene, children and others gather behind Beyoncé as they join her in the streets. This portrayal of solidarity showcases the surprising aspect of the scene: for a song about denial, the tune is almost happy and unnervingly relaxed.\r\n\r\n[caption id=\"attachment_50211\" align=\"aligncenter\" width=\"488\"]<img class=\"wp-image-50211\" src=\"http:\/\/thevandallist.com\/wp-content\/uploads\/2016\/04\/Watch-Beyonc%C3%A9%E2%80%99s-%E2%80%9CLemonade%E2%80%9D-HBO-Album-Movie-the-vandallist-2.jpg\" alt=\"Watch Beyoncé’s “Lemonade” HBO Album Movie - the vandallist (2)\" width=\"488\" height=\"276\" \/> Beyoncé struts down the streets wearing a yellow dress and destroying cars with a bat in the song \"Hold Up,\" the denial stage of grief. Photo from Beyoncé's visual album.[\/caption]\r\n\r\nIn the anger stage with the song \"Don't Hurt Yourself (ft. Jack White)\" the visual album flashes the phrase, “God is God and I am not.” It then leads into the next song \"Sorry,\" the apathy stage, featuring No. 1 ranked women’s tennis player Serena Williams in the song. The faster beat and sassiness of the song embodies more of the diva and “queen” that Beyoncé is known to be. Serena Williams and Beyoncé dance around a room and a bus as they sing “I ain’t sorry” repeatedly. This song is most popular for the lyrics, “Becky with the good hair,” which has sprung controversy as to who Becky is and if it has to do with Jay Z’s cheating scandal.\r\n\r\n“Sandcastles” is Beyoncé’s most vulnerable song as it is the forgiveness stage and features Jay-Z. She is pictured laying with a veil over her head standing in the ocean. The song itself is slowed down with the simplicity of the piano playing in the background. \"Sandcastles\" shows a softer side to Beyoncé as her voice cracks, emphasizing raw emotion and her personal struggles. With Jay-Z featured in this stage, she shows vulnerability and allows the public to see a glimpse of their personal lives. In her narration component, Beyoncé includes phrases like, \"Baptize me. … If we’re gonna heal let it be glorious” and “1,000 girls raise their arms,” a message of empowerment and hope that incorporates religious terms. This song perfectly contrasts to the rest of the album, providing almost a spiritual moment of relief in a storm of strong emotions.\r\n\r\n\"Freedom\" is the stage of hope and is the epitome of female empowerment as many strong women like Zendaya, Winnie Harlow and Ava Clarke are featured in this song. The song \"Forward\" is the resurrection stage and also has powerful imagery as the mothers of several black men who were killed in the last couple of years were are shown holding pictures of their loved ones. This strong message shows how Beyoncé is willing to stand up for her beliefs in her music, making it clear that this an issue calling out for awareness and compassion.\r\n\r\n“All Night,” the redemption stage shows many home video clips of Beyoncé’s family as well as other unknown people and is a bittersweet ending to her visual album. This has a much more peaceful and lighter vibe as it shows Beyoncé getting a matching “four” tattoo with her husband Jay-Z, as well as letting the public in on their wedding night with other couples who are unknown, smiling and having a good time together. All of these clips are happy, memorable events. It is a touching way to end her visual album as the song \"Formation\" is only featured in the end credits. She ends the song with “How I missed you my love” in a haunting whisper.\r\n\r\nBeyoncé uses this visual album as a platform to show her beliefs of women and black empowerment. However, the visual album has a much deeper message than a way of getting revenge on Jay-Z. It illustrates her versatility as an artist: she can do anything from a touching slow song to a powerful, fast-paced pop song. However, the one complaint is that the songs are a bit repetitive, all over the place and not as cohesive because they seem to be there to supplement the visual aspect of the album. But this is Beyoncé we're talking about — she can pull off any genre and make the music as catchy as always.\r\n\r\n&nbsp;","excerpt":"Beyonce’s visual album Lemonade has a meaningful message that goes beyond the topic of her husband. It is an empowering visual album that showcases the strength of women and African Americans. ","date":"2016-05-19 11:41:28","author":"Claire Krugler","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/imgres-2.jpg","categories":["A&amp;E Section Spotlight","Entertainment","Features"],"tags":["album review","artist","beyonce","Lemonade","music","queen bee"]},{"id":120302,"title":"What&#8217;s in my bag: Jackson Nelson-Gal","permalink":"http:\/\/palyvoice.com\/2016\/05\/18\/whats-in-my-bag-jackson-nelson-gal\/","content":"As part of The Paly Voice’s “What’s in my Bag” series to find out more about students at Palo Alto High School, we sat down with senior Jackson Nelson-Gal this week and to ask what’s in his bag. Hover around the photos to learn more. Photos by Cooper Lou.\r\n\r\n<img style=\"max-width:100%\" src=\"\/\/cdn.thinglink.me\/api\/image\/785372970922016769\/1024\/10\/scaletowidth#tl-785372970922016769;1043138249'\" class=\"alwaysThinglink\"\/><script async charset=\"utf-8\" src=\"\/\/cdn.thinglink.me\/jse\/embed.js\"><\/script>","excerpt":"As part of The Paly Voice’s “What’s in my Bag” series to find out more about students at Palo Alto High School, we sat down with senior Jackson Nelson-Gal this week and to ask what’s in his bag. ","date":"2016-05-18 19:50:00","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/FotorCreated.jpg","categories":["Multimedia","Spotlight"],"tags":["jackson nelson-gal","palo alto high school","play","what's in my bag"]},{"id":120579,"title":"Smarter Balance Testing to begin tomorrow","permalink":"http:\/\/palyvoice.com\/2016\/05\/16\/smarter-balance-testing-to-begin-tomorrow\/","content":"[caption id=\"attachment_120581\" align=\"aligncenter\" width=\"505\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Screen-Shot-2015-04-27-at-4.26.04-PM.png\"><img class=\"wp-image-120581\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Screen-Shot-2015-04-27-at-4.26.04-PM.png\" alt=\"Screen-Shot-2015-04-27-at-4.26.04-PM\" width=\"505\" height=\"377\" \/><\/a> Last year, under 50 percent of Palo Alto High School juniors took the state-standardized Smarter Balanced test, according to Dean of Students Adam Paulson. Of the 30 juniors scheduled to take the test in the room 865, only 15 were present. Photo: Jeanette Wong.[\/caption]\r\n\r\nThe Palo Alto High School Administration aims to increase student attendance for the state-standardized Smarter Balanced test that juniors will take on Tuesday and Wednesday at Paly.\r\n\r\nLast year, Principal Kim Diorio expressed disappointment in the low turnout rate.\r\n\r\n“Our participation rate was expected to be somewhere around 50 percent,” Diorio said last year. “We were hoping for a larger turnout, but we certainly understand that parents and students have a right to opt out of these kinds of tests. We’re seeing a trend across the nation of parents and students exercising that right.”\r\n\r\nAccording to California Education Code §60615, parents are allowed to let their children opt out of California standardized tests, such as the Smarter Balanced test, if the school's main office receives a handwritten note of excuse from parents.\r\n\r\nThe goal of the Smarter Balanced Test is to measure the strength of a school’s curriculum, according Diorio. In a recent email sent to juniors and their parents, Diorio encouraged students to take the test.\r\n\r\n“While the results of the test will not be included on your transcript and will not be used in the college admission process, the results will be used to assess the quality of our school and its programs,” Diorio said.\r\n\r\nThere are several ramifications of a low participation rate, according to Diorio.\r\n\r\n“In order to maintain our excellent rankings and strong reputation, both locally and nationally, it’s important that we reach a 95 percent participation rate,” Diorio said.\r\n\r\nIn addition to impacting the school’s reputation, the tests can also help students, according to Diorio.\r\n\r\n“The results from the Smarter Balance tests may be used to satisfy eligibility requirements for the Gold State Seal Merit Diploma, State Seal of Biliteracy and California State University's Early Assessment Program,\" Diorio said.\r\n\r\nJunior Michelle Leong is opting out of the test because she feels that it would be a waste of time.\r\n\r\n“I do not want to take the Smarter Balanced test because I don’t want to be at school for two days taking a test that seems irrelevant and not worth my time,” Leong said.\r\n\r\nSenior Joseph Kao, who took the test last year, opted out after the first section of the exam.\r\n\r\n\"There was a section where they gave us two hours to finish a total of five questions, so it was kind of a waste of time,” Kao said. “It was also a stressful period during junior year and I had a lot of work to do so I just decided to opt out. I knew a lot of people who were against the Common Core as well so that gave a different perspective on the whole testing situation.\"\r\n\r\nHowever, some students are still taking the test because it is a low-stakes assessment for them.\r\n\r\n\"I feel bad for opting out of a test that could provide valuable information for future students, especially since I have a younger sibling,\" junior Alan Huang said. \"It's actually not that much time compared to how much time I waste usually and I don't have much homework due after AP [Advanced Placement] testing anyways.\"","excerpt":"The Palo Alto High School Administration aims to increase student attendance for the state-standardized Smarter Balanced test that juniors will take on Tuesday and Wednesday at Paly.\r\n\r\n","date":"2016-05-16 18:45:20","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Screen-Shot-2015-04-27-at-4.26.04-PM.png","categories":["News","Spotlight"],"tags":["admin","diorio","improve","palo alto high","paly","participation rate","smarter balance test"]},{"id":120434,"title":"Paly Voices: Marie Davis","permalink":"http:\/\/palyvoice.com\/2016\/05\/16\/paly-voices-marie-davis\/","content":"This is the first installment of the series \"Paly Voices,\" which showcases art by Palo Alto High School students. Sophomore Marie Davis shares her voice by singing \"More Than Words\" by Extreme.\r\n\r\nDavis grew up surrounded by family members with a passion for music.\r\n\r\n\"I started singing when I was young because my whole family played music,\" Davis said. \"I've always liked how it makes me feel happy and hopefully it makes others feel happy too,\" Davis said.\r\n\r\nIn addition to open mics hosted by the Teen Arts Council and Red Rock Cafe in Mountain View, Davis has performed at a variety of venues.\r\n\r\n\"When I was younger I lived in France where there were street music festivals once a year and me and my friend would play some songs downtown every year.\"\r\n\r\nIn the upcoming years, Davis looks to expand her music career.\r\n\r\n\"I've always wanted to start a band, so hopefully I can do that,\" Davis said. \"I'd also like to write more original [songs] if I have enough time.\"\r\n\r\n<iframe src=\"https:\/\/www.youtube.com\/embed\/AcAY86WQjVs\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Paly Voice presents its first video in the series \"Paly Voices,\" showcasing Palo Alto High School students' art. In this installment, sophomore Marie Davis sings \"More Than Words\" by Extreme.","date":"2016-05-16 14:25:11","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Screen-Shot-2016-05-12-at-10.50.26-AM.png","categories":["Features","Multimedia","Spotlight","Video"],"tags":["art","extreme","marie davis","more than words","sing","song"]},{"id":120542,"title":"Baseball steals SCVAL title with 7th inning rally","permalink":"http:\/\/palyvoice.com\/2016\/05\/15\/baseball-steals-scval-title-with-7th-inning-rally\/","content":"[caption id=\"attachment_120565\" align=\"alignnone\" width=\"650\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/SCVAL-champs.jpg\"><img src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/SCVAL-champs.jpg\" alt=\"Junior shortstop Ethan Stern looks to turn a double play during a regular season game against Los Gatos during a home league match. The Vikings defeated the Wildcats in the final game of a three-game series to secure the SCVAL title. Photo by Cooper Lou. \" width=\"650\" height=\"432\" class=\"size-full wp-image-120565\" \/><\/a> Junior shortstop Ethan Stern looks to turn a double play during a regular season game against Los Gatos. The Vikings defeated the Wildcats in the final game of a three game series to secure the SCVAL title. Photo by Cooper Lou. [\/caption]\r\nThe Palo Alto High School baseball team (23-5-1, 12-2) defeated the Los Gatos High School Wildcats (20-12, 13-1), 3-2, thanks to a three-run rally in the final inning of the Santa Clara Valley Athletic League championship game on Friday at Los Gatos.\r\n\r\nSophomore starting pitcher Jeremy Akioka held the Wildcats to just one run in five and one-third innings pitched, giving up his lone run in the third inning. Akioka said the team stayed strong despite trailing for most of the game.\r\n\r\n\"Our team did a great job of battling from behind and getting the hits when it mattered,\" Akioka said.\r\n\r\nDown 2-0, the Vikings were unable to score off Los Gatos' starting ace until the seventh and final inning where they sparked a three run rally.\r\n\r\nThis unlikely comeback started with a walk of senior Justin Hull, followed by a deep double off the right field wall by sophomore second baseman Max Jung-Goldberg. A pair of singles by seniors Alec Olmstead and Lawrence Han scored both Hull and Jung-Goldberg.\r\n\r\nThe Vikings finally took the lead off of a beautiful bunt by junior pinch-hitter Michael Champagne, which scored Olmstead from third.\r\n\r\nChampagne said the Vikings defense, specifically their pitching, enabled the offense to make a comeback late in the game and hopes the team can carry its momentum into the Central Coast Section playoffs.  \r\n\r\n\"Our pitching helped keep us in the game and we finally came alive in the 7th and had a great rally to take the lead,\" Champagne said. \"Niko Lillios provided a clutch closing inning to seal the victory. If our team can bottle that intensity we hope to have a far run in CCS.\"\r\n\r\nSophomore relief pitcher Niko Lillios sealed the game by forcing two flyouts and a strikeout.\r\n\r\nThe Vikings will move on to compete in the CCS playoffs in the coming weeks The game time, opponent, and location have not yet been decided.\r\n\r\nAccording to Akioka, the team looks to continue its hot streak into the next round.\r\n\r\n\"We're confident that we will be able to use our momentum to push far through CCS this year,\" Akioka said.\r\n\r\n","excerpt":"The Palo Alto High School baseball team (23-5-1, 12-2) defeated the Los Gatos High School Wildcats (20-12, 13-1) 3-2, thanks to a three-run rally in the final inning of the Santa Clara Valley Athletic League championship game on Friday at Los Gatos.","date":"2016-05-15 19:40:38","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/SCVAL-champs.jpg","categories":["Baseball","Sports","Spotlight","Uncategorized"],"tags":["Baseball","CCS","gatos","Jung-Goldberg","Lillios","niko","palo alto","rally","schoeben","scval","viking","win"]},{"id":119263,"title":"Coffee Chats: English teacher Mimi Park","permalink":"http:\/\/palyvoice.com\/2016\/05\/12\/coffee-chats-english-teacher-mimi-park\/","content":"[caption id=\"attachment_119592\" align=\"alignnone\" width=\"439\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/13081997_1018696691539752_124260599_n.jpg\"><img class=\" wp-image-119592\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/13081997_1018696691539752_124260599_n.jpg\" alt=\"English and Humanities teacher Mimi Park sits at her desk with an iced latte while discussing her career change. \" width=\"439\" height=\"439\" \/><\/a> English and Humanities teacher Mimi Park sits at her desk with an iced latte while discussing her transition from wanting to be a lawyer to becoming a teacher. Photo by Emilia Diaz-Magaloni[\/caption]\r\n\r\n<i><span style=\"font-weight: 400;\">This is the fourth installment of Coffee Chats, where The Paly Voice gets to know staff members over a cup of coffee.<\/span><\/i>\r\n\r\n<span style=\"font-weight: 400;\">The Paly Voice sat down with English and Humanities teacher Mimi Park over an iced latte to discuss her transition from prospective lawyer to teacher, and her advice for Paly students.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">This is Park’s fourth year teaching at Palo Alto High School. She teaches English 9 and English 9A, as well as Humanities. While Park loves teaching high school English, teaching was not her first passion.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I graduated from law school, but when I left law school I decided I really didn’t want to be a lawyer,” Park said. “I really loved English, which was my major, but when I spoke with my professors a few years later and said 'I’m thinking about becoming a professor,' they were like ‘Don’t do it! If you want to teach, go to public school, because there are no jobs in the humanities Ph.D. market.’” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Park took her professor’s advice and started looking at programs that would give her a teaching credential. She decided she wanted to move to California <\/span><span style=\"font-weight: 400;\">and ended up going to Stanford University's teacher education program.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“When I started looking for jobs there was an opening here at Paly. It was part time and I was like, 'I can't do that because I have to pay rent,'\" Park said. \"Incredibly fortuitously, a teacher soon after took a leave for a year and there were enough classes open that I could get nearly a full-time position. I was hired at Paly and have been here for the past four years.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Park explains that one of the major differences between being a lawyer and teaching high schoolers is who you are working for.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I was thinking of doing corporate law and my clients would have been gigantic corporations,\" Park said. \"I was so used to thinking about adults as my clients, and as a teacher, I had to readjust my thinking and start being more aware of the different issues surrounding public education, from the legal issues to policy to even the social-emotional aspects of the students.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Despite the difficult transition from lawyer to high school teacher, Park says that being open to changing careers taught her how to relate to Paly students. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I would say my biggest piece of advice is don't pigeonhole yourself; be open to changing your path or looking for new opportunities, and don’t be afraid to embrace them because it is really easy to get into the mindset of 'this is what I'm going to do and this is what I'm going to be,'” Park said. <\/span>\r\n\r\nPark recalls having spent all of her high school and college years preparing for pre-law. However, when she achieved her goal, she realized that being a lawyer just wasn't for her.\r\n\r\n<span style=\"font-weight: 400;\">“I planned to be a lawyer since 8th grade when people told me I talk too much and therefore I should be a lawyer,\" Park said. \"It was the scariest and biggest decision I've probably made in my life so far, to give up three years of education and a lot of money and not have a plan,\" Park said. \"I had a year where I had to think about what I wanted to do. It's terrifying, but I think that being really open to that is a super important thing.\"<\/span>\r\n\r\nAccording to Park switching to teaching was the best decision she's ever made.\r\n\r\n\"I love teaching, and I’m fortunate to be in a career when I’m actually excited about coming to work and happy about the work I do, versus dreading the day ahead,\" Park said.","excerpt":"The Paly Voice sat down with English and Humanities teacher Mimi Park over an iced latte to discuss her transition from prospective lawyer to teacher, and her advice for Paly students.","date":"2016-05-12 21:08:12","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/13081997_1018696691539752_124260599_n.jpg","categories":["Coffee chats","Features"],"tags":["coffeechats","english","Humanities","mimi park","palo alto","paly"]},{"id":120425,"title":"Liveblog: Baseball vs. Los Gatos in SCVAL elimination game","permalink":"http:\/\/palyvoice.com\/2016\/05\/12\/liveblog-baseball-vs-los-gatos-in-scval-elimination-game\/","content":"[caption id=\"attachment_120116\" align=\"alignnone\" width=\"450\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/baseball-beats-los-altos.jpg\"><img src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/baseball-beats-los-altos.jpg\" alt=\"Senior pitcher Alec Olmstead warms up with Senior catcher Lawrence Han before a regular season game against Los Gatos High School. Han has been a dependable plate general for the Vikings all season. Photo by Cooper Lou. \" width=\"450\" height=\"518\" class=\"size-full wp-image-120116\" \/><\/a> Senior pitcher Alec Olmstead warms up with Senior catcher Lawrence Han before a regular season game against Los Gatos High School. Han has been a dependable plate general for the Vikings all season. Photo by Cooper Lou. [\/caption]\r\nThe Palo Alto High School baseball team (21-5-1, 12-2) faces off against Los Gatos High School (20-10, 13-1) in a must win Santa Clara Valley Athletic League playoff game at 4:30 p.m. Tuesday at home. The Vikings fell to Los Gatos in the first match of the two game series. \r\n\r\n[liveblog] ","excerpt":"The Palo Alto High School baseball team (21-5-1, 12-2) faces off against Los Gatos High School (20-10, 13-1) in a must win Santa Clara Valley Athletic League playoff game at 4:30 p.m. Tuesday at home.","date":"2016-05-12 10:47:02","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/baseball-for-los-altos-story-1.jpg","categories":["Baseball","Spotlight","Uncategorized"],"tags":["Baseball","los gatos","palo alto"]},{"id":120386,"title":"Boys&#8217; golf qualifies for CCS Championship","permalink":"http:\/\/palyvoice.com\/2016\/05\/11\/boys-golf-qualifies-for-ccs-championship\/","content":"[caption id=\"attachment_120403\" align=\"alignnone\" width=\"619\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/13184547_1720898391485755_1901.jpg\"><img class=\" wp-image-120403\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/13184547_1720898391485755_1901.jpg\" alt=\"Junior Timothy Liu tees off at a match against Los Altos during the regular season. Photo by Cooper Lou \" width=\"619\" height=\"414\" \/><\/a> Junior Timothy Liu tees off at a match against Los Altos High School during the regular season. Photo by Cooper Lou.[\/caption]\r\n\r\nTop members of the Palo Alto High School boys' golf team dominated their competition at the Central Coast Section regionals on Tuesday in Carmel Valley, allowing them to qualify for the CCS final.\r\n\r\nAccording to head coach Doyle Knight, the team shot 367, only 12 over par, securing the victory for the Vikings.\r\n\r\nThe Vikings have yet to lose a match all season, as they head into the final.\r\n\r\nAccording to sophomore Ahmed Ali, the team is looking forward to CCS and possibly beyond.\r\n\r\n\"The depth on our team is great and we are really looking forward to trying to advance to NorCal,\" Ali said.\r\n\r\nDespite winning the game, Ali says that the team has the ability to play at an even higher level.\r\n\r\n\"Individually I think each one of us could've played a little better, [this] is great because we won CCS [regionals] without all of our A games,\" Ali said.\r\n\r\nThe team will compete in the CCS finals next Tuesday again at Rancho Canada Golf Club in Carmel Valley.","excerpt":"Top members of the Palo Alto high school boys' golf team dominated the competition at the Central Coast Section regionals on Tuesday in Monterey, allowing them to qualify for the CCS final.\r\n","date":"2016-05-11 21:20:53","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/13184547_1720898391485755_1901.jpg","categories":["Golf","Sports","Spotlight"],"tags":["ahmed ali","Boys","CCS","Golf"]}]