[{"id":118413,"title":"Ohlone teacher expected to enter plea Monday","permalink":"http:\/\/palyvoice.com\/2016\/04\/11\/ohlone-teacher-expected-to-enter-plea-monday\/","content":"An Ohlone Elementary School teacher on unpaid compulsory leave is expected to enter a plea 9 a.m. Monday, April 18 at the Palo Alto Courthouse after postponing his arraignment in a case involving charges of child sexual abuse.\r\n\r\nIn a court presided over by Judge Kenneth P. Barnum on <a href=\"http:\/\/palyvoice.com\/2016\/02\/15\/ohlone-teacher-to-appear-in-court-tuesday\/\" target=\"_blank\">Feb. 16<\/a>, defendant Michael Christopher Airo waived his right to a speedy trial and delayed his arraignment by 30 days. He verbally agreed to a <a href=\"http:\/\/www.scscourt.org\/self_help\/restraining\/crim_ro.shtml\" target=\"_blank\">no contact order<\/a> which mandates that he cannot come within 300 yards of the alleged victim.\r\n\r\nOn March 21 before Judge Rene Navarro, Airo appeared briefly at the stand to waive time for another 30 days and to set the date for his next appearance.\r\n\r\nThe arraignment will include a reading of charges against Airo. Subsequently, Airo is anticipated to enter a plea of guilty, not guilty or as otherwise permitted by the law, as per the common procedure of an arraignment. In a typical criminal proceeding, a preliminary hearing follows arraignment and determines if there is enough evidence to go to trial.\r\n\r\nAiro is charged with one count of continual sexual abuse of a child and three counts of lewd and lascivious acts on a child, according to a Jan. 15 <a href=\"http:\/\/www.cityofpaloalto.org\/civica\/press\/display.asp?layout=1&amp;Entry=1393\">press release<\/a> from the Palo Alto Police Department and a full police report by Officer Joel Hornung.","excerpt":"An Ohlone Elementary School teacher on unpaid compulsory leave is expected to enter a plea 9 a.m. Monday, April 18 at the Palo Alto Courthouse after postponing his arraignment in a case involving charges of child sexual abuse.","date":"2016-04-11 19:21:47","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/IMG_3324.jpg","categories":["News","Spotlight"],"tags":["airo","court","lewd and lascivious acts","michael christopher","ohlone elementary school","palo alto courthouse","plea","santa clara county superior court","sexual abuse of child","speedy trial","waive time"]},{"id":118763,"title":"Science Olympiad wins regional competition, heading to States","permalink":"http:\/\/palyvoice.com\/2016\/04\/03\/science-olympiad-wins-regional-competition-heading-to-states\/","content":"[caption id=\"attachment_118830\" align=\"alignnone\" width=\"527\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/12903484_546740605495972_1185575781_o1.jpeg\"><img class=\"wp-image-118830\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/12903484_546740605495972_1185575781_o1.jpeg\" alt=\"\" width=\"527\" height=\"360\" \/><\/a> Green Team members celebrate after winning the Santa Clara Regional Science Olympiad competition. The competition this year was extremely close and tough, according to green team member sophomore Celine Wang. \"I think this made us realize that there are other teams in regionals that are definitely capable of threatening us,\" Wang said. Photo: Celine Wang[\/caption]\r\n\r\nPalo Alto High School’s Science Olympiad team looks to win the North California Science Olympiad State competition after taking first at the <a href=\"http:\/\/palyvoice.com\/2016\/03\/16\/science-olympiad-prepares-for-regional-tournament\/\">Santa Clara Regional Science Olympiad competition<\/a> on March 19 in San Jose.\r\n\r\nThis first place win continues a seven-year streak, according to sophomore Chloe Hong.  With this win, Paly’s SciOly team will be advancing to the state competition on April 16 in Turlock to compete for a place at Science Olympiad National Tournament.\r\n\r\nThis year, the team won by a margin of seven points, according to Hong, a member of Paly's green team. The SciOly competition is split into two teams, green team, which is akin to a varsity team, and white team, or the junior varsity team.  This slim margin came as a surprise to the team, who in the past, had been the undisputed winner of regionals.\r\n\r\n“It is not that we got worse, per se, it is just that the other teams have been working harder,” SciOly adviser Ron Bowditch said. “We can see that the competition has gotten much more intense.”\r\n\r\nAccording to senior team captain James Wang, there were some complications during some events.\r\n\r\n“During the competition, someone stepped on one of our engineering builds and there was a mishap that almost disqualified us in an event,” Wang said. “Our team remained supportive and optimistic.”\r\n\r\nThe team plans to take this close win as a wake up call and continue studying and preparing for states\r\n\r\n“We will just prepare as we usually do,” Hong said. “But now we are a lot more aware of the competition we have to face, and we will have to work harder.”\r\n\r\nBowditch echoes these sentiments, stating that competition at States will be extremely tough and competitive.\r\n\r\nFor the past few years, Paly SciOly has finished second at states, each time placing after Mira Loma High School from Sacramento. According to Hong, the only time Paly received first at states was in 2013, breaking Paly’s three-year streak of second-place wins. At <a href=\"http:\/\/palyvoice.com\/2013\/05\/21\/paly-scioly-team-makes-impressive-debut-at-nationals\/\">Nationals<\/a>, the team went on to place 16th out of 60 teams.\r\n\r\nHowever, team members do not think that this close call at the regional competition will affect the way the club is run.\r\n\r\n“We do not want our club to become inorganic and rigidly structured, because at the core we are still a 100% student-run and student-established club,” Hong said. “As always we are a community and we will always have fun.”","excerpt":"Palo Alto High School’s Science Olympiad team looks to win the North California Science Olympiad State competition after taking first at the Santa Clara Regional Science Olympiad competition on March 19 in San Jose.","date":"2016-04-03 19:18:57","author":"Julia Qiao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/12903484_546740605495972_1185575781_o.jpeg","categories":["News","Spotlight"],"tags":["Bowditch","chloe hong","competition","james wang","nationals","Olympiad","paly scioly","regional","santa clara regionals","science","Science Olympiad National Tournament","state"]},{"id":118792,"title":"Boys&#8217; tennis loses to cross-town rival Gunn","permalink":"http:\/\/palyvoice.com\/2016\/04\/02\/boys-tennis-loses-to-cross-town-rival-gunn\/","content":"[caption id=\"attachment_118794\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/2016-03-31-05.10.29.jpg\"><img class=\" wp-image-118794\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/2016-03-31-05.10.29.jpg\" alt=\"Junior Henry Badger serves while junior Jerry Hong prepares for the return. Badger and Hong lost their match in two close sets. \" width=\"600\" height=\"413\" \/><\/a> Junior Henry Badger serves while junior Jerry Hong prepares for the return during the Vikings' match Thursday against the Titans at Gunn High School. Badger and Hong lost their match in two close sets. Photo by Chirag Akella.[\/caption]\r\n\r\nThe Palo Alto High School boys’ tennis team fell to cross-town rivals Gunn High School, 5-2, in a De Anza league match on Thursday at Gunn.\r\n\r\nThe Vikings were unable to take advantage of three-set wins by senior Shiv Matta and junior Adrian Smith, losing by the same score as they did earlier in the season.\r\n\r\nHead coach Andy Harader said that the team was missing a few key players, including senior Carl Goodfriend, which contributed to the loss.\r\n\r\n“It was a little disappointing in that respect because I thought that we had a real chance to pull it off,\" Harader said. “We had a couple guys who were not around because of Spring Break, but I still thought that we might be able to win it.”\r\n\r\nHarader said that absences have been a theme throughout the season and something that the team has struggled to deal with.\r\n\r\n“We have had a lot of guys out with injuries and sickness and it has been hard to gain any consistency,” Harader said.\r\n\r\nDespite the loss, senior captain Shiv Matta felt that the team showed some fight against a good team.\r\n\r\n“It was a tough match and the guys battled hard so that was good to see,\" Matta said. “Despite the loss, the encouraging thing was that everyone competed hard.”\r\n\r\nThe team has already clinched a spot in next year’s De Anza league, an achievement that both the coach and players are excited about.\r\n\r\n“We have stayed up in the league because we got three wins in our league already, which we feel very good about,” Harader said. “So we have already achieved that goal for the season.”\r\n\r\nJunior Noah Galper echoed his coach’s positive sentiments.\r\n\r\n“We're really happy about that because that means we get to play good tennis all through next year,” Galper said. “Dropping down would mean that we would win a lot more, but the tennis would not be as good.”\r\n\r\nDespite not making the Central Coast Section playoffs this year, junior Henry Badger expects the team to continue to improve in order to compete next year.\r\n\r\n“In the upcoming weeks, we are going to work on keeping up the work so we can pull out more wins in the future,” Badger said. “We will not be making CCS unfortunately, but I hope that whoever is chosen for SCVALS [Santa Clara Valley Athletic League] will perform well for Paly and show other schools that we will be much better next year.”\r\n\r\nThe Vikings' next match is against Saratoga High School at 3:30 p.m. on April 12 at Saratoga.","excerpt":"The Palo Alto High School boys’ tennis team fell to cross-town rivals Gunn High School, 5-2, in a De Anza league match on Thursday at Gunn.","date":"2016-04-02 10:54:06","author":"Chirag Akella","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/2016-03-31-05.10.29.jpg","categories":["Sports"],"tags":["andy harader","boys tennis","de anza league","gunn","henry badger","jerry hong","palo alto high school","paly","shiv matta","tennis"]},{"id":118768,"title":"News in Review: March 2016","permalink":"http:\/\/palyvoice.com\/2016\/03\/31\/news-in-review-march-2016\/","content":"<em>This installment of the News in Review series summarizes the most important news stories and events from the month of March in a timeline format.<\/em>\r\n\r\n<iframe src=\"https:\/\/cdn.knightlab.com\/libs\/timeline3\/latest\/embed\/index.html?source=1mnroZNo1cSJ5Z32XWLkpW16L4_JPbSEOwuBG9BJ-wFY&amp;font=Default&amp;lang=en&amp;initial_zoom=2&amp;height=650\" width=\"100%\" height=\"650\" frameborder=\"0\"><\/iframe>","excerpt":"This installment of the News in Review series summarizes the most important news stories and events from the month of March in a timeline format.","date":"2016-03-31 21:25:35","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/news-in-review-march-2016.png","categories":["Multimedia","Spotlight"],"tags":["2016","admin","ASB","board","career","cheerleading","debate","donation","gunn","in","march","month","news","night","pranks","rally","review","School","science","seniors","TEDx"]},{"id":118506,"title":"Dance team triumphs at national competition","permalink":"http:\/\/palyvoice.com\/2016\/03\/31\/dance-team-triumphs-at-national-competition\/","content":"[caption id=\"attachment_118568\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/Dance.jpg\"><img class=\" wp-image-118568\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/Dance.jpg\" alt=\"Photo by Nathalia Castillo.\" width=\"600\" height=\"375\" \/><\/a> After a five-year absence from the United Spirits Association national competition, the Palo Alto High School dance team placed first in the Extra Small Dance category and recieved the judges' award of excellence. Photo by Nathalia Castillo.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto High School dance team triumphed at <\/span><span style=\"font-weight: 400;\">the United Spirits Association national competition this weekend, clinching first place in the Lyrical Extra Small Dance category in Anaheim, California.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to junior Nathalia Castillo, it has been five years since the Paly dance team last went to the national competition and the first time competing in five categories. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It wasn't our first time competing at nationals, but the last time we went was almost 5 years ago,” Castillo said. “We competed in five different categories: jazz, hip hop,<\/span><span style=\"font-weight: 400;\"> lyrical with small dance, team lyrical and character dance.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to senior Catherine Yu, the team was very proud of placing in its first year back.<\/span>\r\n\r\n“This was the first year in a while that the dance team competed so going to nationals and placing first in the Lyrical Small Dance category was a huge success,” Yu said. “I feel incredibly proud of our team, especially because we definitely went into the competition feeling like the underdog and not expecting to win anything.”\r\n\r\n<span style=\"font-weight: 400;\">Nevertheless, the team faced complications in other categories due to changes in the rules.<\/span>\r\n\r\n“Unfortunately, we didn't do as well in other categories because of some complications with rules,” Yu said. “However, competing in five different categories qualified us to win the judges' award of excellence, which is only given to three teams out of the entire competition.”\r\n\r\n<span style=\"font-weight: 400;\">The merits at the tournament did not come without preparation, according to Yu. Dance members dedicated large portions of their time to get ready for the competition.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We practiced four times a week after school, just running through the dances and cleaning them,” Yu said. “We actually learned all of our dances the week of regionals and were still making changes to choreography the week of nationals. It was a creative process the entire time.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Although the team will not participate in another competition until the next school year, senior Emma Sternfield hopes the team will continue to improve year after year. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“As a senior, I’m passing the baton down but I hope the team will become better and better,” Sternfield said. “I’m extremely proud of the team and what we have achieved and could not have asked for a better ending.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">As for next season, Sternfield anticipates another appearance at nationals. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I’m not sure about the plans for next year but hopefully the team competes at nationals again,” Sternfield said. “I think the team has what it takes to do well and I’m excited to see where they go.”<\/span>\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School dance team triumphs at the United Spirits Association national competition this weekend clinching first place in the country in the lyrical dance category in Anaheim, California.","date":"2016-03-31 11:00:20","author":"Ethan Kao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/Dance.jpg","categories":["News"],"tags":["dance team","nationals","paly"]},{"id":118740,"title":"ASB to hold special elections for vacant positions","permalink":"http:\/\/palyvoice.com\/2016\/03\/30\/asb-to-hold-special-elections-for-vacant-positions\/","content":"Palo Alto High School students will be able to digitally vote in special elections for vacant Associated Student Body positions on April 14 and 15.\r\n\r\nApplications for  positions of ASB Treasurer and Junior Class Vice President, identical to those of the regular election, were released March 28 and will be accepted until 3:30 p.m. on Thursday March 31, according to Student Activities Director Matthew Hall.\r\n\r\n“I had already had some [students] email me, but they weren’t allowed to get in on the regular election because ostensibly they didn’t make the original deadline,” Hall said.\r\n\r\nAccording to Hall, candidate statements and speeches will be recorded April 11 and 12 and released along with their photos.\r\n\r\n“They [special election candidates] probably won’t even be putting up posters, we’re just going to do it digitally and find out who wins,” Hall said. “We have to fill those positions [ASB Treasurer and Junior Vice President] prior to interviews for appointed positions.”\r\n\r\nSpecial elections are a rare occurrence and the system for special elections was created in the ASB 2012-13 election, according to Hall.\r\n\r\n“Special elections are only used when we have positions for which nobody originally ran,\" Hall said. \"That precedent goes back to [the election of] 2012 to 2013 when the ASB Vice Presidential position was unfilled,” Hall said.","excerpt":"Digital voting for Palo Alto High School Associated Student Body's special elections for the vacant positions of ASB Treasurer and Junior Class Vice President will be available April 14 and 15.","date":"2016-03-30 21:33:43","author":"Zahra Muzaffar","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/0000\/00\/matt.jpg","categories":["News"],"tags":["ASB","ASB elections","Associated Student Body","hall","matt","palo alto high school","paly","special elections","Student activities director"]},{"id":118640,"title":"Liveblog: Baseball vs. Los Altos","permalink":"http:\/\/palyvoice.com\/2016\/03\/30\/liveblog-baseball-vs-los-altos\/","content":"Check back in at 4 p.m. as the Palo Alto High School baseball team (11-1-1, 6-0) looks to continue an undefeated league season against Los Altos High School (8-6, 3-3) at home.\r\n\r\n[liveblog]","excerpt":"The Palo Alto High School baseball team (11-1-1, 6-0) looks to continue an undefeated league season against Los Altos High School (8-6, 3-3) 4 p.m Wednesday at home. ","date":"2016-03-30 14:23:05","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/MG_32931.jpg","categories":["Baseball","Sports"],"tags":[]},{"id":118608,"title":"First Paly vs. Gunn night rally debuts, ASB looks to start tradition","permalink":"http:\/\/palyvoice.com\/2016\/03\/30\/first-paly-vs-gunn-night-rally-debuts-asb-looks-to-start-tradition\/","content":"[caption id=\"attachment_118609\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/IMG_0024.jpg\"><img class=\"size-full wp-image-118609\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/IMG_0024.jpg\" alt=\"Paly dance team members (left to right) junior Nathalia Castillo, senior Melanie Guan and senior Emma Sternfield perform in a collaboration between the Paly and Gunn dance teams at the first ever Paly vs. Gunn night rally on Thursday at Gunn. Photo by Emma van der Veen.\" width=\"600\" height=\"400\" \/><\/a> Palo Alto High School dance team members (left to right) junior Nathalia Castillo, seniors Melanie Guan and Emma Sternfield perform in a collaboration with the Paly and Gunn High School dance teams at the first ever Paly vs. Gunn night rally on Thursday at Gunn. Photo by Emma van der Veen.[\/caption]\r\n\r\nThe Palo Alto High School Associated Student Body and Gunn High School Student Executive Council are looking forward to making the Paly vs. Gunn night rally an annual tradition after the inaugural event on Thursday at the Titan Gym.\r\n\r\n<span style=\"line-height: 1.5;\">According to Paly Student Activities Director Matt Hall, the event was a success, especially considering all other concurrent events at both schools.<\/span>\r\n\r\n“It was just about what we wanted,” Hall said. “Certainly, we would have liked better attendance, but it was solid for a first time [rally], on a Thursday, with 14 different other events happening at both schools. We have started a new tradition, and next year it will be even better.”\r\n\r\nThe rally events included an obstacle course competition and a staff versus student volleyball game. There were also performances by the Gunn dance team, Gunn cheer team, Paly dance and cheer teams and a collaboration dance.\r\n\r\n“The obstacle course was the most hyped up and people were shouting and screaming,” senior ASB Secretary Joseph Kao said.\r\n\r\n[caption id=\"attachment_118616\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/IMG_0074.jpg\"><img class=\"size-full wp-image-118616\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/IMG_0074.jpg\" alt=\"Junior Skylar Burris attempts to eat a donut in the obstacle course competition as part of the Paly upperclassmen team. Photo by Emma van der Veen.\" width=\"600\" height=\"400\" \/><\/a> Junior Skylar Burris attempts to eat a donut in the obstacle course competition as part of the Paly upperclassmen team. Photo by Emma van der Veen.[\/caption]\r\n\r\nIn the obstacle course, the schools were divided into four teams: the upper and underclassmen of each school. Paly underclassmen won first place, followed by Gunn upperclassmen, Paly upperclassmen and Gunn underclassmen. The course consisted of tag team action in separate sections: the egg carry, toilet paper unroll, frisbee throw, 3-point contest, donut-on-a-string eating and the 3-legged race. According to junior Peter Snodgrass, who participated in the frisbee portion of the Paly upperclassmen team, the Vikings faced some challenges in the first rounds, but adapted later on.\r\n\r\n“We had a rough start, but we pushed through the adversity that we faced,” Snodgrass said. “We came together as a team and got the job done and did very well.”\r\n\r\nAccording to senior Gunn SEC member Grace Park, the student versus staff volleyball game united the students across the district, despite the students losing the game 15-13.\r\n\r\n“Next year we’re going to do a lot more to hype it up,” Park said. “Having Paly here and all of the staff, there was a huge motivation to show come out and unite, especially in the common goal [of Paly and Gunn] to beat the staff.”\r\n\r\nJunior Class Vice President Natalie Maloney is excited at the prospect of future joint rallies with a greater amount of participation.\r\n\r\n“We [Paly ASB and Gunn SEC] were super excited to host the first ever Gunn-Paly rally,” Maloney said. “It was a lot of fun. I was hoping that more people would show up, but I understand that people had tests and homework they had to do. Next year, we will hopefully have it on a Friday night so we can get a better turnout.”","excerpt":"The Palo Alto High School Associated Student Body and Gunn High School Student Executive Council are looking forward to making the Paly vs. Gunn night rally an annual tradition after the inaugural event on Thursday at the Titan Gym.","date":"2016-03-30 09:09:11","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/IMG_0074.jpg","categories":["News"],"tags":["ASB","Associated Student Body","cheer","dance","gunn","hall","Kao","maloney","night rally","obstacle course","paly","paly vs gunn","park","rally","sec","snodgrass","student executive council","underclassmen","upperclassmen"]},{"id":117452,"title":"TeamLAB: A spellbinding blend of art and technology","permalink":"http:\/\/palyvoice.com\/2016\/03\/29\/teamlab-an-spellbinding-blend-of-art-and-technology\/","content":"The teamLab exhibit at the Pace Gallery in Menlo Park, open from Feb. 6 to July 1, features a blend of art and technology that encapsulates the Silicon Valley atmosphere of innovation. Rooted in traditional Japanese art, the exhibition highlights how technology can enhance art instead of replace it.\r\n\r\n<iframe style=\"border: none;\" src=\"https:\/\/social.shorthand.com\/thepalyvoice\/embed\/3gVMXbHdaf\" width=\"100%\" height=\"500px\"><\/iframe>","excerpt":"The teamLab exhibit at the Pace Gallery in Menlo Park, open from Feb. 6 to July 1, features a blend of art and technology that encapsulates the Silicon Valley atmosphere of innovation. Rooted in traditional Japanese art, the exhibition highlights how technology can enhance art instead of replace it. ","date":"2016-03-29 11:07:14","author":"Emilia Diaz-Magaloni","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/unspecified.jpg","categories":["Features","Spotlight"],"tags":["art","art exhibit","menlo park","PACE","palo alto high school","technology"]},{"id":117968,"title":"You are so not OCD: The truth behind the colloquialism","permalink":"http:\/\/palyvoice.com\/2016\/03\/28\/you-are-so-not-ocd-the-truth-behind-the-colloquialism\/","content":"[caption id=\"attachment_118591\" align=\"alignnone\" width=\"541\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/ocd.jpg\"><img class=\"wp-image-118591\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/ocd.jpg\" alt=\"Illustration by Portia Barrientos.\" width=\"541\" height=\"408\" \/><\/a> A student struggles to keep up with a teacher's lecture, not because the concepts are difficult to grasp, but rather because his intrusive obsessions halt his ability to focus. Illustration by Portia Barrientos.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Envision sitting in your history class and taking notes on your teacher’s PowerPoint lecture on India. As you copy down the word ‘Buddhism,’ you notice that the ‘h’ is slanted. Compulsively, you erase the word and rewrite it, only to erase it again because now the ‘d’ is smudged. Soon, your brain repeats the word ‘Buddhism’ over and over, and you find that you are unable to pay attention to the lecture. As this all transpires, you come to realize that not only have you missed the remainder of the Buddhism slide, but the following slide as well. For sophomore Darrow Hornik, these nettlesome compulsions are a result of obsessive-compulsive disorder.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“My OCD really depends on how my day is going; if I am more stressed out, my OCD is worse,” Hornik said. “When I am in a happier mood I don’t get it as much, and writing becomes a lot easier, as I am not as affected by the symptoms. <span style=\"font-weight: 400;\">The whole OCD stereotype where everything has to be <\/span><span style=\"font-weight: 400;\">super neat — that is a part of it, and I do get that as well, but there are multiple other symptoms.\"<\/span><\/span>\r\n\r\n<span style=\"font-weight: 400;\">Hornik has publicly expressed her personal journey as a student with OCD. Her talk titled \"Where are you going?\" was part of TEDx Palo Alto High School's third annual conference on March 26. Despite recent examples of online public discussion pertaining to mental illness, with Gunn High School's student newspaper The Oracle publishing a <a href=\"http:\/\/gunnoracle.com\/category\/changing-the-narrative\/\">Changing the Narrative<\/a> series aimed to spread personal stories and a <a href=\"http:\/\/paloaltoonline.com\/print\/story\/2016\/03\/18\/guest-opinion-unmasking-the-truth-beyond-the-stigma-of-mental-illness#.VuwTrFwPVBo.facebook\">guest column<\/a> on Palo Alto Online, many continue to misconceive the terms and phrases often used in casual conversation.\r\n<\/span>\r\n\r\n<b>What is OCD?<\/b>\r\n\r\n<span style=\"font-weight: 400;\">According to Lorrin Koran, M.D., a Stanford University professor of Psychiatry and Behavioral Sciences, obsessive-compulsive disorder is characterized by the presence of obsessions — anxiety-inducing thoughts, images or urges that a person finds difficult to dismiss from his or her mind. The obsessions lead to compulsions — behaviors that are designed to either reduce the anxiety associated with the obsession, or prevent a detrimental outcome if the person does not follow his or her obsession. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“A person with OCD might be afraid that if she leaves her house and does not check the stove, there will be a fire while she is gone, leaving her responsible,” Koran explains. “Consequently, she will check every knob on the stove. Then, she may think that she did not check correctly, so she checks them again. She might spend five or 10 minutes checking the knobs on the stove to make sure they are off before feeling comfortable leaving the house. The obsession is the possibility of a fire and she will be responsible, while the compulsion is frequently checking the knobs.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Koran, OCD affects 1 percent to 2 percent of the population. One out of every three patients is diagnosed with OCD between the ages of three and 15; a third of the time the diagnosis occurs between 15 and 25, and the final third of diagnoses occur between 25 and 35 years old. The brain of a patient with the disorder clearly showcases physical changes.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“OCD from a psychiatric standpoint is a mental disorder in which there is a chemical imbalance within the brains of those diagnosed,” Koran said. “It’s a disorder rather than a disease because diseases are things we know the cause of. Disorders are pathological conditions that we don’t know the cause of and an illness is a disease or disorder as experienced by the patient.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Although a definitive cause for obsessions has not been found, research has shown that its presence is related to genetics. However, exposure to particular environments can, at times, also cause OCD. According to Koran, manganese miners have been known to develop the disorder and occasionally, children who have had a strep infection suddenly develop OCD a few weeks later.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Koran, modern medicine has found two treatments to be most effective: a class of medicine known as selective serotonin reuptake inhibitors and psychotherapy in the form of exposure and response prevention. Not all patients benefit from the prescribed methods of treatment, as 40 percent of those diagnosed will not improve after a first trial of SSRI medications; however, many of those failing to respond to initial treatment benefit from a second or third trial.<\/span>\r\n\r\n<b>The societal issue, defined <\/b>\r\n\r\n<span style=\"font-weight: 400;\">‘I’m so OCD’ has become all too familiar of a phrase, ingrained in speech to justify moments in which one feels the need to perform an action in a certain way. Consider Buzzfeed, a social news and entertainment company that frequently amasses views through articles such as “<\/span><a href=\"http:\/\/www.buzzfeed.com\/peggy\/33-meticulous-cleaning-tricks-for-the-ocd-person-i#.id77mYJzJ\"><span style=\"font-weight: 400;\">33 Meticulous Cleaning Tricks For The OCD Person Inside You<\/span><\/a><span style=\"font-weight: 400;\">” and “<\/span><a href=\"http:\/\/www.buzzfeed.com\/samir\/things-that-will-drive-your-ocd-self-insane#.qyw7xrMqm\"><span style=\"font-weight: 400;\">19 Things That Will Drive Your OCD Self Insane<\/span><\/a><span style=\"font-weight: 400;\">” or the numerous hashtags that have emerged: #ObsessiveChristmasDisorder and #ObsessiveCrossfitDisorder. People have learned to use the disorder as a colloquialism. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Not only do such articles trivialize OCD and its effects, but they equate everyday “obsessions” with the disorder. Because “obsessive” is a personality trait and does not impair functioning, the mental disorder is being mixed with a personality preference.<\/span> <span style=\"font-weight: 400;\">Knowing every lyric to “Hotline Bling” within days of its release is not remotely similar to the irrational need to flip a light switch an even number of times before exiting a room in order to prevent something bad from happening to a loved one. When ‘being so OCD’ is correlated with words such as ‘neat’, ‘picky’ and ‘organized’, it strips the serious mental illness of its harsh reality.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The thing is, everybody assumes that people with OCD are neat freaks or germaphobes,” Hornik said. “That isn’t true. Sure, it’s a fragment of OCD, but it is wrong to characterize that as the entire disorder. The average person is aware of and recognizes the term OCD; however, I don’t think they know what OCD is and its detrimental effects it can have on a person’s life.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The misuse of the term ‘OCD’ leads to misunderstandings revolving around the mental disorder itself. In fact, when people use OCD to describe themselves, they are also forgetting OCD is not an adjective and that a person cannot <\/span><b><i>be<\/i><\/b><span style=\"font-weight: 400;\"> OCD, but rather a person <\/span><b><i>has <\/i><\/b><span style=\"font-weight: 400;\">OCD.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“If you ask somebody ‘Have you heard of OCD?,’ they would say ‘Of course I have,’” Hornik said. “However, most are probably not aware that OCD is actually a chemical imbalance in your brain.”<\/span>\r\n\r\n<b>Delving further into the issue<\/b>\r\n\r\n<span style=\"font-weight: 400;\">But why does society consider it inappropriate and abnormal to say, “I am so cancer,” while accepting the analogous statements when “cancer” is replaced with “OCD,\" “depressed\" or even \"retarded\"? The answer? The stigma around mental illnesses. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to <\/span><a href=\"http:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC1489832\/\"><span style=\"font-weight: 400;\">World Psychiatry<\/span><\/a><span style=\"font-weight: 400;\">, which describes itself as the leading informational center devoted to the diagnosis, prevention, study and treatment of mental disorders, a majority of people hold negative attitudes and stereotypes about diagnosed patients. These people go through life hearing stereotypes such as ‘people with mental illnesses are scary and violent.’ As a result, people diagnosed with a mental disorder may be denied opportunities in everyday life, including jobs, housing and health care.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I don’t think that anyone should be ashamed to have a mental illness,” Hornik said. “The stigma that is created around mental illnesses is affecting so many people’s lives.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Jonathan Frecceri, Paly’s Mental Health and Wellness Coordinator, expanded upon the notion that a significant distinction has developed between physical and mental health, when in reality the two are equally important.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Physical health and mental health are all apart of overall health,” Frecceri said. “We live in a society where there is still kind of a taboo around mental illnesses, which is kind of absurd because the brain is a physical part of the body and that’s where mental illnesses live. However, we are making progress and the first step is to really raise awareness.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Hornik, who has been ashamed to tell her friends that she routinely visits a therapist, stresses her experiences with the negative stigma around the disorder.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“During Tutorial, I have to go see my therapist,” Hornik said. “I was dealing with the stigma around mental illnesses because I was sort of embarrassed to go see a therapist and leave every single Tutorial. My friends would ask me, ‘Where are you going?,’ and I would say, ‘I’m going to the doctor,’ rather than say, ‘I’m going to the therapist to treat my mental illness.’”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Frecceri emphasized that a way to end the negative stigma surrounding mental illnesses is for individuals to be aware of the language they use and its effects on diagnosed patients.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I think it’s an opportunity for all of us, as a part of a community to continue to educate people, not to shame people, but to acknowledge that there are people who suffer from something very real and such phrases should not be used loosely,” Frecceri said. “I think the problem is for individuals that do have a diagnosis, it [colloquial use of the illness] can feel very pejorative, that it’s being used at their expense, even if it’s not being used against them.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Since only 1 percent to 2 percent of the population suffer from OCD, understanding the complexity of the disorder can help foster a community of support and stop individuals from suffering in silence.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“When it is a mental illness like OCD, people think that you are being overly dramatic and that you can stop your brain from thinking constantly,” Hornik explains. “Why is it not acceptable for me to take medicine for a chemical imbalance in my brain, <\/span><span style=\"font-weight: 400;\">when it is acceptable to take insulin for Diabetes, which is caused by a chemical imbalance in your pancreas<\/span><span style=\"font-weight: 400;\">?\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">So the next time your impulse is to say that you are ‘so OCD’ about something, or hop on the bandwagon that is the newest social media trend, remember that #YouAreSoNotOCD. <\/span>","excerpt":"‘I am so OCD’ has become too familiar of a phrase, ingrained in speech to justify moments in which one feels the need to perform an action in a certain way; but this has stripped the serious mental illness of its harsh reality.  ","date":"2016-03-28 21:04:20","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/ocd.jpg","categories":["Opinion","Spotlight"],"tags":["buzzfeed","compulsions","darrow","Frecceri","hornik","jonathan","koran","lorrin","mental health","obsessions","obsessive compulsive disorder","ocd","palo alto high school","paly","stigma"]}]