[{"id":116014,"title":"Third annual Paly Student Film Festival is on Friday, Feb. 19","permalink":"http:\/\/palyvoice.com\/2016\/02\/08\/third-annual-paly-student-film-festival-is-on-friday-feb-19\/","content":"","excerpt":"","date":"2016-02-08 18:20:29","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":116012,"title":"Deadline for Camp Unity is this Friday, Feb. 12","permalink":"http:\/\/palyvoice.com\/2016\/02\/08\/deadline-for-camp-unity-is-this-friday-feb-12\/","content":"","excerpt":"","date":"2016-02-08 18:19:46","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":116010,"title":"Social Justice Pathway information night is at 7 p.m. on Tuesday, Feb. 9 in the Media Arts Center","permalink":"http:\/\/palyvoice.com\/2016\/02\/08\/social-justice-pathway-information-night-is-at-7-p-m-on-tuesday-feb-9-in-the-media-arts-center\/","content":"","excerpt":"","date":"2016-02-08 18:18:18","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":115750,"title":"Library aims to streamline research with new tool","permalink":"http:\/\/palyvoice.com\/2016\/02\/08\/library-aims-to-streamline-research-with-new-tool\/","content":"[caption id=\"attachment_115752\" align=\"aligncenter\" width=\"530\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/photo.jpg\"><img class=\"wp-image-115752\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/photo.jpg\" alt=\"photo\" width=\"530\" height=\"397\" \/><\/a> Palo Alto High School librarian Rachel Kellerman demonstrates the library's new One Search Discovery program that aggregates most of the library's research resources into one database. Photo by William Zhou.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">In an effort to streamline research, the Palo Alto High School Library recently purchased its new<a href=\"http:\/\/www.paly.net\/academics\/library\"> One Search Discovery Tool<\/a>. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Like the name suggests, One Search Discovery aims to simply research by aggregating the library's various research tools into one page, according to Paly librarian Rachel Kellerman.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“One Search Discovery is a global search engine that connects most of the library’s research products,” Kellerman said. \"As consumers we don’t want to click a lot, everyone wants products where you can get to the meat of the product as fast as possible.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Currently, the librarians are working on introducing students to One Search Discovery. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The challenge is always marketing,” Kellerman said. “I’m working on an online tutorial, and librarian Sima Thomas went into all the AP Psychology classes to demo the tool. My goal is to go into all the social science courses so that every senior touches this product before he or she leaves.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Through their tutorials and visits, the librarians hope to familiarize students with One Search Discovery's many features, according to Kellerman. <\/span>\r\n\r\n“In addition to searching, you can also filter specifically for books in the library, e-books and books published within a certain date range,” Kellerman said. “If you are at home, you can also access the database through the library libguide. The nice thing about the e-books is that you can search for specific words in the books and the e-books aren't one to one, so the whole class could be looking at the same book. Furthermore, you can create folders, save books and access them anywhere, it’s very much like a Google Drive environment.”\r\n\r\n<span style=\"font-weight: 400;\">After the school's contract with its previous research tool expired, the librarians had been looking for a new system that could make research faster. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The old system for searching was very, very slow,” Kellerman said. “If you needed a book, you would have to go to the library catalog, then if you wanted a database article you would have to go the library libguide, then if you wanted an e-book you would have to go the e-book catalog. Nothing was integrated. The old library system that we had was more designed for middle school students.” <\/span>\r\n\r\nAdditionally, the librarians hope that this new tool will help prepare students for college research.\r\n\r\n<span style=\"font-weight: 400;\">“Similar search tools to One Search Discovery are found in colleges and universities,” Kellerman said. “It’s not hard to use, but like a new app on your phone it's good to practice before you have pressure for a research report and we wanted to expose students to it beforehand.”  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">To Kellerman, the adoption of the One Search Discovery tool is representative of Paly’s willingness to innovate and explore. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We're one of the high school that vendors [of software] will look at because we will try things out,” Kellerman said. “In the spring we’re going to a user's conference day that mostly has colleges, but we’ve been invited because Paly really has that forward looking attitude.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Though the librarians discovered One Search Discovery last year, it has taken around nine months to get it up and running and they’re still some areas which need to be improved. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“You still need to click through a couple pages to access the text for the e-book,” Kellerman said. “And some research tools like The New York Times and ABC Cleo aren’t integrated.”  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Student reaction has been positive so far, according to Kellerman. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The best reactions I got were ‘I found it!’ and ‘I’m going to use it.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior Alice On’s opinion reflects Kellerman’s view.  <\/span>\r\n<span style=\"font-weight: 400;\">“It’s not perfect,” On said. “I tried it in my AP Psych class and there were some glitches, but other than that, it’s pretty cool and convenient. It’s like the entire library on your computer, I think I’ll use it in the future.”<\/span>","excerpt":"The Palo Alto High School Library recently launched its One Search Discovery Tool in an effort to streamline research.","date":"2016-02-08 11:48:23","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/photo.jpg","categories":["News"],"tags":["faster","Kellerman","one search discovery","paly","research","streamline"]},{"id":115917,"title":"18 senior athletes commit to schools on National Signing Day","permalink":"http:\/\/palyvoice.com\/2016\/02\/08\/18-senior-athletes-commit-to-schools-on-national-signing-day\/","content":"[caption id=\"attachment_115919\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/DSC_0026.jpg\"><img class=\"size-full wp-image-115919\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/DSC_0026.jpg\" alt=\"Seniors Katie Francis and Andrew Cho sign their college athletic letters of intent on Wednesday in the Media Arts Center. Francis will be attending Santa Clara University for water polo and Cho will be attending the George Washington University for swimming.\" width=\"600\" height=\"400\" \/><\/a> Seniors Katie Francis and Andrew Cho sign their college athletic letters of intent on Wednesday in the Media Arts Center. Francis will be attending Santa Clara University for water polo and Cho will be attending the George Washington University for swimming. Photo by Emma van der Veen.[\/caption]\r\n\r\nEighteen Palo Alto High School senior athletes are preparing to take on college athletics, as they signed their letters of intent on National Signing Day on Wednesday in the Media Arts Center.\r\n\r\nThe athletes include Katie Francis, Andrew Cho and Kayleigh Svensson for swimming; Gigi Rojahn and Kevin Bowers for water polo; Jacey Pederson, Ansley Queen and Alex Bonomi for soccer; Reed Merritt and Mimi Lin for diving; Eli Givens and Mikey Grande for football; Owen Plambeck and Justin Hull for baseball; Henry Gordon for golf; Claire Dennis for volleyball; and Alexis Harris for basketball.\r\n\r\nPrincipal Kim Diorio, Athletic Director Kathi Bowers and alumnus and Stanford University swimmer Andrew Liang spoke at the event.\r\n\r\n“The weeks and days may be long, it can be a grind, but just remember that the years will fly by,” Liang said. “Enjoy the journey. It’s one that not many kids get to experience.”\r\n\r\nLiang credited Paly for preparing students, academically and otherwise, and offered some helpful advice to the college-bound athletes.\r\n\r\n“Paly has prepared you extremely well for this [being a college athlete],” Liang said. “You should continue to use the skills you have learned over these your four years and apply them in college. There will be ups and downs, just like there were in your four years here.”\r\n\r\nAccording to Givens, who will be playing Division 1 football at Southern Utah University, this day served as an affirmation to his dedication to athletics throughout high school.\r\n\r\n“I have worked so hard for this,” Givens said. “From coming to school at 7 a.m, to just working out to get bigger and stronger, to giving it 110% during practice. Even if I didn’t get an offer, I know that I worked hard enough to get one. This is an amazing feeling and I’m really glad that this happened to me.”\r\n\r\nNot all of the Vikings who signed to a college will be competing in Division I athletics. Kayleigh Svensson, who will be attending Wellesley College for Division III swimming, is looking forward to the experience, but does not want it to dominate her academic career.\r\n\r\n“I’m just focusing a little bit more on school, but I’m still very, very excited to swim,” Svensson said. “It should be a fun four years.”","excerpt":"Eighteen Palo Alto High School senior athletes are preparing to take on college athletics, as they signed their letters of intent on National Signing Day on Wednesday in the Media Arts Center.\r\n","date":"2016-02-08 11:42:43","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/DSC_0026.jpg","categories":["News"],"tags":["andrew liang","athlete","college","eli givens","kathi bowers","kayleigh svensson","media arts center","national signing day","palo alto high school","paly","signing","signing day","sports","sports boosters"]},{"id":115978,"title":"Choir Pops Concert is at 7:30 p.m. on Tuesday, Feb. 9 at Haymarket Theater","permalink":"http:\/\/palyvoice.com\/2016\/02\/08\/choir-pops-concert-is-at-730-p-m-on-tuesday-feb-9-at-haymarket-theater\/","content":"","excerpt":"","date":"2016-02-08 09:47:35","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":115960,"title":"Advisory this week is on Tuesday for all juniors and freshmen (L-Z)","permalink":"http:\/\/palyvoice.com\/2016\/02\/07\/advisory-this-week-is-on-tuesday-for-all-juniors-and-freshmen-l-z\/","content":"","excerpt":"","date":"2016-02-07 22:34:38","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":115927,"title":"Paly Quad to Levi&#8217;s Stadium: Students perform at Super Bowl 50","permalink":"http:\/\/palyvoice.com\/2016\/02\/07\/paly-quad-to-levis-stadium-students-perform-at-super-bowl-50\/","content":"[caption id=\"attachment_115928\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/12687887_1124695217549030_2321994312789312104_n.jpg\"><img class=\"wp-image-115928\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/12687887_1124695217549030_2321994312789312104_n.jpg\" alt=\"12687887_1124695217549030_2321994312789312104_n\" width=\"600\" height=\"451\" \/><\/a> Members of Palo Alto High School's cheer and dance team pose with a \"Super Bowl 50\" flag before their performance at the halftime show today at Levi's Stadium in Santa Clara. (Left to right, top to bottom row) Senior Emma Sternfield, sophomores Grace Kitayama, Clare Thomas, seniors Melanie Guan, Mariah Poitier, junior Lauren Jozefov, senior Ella Higashi and junior Nathalia Castillo submitted a video and were selected along with 200 other dancers to perform as \"flowers.\" Photo by Julie Sternfield.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Eight members of Palo Alto High School's cheer and dance team performed at the Super Bowl 50 halftime show today. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The performance, inundated with local teenagers, featured seniors Melanie Guan, Ella Higashi, Mariah Poitier and Emma Sternfield; juniors Nathalia Castillo and Lauren Jozefov; and sophomores Grace Kitayama and Clare Thomas. They danced alongside big-time musicians Coldplay, Bruno Mars and Beyoncé, spinning colorful flower umbrellas and precisely rotating formations with around 200 other dancers.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Higashi, the only performer from the cheer team, a favorite part of the experience was spending a few days before the game with the performers. Guan agreed that working alongside the famous artists was a memorable moment. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The highlight of the performance was definitely when Jay-Z and Blue Ivy walked past me and waved,” Guan said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Paly cheer and dance team became involved about a month ago when Julie Zimmer, the halftime show casting director, contacted the team to perform, according to Guan.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The Super Bowl halftime coordinators contacted our coach via email,” Sternfield said. “We submitted a <a href=\"https:\/\/www.youtube.com\/watch?v=AjCgcVY8fJw\" target=\"_blank\">video<\/a> of our team performing multiple dances, and soon after they contacted us saying we've been chosen to dance in the halftime show.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">After being chosen, the performers committed to confidentiality and hours of practice.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We weren’t allowed to tell anyone for around a month, but we had to leave school early a couple days to practice around five to six hours in Santa Clara,” Castillo said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">On the Wednesday through Friday leading up to the Super Bowl, the Paly performers had extra rehearsals from 3 p.m. to 8:30 p.m., according to Jozefov.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Those rehearsals were really fun because most of the time we were watching the singers perform,” Jozefov said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The dancers agreed that overall, their inclusion in the performance was an unforgettable opportunity.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It was definitely an experience of a lifetime and being a part of this event was one that I’ll never forget,” Castillo said.<\/span>\r\n\r\nSee posted recording by \"Heavy\" <a href=\"http:\/\/heavy.com\/sports\/2016\/02\/super-bowl-50-halftime-show-2016-performances-watch-video\/\" target=\"_blank\">here.<\/a>","excerpt":"Eight members of Palo Alto High School's cheer and dance team performed at the Super Bowl 50 halftime show today.","date":"2016-02-07 17:07:57","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/12687887_1124695217549030_2321994312789312104_n.jpg","categories":["News","Spotlight"],"tags":["beyonce","bruno mars","carolina panthers","cheer","chris martin","coldplay","dance","denver broncos","football","halftime show","super bowl 50"]},{"id":115869,"title":"Girls&#8217; soccer falls to Mountain View, ending hopes for perfect season","permalink":"http:\/\/palyvoice.com\/2016\/02\/07\/girls-soccer-falls-to-mountain-view-ending-hopes-for-perfect-season\/","content":"[caption id=\"attachment_115871\" align=\"aligncenter\" width=\"599\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/jacey.jpg\"><img class=\" wp-image-115871\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/jacey.jpg\" alt=\"Senior Jacey Pederson (19) weaves through the Mountain View defense. Pederson was sidelined with a hamstring injury early in the second half in the Viking's loss.\" width=\"599\" height=\"399\" \/><\/a> Senior Jacey Pederson weaves through the Mountain View defense. In the Vikings' loss, Pederson sustained a hamstring injury early in the second half. Photo by Cooper Lou.[\/caption]\r\n<p class=\"p1\">Unable to find offensive rhythm, the Palo Alto High School girls’ soccer team (13-1-1, 8-1-1) saw its hopes of an unbeaten season dashed after falling 0-2 to Mountain View (14-0-2, 7-0-2) on Friday.<\/p>\r\n<p class=\"p1\"><span class=\"s1\">Making the loss even more stinging was the fact that two of Paly’s biggest stars, seniors Alison Lu and University of California, Los Angeles-bound Jacey Pederson, were sidelined with injuries for most of the second half. According to Paly head coach Kurt Devlin, Lu will likely recover soon but Pederson's prognosis is uncertain.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">Right off of the starting whistle, Mountain View and its forward duo, junior Natasha Harris and senior Ysa<\/span><\/p>\r\n\r\n\r\n[caption id=\"attachment_115872\" align=\"alignright\" width=\"323\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/ansley.jpg\"><img class=\" wp-image-115872\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/ansley.jpg\" alt=\"Senior Ansley Queen goes up for a header against Mountain View's Bethan Parry. Photo by Cooper Lou.\" width=\"323\" height=\"485\" \/><\/a> Senior Ansley Queen goes up for a header against Mountain View sophomore Bethan Parry. Queen recently signed her National Letter of Intent and will continue her soccer career at Colorado College this fall. Photo by Cooper Lou.[\/caption]\r\n<p class=\"p1\"><span class=\"s1\">Baluyot, pressed hard offensively, setting up two dangerous chances early that Lu skillfully cleared. But the Spartans broke through in the 10th minute, when Harris received a through ball at the top of the 18-yard box, drew Paly goalkeeper Linnea Carlstrom out of position and evaded two defenders, finding the back of the net for Mountain View's first goal.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">In the first half stoppage time, Harris sent a dangerous chip into the box that resulted in a defensive miscommunication by the Vikings. In the chaos, Mountain View's Maddie Neidig tapped the ball through to double the Spartans' lead.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">Paly's prolific offense, which has produced 51 goals this season, found itself stifled by the Mountain View defense. <\/span><span class=\"s1\">The second half looked like it would be better for the Vikings after they made tactical adjustments, including moving Lu to forward, and created several promising chances. But things quickly deteriorated when Pederson limped off the field 10 minutes into the half with a hamstring injury, and Lu came off a few minutes later with a leg cramp. <\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">Left without two of its biggest playmakers, Paly fizzled toward the end of the half, unable to produce chances as Mountain View continued to apply pressure on the offensive end.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">“We started out the second half pretty well,” Devlin said. “After the injuries, it was pretty much an uphill battle. But you have to give them [Mountain View] a little bit of credit, because they had a good game plan, and they executed pretty well.”<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">Mountain View's Harris emphasized that her team's offensive success was due to tactical improvements.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">“The past couple of games, we hadn’t been able to score much,” Harris said. “Today, we played to our forwards’ strengths by playing to their feet.”<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">Paly junior defender Talia Malchin said that the athleticism of Mountain View’s attackers was the greatest contributing factor to the game’s result.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">“It was more a matter of the individual speed and skill of the forwards, rather than the whole team,” Malchin said. “They created the most issues for us as defenders.”<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">On the offensive front, sophomore midfielder Emily Tomz expressed disappointment with the Vikings’ inability to convert chances.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">“We should have been able to slot some in, with the amount of time we had possession of the ball in the final third of the field,” Tomz said.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">Tomz also noted that the Vikings went in with a more defensive mindset, knowing that they only needed to tie Mountain View to maintain their first-place position in league. Despite the setback, she emphasized that the team was going to bounce back for the final stretch of league play.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">\"A loss is a loss, and as we talked about after the game, that happened to be an important loss,” Tomz said. “But we still have four more games to play.”<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">The result was particularly frustrating for the Vikings because they were looking to avenge their loss to Mountain View in the the Central Coast Section Division I championship game last year. But Tomz remains optimistic that they will have another opportunity to do so.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">“Hopefully we'll see them sometime again soon in CCS,” Tomz said. <\/span><\/p>\r\n<p class=\"p1\">In their next game, the Vikings will take on Santa Clara at 3:30 p.m. on Feb. 10 at Mountain View High School. To have a shot at the De Anza League title, Paly needs to win out the remainder of its games and have Mountain View lose at least once in league play.<\/p>","excerpt":"Unable to find offensive rhythm, the Palo Alto High School girls’ soccer team (13-1-1, 8-1-1) saw its hopes of an unbeaten season dashed after falling 0-2 to Mountain View (14-0-2, 7-0-2) on Friday.","date":"2016-02-07 11:04:17","author":"Dhara Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/jacey.jpg","categories":["Sports","Sports Recap","Spotlight"],"tags":["emily tomz","girls soccer","jacey pederson","kurt devlin","mountain view","paly","talia malchin","vikings"]},{"id":115387,"title":"Season Update: Girls&#8217; soccer looks towards CCS","permalink":"http:\/\/palyvoice.com\/2016\/02\/05\/season-update-girls-soccer-looks-towards-ccs\/","content":"[caption id=\"attachment_115550\" align=\"alignleft\" width=\"581\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Homestead-vs-PALY.png\"><img class=\" wp-image-115550\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Homestead-vs-PALY.png\" alt=\"Photo by Ethan Kao.\" width=\"581\" height=\"436\" \/><\/a> Junior midfielder Natalie Maloney dribbles the ball past defenders as the Vikings beat the Homestead Mustangs 5-0 on Friday. Photo by Ethan Kao.[\/caption]\r\n\r\nAfter an impressive season comes to a close, the Palo Alto High School girls’ soccer team (12-0-1, 7-0-1) continues to dominate opponents with stellar offense and fluid defense, maintaining their undefeated record.\r\n\r\nWith a recent 5-0 win against the Homestead Mustangs on Friday, and a 6-0 win against the Milpitas Trojans on Wednesday, the Vikings have been crushing opponents game after game.\r\n\r\nAssistant coach Eric Seedman reflects on the team's strong performance so far.\r\n\r\n“The first half of the season has been great and I think our record reflects how the girls have been playing,” Seedman said. “We’ve continued to improve from last season and I think we will only get better.”\r\n\r\nBoth the boys and the girls soccer teams have impressed with their dual undefeated streak, winning all 30 games thus far. Girls' are currently ranked 30th in the nation, and 12th in state according to <a href=\"http:\/\/www.maxpreps.com\/high-schools\/palo-alto-vikings-(palo-alto,ca)\/girls-soccer-winter\/home.htm\" target=\"_blank\">MaxPreps<\/a>.\r\n\r\nSeedman emphasizes the team's ability to play through adversity, due to the loss of senior left back Jacey Pederson the past few games to a national team camp.\r\n\r\n“This week was very tough for us not only because we had three games, but we were missing our best player [Pederson],” Seedman said. “We were also playing three tough opponents with two games on the road but the girls held up well and won them all.”\r\n\r\nAs the season comes to a close, seniors Heidi Moeser, Jacey Pederson, Nika Woodfill, Alison Lu, Linnea Carlstrom, and Ansley Queen look forward to ending the season on a strong note but also to prepare the team for next season as many key players are leaving for college.\r\n\r\nSenior Captain Heidi Moeser remarks on how the team has added multiple new players.\r\n\r\n\"We added 6 new players this year and they are doing an excellent job, and are really a huge part of this team,\" Moeser said. \"With so many of us leaving next year, I still feel confident in the strength of our team. We've proved drastically what we can do and we look to improve every practice, every game.\"\r\n\r\nGiven the success of the Vikings, senior defender Alison Lu stresses the importance of not allowing the wins to stifle improvement.\r\n\r\n“We have been playing well but there are definitely things we can work on,” Lu said. “There are still some communication issues on the field and we need to work on keeping possession. Improving that will really help us out. We also know the rising seniors and juniors are strong and will uphold what we've accomplished this season so far.”\r\n\r\nMidfielder Emily Tomz compares this season to the last, emphasizing how they have improved.\r\n\r\n\"Compared to last season, I definitely think we have a greater chance at winning leagues and CCS,\" Tomz said. \"We are a really strong and talented group, with a firm defense, crafty midfielders, and fast forwards who score often and with precision. This year more than last year we have been doing more fitness, which has and will benefit us in games, helping us keep up a high endurance the whole game.\"\r\n\r\nAs the second half of the season approaches, the Vikings continues to stay optimistic about the teams ability to maintain its undefeated record, and constantly looks to improve.\r\n\r\n\"For the rest of this season we are definitely aiming to continue our undefeated streak, and, of course, beat mountain view next Friday,\" Tomz said.\r\n\r\nThe Vikings will face off against league rivals Mountain View (13-0-1, 6-0-1) on Friday at 3:30 p.m. at Paly.","excerpt":"After an impressive start to the season, the Palo Alto High School girls’ soccer team (12-0-1, 7-0-1) continues to dominate opponents with stellar offense and defense maintaining their undefeated record.\r\n","date":"2016-02-05 10:40:21","author":"Ethan Kao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Homestead-vs-PALY.png","categories":["Sports"],"tags":["CCS","dominate","girls","girls soccer","moeser","pederson","seedman","Soccer","undefeated","vikings"]}]