[{"id":124262,"title":"Liveblog: Football hopes to bounce back against Wilcox after consecutive losses","permalink":"http:\/\/palyvoice.com\/2016\/10\/14\/liveblog-football-hopes-to-bounce-back-against-wilcox-after-consecutive-losses\/","content":"[liveblog]The Palo Alto High School football team (1-2, 2-5) looks to defeat the Wilcox High School Chargers (3-0, 4-3) in rainy weather at home. The Vikings hope to snap their 2-game losing streak with a win tonight.","excerpt":"The Palo Alto High School football team (1-2, 2-5) looks to defeat the Wilcox High School Chargers (3-0, 4-3) in rainy weather at home. The <a href=\"http:\/\/palyvoice.com\/2016\/10\/14\/liveblog-football-hopes-to-bounce-back-against-wilcox-after-consecutive-losses\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2016-10-14 17:57:00","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/08\/pauljackson11.jpg","categories":["Uncategorized"],"tags":["chargers","football","vikings","wilcox"]},{"id":124119,"title":"Robotics wins big at off-season competition","permalink":"http:\/\/palyvoice.com\/2016\/10\/13\/robotics-wins-big-at-off-season-competition\/","content":"The Palo Alto High School robotics team looks forward to a promising year after winning multiple awards at the CalGames competition at Fremont High School this past weekend.\r\n\r\n<span style=\"font-weight: 400;\">According to senior Lauren Nolen, the robotics team’s Strategic Director, the competition was off-season, and was hosted by the Western Region Robotics Forum in the style of a \"For Inspiration and Recognition of Science and Technology\" <a href=\"http:\/\/www.firstinspires.org\/robotics\/frc\">robotics game.<\/a> <\/span>\r\n\r\nPaly robotics, otherwise known as \"Team Eight,\" won the Entrepreneurship Award.\r\n\r\n<span style=\"font-weight: 400;\">As described by the <a href=\"http:\/\/wrrf.org\/calgames\/calgames-2016\/\">CalGames<\/a> website, the Entrepreneurship Award, won by Team Eight, is awarded to the team “that demonstrates a business organization and execution that help its team succeed on the field.” <\/span>\r\n\r\nThe Space Cookies, a Paly student all-girls robotics team, won the overall competition as well as the Design and CAD Award and Paly student Terrance Tech team won the Rookie Award.\r\n\r\nAccording to the <a href=\"http:\/\/wrrf.org\/calgames\/calgames-2016\/\">CalGames<\/a> website, the Design Award and the CAD award, won by the Space Cookies in addition to winning the whole competition, are awarded to a team with \"exceptional design element\" and \"exceptional use and connections from CAD design to implementation,\" respectively. The Rookie Award, won by the Terrance Tech team, is described the award for the \"first-timer teams\" at the competition, for a team who \"inspires us all with its efforts and accomplishments as a team.\"\r\n\r\n[caption id=\"attachment_124178\" align=\"alignleft\" width=\"359\"]<img class=\"wp-image-124178\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Screenshot-2016-10-13-at-8.36.47-AM-3.png\" alt=\"Screenshot 2016-10-13 at 8.36.47 AM-3\" width=\"359\" height=\"313\" \/> Participates of pose with their awards at the 2016 CalGames competition. Photo: Natalie Bruster[\/caption]\r\n\r\nAccording to Space Cookies member senior Erin Mittman, after the teams are ranked in certain qualification rounds, top teams will from alliances of three teams and move on to the playoffs.\r\n\r\n\"Whichever team wins two matches advances,\" Mittman said. \"There are eight alliances to start with and one at the end. The final alliance wins the competition.\"\r\n\r\n<span style=\"font-weight: 400;\">Junior Annalee Soohoo, Team Eight business captain, explains that the process for competing at the CalGames competition requires the teams to submit their applications for the award a month in advance, and then present their business plan at the competition.<\/span>\r\n\r\n“We applied for an interview slot around a month ago, and we presented our plan this Saturday at 10 a.m.,\" Soohoo said. \"Team Captain senior Kenneth Cheung, Business Project Manager senior Jennifer Xu, and I presented to the judges for 15 minutes and gave the judges our <a href=\"https:\/\/drive.google.com\/file\/d\/0B_sAFWYnsl_WazJfakkySWwtaHM\/view?usp=sharing\">business plan<\/a>, budget, and project management schedules for review,”  “We were notified that we won the award at around 7 p.m. that night.”\r\n\r\nCheung, says that the team's business plan was centered around its growth.\r\n\r\n“We framed the presentation around the story of how our team has grown from being a last-place-team in 2014 to a world-class one that not only performs better on the field, but is also dedicated to STEM outreach,” Cheung said. “We talked about the creation and success of our art and business subteams, and our extensive project management system that enables us to manage projects for 85 members. We also talked about the free <a href=\"http:\/\/paly.io\/v\/121100\">summer camp<\/a> we ran this past summer, which was developed and taught completely by students.”\r\n\r\n[caption id=\"attachment_124181\" align=\"alignright\" width=\"364\"]<img class=\"wp-image-124181\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Screenshot-2016-10-13-at-8.36.41-AM.png\" alt=\"Screenshot 2016-10-13 at 8.36.41 AM\" width=\"364\" height=\"374\" \/> Space Cookie members senior Erin Mittmann and sophomore Grace Lam pose with their robot. The Space Cookies won the competition as well as the Design Award and CAD Award. Photo: Ushana Goyal[\/caption]\r\n\r\nAccording to Cheung, this is not the first time <a href=\"http:\/\/palyvoice.com\/2015\/03\/17\/robotics-team-wins-entrepreneurship-award-at-regional-competition\/\">Paly robotics has won the entrepreneurship award<\/a>, but the first time winning it at the CalGames competition.\r\n\r\n“This is the third Entrepreneurship Award Paly robotics has won in the past two years,” Cheung said. “And this upcoming season, we are aiming even higher for the Engineering Inspiration Award and Chairman's Awards; the two most prestigious awards in the FIRST Robotics Competition.”\r\n\r\nThis is also not the first win for the Space Cookies, who have won in past competitions awards such as the Chairman's award for embodying <a href=\"http:\/\/www.firstinspires.org\/about\/vision-and-mission\">FIRST<\/a> values and doing outreach, among many others, according to Mittman.\r\n\r\n\"I hope we can win this Chairman's Award again along with continuing to expand our outreach,\" Mittman said. \"We also hope to build an equally successful robot for the next year.\"","excerpt":"The Palo Alto High School robotics team looks forward to a promising year after winning multiple awards at the CalGames competition at Fremont High School this past weekend.","date":"2016-10-13 21:15:11","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Screenshot-2016-10-13-at-8.36.47-AM-3.png","categories":["News","Spotlight"],"tags":["Award","CalGames","entrepreneurship award","robotics"]},{"id":124182,"title":"Car crashes into Town &#038; Country store window","permalink":"http:\/\/palyvoice.com\/2016\/10\/13\/car-crashes-into-town-country-store-window\/","content":"Hudson Grace, a Town &amp; Country Village decor store, will be closed until further notice after a car crashed into its front window at approximately 3 p.m. yesterday.\r\n\r\nA woman driving a Mercedes-Benz CLA 250 crashed into the front entrance of Hudson Grace causing damage inside the store, but no injuries were reported. Authorities have not released her name nor her age.\r\n\r\n[caption id=\"attachment_124251\" align=\"alignleft\" width=\"393\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/14699685_325250784500401_25283707_o.jpg\"><img class=\"wp-image-124251 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/14699685_325250784500401_25283707_o.jpg\" alt=\"14699685_325250784500401_25283707_o\" width=\"393\" height=\"295\" \/><\/a> A car struck the front window and toppled over shelves full of glassware and ceramic pieces at Town &amp; Country store Hudson Grace, leaving the floor covered in debris. Photo by Rachel Code.[\/caption]\r\n\r\nWhen pulling into a parking spot in front of Hudson Grace, the driver reported that she tried to stop but the car kept moving forward. Diners at a next door restaurant, Calafia Café &amp; Market A Go Go, said the driver was pulling into a parking spot in front of Hudson Grace when the accident occurred. Fire officials and police responded to the scene shortly after 3 p.m.\r\n\r\nThe driver had steered her car inside into the store, knocking over a display of housewares, including ceramic bowls and serving platters, according to fire officials at the scene. The driver and her passenger sustained no injuries, the Palo Alto Police Department reported.\r\n\r\nAfterwards, broken glass shards littered the floor, and ceramic vases and pots lay in pieces across the small decor store. No customers were in the store at the time of the accident and employees present at the scene were not injured, police said.\r\n\r\nHudson Grace has put a wooden board in place of the broken front window.","excerpt":"Hudson Grace, a Town & Country Village decor store, will be closed until further notice after a car crashed into its front window at approximately 3 p.m. yesterday.","date":"2016-10-13 16:09:32","author":"Bianca Al-Shamari","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/53691_full.jpg","categories":["News","Spotlight"],"tags":["Car Crash","hudson grace","mercedes-benz","palo alto","Town and Country","woman"]},{"id":124134,"title":"Stanford University teams up with Paly athletic trainers","permalink":"http:\/\/palyvoice.com\/2016\/10\/13\/stanford-university-teams-up-with-paly-athletic-trainers\/","content":"[caption id=\"attachment_124242\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9488.jpg\"><img class=\"wp-image-124242\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9488.jpg\" alt=\"A stanford Athletic Supervisor mans the check-in desk for Palo Alto student athletes receiving their physicals through the Young Athletes Academy program. Photo by Bianca Al-Shamari.\" width=\"600\" height=\"400\" \/><\/a> A Stanford athletic supervisor mans the check-in desk for Palo Alto student athletes receiving their physicals through the Young Athletes Academy program. Photo by Bianca Al-Shamari.[\/caption]\r\n\r\nStanford University will be expanding a new program that will provide Palo Alto High School athletic teams with dual game coverage and low-cost sports physicals. By working hand-in-hand with Palo Alto Unified School District athletic trainers and coaches, Stanford aims to provide medical care for Palo Alto and Gunn High School athletic teams through the creation of the <a href=\"http:\/\/www.stanfordchildrens.org\/en\/service\/young-athletes-academy\">Young Athletes Academy<\/a>.\r\n\r\nLast spring, the Children’s Orthopedic &amp; Sports Medicine Center launched this community outreach program in an effort to bring easily accessible sports medicine resources to partnered schools and clubs.\r\n\r\nThe team consists of 10 athletic trainers, a group of physical therapists and physicians who provide the many services offered by the Young Athletes Academy. These include sideline sports medicine care, access to specialty care, pre-participation physical evaluations, <a href=\"http:\/\/www.stanfordchildrens.org\/en\/service\/sports-medicine\/injury-prevention-resources\">injury prevention programs<\/a> and educational opportunities, according to the Young Athletes Academy <a href=\"http:\/\/www.stanfordchildrens.org\/en\/service\/young-athletes-academy?\">website<\/a>.\r\n\r\n[caption id=\"attachment_124243\" align=\"alignleft\" width=\"380\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9479.jpg\"><img class=\"wp-image-124243\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9479.jpg\" alt=\"Justine Iogini and a volunteer with the Palo Alto High School athletics department work together with Stanford in providing athletes sports-med services at Gunn High School. Photo by Bianca Al-Shamari. \" width=\"380\" height=\"253\" \/><\/a> Justine Iogini and a volunteer with the Palo Alto High School athletics department work together with Stanford in providing athletes sports-med services at Gunn High School. Photo by Bianca Al-Shamari.[\/caption]\r\n\r\nAccording to Courtney Beverine, an athletic trainer with Stanford Children's Health, this program will be giving students throughout the area a cheaper option for their sports-related medical exams, especially if a student does not have insurance.\r\n\r\n\"This partnership with local high schools will allow students to be able to use Stanford's clinic if an injury is in need of more attention than an athletic trainer is able to provide, such as screening or one-on-one with a physician,\" Beverine said.\r\n\r\nAs a result of the recent partnership with PAUSD, on Monday Oct. 10, the Young Athletes Academy provided $10 sports physicals at Gunn High School for Gunn and Palo Alto High School students.\r\n\r\nInsurance, or lack of insurance, will not be a problem in receiving services and medical information for student athletes.\r\n\r\n\"You don't need any type of insurance to be able to do this. We are hosting this as a sort of community service,\" Beverine said. \"We're trying to help out those families that don't have insurance, or have a limited insurance plan. If someone is paying out of pocket, the price can be $50 or more for a physical. We're doing it for $10 and the money we raise we send back to the high schools.\"\r\n\r\nJustine Iongi, the head athletic trainer for Paly is one of the many high school athletic trainers partnered with the program. Every trainer has a direct line with the Stanford athletic trainers, giving them the ability to call Stanford when they are in need of their services at the press of a button.\r\n\r\n\"This [program] unified us as a team to be better able to catch small things that we might have been unable to catch before,\" Iongi said. \"We can now send our athletes for more detailed screenings and get them the care they need faster. It's a quick process that will help a lot of people that either don't have insurance or just want an affordable resource for sports related injuries and information.\"\r\n\r\n[caption id=\"attachment_124246\" align=\"alignright\" width=\"441\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9477.jpg\"><img class=\"wp-image-124246\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9477.jpg\" alt=\"Stanford Physicians hold one-on-one conferences with student athletes as a final assessment of their health for sports physicals. Photo by Bianca Al-Shamari \" width=\"441\" height=\"294\" \/><\/a> Stanford Physicians hold one-on-one conferences with student athletes as a final assessment of their health for sports physicals. Photo by Bianca Al-Shamari[\/caption]\r\n\r\nThe Young Athletes Academy is currently partnered with Palo Alto High School, Gunn High School, San Mateo High School, Burlingame High School, Capuchino High School, Aragon High School, the Hillsdale Fighting Knights football team, Ballistic Soccer Club and Rage Soccer Club.\r\n\r\n\"We will be expanding to more [sports] clubs on the Peninsula side as well,\" Beverine said. \"Since we are still building we don't have the manpower yet to cover more clubs as well because they need more attention than the high schools because they don't have athletic trainers.\"\r\n\r\nAnother big part of the program is their sports medicine lectures and injury prevention programs.\r\n\r\n\"We're in the process of coming up with more structured times of the year so we can hold larger amounts of people,\" Beverine said. \"We also want to provide conferences and educational events for the community, and students in partnered high schools would pay a discounted price to come in.\"\r\n\r\nIn the coming months, the Young Athletes Academy looks to expand, create more educational events, and to make their services occur on an annual basis, according to Beverine.\r\n\r\n\"For the future, we are looking to grow and partner with more local schools and clubs,\" Beverine said. \"Our goal is everyone knows who are, and that people know they can come by and see us.\"\r\n\r\nTo find out more about upcoming events and provided services, contact the Youth Athletes Academy at  <strong><a href=\"mailto:sports@stanfordchildrens.org\">sports@stanfordchildrens.org<\/a><\/strong>","excerpt":"Stanford University will be expanding a new program that will provide Palo Alto High School athletic teams with dual game coverage and low-cost sports physicals. ","date":"2016-10-13 15:30:35","author":"Bianca Al-Shamari","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9488.jpg","categories":["News","Sports","Spotlight"],"tags":["Athletic trainers","beverine","justine Iongi","stanford","stanford university","young athletes academy"]},{"id":124125,"title":"Teen Arts Council to host third Poetry Jam","permalink":"http:\/\/palyvoice.com\/2016\/10\/13\/teen-arts-council-to-host-third-poetry-jam\/","content":"[caption id=\"attachment_124175\" align=\"alignnone\" width=\"617\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/14650505_10154615008424806_4589139196814844696_n.jpg\"><img class=\"wp-image-124175\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/14650505_10154615008424806_4589139196814844696_n.jpg\" alt=\"14650505_10154615008424806_4589139196814844696_n\" width=\"617\" height=\"410\" \/><\/a> Senior Co-founder of Point B, Teddie Stewart passionately performs a poem at the first Point B poetry Jam. Photo by Claire Eberhart.[\/caption]\r\n\r\nThe Teen Arts Council will host its third Poetry Jam from 7:30 p.m. to 9:30 p.m. Friday, Oct. 14 at the Mitchell Park Community Center.\r\n\r\n<span style=\"font-weight: 400;\">Palo Alto High School seniors Teddie Stewart and Claire Eberhart are organizing the event, which is described by its <a href=\"https:\/\/www.facebook.com\/events\/222931494789416\/?notif_t=plan_user_invited&amp;notif_id=1476214743005468\">Facebook page<\/a> as being a “nonjudgmental environment” where anyone from a “verse novice to a poetry expert” is welcome to perform poetry. The event will feature “amazing poetry, good vibes, and yummy food” and is free to the public, according to Stewart. <\/span>\r\n\r\nIn the past the event has been held at the Palo Alto Children's Theatre but due to construction the event will take place at the Mitchell Park Community Center.\r\n\r\nThe Facebook page explains that the event’s title, “Point B\" comes from the idea that “you are Point A and we are Point b. We will always be here for you as an open place for emotional and artistic expression.”\r\n\r\nAccording to the Facebook page, the event is an open place for emotional and artistic expression.\r\n\r\nAccording to Stewart, the Poetry Jam started three years ago, when Stewart and Eberhart were sophomores.\r\n\r\n<span style=\"font-weight: 400;\">“We started it because there was no place for teenagers to share their poetry that wasn't monitored or run by adults,” Stewart said. “We also wanted to emphasize that it’s a poetry jam, <\/span><span style=\"font-weight: 400;\">not<\/span><span style=\"font-weight: 400;\"> a poetry competition.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Stewart encourages all students to come watch the performances, and is confident there will be something for everyone to enjoy at the event.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I have seen people open up and also really value and listen to other poetry,” Stewart said. “I have seen people become so inspired through this art form that they didn't really know was a thing before they came and watched other perform. It was one of the best moments of my life when Claire and I hosted the first Point B because I saw inspiration spark in people, and there is nothing better than that.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Those interested in performing a poem should contact Eberhart or Stewart at teenartscouncil@gmail.com or message them on Facebook. Eberhart and Stewart ask that the poems “not offend anyone or exceed an extremely long period of time.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Stewart, poems will also be provided at the event for anyone who wants to read them. <\/span>\r\n\r\n<span style=\"font-weight: 400;\"><a href=\"https:\/\/www.facebook.com\/events\/222931494789416\/?active_tab=about\">Students must be aged 13-18 to attend, and can RSVP here.<\/a> <\/span>","excerpt":"The Teen Arts Council will be hosting its third Poetry Jam from 7:30 to 9:30 p.m. this Friday, Oct. 14, at the Mitchell Park Community Center.","date":"2016-10-13 09:25:14","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/14650505_10154615008424806_4589139196814844696_n.jpg","categories":["News","Spotlight"],"tags":["poetry jam","point b teen poetry jam"]},{"id":123889,"title":"The pumpkin spice hype: Peet&#8217;s Coffee fall drinks review","permalink":"http:\/\/palyvoice.com\/2016\/10\/12\/the-pumpkin-spice-hype-peets-coffee-fall-drinks-review\/","content":"<span style=\"font-weight: 400;\">The trees in Palo Alto have begun their rusting transition from green to red, leaves are slowly collecting in multicolored piles to run through and crunch underfoot and the weather is steadily getting chillier.  It's safe to say fall has truly begun. However, besides these climate changes, the true quintessential signifier of autumn’s beginning comes in the form of pumpkin spice. <\/span>\r\n\r\nBusinesses around the Bay Area, complying with the mass hype surrounding pumpkin spice, are busy producing ridiculous assortments of pumpkin drinks, snacks and desserts. Unlike themed holiday products, pumpkin spice is not in celebration of any particular event, but the excitement  that seems to follow it seems to be worthy of its own form of holiday.\r\n\r\nPeet's Coffee and Tea has recently released a completely new menu with an assortment of pumpkin drinks. These include the Pumpkin Latte, the Pumpkin Chai, the Pumpkin Mocha, and the Pumpkin Javiva.\r\n\r\nIs this seasonal collection really equivalent to “fall in a cup”? Does pumpkin really go with everything, even chocolate? The Paly Voice decided to test out what this pumpkin spice craze was all about.\r\n\r\nBelow we<span style=\"line-height: 1.5;\"> have picked three areas to judge: Aesthetic, Taste and finally Fall spirit.<\/span>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/new-piktochart_16805121_3eaf1771b375b8abbf09622cf012db5473431e79.jpeg\"><img class=\"wp-image-123898 aligncenter\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/new-piktochart_16805121_3eaf1771b375b8abbf09622cf012db5473431e79.jpeg\" alt=\"new-piktochart_16805121_3eaf1771b375b8abbf09622cf012db5473431e79\" width=\"600\" height=\"550\" \/><\/a>\r\n\r\n<span style=\"font-weight: 400;\">We started off with the Pumpkin Latte ($3.75 for a small), a creamy coffee topped with a small peak of white foam. It looked like your average Peet's latte, with equally creamy blend of milk, and strong coffee but with slight hint of what could be inferred to be pumpkin flavor. The reality was that it tasted like a strangely bitter sugar sweetener with maybe a hint of cinnamon. We were all quite unimpressed with the drinks unassuming appearance and lackluster taste. It was a decent latte, but a poor pumpkin drink.<\/span>\r\n\r\n&nbsp;\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/new-piktochart_16961221_bc47b73daafaf6251d89b8161e01a80b24da3a4c.jpeg\"><img class=\"wp-image-123899 aligncenter\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/new-piktochart_16961221_bc47b73daafaf6251d89b8161e01a80b24da3a4c.jpeg\" alt=\"new-piktochart_16961221_bc47b73daafaf6251d89b8161e01a80b24da3a4c\" width=\"600\" height=\"550\" \/><\/a>\r\n\r\nThe Pumpkin Chai, $4 for a small comes in a solid white paper cup and is topped with equally bland and slightly droopy white cream. However, the aromatic scents of cinnamon, chai spices, and pumpkin wafting up from this drink were enough to leave our mouths watering. Taking a sip of this drink was like taking in fall in a mouthful. A wonderful warmth fills each sip, the thick taste of cinnamon creating the picture the warm fireplaces and changing leaves hued in a kaleidoscope of color. However, there was still a slight bitterness from the artificial pumpkin that accompanied the warm aftertaste of this drink that kept us from enjoying it fully.\r\n\r\n&nbsp;\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/new-piktochart_16961404_06e42013541a35e79d2eb78eb0ff77db29a44603.jpeg\"><img class=\"wp-image-123901 aligncenter\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/new-piktochart_16961404_06e42013541a35e79d2eb78eb0ff77db29a44603.jpeg\" alt=\"new-piktochart_16961404_06e42013541a35e79d2eb78eb0ff77db29a44603\" width=\"600\" height=\"550\" \/><\/a>\r\n\r\nThe Pumpkin Mocha $4 was an elegant ensemble of fluffy whipped cream topped with a colorful sprinkling of cinnamon and chocolate powder. It was by far the most creative presentation of the four new drinks on the fall menu. We were all quite skeptical of a pumpkin-chocolate combination, but the two flavors combined surprisingly well. The thick coffee accentuated the flavoring of dark chocolate and the small accents of pumpkin were pleasant and subtle, however, not overpowered by the coffee and chocolate flavoring. With fun presentation and the unusual flavor combination, it felt like the perfect drink to order as a festive fall treat.\r\n\r\n&nbsp;\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/new-piktochart_172_d3b99e9882cac3ed669182be65c95f72fd230b60.jpeg\"><img class=\"wp-image-123902 aligncenter\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/new-piktochart_172_d3b99e9882cac3ed669182be65c95f72fd230b60.jpeg\" alt=\"new-piktochart_172_d3b99e9882cac3ed669182be65c95f72fd230b60\" width=\"600\" height=\"550\" \/><\/a>\r\n\r\n<span style=\"font-weight: 400;\">The Pumpkin Javiva ($4 for a small), was a decadent swirling of toppling whipped cream served in a clear plastic cup revealing the drinks frothy caramel coloring. With each sip, you were overwhelmed by a fury of cinnamon, pumpkin and sugar. The taste was a perfect match for the desired seasonal flavoring, but after the third or fourth sip, the drink grew too sweet for our tastes. However, if in the mood for a Javiva, we consider this the perfect option. The pumpkin and cinnamon tones in this drink make it a great option for an autumn drink.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Pumpkin Chai, with its rich cinnamon flavoring and comforting warmth, came out as a clear winner in terms of how authentically “fall” it was. However, in terms of taste and a fun presentation, we would recommend the Pumpkin Mocha, an unusual match of flavorings to spice up these increasingly chilly weeks. Overall, even if you are a more traditional coffee drinker, we still recommend giving these drinks a try. Although pumpkin spice did not totally live up to its legendary hype, these drinks are great for the occasional treat and a fun way to get into the autumn spirit. <\/span>","excerpt":"It's safe to say fall has truly begun. However, besides climate changes, the truly quintessential signifier of autumn’s beginning comes in the form of pumpkin spice.","date":"2016-10-12 19:59:49","author":"Aisha Chabane","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9132.jpg","categories":["Lifestyle","Spotlight"],"tags":["Autmun","Chai","Fall","Javiva","Mocha","Peets","Peets Coffe and Tea","pumpkin","pumpkin spice","Taste Test"]},{"id":124013,"title":"Spirit Week: Dress up guide","permalink":"http:\/\/palyvoice.com\/2016\/10\/11\/spirit-week-dress-up-overview\/","content":"[caption id=\"attachment_43149\" align=\"alignleft\" width=\"398\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2012\/10\/DSC_0177.jpg\"><img class=\" wp-image-43149\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2012\/10\/DSC_0177.jpg\" alt=\"The Class of 2015 cheers on their peers during the sophomore spirit dance. [Photo: Cathy Rong]\" width=\"398\" height=\"264\" \/><\/a> The Class of 2015 cheers on their peers during the sophomore spirit dance. Photo: Cathy Rong[\/caption]&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\nSpirit Week is by far the best week of the year at Palo Alto High School. However, dressing up for Spirit Week can be expensive and hard to do. If you need some wardrobe advice for Spirit Week, check out The Paly Voice's dress up guide for all of the classes using the links below!\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2016\/10\/11\/spirit-week-dress-up-preview-freshmen\/\" target=\"_blank\">Freshmen<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2016\/10\/11\/spirit-week-dress-up-preview-sophomores\/\" target=\"_blank\">Sophomores<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2016\/10\/11\/spirit-week-dress-up-preview-juniors\/\" target=\"_blank\">Juniors<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2016\/10\/11\/spirit-week-dress-up-preview-seniors\/\" target=\"_blank\">Seniors<\/a>\r\n\r\n&nbsp;","excerpt":"If you need some wardrobe advice for Spirit Week, check out The Paly Voice's dress up guide for all of the classes!","date":"2016-10-11 17:09:23","author":"Kasra Orumchian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/imageedit_4_32128012921.jpg","categories":["ASB","Spirit Week 2016","Spotlight","Uncategorized"],"tags":["#palyspirit","2016","ASB","Best dressed","dress up","palo alto","palo alto high school","paly","review","seniors","Spirit Week","student","vikings"]},{"id":123936,"title":"Spirit week dress up preview: Seniors","permalink":"http:\/\/palyvoice.com\/2016\/10\/11\/spirit-week-dress-up-preview-seniors\/","content":"<em><span style=\"font-weight: 400;\">Dear Seniors,<\/span><\/em>\r\n\r\n<em>It’s time for one last go-around of the best week of the year. We’re confident in your ability to perform and end up on top this year. You are the top dogs for the first time, and expectations for the Class of 2017 have never been higher. Go ALL out and make the most of your last high school Spirit Week!<\/em>\r\n\r\nMonday: 90s day\r\n\r\n<span style=\"font-weight: 400;\">It’s time to break out those razor scooters and roller blades. If you aren’t confident enough rollerblading around campus, we recommend you stick to a scooter. Make sure to blast those 90s jams all day around campus, preferably with an oversized boombox. If thats not your style, you can also sport a pair of headphones around your neck. We expect to hear NSYNC, Backstreet Boys and Britney Spears all day long. Don't forget to break out it’s also time to break out your colorful windbreakers, scrunchies, chokers, denim overalls and good ol' Chuck Taylor's. <\/span>\r\n\r\nTuesday: Dressing day - Caesar\r\n\r\n<span style=\"font-weight: 400;\">One word: Togas. Grab a white bed sheet and create your very own Toga by following these <a href=\"http:\/\/www.al.com\/living\/index.ssf\/2014\/09\/how_to_tie_a_toga_photos_video.html\" target=\"_blank\">simple steps<\/a>. Accessorize your toga with all the gold and purple jewelry you can find and some gladiator sandals.<\/span>\r\n\r\nWednesday: Night rally - Green\r\n\r\n<span style=\"font-weight: 400;\">For your final Spirit Week, you’ll be representing your class color at the night rally at 7 p.m. on Oct. 19. Grab all the neon green glow sticks you can along with lime green tights. From head to toe, rep that bright green for the class of 2017.<\/span>\r\n\r\n&nbsp;\r\n\r\n[caption id=\"attachment_124078\" align=\"alignleft\" width=\"210\"]<img class=\"wp-image-124078\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_93011.jpg\" alt=\"\" width=\"210\" height=\"323\" \/> Staff Writer Isabella Marcus and Managing Editor Sherwin Amsbaugh wear their camo and Paly gear for \"Paly\" Day.[\/caption]\r\n\r\nThursday: Generations day - Senior Citizens\r\n\r\nYou're finally at the top of the food chain. Senior citizens day is by far the most anticipated theme of generations day. It's time to dress up as that 70-year-old grandma and grandpa you've been waiting to be since freshmen year. Grab a cane, walker or wheelchair and make sure to dye your hair a nice wispy grey. We expect to see tons of pillows attached to your rear end and lipstick smudged all over your face. Make sure to go all out on one of your final Spirit Week days.\r\n\r\nFriday: Camo\r\n\r\n<span style=\"font-weight: 400;\">It’s year four, <\/span><span style=\"font-weight: 400;\">you should know what to do by now. Make sure to finish your high school Spirit Week career on a high note and make memories that will last a lifetime<\/span>.","excerpt":"Spirit Week is by far the best week of the year at Palo Alto High School. Check out The Paly Voice's dress up guide for the   senior class!","date":"2016-10-11 16:36:51","author":"Isabella Marcus","categories":["Uncategorized"],"tags":["#palyspirit","2016","dance","palo alto","palo alto high school","paly","seniors","Spirit Week","vikings"]},{"id":123934,"title":"Spirit Week dress up preview: Juniors","permalink":"http:\/\/palyvoice.com\/2016\/10\/11\/spirit-week-dress-up-preview-juniors\/","content":"<em>Dear Juniors,<\/em>\r\n\r\n<em>Last year, you fought a great fight, but unfortunately came up short of the upset. You faltered on the float and dance, which ultimately was the reason you came in third place. However, you killed it during the rallies. If you  are able to improve on your float and dance from last year and replicate your success at the rallies, the Class of 2018 could be a large threat to the seniors.<\/em>\r\n\r\n&nbsp;\r\n\r\n<span style=\"font-weight: 400;\">Monday: Theme day - Boxers<\/span>\r\n\r\n<span style=\"font-weight: 400;\">It’s time for the Class of 2018 to enter the Spirit Week ring for the third time. Following last year's Spirit Week, this year’s juniors are expected to impress. Grab your white undershirts, robes, boxing gloves and title belts, and knock this week out. Along with this, girls can sport those boxing braids you’ve been dying to wear. Boxing gloves can be expensive, but are available on Amazon and eBay. You can also wrap your hands with athletic tape or pre-wrap as a less expensive substitute to the gloves.<\/span>\r\n\r\n[caption id=\"attachment_123988\" align=\"alignleft\" width=\"351\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9249.jpg\"><img class=\" wp-image-123988\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9249.jpg\" alt=\"Staff Writers Kasra Orumchian and Isabella Marcus wear their tropical clothing for the Junior spirit day &quot;Thousand Island&quot;.\" width=\"351\" height=\"234\" \/><\/a> Staff Writers Kasra Orumchian and Isabella Marcus wear their tropical clothing for the Junior spirit day \"Thousand Island\". Photo by Sherwin Amsbaugh[\/caption]\r\n\r\nTuesday: Dressing day - Thousand Island\r\n\r\n<span style=\"font-weight: 400;\">It’s time for the juniors to run this beach one more time. Go all out with leis, coconut bras, hula skirts, bathing suits  and Tommy Bahama shirts. Amazon, Target, Goodwill, Dollar Stores and Walmart should be able to provide you with those key outfits you are looking so dearly for. This day is the perfect opportunity to bring an assortment of pool floaties to the quad. You should be able to reuse some of that lifeguard material, and must bring that hawaiian spirit. <\/span>\r\n\r\nWednesday: Night rally - Yellow\r\n\r\n<span style=\"font-weight: 400;\">For the night rally, this is the easiest and by far the most vibrant color to wear for a night time event. Yellow hats, class t-shirts, yellow socks and shorts and whatever yellow you can find will look great next to the green and red classes around you. Amazon should be able to provide all forms of yellow attire, and any glow sticks or neon you seek. Target, Goodwill and Walmart may also have good options for you if you need to find anything else yellow.<\/span>\r\n\r\nThursday: Generations day - Sophisticates\r\n\r\n<span style=\"font-weight: 400;\">Ladies and gentlemen, it’s time to dress for success. Ladies, grab those pencil skirts, white blouses, blazers and heels if you’re feeling daring. Gentlemen make sure to rock those suits and ties. The perfect accessories for everyone and anyone includes briefcases, a bluetooth earpiece, a coffee mug and glasses. You can borrow your suits and various sophisticate items from your parents, or can buy your own off Amazon. <\/span>\r\n\r\nFriday: Paly - Green and White\r\n\r\n<span style=\"font-weight: 400;\">Juniors, it's your last time wearing your Paly gear on the last day of Spirit Week. Make it a memorable final run-through grab your Paly T-shirts, sweatshirts, hats, socks, underwear, gloves, pants and any other Paly gear you have. Viking Helmets, and green and white face paint never disappoint, and there’s no excuse why you should disappoint either. Hit the field after school to watch the official unveiling of your float and Spirit Dance to the rest of the classes, as Spirit Week comes to a close.<\/span>","excerpt":"Spirit Week is by far the best week of the year at Palo Alto High School. Check out The Paly Voice's dress up guide for the junior class!","date":"2016-10-11 16:36:21","author":"Isabella Marcus","categories":["Uncategorized"],"tags":["#palyspirit","2018","ASB","boxing","juniors","palo alto high school","paly","paly spirit week","sophisticates","Spirit Week","thousand island"]},{"id":123887,"title":"Spirit Week dress up preview: Sophomores","permalink":"http:\/\/palyvoice.com\/2016\/10\/11\/spirit-week-dress-up-preview-sophomores\/","content":"Dear Sophomores,\r\n\r\n<em><span style=\"font-weight: 400;\">It’s time for round two. You guys left your mark on the other classes last year, as one of the best freshman classes we’ve ever seen at Paly. Although you fell to last place, expectations are high for you to perform this year.<\/span><\/em>\r\n\r\nMonday: Theme day - Firefighters\r\n\r\n<span style=\"font-weight: 400;\">When things get L17 , it’s time for the firefighters to come and extinguish those flames. Bring your A-game and rock those firefighter hats, boots, jackets and suspenders. For a more affordable option, throw on a plain white shirt and some black bottoms paired with red suspenders and firefighter hat.<\/span>\r\n\r\n[caption id=\"attachment_123971\" align=\"alignleft\" width=\"347\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9184.jpg\"><img class=\" wp-image-123971\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9184.jpg\" alt=\"Staff Writers Kasra Orumchian and Isabella Marcus wear their flannels in preparation to &quot;Ranch&quot; day.\" width=\"347\" height=\"231\" \/><\/a> Staff Writers Kasra Orumchian and Isabella Marcus rock their flannels in to demostrate what to wear for \"Ranch\" day. Photo by Sherwin Amsbaugh[\/caption]\r\n\r\nTuesday: Dressing day - Ranch\r\n\r\n<span style=\"font-weight: 400;\">Hay is for horses, but is also appropriate as a Quad decoration. Grab your flannels, cowboy hats, and ride the rodeo. Carrots may go well with ranch dressing, but on this day, put on a bandanna or any other assorted cowboy apparel. Bandannas should be rather accessible to anyone; you can borrow them from a friend, or go out and buy them from most retail stores. Almost everything for this day can be found on Amazon, Target and Walmart and should supply you with what you need.<\/span>\r\n\r\nWednesday: Night rally - Red\r\n\r\n<span style=\"font-weight: 400;\">It’s time for the night rally. The class of 2019 impressed at every rally last year and is expected to do the same this year. Sophomores, grab your red and take to the bleachers for the second ever night rally in Paly history. Red might be a hard color to light the night with, but we’re confident that you can do it. Try getting some red neon glow sticks and wear them as necklaces or bracelets. Amazon has a wide and reliable variety of neon material that you can get for a moderately low price.<\/span>\r\n\r\nThursday: Generations day - Teenyboppers\r\n\r\n<span style=\"font-weight: 400;\">Teenybopper day is commonly known as “greasers day,” so grab your bluetooth speakers and jam out to the soundtrack of “Grease\". If you want to leave a lasting impression on the other classes, earn the hand jive to show your greaser spirit. Stay golden, Ponyboy. For boys, you want to embody the greaser spirit, so slick back your hair, grab your leather jackets and show off that teenage angst. Girls, it’s time to live out your life goals of being Sandy from “Grease.” Grab a traditional poodle skirt and pair it with a “pink ladies” jacket or take the alternate approach and rock those pin-up curls, red lipstick and leather jackets. <\/span>\r\n\r\nFriday: Paly - Green and White\r\n\r\n<span style=\"font-weight: 400;\">Sophomores, you've done this before, and should know how to do it again. Grab your Paly T-shirts, sweatshirts, hats, socks, underwear, gloves, pants and any other Paly gear you have. Viking Helmets and green and white face paint never disappoint, so there’s no excuse why you should disappoint either. Hit the field after school to watch the official unveiling of the floats and Spirit Dances to the rest of the classes as Spirit Week comes to a close.<\/span>","excerpt":"Spirit Week is by far the best week of the year at Palo Alto High School. Check out The Paly Voice's dress up guide for the sophomore class!","date":"2016-10-11 16:35:48","author":"Isabella Marcus","categories":["Uncategorized"],"tags":["#palyspirit","2016","ASB","freshman","juniors","palo alto","palo alto high school","paly","preview","seniors","Sophomores","Spirit Week","SpiritWeek16","student","vikings"]}]