[{"id":120542,"title":"Baseball steals SCVAL title with 7th inning rally","permalink":"http:\/\/palyvoice.com\/2016\/05\/15\/baseball-steals-scval-title-with-7th-inning-rally\/","content":"[caption id=\"attachment_120565\" align=\"alignnone\" width=\"650\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/SCVAL-champs.jpg\"><img src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/SCVAL-champs.jpg\" alt=\"Junior shortstop Ethan Stern looks to turn a double play during a regular season game against Los Gatos during a home league match. The Vikings defeated the Wildcats in the final game of a three-game series to secure the SCVAL title. Photo by Cooper Lou. \" width=\"650\" height=\"432\" class=\"size-full wp-image-120565\" \/><\/a> Junior shortstop Ethan Stern looks to turn a double play during a regular season game against Los Gatos. The Vikings defeated the Wildcats in the final game of a three game series to secure the SCVAL title. Photo by Cooper Lou. [\/caption]\r\nThe Palo Alto High School baseball team (23-5-1, 12-2) defeated the Los Gatos High School Wildcats (20-12, 13-1), 3-2, thanks to a three-run rally in the final inning of the Santa Clara Valley Athletic League championship game on Friday at Los Gatos.\r\n\r\nSophomore starting pitcher Jeremy Akioka held the Wildcats to just one run in five and one-third innings pitched, giving up his lone run in the third inning. Akioka said the team stayed strong despite trailing for most of the game.\r\n\r\n\"Our team did a great job of battling from behind and getting the hits when it mattered,\" Akioka said.\r\n\r\nDown 2-0, the Vikings were unable to score off Los Gatos' starting ace until the seventh and final inning where they sparked a three run rally.\r\n\r\nThis unlikely comeback started with a walk of senior Justin Hull, followed by a deep double off the right field wall by sophomore second baseman Max Jung-Goldberg. A pair of singles by seniors Alec Olmstead and Lawrence Han scored both Hull and Jung-Goldberg.\r\n\r\nThe Vikings finally took the lead off of a beautiful bunt by junior pinch-hitter Michael Champagne, which scored Olmstead from third.\r\n\r\nChampagne said the Vikings defense, specifically their pitching, enabled the offense to make a comeback late in the game and hopes the team can carry its momentum into the Central Coast Section playoffs.  \r\n\r\n\"Our pitching helped keep us in the game and we finally came alive in the 7th and had a great rally to take the lead,\" Champagne said. \"Niko Lillios provided a clutch closing inning to seal the victory. If our team can bottle that intensity we hope to have a far run in CCS.\"\r\n\r\nSophomore relief pitcher Niko Lillios sealed the game by forcing two flyouts and a strikeout.\r\n\r\nThe Vikings will move on to compete in the CCS playoffs in the coming weeks The game time, opponent, and location have not yet been decided.\r\n\r\nAccording to Akioka, the team looks to continue its hot streak into the next round.\r\n\r\n\"We're confident that we will be able to use our momentum to push far through CCS this year,\" Akioka said.\r\n\r\n","excerpt":"The Palo Alto High School baseball team (23-5-1, 12-2) defeated the Los Gatos High School Wildcats (20-12, 13-1) 3-2, thanks to a three-run rally in the final inning of the Santa Clara Valley Athletic League championship game on Friday at Los Gatos.","date":"2016-05-15 19:40:38","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/SCVAL-champs.jpg","categories":["Baseball","Sports","Spotlight","Uncategorized"],"tags":["Baseball","CCS","gatos","Jung-Goldberg","Lillios","niko","palo alto","rally","schoeben","scval","viking","win"]},{"id":119263,"title":"Coffee Chats: English teacher Mimi Park","permalink":"http:\/\/palyvoice.com\/2016\/05\/12\/coffee-chats-english-teacher-mimi-park\/","content":"[caption id=\"attachment_119592\" align=\"alignnone\" width=\"439\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/13081997_1018696691539752_124260599_n.jpg\"><img class=\" wp-image-119592\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/13081997_1018696691539752_124260599_n.jpg\" alt=\"English and Humanities teacher Mimi Park sits at her desk with an iced latte while discussing her career change. \" width=\"439\" height=\"439\" \/><\/a> English and Humanities teacher Mimi Park sits at her desk with an iced latte while discussing her transition from wanting to be a lawyer to becoming a teacher. Photo by Emilia Diaz-Magaloni[\/caption]\r\n\r\n<i><span style=\"font-weight: 400;\">This is the fourth installment of Coffee Chats, where The Paly Voice gets to know staff members over a cup of coffee.<\/span><\/i>\r\n\r\n<span style=\"font-weight: 400;\">The Paly Voice sat down with English and Humanities teacher Mimi Park over an iced latte to discuss her transition from prospective lawyer to teacher, and her advice for Paly students.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">This is Park’s fourth year teaching at Palo Alto High School. She teaches English 9 and English 9A, as well as Humanities. While Park loves teaching high school English, teaching was not her first passion.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I graduated from law school, but when I left law school I decided I really didn’t want to be a lawyer,” Park said. “I really loved English, which was my major, but when I spoke with my professors a few years later and said 'I’m thinking about becoming a professor,' they were like ‘Don’t do it! If you want to teach, go to public school, because there are no jobs in the humanities Ph.D. market.’” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Park took her professor’s advice and started looking at programs that would give her a teaching credential. She decided she wanted to move to California <\/span><span style=\"font-weight: 400;\">and ended up going to Stanford University's teacher education program.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“When I started looking for jobs there was an opening here at Paly. It was part time and I was like, 'I can't do that because I have to pay rent,'\" Park said. \"Incredibly fortuitously, a teacher soon after took a leave for a year and there were enough classes open that I could get nearly a full-time position. I was hired at Paly and have been here for the past four years.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Park explains that one of the major differences between being a lawyer and teaching high schoolers is who you are working for.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I was thinking of doing corporate law and my clients would have been gigantic corporations,\" Park said. \"I was so used to thinking about adults as my clients, and as a teacher, I had to readjust my thinking and start being more aware of the different issues surrounding public education, from the legal issues to policy to even the social-emotional aspects of the students.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Despite the difficult transition from lawyer to high school teacher, Park says that being open to changing careers taught her how to relate to Paly students. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I would say my biggest piece of advice is don't pigeonhole yourself; be open to changing your path or looking for new opportunities, and don’t be afraid to embrace them because it is really easy to get into the mindset of 'this is what I'm going to do and this is what I'm going to be,'” Park said. <\/span>\r\n\r\nPark recalls having spent all of her high school and college years preparing for pre-law. However, when she achieved her goal, she realized that being a lawyer just wasn't for her.\r\n\r\n<span style=\"font-weight: 400;\">“I planned to be a lawyer since 8th grade when people told me I talk too much and therefore I should be a lawyer,\" Park said. \"It was the scariest and biggest decision I've probably made in my life so far, to give up three years of education and a lot of money and not have a plan,\" Park said. \"I had a year where I had to think about what I wanted to do. It's terrifying, but I think that being really open to that is a super important thing.\"<\/span>\r\n\r\nAccording to Park switching to teaching was the best decision she's ever made.\r\n\r\n\"I love teaching, and I’m fortunate to be in a career when I’m actually excited about coming to work and happy about the work I do, versus dreading the day ahead,\" Park said.","excerpt":"The Paly Voice sat down with English and Humanities teacher Mimi Park over an iced latte to discuss her transition from prospective lawyer to teacher, and her advice for Paly students.","date":"2016-05-12 21:08:12","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/13081997_1018696691539752_124260599_n.jpg","categories":["Coffee chats","Features"],"tags":["coffeechats","english","Humanities","mimi park","palo alto","paly"]},{"id":120425,"title":"Liveblog: Baseball vs. Los Gatos in SCVAL elimination game","permalink":"http:\/\/palyvoice.com\/2016\/05\/12\/liveblog-baseball-vs-los-gatos-in-scval-elimination-game\/","content":"[caption id=\"attachment_120116\" align=\"alignnone\" width=\"450\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/baseball-beats-los-altos.jpg\"><img src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/baseball-beats-los-altos.jpg\" alt=\"Senior pitcher Alec Olmstead warms up with Senior catcher Lawrence Han before a regular season game against Los Gatos High School. Han has been a dependable plate general for the Vikings all season. Photo by Cooper Lou. \" width=\"450\" height=\"518\" class=\"size-full wp-image-120116\" \/><\/a> Senior pitcher Alec Olmstead warms up with Senior catcher Lawrence Han before a regular season game against Los Gatos High School. Han has been a dependable plate general for the Vikings all season. Photo by Cooper Lou. [\/caption]\r\nThe Palo Alto High School baseball team (21-5-1, 12-2) faces off against Los Gatos High School (20-10, 13-1) in a must win Santa Clara Valley Athletic League playoff game at 4:30 p.m. Tuesday at home. The Vikings fell to Los Gatos in the first match of the two game series. \r\n\r\n[liveblog] ","excerpt":"The Palo Alto High School baseball team (21-5-1, 12-2) faces off against Los Gatos High School (20-10, 13-1) in a must win Santa Clara Valley Athletic League playoff game at 4:30 p.m. Tuesday at home.","date":"2016-05-12 10:47:02","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/baseball-for-los-altos-story-1.jpg","categories":["Baseball","Spotlight","Uncategorized"],"tags":["Baseball","los gatos","palo alto"]},{"id":120386,"title":"Boys&#8217; golf qualifies for CCS Championship","permalink":"http:\/\/palyvoice.com\/2016\/05\/11\/boys-golf-qualifies-for-ccs-championship\/","content":"[caption id=\"attachment_120403\" align=\"alignnone\" width=\"619\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/13184547_1720898391485755_1901.jpg\"><img class=\" wp-image-120403\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/13184547_1720898391485755_1901.jpg\" alt=\"Junior Timothy Liu tees off at a match against Los Altos during the regular season. Photo by Cooper Lou \" width=\"619\" height=\"414\" \/><\/a> Junior Timothy Liu tees off at a match against Los Altos High School during the regular season. Photo by Cooper Lou.[\/caption]\r\n\r\nTop members of the Palo Alto High School boys' golf team dominated their competition at the Central Coast Section regionals on Tuesday in Carmel Valley, allowing them to qualify for the CCS final.\r\n\r\nAccording to head coach Doyle Knight, the team shot 367, only 12 over par, securing the victory for the Vikings.\r\n\r\nThe Vikings have yet to lose a match all season, as they head into the final.\r\n\r\nAccording to sophomore Ahmed Ali, the team is looking forward to CCS and possibly beyond.\r\n\r\n\"The depth on our team is great and we are really looking forward to trying to advance to NorCal,\" Ali said.\r\n\r\nDespite winning the game, Ali says that the team has the ability to play at an even higher level.\r\n\r\n\"Individually I think each one of us could've played a little better, [this] is great because we won CCS [regionals] without all of our A games,\" Ali said.\r\n\r\nThe team will compete in the CCS finals next Tuesday again at Rancho Canada Golf Club in Carmel Valley.","excerpt":"Top members of the Palo Alto high school boys' golf team dominated the competition at the Central Coast Section regionals on Tuesday in Monterey, allowing them to qualify for the CCS final.\r\n","date":"2016-05-11 21:20:53","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/13184547_1720898391485755_1901.jpg","categories":["Golf","Sports","Spotlight"],"tags":["ahmed ali","Boys","CCS","Golf"]},{"id":120260,"title":"Season recap: Seniors reflect on boys&#8217; tennis experience","permalink":"http:\/\/palyvoice.com\/2016\/05\/11\/season-recap-seniors-reflect-on-boys-tennis-experience\/","content":"[caption id=\"attachment_120315\" align=\"alignnone\" width=\"620\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Adriancandid1.jpg\"><img class=\" wp-image-120315\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Adriancandid1.jpg\" alt=\"Junior Adrian Smith will look to make his fourth and final year his best when tennis resumes next season. Photo by Sam Lee. \" width=\"620\" height=\"413\" \/><\/a> Junior Adrian Smith will try to make his fourth and final year his best when tennis resumes next season. Photo by Sam Lee.[\/caption]\r\n\r\nDespite an injury-riddled season and the departure of several key seniors, members of the Palo Alto High School boys' tennis team are excited for what next season will bring, even with the departure of several key seniors.\r\n\r\nThe Vikings failed to reach the Central Coast Section playoffs this season, but juniors Jerry Hong, Adrian Smith and Henry Badger, sophomore Hunter North, and freshmen Adam Love and Antony Georgiadis <a href=\"http:\/\/palyvoice.com\/2016\/04\/26\/viking-boys-tennis-players-advance-to-scval-finals\/\">all participated<\/a> in Santa Clara Valley Athletic League postseason play. None of the players advanced past the SCVAL rounds.\r\n\r\nAccording to senior captain Shiv Matta, who suffered a concussion midway before the start of the De Anza League regular season, minor injuries frequently prevented the team from playing up to its full potential.\r\n\r\n\"It was a tough season because we had a lot of injuries and a lot of people missed time,\" Matta said. \"Our lineup had to keep changing to accommodate that, but nonetheless it was another fun season with the team.\"\r\n\r\nAlthough Matta and fellow seniors Drew Embersits and Carl Goodfriend are frustrated by the tough season, they say that they are excited for the team's future.\r\n\r\n\"It was a tough season with injuries and the like, but a lot of underclassmen performed really well, which means a lot of potential for the future,\" Embersits said. \"Overall it was a good season with only better ones ahead.\"\r\n\r\nThe leadership role will be assumed by Smith, a varsity player since his freshman year, and other rising seniors including Badger and Hong.\r\n\r\nGoodfriend recalls team bonding activities as one of the top highlights of his Paly career.\r\n\r\n\"I really enjoyed all of the creative cheers we came up with over the years,\" Goodfriend said.\r\n\r\nAs for Matta, who is thinking of walking on to the University of Illinois at Urbana-Champaign tennis team in the future, his favorite memories consist of the team's competitive tournaments in Fresno.\r\n\r\n\"My favorite moments were the two Fresno trips I was a part of,\" Matta said. \"Sophomore year we won the back-draw [losers play a minimum of three matches] tournament and last year we won it all so they were two great trips with a lot of success and a lot of fun.\"\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"Despite an injury-riddled season, members of the Palo Alto boys' tennis team are excited for what next season will bring, even with the departure of several key seniors. ","date":"2016-05-11 18:42:32","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Adriancandid1.jpg","categories":["Sports","Spotlight"],"tags":["#tagsarecool","badger","cause nika said so","embersits","georgiadis","goodfriend","Harader","hong","love","matta","north","paly tennis","sports","tennis"]},{"id":120352,"title":"Boys&#8217; lacrosse looks to move onto league finals","permalink":"http:\/\/palyvoice.com\/2016\/05\/10\/boys-lacrosse-looks-to-move-onto-league-finals\/","content":"[caption id=\"attachment_51413\" align=\"alignnone\" width=\"568\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/03\/mce_031113_0382.jpg\"><img class=\" wp-image-51413\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/03\/mce_031113_0382.jpg\" alt=\"Seniors Skyler Anderson (left) and Weston Preising celebrate Anderson's goal in the second quarter of Paly's 12-11 home loss to Burlingame Monday night. Photo by Matt Ersted.\" width=\"568\" height=\"378\" \/><\/a> Seniors Skyler Anderson (left) and Weston Preising celebrate Anderson's goal in the second quarter of Palo Alto High School's 12-11 home loss to Burlingame. Photo by Matt Ersted.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto High School boys’ lacrosse team (15-5, 8-1) will take on Saratoga High School (6-7, 4-4) at 5:30 p.m. on Wednesday at the Paly lacrosse field, hoping to defeat the Falcons in the Santa Clara Valley Athletic League semi-finals. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">After a blowout win over Los Altos High School last Thursday, the Vikings look to continue their six-game win streak as the team heads towards the SCVAL finals. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to senior co-captain Cole Tierney, the Vikings feel optimistic heading into tomorrow’s game.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We feel pretty confident considering our placement in league,” Tierney said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Furthermore, Tierney said that the Vikings will focus on infiltrating the Falcons’ weak defense.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Saratoga has a good midfield, but their [Saratoga] defense is slow and they leave the back side open,” Tierney said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The last time the two teams met, the Vikings dominated the Falcons, scoring a massive 12 goals in the match according to Maxpreps.com<\/span>\r\n\r\nAlong with the team’s confidence, junior midfielder Jackson Dahl stresses the importance of staying focused.\r\n\r\n<span style=\"font-weight: 400;\">“In practice our major focus has been our mental game, because that is usually our limiting factor,” Dahl said. “If we can pull together, work as a team, and stay focused throughout the entire game, then we can do anything.”<\/span>","excerpt":"The Palo Alto High School boys’ lacrosse team (15-5, 8-1) will take on Saratoga High School (6-7, 4-4) at 5:30 p.m. on Wednesday at the Paly lacrosse field, hoping to defeat the Falcons in the Santa Clara Valley Athletic League semi-finals.\r\n","date":"2016-05-10 23:31:48","author":"Sam Lee","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/03\/mce_031113_0382.jpg","categories":["Sports","Spotlight"],"tags":["Boys","cole tierney","Jackson Dahl","Lacrosse","lax","paly","Saratoga Falcons","scvals","sports","vikings"]},{"id":120239,"title":"What&#8217;s in my bag: Tiffany Tsay","permalink":"http:\/\/palyvoice.com\/2016\/05\/10\/whats-in-my-bag-tiffany-tsay\/","content":"As part of The Paly Voice’s “What’s in my Bag” series to find out more about students at Palo Alto High School, we sat down with senior Tiffany Tsay to ask what’s in her bag. Hover around the photos to learn more. Photos by Cooper Lou.\r\n\r\n<img class=\"alwaysThinglink\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/785370092467650561\/1024\/10\/scaletowidth#tl-785370092467650561;1043138249'\" alt=\"\" \/><script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script>","excerpt":"As part of The Paly Voice’s “What’s in my Bag” series to find out more about students at Palo Alto High School, we sat down with senior Tiffany Tsay to ask what’s in her bag. ","date":"2016-05-10 10:51:35","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Tiff2.jpg","categories":["Multimedia","Spotlight"],"tags":["jackson nelson-gal","palo alto high school","paly","tiffany tsay","what's in my bag"]},{"id":120317,"title":"Badminton players win at Leagues, head to CCS","permalink":"http:\/\/palyvoice.com\/2016\/05\/09\/badminton-players-win-at-leagues-head-to-ccs\/","content":"Four players from the Palo Alto High School badminton team are heading to the Central Coast Section finals after placing at the Santa Clara Valley Athletic League competition on Saturday.\r\n\r\nThe three-day tournament started on Thursday, and determined who goes to the Central Coast Sections finals and ultimately, the CIF-Norcal competition. The team went into Leagues winning five of the 12 dual games, according to sophomore Emily Yu.\r\n\r\nAccording to Yu, the top four players in each division heads to CCS. There were 24 players from Paly who competed at Leagues.\r\n\r\nSophomore Michael Chau and senior Eric Chiang placed first in the boy's doubles division, according to Chiang. The pair won six of their seven games.\r\n<div class=\"_4tdt\">\r\n<div class=\"_4tdv\">\r\n<div class=\"_5wd4 _1nc7 direction_ltr\">\r\n<div class=\"_5wd9\">\r\n<div class=\"_5wde _n4o\">\r\n<div class=\"_5w1r _3_om _5wdf\">\r\n<div class=\"_4gx_\">\r\n<div class=\"_d97\">\r\n\r\n<span class=\"_5yl5\">\"I think we played pretty well,\" Chiang said. \"For the past week or two, I have had a shoulder injury which prevented us from playing at our best. There are still things we can approve as this is just the second time we played doubles together this season.\"<\/span>\r\n<div class=\"_d97\">\r\n<div class=\"_4tdt\">\r\n<div class=\"_4tdv\">\r\n<div class=\"_5wd4 _1nc7 direction_ltr\">\r\n<div class=\"_5wd9\">\r\n<div class=\"_5wde _n4o\">\r\n<div class=\"_5w1r _3_om _5wdf\">\r\n<div class=\"_4gx_\">\r\n<div class=\"_d97\">\r\n\r\nThe pair hopes to final at CCS and advance to the CIF-Norcal competition.\r\n<div class=\"_4tdt\">\r\n<div class=\"_31o4\">\r\n\r\n\"The only goal we have in mind right now, considering the regular season is over, is to get to NorCal and hopefully place at NorCal,\" Chiang said.\r\n<div class=\"_31o4\">\r\n\r\n The Vikings also did well in the girl's double division, with senior Priya Misner and junior Flavia Stiglich finishing second, winning five of their seven games.\r\n<div class=\"_31o4\">\r\n\r\nOther notable performances included sophomore Tilak Misner, who got to the quarterfinals in the boy's single division before dropping. He won four of his six games, placing him in seventh place.\r\n\r\nMore information on rankings and records can be found at this <a href=\"http:\/\/challonge.com\/users\/mugdays\">website<\/a>.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","excerpt":"Four players from the Palo Alto High School Badminton team are heading to the Central Coast Section finals after placing at the Santa Clara Valley Athletic League competition on Saturday. ","date":"2016-05-09 21:25:22","author":"Julia Qiao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/IMG_0416.jpg","categories":["Badminton","News","Spotlight"],"tags":["badminton","CCS","eric chiang","Flavia Stiglich","leagues","Michael Chau","Priya Misner","scval","Tilak Misner"]},{"id":120266,"title":"&#8220;Captain America: Civil War&#8221; is basically &#8220;Avengers 2.5&#8221;","permalink":"http:\/\/palyvoice.com\/2016\/05\/09\/captain-america-civil-war-is-basically-avengers-2-5\/","content":"[caption id=\"attachment_120296\" align=\"alignnone\" width=\"640\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Captain-America-Civil-War_1457366587703_891849_ver1.0_640_360.png\"><img src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Captain-America-Civil-War_1457366587703_891849_ver1.0_640_360.png\" alt=\"Falcon (Anthony Mackie), Ant-Man (Paul Rudd), Hawkeye (Jeremy Renner), Captain America (Chris Evans), Scarlet Witch (Elizabeth Olson) and the Winter Soldier (Sebastian Stan) make up Captain America&#039;s team in &#039;Captain America: Civil War.&#039; Photo: © 2016-Marvel Studios\" width=\"640\" height=\"334\" class=\"size-full wp-image-120296\" \/><\/a> Falcon (Anthony Mackie), Ant-Man (Paul Rudd), Hawkeye (Jeremy Renner), Captain America (Chris Evans), Scarlet Witch (Elizabeth Olson) and the Winter Soldier (Sebastian Stan) make up Captain America's team in 'Captain America: Civil War.' Photo: © 2016-Marvel Studios[\/caption]\r\n\r\n\r\n\"Captain America: Civil War\" directors Joe and Anthony Russo tell the story of the conflict between two central characters in the Marvel Universe, succeeding in some areas but falling short in others. Based off of a Marvel comic of the same name, \"Civil War\" revolves around the the growing rift between Iron Man (Robert Downey Jr.) and Captain America (Chris Evans). As the situation escalates, their friends are forced to choose sides and fight.\r\n\r\nThe movie begins with a bang, as Scarlet Witch (Elizabeth Olsen) accidentally causes an explosion, killing several civilians which leads to the question of whether the Avengers should be regulated. Secretary of State Thaddeus Ross (William Hurt) approaches the Avengers with a plan to place them under United Nations control, no longer allowing them to operate independently.  Lines are drawn quickly as Iron Man voices his support for the plan, along with Black Widow (Scarlett Johansson), Vision (Paul Bettany) and War Machine (Don Cheadle). Captain America is against the plan and refuses to obey them, putting him and Iron Man on opposing sides.\r\n\r\nDespite all this, the plan proposed by Ross is not the main source of conflict. This instead comes from the reappearance of the Winter Soldier (Sebastian Stan), and the introduction of a mysterious villain Helmut Zemo, (Daniel Bruhl). It is the lengths that Captain America goes to protect his friend, and the loyalty that he has towards him that drives the conflict and results in quite possibly the most spectacular battle scene in the Marvel franchise, bringing together all of the Avengers and some extras as Ant-Man (Paul Rudd), Spider-Man (Tom Holland) and Black Panther (Chadwick Boseman) all choose sides and fight.\r\n\r\nWhere the movie falls flat, however, is the main underlying story. Captain America and Iron Man are friends, then they fight, but then they become friends again? Wait, no, they're fighting again. The final fight between the two just feels too forced; there isn't really a rational reason behind it. In addition, the main villain, Zemo, doesn't seem to convey a serious threat. His motives are clear, but his plan is simply too convoluted. He does however participate in a nice little twist that breaks away from the standard Marvel formula. Despite this Zemo simply isn't given enough room to work a screen, creating a flimsy antagonist, a problem that Marvel movies have been repeating, with the exception of Loki (Tom Hiddleston) in \"The Avengers.\" \r\n\r\nOne of the best parts of the movie is the addition of Spider-Man, who makes his debut in the Marvel cinematic universe. With Sony's release of the Spider-Man license, Marvel is now able to use the character in future movies. Holland nails the role of a teen superhero, with all the quips and jokes that the superhero is supposed to have. He is the first movie version of Spider-Man that actually feels and acts like a kid. Despite only appearing in the movie for a brief moment, he absolutely steals the spotlight, overshadowing the introduction of another key Marvel character, Black Panther. Nonetheless, Black Panther is a welcome addition to the movie and has a solid subplot to the overall story.\r\n\r\nWhile not on the same level as \"Captain America: The Winter Soldier\", \"Civil War\" manages to deliver a solid package. The introduction of new characters (Spider-Man!) and some incredible fight scenes more than make up for a shaky plot. If you enjoy any Marvel movie, do yourself a favor and go see this one.\r\n\r\n<strong> Captain America: Civil War\r\n2 hours 27 minutes\r\nRated PG-13\r\nDirected by Joe and Anthony Russo\r\nStarring Chris Evans, Robert Downey Jr., Sebastian Stan<\/strong>\r\n","excerpt":" Based off of a Marvel comic of the same name, \"Civil War\" revolves around the the growing rift between Iron Man (Robert Downey Jr.) and Captain America (Chris Evans). As the situation escalates, their friends are forced to choose sides and fight.","date":"2016-05-09 18:07:01","author":"Jackson Doerr","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Captain-America-Civil-War_1457366587703_891849_ver1.0_640_360.png","categories":["Entertainment","Reviews","Uncategorized"],"tags":["avengers","captain america","civil war","marvel"]},{"id":120137,"title":"News in Review: April 2016","permalink":"http:\/\/palyvoice.com\/2016\/05\/08\/news-in-review-april-2016\/","content":"<em>This installment of the News in Review series summarizes the most important news stories and events from the month of April in a timeline format.\r\n<\/em>\r\n\r\n&nbsp;\r\n\r\n<iframe src=\"https:\/\/cdn.knightlab.com\/libs\/timeline3\/latest\/embed\/index.html?source=1vtcizLawVLBD5S3vLWcpwxxr8TeYE8PY2rVQjXNGQrE&amp;font=Default&amp;lang=en&amp;initial_zoom=2&amp;height=650\" width=\"100%\" height=\"650\" frameborder=\"0\"><\/iframe>","excerpt":"This installment of the News in Review series summarizes the most important news stories and events from the month of April in a timeline format.","date":"2016-05-08 14:15:22","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/untitled-presentation1.png","categories":["Multimedia","Spotlight"],"tags":["i love news","more news","news","news ???","news in review","news is crazy fun","news news news","news saved my life","news&lt;3333","plz news","review","so much news","such news","very news"]}]