[{"id":116525,"title":"Admin investigates Franco mural vandalism","permalink":"http:\/\/palyvoice.com\/2016\/02\/16\/admin-investigates-franco-mural-vandalism\/","content":"[caption id=\"attachment_116533\" align=\"alignnone\" width=\"594\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/FullSizeRender.jpg\"><img class=\"wp-image-116533\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/FullSizeRender.jpg\" alt=\"james franco mural graffiti\" width=\"594\" height=\"455\" \/><\/a> Sophomores Chloe Hong and Julia Qiao ate beside a mural painted on the Student Center wall today during lunch. Administration discovered the words, \"How do you vandalize garbage?\" after school today and are taking prompt action to remove it. Photo by Adrienne Kwok.[\/caption]\r\n\r\nThe Palo Alto High School administration is looking to investigate damages done to a mural painted by Paly alumnus and actor James Franco as of Feb. 16.\r\n\r\nStudents and staff were greeted after the President’s Day weekend with red, spray-painted letters graffitied onto one of two murals Franco had painted last year on the Student Center. The words, “How do you vandalize garbage?” covered his painting depicting student football players.\r\n\r\n<span style=\"line-height: 1.5;\">According to Assistant Principal Jerry Berkson, the district is searching for a method to remove the red paint without affecting the original work.<\/span>\r\n\r\n“I have to see if the district can fix it, remove that painting without removing the real painting,” Berkson said.\r\n\r\nAccording to Berkson, identifying those responsible was made harder due to the extended weekend.\r\n\r\n“The problem is catching someone,” Berkson said. “Since we noticed it today, it was probably done over a four [five] day weekend. But we’re on it.”\r\n\r\n[caption id=\"attachment_116530\" align=\"alignright\" width=\"332\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/franco6.jpg\"><img class=\"wp-image-116530\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/franco6.jpg\" alt=\"james franco mural graffiti\" width=\"332\" height=\"254\" \/><\/a> Students observed as one of James Franco's murals was painted in fall 2014. Photo by Adrienne Kwok.[\/caption]\r\n\r\nVandalism can result in a variety of consequences.\r\n\r\n“It could go anywhere from a legal matter [such as] bringing in the police to community service to suspension,” Berkson said.\r\n\r\nBefore the break, the administration <a href=\"http:\/\/palyvoice.com\/2016\/02\/11\/admin-removes-james-franco-mural-from-student-center\/\">painted over the mural<\/a> displaying students reading Paly’s newspaper, The Campanile. In addition to the murals, Franco, a graduate of 1996, has also donated multiple other paintings that are currently on display around campus.\r\n<div class=\"_5wd4 _1nc7 direction_ltr\">\r\n<div class=\"_5wd9\">\r\n<div class=\"_5wde _n4o\">\r\n<div class=\"_5w1r _3_om _5wdf\">\r\n<div class=\"_4gx_\">\r\n<div class=\"_d97\">\r\n\r\n<span class=\"_5yl5\">Some students responded by expressing their disapproval of the graffiti.<\/span>\r\n<div class=\"_5wd4 _1nc7 direction_ltr _2cnu\">\r\n\r\n“Even if you disapprove or dislike someone’s work, you’re still not entitled to vandalize it,” sophomore Adeline Zhou said. “Honestly it’s pretty disrespectful to Franco. I know I would be hurt if someone trashed my work.”\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","excerpt":"The Palo Alto High School administration is looking to investigate damages done to James Franco’s mural on the Student Center as of Feb. 16.","date":"2016-02-16 22:12:38","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/FullSizeRender.jpg","categories":["News","Spotlight"],"tags":["admin","art","center","football","franco","graffiti","james","mural","paly","student","vandalized"]},{"id":116490,"title":"Injured hawk found on campus","permalink":"http:\/\/palyvoice.com\/2016\/02\/16\/injured-hawk-found-on-campus\/","content":"[caption id=\"attachment_116509\" align=\"alignright\" width=\"403\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/hawk.jpg\"><img class=\" wp-image-116509\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/hawk.jpg\" alt=\"Animals services responded to the Paly administration's call about an injured Cooper's hawk on campus. Photo by Paul Kandell.\" width=\"403\" height=\"308\" \/><\/a> Animal services responded to the Paly administration's call about an injured Cooper's hawk on campus. Photo by Paul Kandell.[\/caption]\r\n\r\nThe avian life at Palo Alto High School is usually limited to seagulls, pigeons and a few smaller birds, but today, the campus had an unusual visitor — a hawk.\r\n\r\n<span style=\"font-weight: 400;\">Journalism teacher Paul Kandell was the first to spot the bird, later identified as a <a href=\"https:\/\/www.allaboutbirds.org\/guide\/Coopers_Hawk\/id\">Cooper's hawk<\/a>, limping in the walkway between the tower building and Haymarket Theatre at around 8:30 a.m. Campus supervisor AJ Castillo, called over to the scene by Kandell, notified front office secretary Jennifer Gardner, who then placed a call to Palo Alto Animal Services.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Upon arrival, Palo Alto animal control officer Ken Cunningham laid a blanket over the hawk and carried it to his vehicle, Castillo said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Cunningham, the bird had sustained an injury to its left talon.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Cooper’s hawks tend to be fractious, but he [the hawk] was so weak that he didn’t resist when I picked him up,” Cunningham said. \"He was <\/span><span style=\"font-weight: 400;\">traumatized, so we kept him covered completely to sedate him.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Cunningham explained that Cooper’s hawks are more prone to injury than their close relatives, red-tailed hawks, because they hunt from lower altitudes and make quicker movements.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto Animal Shelter contacted the Peninsula Wildlife Rescue, a subdivision of the Peninsula Humane Society, for further evaluation of the hawk’s injury, Cunningham said. The hawk will be in the Humane Society's care until it has been deemed strong enough to return to the wild.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“When the bird is successfully rehabilitated, they [the Humane Society] will bring it back to where it was found, near the high school,” Cunningham said. “It’s not going to be sent off to a zoo.”<\/span>","excerpt":"The avian life at Palo Alto High School is usually limited to seagulls, pigeons and a few smaller birds, but today, the campus had an unusual visitor — a hawk.","date":"2016-02-16 20:25:02","author":"Dhara Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/hawk.jpg","categories":["News","Spotlight"],"tags":["AJ Castillo","bird","bird of prey","cooper's hawk","Jennifer Gardner","Ken Cunningham","palo alto animal shelter","peninsula humane society"]},{"id":116378,"title":"TEDx to host emcee auditions today","permalink":"http:\/\/palyvoice.com\/2016\/02\/16\/tedx-to-host-emcee-auditions-today\/","content":"[caption id=\"attachment_116412\" align=\"alignnone\" width=\"548\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/10922448_334598283407783_150521601487457039_n.jpg\"><img class=\" wp-image-116412\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/10922448_334598283407783_150521601487457039_n.jpg\" alt=\"The Palo Alto High School TEDx club will host its first ever MC auditions. Last year the club asked theater students, but have decided to have audtions to give more people the opportunity, Photo by TEDxPaloAltoHighSchool\" width=\"548\" height=\"365\" \/><\/a> The Palo Alto High School TEDx club will host its first-ever emcee auditions. Last year the club personally reached out to theater students, but instead are holding auditions to give all students an opportunity to emcee. Photo by Adele Bloch.[\/caption]\r\n\r\nThe TEDxPaloAltoHighSchool club will host emcee auditions at 3 p.m. today in Room 857 for its conference on March 26.\r\n\r\nAccording to Head of Speakers Joelle Dong, this is the first time in its three-year history that the club has hosted emcee auditions.\r\n\r\n\"For the last two years, TEDx personally asked individual theater students to host,\" Dong said. \"But this year we decided it would be better to hold auditions and give more students the opportunity.\"\r\n\r\nAccording to Dong, the prospective emcees will be asked to deliver a <a href=\"https:\/\/docs.google.com\/document\/d\/1usyNgJC83ijv437BiR82mPUStP8333bD5JZ30XzGO7M\/edit\">practice script<\/a> to the TEDx team and will be judged based on their confidence, speaking skills and stage presence.\r\n\r\nDong said that the club hopes to find more student participants by offering everyone the opportunity to audition.\r\n\r\n\"Paly has loads of talented, well-spoken and captivating presences, so we are psyched to see who comes out,\" Dong said.\r\n\r\nThe emcee for last year's conference, junior Jason Pollak, enjoyed his experience.\r\n\r\n\"Being an emcee for an event like TEDx is an opportunity that I'm very grateful to have had,\" Pollak said. \"Public speaking, from conveying information in an interesting way to engaging with the audience, is an invaluable experience that I wish more Paly students could have. The team at TEDx is super supportive and friendly, and it's great being part of such a positive event.\"\r\n\r\nStudents can sign-up to audition <a href=\"https:\/\/docs.google.com\/forms\/d\/1GmXGaCDWoQMYF9YZT0sseFZv_e7QLer3-bMY_j00sz8\/viewform?c=0&amp;w=1\">here<\/a>.","excerpt":"The TEDxPaloAltoHighSchool club will host emcee auditions at 3 p.m. today in Room 857 for its conference on March 26.","date":"2016-02-16 14:08:32","author":"Chirag Akella","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/10922448_334598283407783_150521601487457039_n.jpg","categories":["News"],"tags":["Adele","adele bloch","audition","auditions","bloch","club","dong","emcee","jason pollak","joelle","joelle dong","MC","practice script","script","TEDx","tedxpaloaltohighschool"]},{"id":116049,"title":"Career Month to feature array of distinguished speakers","permalink":"http:\/\/palyvoice.com\/2016\/02\/16\/career-month-to-feature-array-of-distinguished-speakers\/","content":"[caption id=\"attachment_116051\" align=\"aligncenter\" width=\"611\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Screen-Shot-2016-02-09-at-11.15.58-AM.png\"><img class=\"wp-image-116051\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Screen-Shot-2016-02-09-at-11.15.58-AM.png\" alt=\"Screen Shot 2016-02-09 at 11.15.58 AM\" width=\"611\" height=\"332\" \/><\/a> \"The Career Month setlist this year features speakers across a breadth of career fields,\" said senior Minyoung Kim, a member of the Paly career Month Planning Committee. All presentations will happen during lunch except for veterinarian Katrina Chew’s presentation which will happen in the ERC during tutorial.\" Graphic by William Zhou.[\/caption]\r\n\r\nPalo Alto High School’s Eighth Annual Career Month Speaker Series will kick off on Monday and will continue through March 11 during lunch and tutorial inside the English Resource Center and Language Resource Center.\r\n\r\n<span style=\"font-weight: 400;\">According to senior Minyoung Kim, a member of the Career Month Planning Committee, this year the committee is focused on creating a balance between the arts and STEM (science, technology, engineering, and math) to create a greater perspective of different career fields. Furthermore, there will now be a guest speaker during tutorial because of the influx of speakers.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“One thing we noticed is that last year, the majority of our speakers were from STEM fields,” Kim said. “This year, we were able to give out a student survey form to hear from students what career fields they are interested in. We try our best to find speakers who best represent these areas of careers.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The purpose of this event is to provide opportunities for students to directly talk to the speakers and ask them questions so that they can learn about a variety of career choices, explains Kim. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Kim, lunch is provided for students during lunchtime speakers and snacks will be provided for students during tutorial speakers.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Freshman Rachel Code looks forward to her first Career Month experience at Paly.<\/span>\r\n\r\n“I'm really excited for the speakers,” Code said. “It's will be a very interesting way to broaden my horizons and hear about different career paths.”","excerpt":"Palo Alto High School’s Eighth Annual Career Month Speaker Series will kick off on Monday, Feb.29 and will continue through Mar.11 during lunch and tutorial inside the English Resource Center and Language Resource Center. ","date":"2016-02-16 11:20:43","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Screen-Shot-2016-02-09-at-11.15.58-AM.png","categories":["News"],"tags":["career month","ERC","Library","lrc","speakers","wrc"]},{"id":115988,"title":"Boys&#8217; soccer beats Fremont to win De Anza League","permalink":"http:\/\/palyvoice.com\/2016\/02\/16\/boys-soccer-beats-fremont-to-win-de-anza-league\/","content":"[caption id=\"attachment_116341\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_9454.jpg\"><img class=\"size-full wp-image-116341\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_9454.jpg\" alt=\"Senior forward Alessandro Reale wins the ball from the Fremont High School defender on Wednesday. Photo by Emma van der Veen.\" width=\"600\" height=\"400\" \/><\/a> Senior forward Alessandro Reale wins the ball from a Fremont High School defender on Wednesday at the Paly soccer field. Photo by Emma van der Veen.[\/caption]\r\n\r\nThe Palo Alto High School boys' soccer team (14-0-4, 8-0-3) took down Fremont High School (3-9-5, 2-6-3), 4-0, on Wednesday for a Senior Night victory, securing the De Anza League title and a spot in the championship bracket of the Central Coast Section playoffs, still remaining undefeated.\r\n\r\nWith two goals in each half, Paly dominated possession of the ball throughout the game and took advantage of its scoring opportunities. It remained defensively strong and did not let Fremont have many opportunities to try to score.\r\n\r\nThe Vikings raised their level of play to achieve what they have worked for throughout this season despite setbacks, according to junior captain and defender Neil Verwillow.\r\n\r\n\"What makes our team great is that we are always trying to progress,\" Verwillow said. \"Every game and every practice we step up, and I think we did really well seeing as so many of us have gotten injured these last few weeks.\"\r\n\r\nThe Vikings had struggled in recent weeks with multiple tied games, but the team earned its win over Fremont, according to senior midfielder Siddharth Srinivasan.\r\n\r\n\"We played very well,\" Srinivasan said. \"We clinched league today and I think we played solid all the way through the game.\"\r\n\r\nAccording to senior captain and goalkeeper Eli Friedlander, winning the league title came as a result of all of the work the players have put in throughout the season.\r\n\r\n\"It feels great [to win league],\" Friedlander said. \"We've been working on this all season and league sums up the entire season so far. I think we did well to deserve this.\"\r\n\r\nWith one game left in the season, the the Vikings are looking to maximize their wins by beating Santa Clara High School (6-7-3, 3-6-2), which will help the team be seeded higher into the CCS playoffs. According to head coach Don Briggs, winning league means that the Vikings will be placed in the championship bracket for the CCS playoffs.\r\n\r\n\"The league champions are in the championship bracket, which means it will be a lot tougher,\" Briggs said. \"We will be playing the first place teams of each league, so we'll be playing the best of the best.\"\r\n\r\nMoving forward, the team will be experimenting with different formations, according to Briggs.\r\n\r\n“We’re going to try to change our formation,” Briggs said. “We’re doing that so that we can really push up offensively.”\r\n\r\nThe Vikings will kick off their final game of the season against Santa Clara High School (6-7-3, 3-6-2) at 3:30 p.m. on Wednesday at Santa Clara.","excerpt":"Palo Alto High School boys' soccer team took down Fremont High School on Wednesday for a Senior Night victory, securing the De Anza League title and a spot in the championship bracket of the Central Coast Section playoffs, still remaining undefeated.","date":"2016-02-16 11:00:26","author":"Bianca Al-Shamari","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_9454.jpg","categories":["Sports","Spotlight"],"tags":["boys soccer","briggs","CCS","de anza","friedlander","league","palo alto high school","santa clara","saratoga","Soccer","sports","verwillow"]},{"id":116444,"title":"Advisory this week is for sophomores and select freshmen (A-K last name)","permalink":"http:\/\/palyvoice.com\/2016\/02\/16\/advisory-this-week-is-for-sophomores-and-select-freshmen-a-k-last-name\/","content":"","excerpt":"","date":"2016-02-16 10:46:23","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":115029,"title":"&#8216;The Revenant&#8217;: A haunting survival story","permalink":"http:\/\/palyvoice.com\/2016\/02\/16\/the-revenant-a-haunting-survival-story\/","content":"[caption id=\"attachment_115642\" align=\"aligncenter\" width=\"667\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/maxresdefault.jpg\"><img class=\"wp-image-115642\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/maxresdefault.jpg\" alt=\"maxresdefault\" width=\"667\" height=\"375\" \/><\/a> Leonardo DiCaprio's charter Hugh Glass stares forbiddingly into the distance wrapped in a oversized bear pelt. Photo: 20th Century Fox.[\/caption]\r\n<p style=\"text-align: left;\">In \"The Revenant,\" director Alejandro G. Iñárritu returns after winning the Academy Award for Best Picture for \"Birdman\" last year to share a gut-wrenching journey of a man fighting against the unstoppable forces of nature to achieve vengeance.<\/p>\r\nThe movie follows the mostly true story of Hugh Glass (Leonardo DiCaprio), an expert tracker and hunter who suffers from a violent bear attack during a fur-trapping expedition in the 1820s. His companion, John Fitzgerald (Tom Harding), leaves him in the forest to die after killing Glass's son (Forrest Goodluck), who tries to fight Fitzgerald. Glass becomes a legend when he manages to claws his way through thousands of miles of frozen wasteland with open wounds on a hunt for vengeance. A story of adversity and justice is eclipsed by one of personal development and rebirth, as every imaginable obstacle is thrown at Glass, only for us to see him emerge alive, but barely breathing.\r\n\r\nDicaprio’s performance is raw and haunting. The audience watches him scrape marrow out of frozen bones, catch a fish with his bare hands and cling for his life on a piece of driftwood at the whims of an immense river, and as we root for him all the way. Despite roughly a dozen lines of dialogue, DiCaprio maintains a strong vigor in his eyes that chills to the bone. In the end, this is DiCaprio's film through and through; he is completely committed in every terrifying moment, pushing himself further than he ever has before as an actor and proving himself more than deserving of that \"overdue Oscar.\"\r\n\r\n<span style=\"font-weight: 400;\">The supporting cast's performance is equally raw and truthful, particularly that of Tom Harding, who manages to encompass the villain of lawless and ruthless frontiersmen, as well as Domhnall Gleeson, who plays the solemn and well-intended captain of the fur-trapping expedition. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Part of what makes watching \"The Revenant\" more entertaining is knowing the cast and crew of the survival story also went through multiple struggles to make it. Iñarritu took the cast and crew on a nine-month shoot in the wildernesses Alberta and Argentina. What's more, contrary to the norm, he insisted on filming in chronological order and in natural light.<\/span>\r\n\r\n“The Revenant” is not for the light-hearted. The gore and blood encompasses the rough and uncertain reality of life on the frontier during that time. This further heightens the intensity of this gripping survival story.\r\n\r\n<span style=\"font-weight: 400;\">One of the greatest achievements of the film is the way it manages to juxtapose the immense beauty of nature to the unforgiving conditions of life that stumbles alongside it. This is made possible through the sublime cinematography of Emmanuel Lubezki, who captures the the dark brutality of man in a scene when DiCaprio first finds the body of his son. The ragged breaths of a barely-breathing man fog up the camera lens as Dicaprio gazes at his son’s body, serving to embody the panic and rawness of his emotions. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Lubezki effectively proceeds to sweep us up in the ineffable beauty of nature, showcasing static shots of snow dripping from the tips of evergreen trees and vast expanses of iced valleys and churning rivers. <\/span><span style=\"font-weight: 400;\">The movie plays on the contrast between nature and man; every step of the journey feels treacherous yet simultaneously <\/span><span style=\"font-weight: 400;\">beautiful.<\/span>\r\n\r\nIñarritu turns a gruelling frontier mythology into an ethereal, treacherous odyssey that continues to linger in your mind, haunting, for days after.\r\n\r\n<span style=\"font-weight: 400;\">“The Revenant” is nominated for the following 11 Academy Awards: Best Picture, Best Actor<\/span><span style=\"font-weight: 400;\">, <\/span><span style=\"font-weight: 400;\">Best Director, Best Actor in a Supporting Role, Best Cinematography, <\/span><span style=\"font-weight: 400;\">Best Film Editing<\/span><span style=\"font-weight: 400;\">, <\/span><span style=\"font-weight: 400;\">Best Costume Design, Best Sound Editing, Best Production Design, Best Visual Effects, and Best Sound Mixing. <\/span><span style=\"font-weight: 400;\">“The Revenant” deserves to win “Best Picture,” “Best Actor<\/span><span style=\"font-weight: 400;\">,” “<\/span><span style=\"font-weight: 400;\">Best Director” and “Best Cinematography\" for its ability to capture an audience with gripping camera work and its raw and authentic performances.<\/span>\r\n\r\n<strong>“The Revenant”<\/strong>\r\n\r\n<strong>2 hours, 36 minutes<\/strong>\r\n\r\n<strong>Rated: Rated R for strong frontier combat and violence including gory images, a sexual assault, language and brief nudity <\/strong>\r\n\r\n<strong>Directed by Alejandro G. Iñárritu<\/strong>\r\n\r\n<strong>Starring Leonardo DiCaprio, Tom Hardy, Will Poulter<\/strong>","excerpt":"In \"The Revenant,\" director Alejandro G. Iñárritu returns after winning the Academy Award for Best Picture for \"Birdman\" last year to share a gut-wrenching journey of a man fighting against the unstoppable forces of nature to achieve vengeance.","date":"2016-02-16 10:40:00","author":"Emilia Diaz-Magaloni","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/maxresdefault.jpg","categories":["A&amp;E Section Spotlight","Entertainment","Oscars 2016","Spotlight"],"tags":["Academy Award for Best Picture","Alejandro G. Iñárritu","Emmanuel Lubezki","Forrest Goodluck)","Leonardo DiCaprio","The Revenant","Tom Harding"]},{"id":116060,"title":"Ohlone teacher to appear in court Tuesday","permalink":"http:\/\/palyvoice.com\/2016\/02\/15\/ohlone-teacher-to-appear-in-court-tuesday\/","content":"Ohlone Elementary School teacher Michael Christopher Airo, currently on unpaid compulsory leave, is scheduled to be arraigned at 9 a.m. Tuesday at the Superior Court of the Palo Alto Judicial District, according to court documents.\r\n\r\nThe District Attorney Office is charging him with one count of continual sexual abuse of a child and three counts of lewd and lascivious acts on a child, according to a Jan. 15 <a href=\"http:\/\/www.cityofpaloalto.org\/civica\/press\/display.asp?layout=1&amp;Entry=1393\" target=\"_blank\">press release<\/a> from the Palo Alto Police Department. In response to the formal reading of his charging documents, Airo is expected to enter a plea.\r\n\r\nSupt. Max McGee says the district is expecting to hire an outside firm to conduct an investigation into the case, alleged to have occurred at his former girlfriend's residence 10 years before he became a teacher.\r\n\r\n[caption id=\"attachment_116086\" align=\"alignright\" width=\"327\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_3321.jpg\"><img class=\"wp-image-116086\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_3321.jpg\" alt=\"Ohlone\" width=\"327\" height=\"245\" \/><\/a> As of Jan. 14, Ohlone Elementary School is no longer the workplace of former teacher Michael Christopher Airo after child sexual abuse charges were brought to light and the district placed him on unpaid compulsory leave. Photo by Emily Hwang.[\/caption]\r\n\r\n“We are anticipating that an outside firm will be hired to complete a comprehensive review of the information that has been alleged and a full report and outcomes will be produced,” McGee said in a follow-up letter to Palo Alto Unified School District parents on Jan. 15.\r\n\r\nAccording to McGee, the district placed Airo on leave and followed a general crisis management plan after hearing about Airo’s arrest. Ohlone Principal Nicki Smith and McGee sent resources to parents regarding talking to children about delicate situations. McGee said he is open to looking into policies that adapt the district's current hiring practices to avoid similar situations.\r\n\r\n“We treated the situation similarly as the death [of a student] last year,\" McGee said. \"We called a meeting and we brought in outside help for parents, kids and teachers, and we had a plan on how to work with the media.”\r\n\r\n<span style=\"font-weight: 400;\">In a letter sent on Jan. 14 to PAUSD families, McGee stated he was “sickened and disgusted” after reading the police report detailing the case.<\/span><span style=\"font-weight: 400;\"> McGee said his word choice might have differed if he had been given more time to consider his message, especially considering that Airo’s status as a criminal is not yet confirmed.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“In retrospect I would have sent out a more measured letter,” McGee said. “I was really angry because I couldn't imagine behavior like that. … It was really disturbing.” <\/span>\r\n\r\n[caption id=\"attachment_116087\" align=\"alignright\" width=\"280\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_3432.jpg\"><img class=\"wp-image-116087\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_3432.jpg\" alt=\"Airo File\" width=\"280\" height=\"210\" \/><\/a> The police report detailing Airo's case is available to the public at the Palo Alto Courthouse. Airo will be arraigned at 9 a.m. Tuesday, Feb. 16 at the Santa Clara County Superior Court. Photo by Emily Hwang.[\/caption]\r\n\r\nA police report by PAPD officer Joel Hornung includes a statement made by Airo's principal on Jan. 8, 2014.\r\n\r\n\"She [Airo's principal] described him as a teacher that gives his students a lot of attention and care,\" the report says. \"She said she would never imagine Suspect Airo touching or harming the children in any way and does not know of any suspicious circumstances involving him.\"\r\n\r\nAccording to the police report and PAPD's press release, Airo self-surrendered on Jan. 13 after an arrest warrant was issued against him, following a one-year investigation by Hornung. Hornung stated that the investigation began after the victim revealed to her college psychologist that she had been sexually abused over a three-year period 10 years ago by Airo, her mother’s former live-in boyfriend and aide at victim's school.","excerpt":"Ohlone Elementary School teacher Michael Christopher Airo, currently on unpaid compulsory leave, is scheduled to be arraigned at 9 a.m. Tuesday at the Superior Court of the Palo Alto Judicial District, according to court documents.","date":"2016-02-15 21:51:05","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_3321.jpg","categories":["News","Spotlight"],"tags":["arraignment","court","district","judge","lascivious","lewd","McGee","michael","michael champagne","mike","nicki smith","ohlone","palo alto unified","PAUSD","principal","sexual abuse","superintendent","Teacher","trial"]},{"id":115753,"title":"&#8216;Bridge of Spies:&#8217; the Cold War shrouded in moral ambiguity","permalink":"http:\/\/palyvoice.com\/2016\/02\/14\/bridge-of-spies-the-cold-war-shrouded-in-moral-ambiguity\/","content":"[caption id=\"attachment_115792\" align=\"aligncenter\" width=\"569\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/os-bridge-of-spies-trailer-tom-hanks-20150616.jpg\"><img class=\" wp-image-115792\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/os-bridge-of-spies-trailer-tom-hanks-20150616.jpg\" alt=\"Photo courtesy of the Orlando Sentinel. \" width=\"569\" height=\"379\" \/><\/a> In \"Bridge of Spies\" Tom Hanks portrays James Donovan, an affluent American lawyer who has been asked to defend a Soviet spy. Donovan must defend his client, as well as his family and beliefs in this period thriller. Photo courtesy of the Orlando Sentinel.[\/caption]\r\n\r\nDespite the brilliance that is “Bridge of Spies,” its reception by the public has been underwhelming.\r\n\r\nPerhaps it is due to the contrast of director Steven Spielberg’s other explosive action films with the slow suspense of his latest work “Bridge of Spies,” but nevertheless the film reveals itself magically. The story, based on true events, takes place at the height of the Cold War as both the United States and the Soviet Union grapple with fear and suspicion. The plot centers on a Brooklyn-based artist, Rudolf Abel (Mark Rylance), who is found to be a Russian spy. This threatening discovery affirms America’s worst fears and causes an outbreak of panic and hatred.\r\n\r\nAlthough Abel seems destined to  hang, the government attempts to display the superiority of democracy by ensuring him a fair trial. They assign him a successful insurance lawyer, James Donovan (Tom Hanks). Hanks plays his typical character masterfully—he’s charismatic, approachable, but not afraid to shake things up. Due to his respect for the fundamentals of due process, Donovan agrees to the case. To his surprise he develops a personal connection with Abel. Hanks and Rylance’s on-screen chemistry is part of what makes the movie so captivating.\r\n\r\nAs Abel's unfortunate fate looms closer, across the country an American spy plane disguised as a weather plane is shot down over the Soviet Union. Suddenly Abel has a hope for a prisoner exchange.\r\n\r\nThe film is long, in typical Spielberg manner, and the beginning is at times uneventful, trading action for obvious symbolism and intricate camerawork. Yet the second half, when Donovan is sent to a post-war Berlin, turns out to be the most enthralling, insightful part of the film. Donovan is asked by the U.S. government to work as a third party to arrange the swap. He must travel through both devastated East and West Berlin, as beautiful cinematography captures the stark differences in the two sides both visibly and economically even just after the wall has come up; The West is filled with tantalizing stores and light, and the east dark and hazy with young gangs on every corner.\r\n\r\n“Bridge of Spies” received six Oscar nominations this year for “Best Picture,” “Best Original Score,” “Best Production Design,” “Best Sound Mixing,”“Best Original Screenplay,” as well as “Best Actor in a Supporting Role,” for Rylance’s performance as Abel.\r\n\r\nRylance delivers an exceptional yet nuanced performance, often overshadowed by more dramatic dialogue. While his performance is notable, its subtlety will most likely take away Rylance’s prospect of winning “Best Actor in a Supporting Role,” especially considering the other strong candidates.\r\n\r\nBoth Hanks and Rylance give stellar performances, yet the real treasure of “Bridge of Spies” is the portrayal of ethical uncertainty Donovan must face. While American society and media easily paint Abel as a communist villain, Donovan can see he’s truly just a patriot, doing what he must for his country.\r\n\r\n<strong>\"Bridge of Spies\"<\/strong>\r\n\r\n<strong>2 hours 21 minutes<\/strong>\r\n\r\n<strong>Rated PG-13 for some violence and profanity<\/strong>\r\n\r\n<strong>Directed by Steven Spielberg<\/strong>\r\n\r\n<strong>Starring Tom Hanks, Mark Rylance, Alan Alda, Amy Ryan, and Billy Magnussen<\/strong>","excerpt":"In \"Bridge of Spies,\" Tom Hanks portrays James Donovan, an affluent American lawyer who has been asked to defend a Soviet spy. Donovan must defend his client, as well as his family and beliefs in this period thriller.","date":"2016-02-14 18:24:36","author":"Nika Woodfill","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/os-bridge-of-spies-trailer-tom-hanks-20150616.jpg","categories":["Entertainment","Oscars 2016"],"tags":["2016","best picture","bridge","bridge of spies","movie","oscar","oscar review","oscars","reviews","spies"]},{"id":116291,"title":"Choir rocks the Pops Concert","permalink":"http:\/\/palyvoice.com\/2016\/02\/14\/choir-rocks-the-pops-concert\/","content":"[caption id=\"attachment_116293\" align=\"aligncenter\" width=\"527\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_5245.jpg\"><img class=\"size-full wp-image-116293\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_5245.jpg\" alt=\"Senior Sergio Valente, junior Joao De Pina, sophomore Brian Hwang, juinor Spencer Wycoff, and senior Sean Jawetz perform an acapella song at the choir Pops Concert on Wednesday in the Haymarket Theater. The group is known as The Heartbreakers. Photo by Emma van der Veen\" width=\"527\" height=\"351\" \/><\/a> From left to right, senior Sergio Valente, junior Joao De Pina, sophomore Brian Hwang, juinor Spencer Wycoff and senior Sean Jawetz perform an acapella song at the choir Pops Concert on Wednesday in the Haymarket Theater. The group is known as The Heartbreakers. Photo by Emma van der Veen.[\/caption]\r\n\r\nThe Palo Alto High School choirs' Pops Concert with a Bay Area music-themed focus got the audience snapping, clapping and cheering on Wednesday for their last performance in the Haymarket Theater.\r\n\r\nAccording to choir teacher Michael Najar, the choice of the theme of the concert, the Bay Area, was influenced by many factors. Performances ranged from solos to small groups to larger groups and included a San Francisco-themed medley that was performed by the Beginning Choir.\r\n\r\n“The Bay Area needs a little Bay Area love,” Najar said. “With all sorts of things happening, like the Super Bowl coming to town, it just seemed like the right time to do a Bay Area theme.”\r\n\r\nThe Pops Concert, unlike other concerts, is much more casual and allows the students to express themselves through the music that they select to perform, according to Najar.\r\n\r\n“They choose the music,” Najar said. “They work on it. They rehearse with each other. They work through all the problems that a regular musician would have in putting together a concert.”\r\n\r\nAccording to junior Taylor Duncan, the Pops Concert allows the students to form a community.\r\n\r\n“This is the concert where it’s super laid back and it’s not so choral-heavy,” Duncan said. “We get to know everyone in the choir and in Beginning Choir and in all the different groups a lot more. It’s awesome that we really get to connect in this concert.”\r\n\r\nThe entire choir sported tie-dye shirts, which were hand-made last Friday after school on the Quad in an activity led by junior Spencer Wycoff.\r\n\r\n“Mr. Najar got a bunch of blank shirts with the Paly Pops Concert logos on them, so we tie-dyed them on Friday after school,” Wycoff said. “The shirts that look extra dope are the ones that I made.”\r\n\r\nThe Pops Concert was the last that the Paly choirs will perform in the Haymarket Theater, according to Najar.\r\n\r\n“I don’t know what we’re going to do next year,” Najar said. “I can’t stand the Haymarket, but things are going to change so we’re excited about the change.”\r\n\r\nAccording to senior Sean Jawetz, choir is a great way to create art, and this experience is enriched by the Pops Concert.\r\n\r\n“It [the Pops Concert] really turns choir from a class into a community,” Jawetz said. “I will definitely continue to do choir in college because I think that choir is a great art form that allows you to express yourself and do something fun.”","excerpt":"The Palo Alto High School choirs performed their annual Pops Concert with a Bay Area music-themed focus on Wednesday in the Haymarket Theater.","date":"2016-02-14 16:06:34","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_5245.jpg","categories":["Entertainment"],"tags":[]}]