[{"id":116035,"title":"Choir Pops Concert to highlight Bay Area tunes","permalink":"http:\/\/palyvoice.com\/2016\/02\/09\/choir-pops-concert-to-highlight-bay-area-tunes\/","content":"[caption id=\"attachment_116067\" align=\"alignnone\" width=\"646\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/pops-concert.jpg\"><img class=\"wp-image-116067\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/pops-concert.jpg\" alt=\"pops concert\" width=\"646\" height=\"364\" \/><\/a> Sophomore Brian Hwang performs a solo at the 2015 'Pops' Concert. This year's concert will focus on Bay Area artists. Photo: Melissa Baten Caswell.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto High School choirs are preparing for the annual Pops Concert at 7 p.m. Tuesday and Wednesday in the Haymarket Theatre.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">As a tradition that has lasted for over a decade, this year’s concert will focus on music from Bay Area musicians, including Green Day, Janis Joplin and Journey, according to junior Nadia Leinhos.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The Pops Concert is annual concert for pop music,” Leinhos said. “No Latin, no renowned composers from the Baroque era – just music from the past century that we as teens are more likely to know.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The concert will feature soloists and several songs from each choir ensemble including  the  a capella groups, Spectrum and Madrigals.<\/span>\r\n\r\nAccording to Leinhos, the choirs began preparing for the concert at the start of the semester. Choir students researched Bay Area artists of their choice and chose songs on them, rehearsing every class period for the past couple of weeks.\r\n\r\n<span style=\"font-weight: 400;\">Unlike a traditional concert, choir members focus solely on pop music and dress casually compared to the <a href=\"http:\/\/palyvoice.com\/2015\/12\/11\/madrigals-is-fit-for-royalty\/\">Madrigals<\/a>’ elaborate costumes and formal Spring Concert attire. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It’s really different from your typical choir concert,” junior Jenny Zhuge said. “We are in casual dress and the singers are on stage when we are waiting for our turn to perform.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Leinhos says she hopes for a large attendance at the event.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It [the concert] could sometimes be considered more energetic,” Leinhos said. “It's definitely going to be a lot of fun.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Tickets are $5 for students and $10 for adults and can be bought at the door.<\/span>","excerpt":"The Palo Alto High School choirs are preparing for the annual Pops Concert at 7 p.m. Tuesday and Wednesday in the Haymarket Theatre.","date":"2016-02-09 17:48:59","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/12474004_10154519770054622_4578201271277032247_o.jpg","categories":["Entertainment"],"tags":["area","bay","choir","concert","jenny","leinhos","madrigals","music","nadia","pop","song","spring","zhuge"]},{"id":115883,"title":"New club hopes to bring end to mental illness stigma","permalink":"http:\/\/palyvoice.com\/2016\/02\/09\/new-club-hopes-to-bring-end-to-mental-illness-stigma\/","content":"[caption id=\"attachment_115895\" align=\"alignnone\" width=\"548\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/bring-change-2-mind-candid.jpg\"><img class=\" wp-image-115895\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/bring-change-2-mind-candid.jpg\" alt=\"&quot;Bring Change 2 Mind&quot; hosts an event during Club Day 2, letting people share their opinion on how to end stigma. Photo by Sam Lee.\" width=\"548\" height=\"425\" \/><\/a> The \"Bring Change 2 Mind\" club hosted an event during Club Day Two to let people share their opinions on mental illness stigmas. Photo by Sam Lee.[\/caption]\r\n\r\nA new student club is hoping to bring an end to mental illness stigma at Palo Alto High School.\r\n\r\nThe club, called Bring Change 2 Mind, was founded by three Paly students, seniors Bryn Carlson and Joseph Kao and freshman Lia Salvatierra, with the goal of creating awareness on the subject.\r\n\r\n“We each, for our own reasons, felt that something needed to be done on our campus to address mental health,” Carlson said. “This club sprang up because we have a vision that mental health will be considered no different than physical health, that people will feel comfortable talking about mental health and will feel no hesitation in seeking help for themselves or a friend who is suffering.”\r\n\r\nAccording to Carlson, Bring Change 2 Mind is a national organization with the goal of ending the stigma.\r\n\r\nOn Friday during Club Day Two, the club hosted an activity in which students could write about why they want to end the stigma or how they hope mental health will be viewed in the near future. Carlson was very pleased with how the activity went.\r\n\r\n“The goal of this activity is the same as our club's overall goal: to get people talking about mental health and to create a space for people to open up about it in order to diminish the stigma,” Carlson said. “I am pretty pleased. We had a bigger turnout than I was expecting so that was exciting.”\r\n\r\nCarlson hopes that the club's message can reach more people through the events it plans to host in the near future.\r\n\r\n“We are going to be pretty active during March,” Carlson said. “We plan on doing some more activities out on the Quad, and then we are going to have some smaller campaigns that we are going to be launching. And then we are also very excited to go to a summit in April that is going to be basically like a conference other chapters of Bring Change 2 Mind from around the Bay Area. “","excerpt":"A new student club, “Bring Change 2 Mind,\" is hoping to bring an end to mental illness stigma at Palo Alto High School.","date":"2016-02-09 11:18:10","author":"Chirag Akella","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/bring-change-2-mind-candid.jpg","categories":["News"],"tags":["Bring Change 2 Mind","carlson","club","Kao","mental illness","salvatierra","stigma"]},{"id":115714,"title":"&#8216;Brooklyn&#8217; redefines the meaning of hope","permalink":"http:\/\/palyvoice.com\/2016\/02\/09\/brooklyn-redefines-the-meaning-of-hope\/","content":"[caption id=\"attachment_115722\" align=\"alignnone\" width=\"590\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Screen-Shot-2016-02-04-at-7.34.52-AM.png\"><img class=\"wp-image-115722\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Screen-Shot-2016-02-04-at-7.34.52-AM.png\" alt=\"Screen Shot 2016-02-04 at 7.34.52 AM\" width=\"590\" height=\"394\" \/><\/a> Saorise Ronan and Emory Cohen star in \"Brooklyn,\" a heartfelt story of a young Irish woman immigrating to New York. Their chemistry and passionate performances create a movie truly worth Best Actress, Best Picture and Best Adapted Screenplay. Photo: Fox Searchlight Pictures.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">A touching immigrant story that transports audiences into 1950s New York, “Brooklyn” is a romantic drama, filled with rich history and emotion.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The storyline, based on Colm Toibin’s 2009 novel “Brooklyn,” tells the tale of Ellis Lacey (Saoirse Ronan), a young Irish woman who immigrates to New York. There, she faces the same struggle as the millions of immigrants that traveled to the United States, which is the need to assimilate to an unfamiliar way of life and the melancholy yearning for a faraway home with no hopes of returning. Ellis begins to enjoy her life in New York more when she falls for a friendly Italian-American plumber, Tom (Emory Cohen). However, after Ellis visits her hometown, she is faced with temptations from a local, Jim Farrell (Domhnall Gleeson), and is torn between the two lovers. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Viewers easily connect with the protagonist and are engrossed by Lacey’s captivating journey to overcome alienation in a new, unfamiliar environment.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Director John Crowley takes the audience through the complexities of each character and lets the actors in the film shine. Every performance is full of emotion and evokes a sense of nostalgia. Ronan, Irish-born herself, delivers a stunning performance that quickly captures the heart of the audience. Ronan’s character Lacey begins her journey as someone shy and inexperienced in the real world, and we see her grow into her true self throughout the movie. However, this inner transformation is subtle, for Ronan’s character is not a fearless, larger than life heroine, but instead a very real woman struggling to find her place in the world. With quiet strength and determination, Ronan is able to captivate the audience and bring the story of Ellis Lacey to life. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The costumes are very well selected and do an exemplary job of enhancing the setting of the era. In particular, in the scene at Coney Island, Lacey and Tom both wear baggy, bright colored swimsuits authentic to the time period.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Although “Brooklyn” has a large number of outstanding elements, the character development is generally lacking in the supporting cast. There is little insight into the life of the other characters in the story. Even with the sincerity and kindness of  Cohen’s character, he remains largely two-dimensional despite being the main love interest. This is primarily due to Crowley’s intentions to illustrate small moments in the main character's life. However, there is little to no insight into the other characters in the story, although it clearly builds the potential for further development. <\/span>\r\n\r\n“Brooklyn” feels like the result of a grandchild’s inquiry into her ancestors. As a drama, it paints a gritty and touching look into one young woman’s journey. The film is not afraid to illustrate the loneliness of an immigrant alone in a new country, but does so in an intimate and refreshing manner.\r\n\r\n<span style=\"font-weight: 400;\">“Brooklyn” is up for three Academy Awards: Best Picture, Best Adapted Screenplay and Best Actress. Ronan’s outstanding performance as Lacey arguably deserves Best Actress and the film has a good shot at Best Picture and Best Adapted Screenplay.<\/span>\r\n\r\n<strong>“Brooklyn”<\/strong>\r\n\r\n<strong>1 hour, 51 minutes<\/strong>\r\n\r\n<strong>Rated: PG-13 for a scene of sexuality and brief strong language<\/strong>\r\n\r\n<strong>Directed by John Crowley<\/strong>\r\n\r\n<strong>Starring: Saoirse Ronan, Emory Cohen<\/strong>","excerpt":"A touching immigrant story that transports audiences into 1950s New York, “Brooklyn” is a romantic drama, filled with rich history and full of emotion, and deserves its Oscar Nominations of Best Picture, Best Adapted Screenplay and Best Actress. ","date":"2016-02-09 11:09:44","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Screen-Shot-2016-02-04-at-7.34.52-AM.png","categories":["A&amp;E Section Spotlight","Entertainment","Oscars 2016","Spotlight"],"tags":["brooklyn","cohen","ellis","emory","film","lacey","movie","new york","oscar","ronan","saorise"]},{"id":116014,"title":"Third annual Paly Student Film Festival is on Friday, Feb. 19","permalink":"http:\/\/palyvoice.com\/2016\/02\/08\/third-annual-paly-student-film-festival-is-on-friday-feb-19\/","content":"","excerpt":"","date":"2016-02-08 18:20:29","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":116012,"title":"Deadline for Camp Unity is this Friday, Feb. 12","permalink":"http:\/\/palyvoice.com\/2016\/02\/08\/deadline-for-camp-unity-is-this-friday-feb-12\/","content":"","excerpt":"","date":"2016-02-08 18:19:46","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":115750,"title":"Library aims to streamline research with new tool","permalink":"http:\/\/palyvoice.com\/2016\/02\/08\/library-aims-to-streamline-research-with-new-tool\/","content":"[caption id=\"attachment_115752\" align=\"aligncenter\" width=\"530\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/photo.jpg\"><img class=\"wp-image-115752\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/photo.jpg\" alt=\"photo\" width=\"530\" height=\"397\" \/><\/a> Palo Alto High School librarian Rachel Kellerman demonstrates the library's new One Search Discovery program that aggregates most of the library's research resources into one database. Photo by William Zhou.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">In an effort to streamline research, the Palo Alto High School Library recently purchased its new<a href=\"http:\/\/www.paly.net\/academics\/library\"> One Search Discovery Tool<\/a>. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Like the name suggests, One Search Discovery aims to simply research by aggregating the library's various research tools into one page, according to Paly librarian Rachel Kellerman.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“One Search Discovery is a global search engine that connects most of the library’s research products,” Kellerman said. \"As consumers we don’t want to click a lot, everyone wants products where you can get to the meat of the product as fast as possible.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Currently, the librarians are working on introducing students to One Search Discovery. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The challenge is always marketing,” Kellerman said. “I’m working on an online tutorial, and librarian Sima Thomas went into all the AP Psychology classes to demo the tool. My goal is to go into all the social science courses so that every senior touches this product before he or she leaves.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Through their tutorials and visits, the librarians hope to familiarize students with One Search Discovery's many features, according to Kellerman. <\/span>\r\n\r\n“In addition to searching, you can also filter specifically for books in the library, e-books and books published within a certain date range,” Kellerman said. “If you are at home, you can also access the database through the library libguide. The nice thing about the e-books is that you can search for specific words in the books and the e-books aren't one to one, so the whole class could be looking at the same book. Furthermore, you can create folders, save books and access them anywhere, it’s very much like a Google Drive environment.”\r\n\r\n<span style=\"font-weight: 400;\">After the school's contract with its previous research tool expired, the librarians had been looking for a new system that could make research faster. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The old system for searching was very, very slow,” Kellerman said. “If you needed a book, you would have to go to the library catalog, then if you wanted a database article you would have to go the library libguide, then if you wanted an e-book you would have to go the e-book catalog. Nothing was integrated. The old library system that we had was more designed for middle school students.” <\/span>\r\n\r\nAdditionally, the librarians hope that this new tool will help prepare students for college research.\r\n\r\n<span style=\"font-weight: 400;\">“Similar search tools to One Search Discovery are found in colleges and universities,” Kellerman said. “It’s not hard to use, but like a new app on your phone it's good to practice before you have pressure for a research report and we wanted to expose students to it beforehand.”  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">To Kellerman, the adoption of the One Search Discovery tool is representative of Paly’s willingness to innovate and explore. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We're one of the high school that vendors [of software] will look at because we will try things out,” Kellerman said. “In the spring we’re going to a user's conference day that mostly has colleges, but we’ve been invited because Paly really has that forward looking attitude.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Though the librarians discovered One Search Discovery last year, it has taken around nine months to get it up and running and they’re still some areas which need to be improved. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“You still need to click through a couple pages to access the text for the e-book,” Kellerman said. “And some research tools like The New York Times and ABC Cleo aren’t integrated.”  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Student reaction has been positive so far, according to Kellerman. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The best reactions I got were ‘I found it!’ and ‘I’m going to use it.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior Alice On’s opinion reflects Kellerman’s view.  <\/span>\r\n<span style=\"font-weight: 400;\">“It’s not perfect,” On said. “I tried it in my AP Psych class and there were some glitches, but other than that, it’s pretty cool and convenient. It’s like the entire library on your computer, I think I’ll use it in the future.”<\/span>","excerpt":"The Palo Alto High School Library recently launched its One Search Discovery Tool in an effort to streamline research.","date":"2016-02-08 11:48:23","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/photo.jpg","categories":["News"],"tags":["faster","Kellerman","one search discovery","paly","research","streamline"]},{"id":115917,"title":"18 senior athletes commit to schools on National Signing Day","permalink":"http:\/\/palyvoice.com\/2016\/02\/08\/18-senior-athletes-commit-to-schools-on-national-signing-day\/","content":"[caption id=\"attachment_115919\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/DSC_0026.jpg\"><img class=\"size-full wp-image-115919\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/DSC_0026.jpg\" alt=\"Seniors Katie Francis and Andrew Cho sign their college athletic letters of intent on Wednesday in the Media Arts Center. Francis will be attending Santa Clara University for water polo and Cho will be attending the George Washington University for swimming.\" width=\"600\" height=\"400\" \/><\/a> Seniors Katie Francis and Andrew Cho sign their college athletic letters of intent on Wednesday in the Media Arts Center. Francis will be attending Santa Clara University for water polo and Cho will be attending the George Washington University for swimming. Photo by Emma van der Veen.[\/caption]\r\n\r\nEighteen Palo Alto High School senior athletes are preparing to take on college athletics, as they signed their letters of intent on National Signing Day on Wednesday in the Media Arts Center.\r\n\r\nThe athletes include Katie Francis, Andrew Cho and Kayleigh Svensson for swimming; Gigi Rojahn and Kevin Bowers for water polo; Jacey Pederson, Ansley Queen and Alex Bonomi for soccer; Reed Merritt and Mimi Lin for diving; Eli Givens and Mikey Grande for football; Owen Plambeck and Justin Hull for baseball; Henry Gordon for golf; Claire Dennis for volleyball; and Alexis Harris for basketball.\r\n\r\nPrincipal Kim Diorio, Athletic Director Kathi Bowers and alumnus and Stanford University swimmer Andrew Liang spoke at the event.\r\n\r\n“The weeks and days may be long, it can be a grind, but just remember that the years will fly by,” Liang said. “Enjoy the journey. It’s one that not many kids get to experience.”\r\n\r\nLiang credited Paly for preparing students, academically and otherwise, and offered some helpful advice to the college-bound athletes.\r\n\r\n“Paly has prepared you extremely well for this [being a college athlete],” Liang said. “You should continue to use the skills you have learned over these your four years and apply them in college. There will be ups and downs, just like there were in your four years here.”\r\n\r\nAccording to Givens, who will be playing Division 1 football at Southern Utah University, this day served as an affirmation to his dedication to athletics throughout high school.\r\n\r\n“I have worked so hard for this,” Givens said. “From coming to school at 7 a.m, to just working out to get bigger and stronger, to giving it 110% during practice. Even if I didn’t get an offer, I know that I worked hard enough to get one. This is an amazing feeling and I’m really glad that this happened to me.”\r\n\r\nNot all of the Vikings who signed to a college will be competing in Division I athletics. Kayleigh Svensson, who will be attending Wellesley College for Division III swimming, is looking forward to the experience, but does not want it to dominate her academic career.\r\n\r\n“I’m just focusing a little bit more on school, but I’m still very, very excited to swim,” Svensson said. “It should be a fun four years.”","excerpt":"Eighteen Palo Alto High School senior athletes are preparing to take on college athletics, as they signed their letters of intent on National Signing Day on Wednesday in the Media Arts Center.\r\n","date":"2016-02-08 11:42:43","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/DSC_0026.jpg","categories":["News"],"tags":["andrew liang","athlete","college","eli givens","kathi bowers","kayleigh svensson","media arts center","national signing day","palo alto high school","paly","signing","signing day","sports","sports boosters"]},{"id":115978,"title":"Choir Pops Concert is at 7:30 p.m. on Tuesday, Feb. 9 at Haymarket Theater","permalink":"http:\/\/palyvoice.com\/2016\/02\/08\/choir-pops-concert-is-at-730-p-m-on-tuesday-feb-9-at-haymarket-theater\/","content":"","excerpt":"","date":"2016-02-08 09:47:35","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":115924,"title":"Tava to debut new Paly special menu","permalink":"http:\/\/palyvoice.com\/2016\/02\/07\/tava-to-debut-new-paly-special-menu\/","content":"[caption id=\"attachment_116006\" align=\"alignleft\" width=\"370\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Untitled-1.png\"><img class=\" wp-image-116006\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Untitled-1.png\" alt=\"Photo by Ethan Kao.\" width=\"370\" height=\"278\" \/><\/a> Tava Indian Kitchen is closed temporarily as the restaurant updates its menu and student special. Photo by Ethan Kao.[\/caption]\r\n\r\nTava Indian Kitchen, a Town and Country restaurant, will update its menu to incorporate a new special for Palo Alto High School students this week.\r\n\r\nTava traditionally allows customers to pick individual ingredients to create their meal. The new menu will also feature complete dishes, called signature entrées, that can be added as sides to a main meal, such as the the student favorite \"Burroti Bowl.\" Examples of these signature entrées include the Chicken Tikka ($8.50) and the Asian Tofu ($8).\r\n\r\n<span style=\"font-weight: 400;\">“Right now at Tava, customers are able to pick a protein, topping, chutney and a sauce and if we were to add in more individual options it would very quickly become overwhelming,” Founder Hasnain Zaidi said. “What we are trying to do is instead is to create blends as well as separate dishes for people to choose from, allowing for more variety but not to overwhelm the customer.”\r\n<\/span>\r\n\r\nZaidi said that the variety in the menu will be appreciated by frequent customers.\r\n\r\n“When we started Tava, we deliberately kept it [the menu] small and simple to not overwhelm our customers and to be able to do everything really well,” Zaidi said. “But what we found was that for the folks who visit often, like students at Paly, having more options would allow them to create different combinations and choices.”\r\n\r\n<span style=\"font-weight: 400;\">The founders hope to learn more about how to shape new aspects of the Paly student special by launching a student <a href=\"http:\/\/Http:\/\/palysurvey.telltava.com\" target=\"_blank\">survey<\/a> to gather ideas. Ideas include offering a free garlic naan instead of the free fountain drink that currently comes with the Paly special.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“One of the things we want to do with the special is to actually have a conversation with students and to figure out what it is that they want in a special,” Zaidi said. “Whether it's adding let's say a garlic naan instead of a soda or removing both and having the price be cheaper, we want to make sure the special we offer is the special that students want rather than what we think they want.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">To make the overhauling changes, the restaurant will be closed this week to spend time training the staff to produce the updated menu. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We are going to close for a week, mostly to train our crew and touch some stuff up,” Zaidi said. “It takes time to learn how to prepare the new recipes and it's essential our staff does it right.”<\/span>\r\n\r\nAccording to CEO Jeremy Morgan, the restaurant will re-open on Thursday, Feb. 18 and will offer free food for all Paly students.\r\n\r\n<span style=\"font-weight: 400;\">According to Zaidi, students who answer the aforementioned survey may be randomly selected to try the new menu in a special VIP testing opportunity. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Despite the current popularity of the restaurant, Zaidi says that the changes will augment Tava’s quality and hopes that the changes will endear themselves to current and new customers alike.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It’s pretty scary to take something that is working and change it,” Zaidi said. “But at the same time we are just so excited about this new approach because it takes all of the best things we have today and adds new elements to it.” <\/span>","excerpt":"Tava Indian Kitchen will be implementing a new special for Palo Alto High School students as well as changing its menu as the restaurant prepares to update its Palo Alto location.","date":"2016-02-07 21:05:39","author":"Chirag Akella","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Untitled-1.png","categories":["Features"],"tags":["Hasnain Zaidi","palo alto high school","paly","Paly Special","survey","TAVA"]},{"id":115927,"title":"Paly Quad to Levi&#8217;s Stadium: Students perform at Super Bowl 50","permalink":"http:\/\/palyvoice.com\/2016\/02\/07\/paly-quad-to-levis-stadium-students-perform-at-super-bowl-50\/","content":"[caption id=\"attachment_115928\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/12687887_1124695217549030_2321994312789312104_n.jpg\"><img class=\"wp-image-115928\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/12687887_1124695217549030_2321994312789312104_n.jpg\" alt=\"12687887_1124695217549030_2321994312789312104_n\" width=\"600\" height=\"451\" \/><\/a> Members of Palo Alto High School's cheer and dance team pose with a \"Super Bowl 50\" flag before their performance at the halftime show today at Levi's Stadium in Santa Clara. (Left to right, top to bottom row) Senior Emma Sternfield, sophomores Grace Kitayama, Clare Thomas, seniors Melanie Guan, Mariah Poitier, junior Lauren Jozefov, senior Ella Higashi and junior Nathalia Castillo submitted a video and were selected along with 200 other dancers to perform as \"flowers.\" Photo by Julie Sternfield.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Eight members of Palo Alto High School's cheer and dance team performed at the Super Bowl 50 halftime show today. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The performance, inundated with local teenagers, featured seniors Melanie Guan, Ella Higashi, Mariah Poitier and Emma Sternfield; juniors Nathalia Castillo and Lauren Jozefov; and sophomores Grace Kitayama and Clare Thomas. They danced alongside big-time musicians Coldplay, Bruno Mars and Beyoncé, spinning colorful flower umbrellas and precisely rotating formations with around 200 other dancers.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Higashi, the only performer from the cheer team, a favorite part of the experience was spending a few days before the game with the performers. Guan agreed that working alongside the famous artists was a memorable moment. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The highlight of the performance was definitely when Jay-Z and Blue Ivy walked past me and waved,” Guan said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Paly cheer and dance team became involved about a month ago when Julie Zimmer, the halftime show casting director, contacted the team to perform, according to Guan.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The Super Bowl halftime coordinators contacted our coach via email,” Sternfield said. “We submitted a <a href=\"https:\/\/www.youtube.com\/watch?v=AjCgcVY8fJw\" target=\"_blank\">video<\/a> of our team performing multiple dances, and soon after they contacted us saying we've been chosen to dance in the halftime show.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">After being chosen, the performers committed to confidentiality and hours of practice.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We weren’t allowed to tell anyone for around a month, but we had to leave school early a couple days to practice around five to six hours in Santa Clara,” Castillo said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">On the Wednesday through Friday leading up to the Super Bowl, the Paly performers had extra rehearsals from 3 p.m. to 8:30 p.m., according to Jozefov.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Those rehearsals were really fun because most of the time we were watching the singers perform,” Jozefov said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The dancers agreed that overall, their inclusion in the performance was an unforgettable opportunity.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It was definitely an experience of a lifetime and being a part of this event was one that I’ll never forget,” Castillo said.<\/span>\r\n\r\nSee posted recording by \"Heavy\" <a href=\"http:\/\/heavy.com\/sports\/2016\/02\/super-bowl-50-halftime-show-2016-performances-watch-video\/\" target=\"_blank\">here.<\/a>","excerpt":"Eight members of Palo Alto High School's cheer and dance team performed at the Super Bowl 50 halftime show today.","date":"2016-02-07 17:07:57","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/12687887_1124695217549030_2321994312789312104_n.jpg","categories":["Editor's Pick","News","Spotlight"],"tags":["beyonce","bruno mars","carolina panthers","cheer","chris martin","coldplay","dance","denver broncos","football","halftime show","super bowl 50"]}]