[{"id":115137,"title":"Speech and Debate team triumphs in January tournaments","permalink":"http:\/\/palyvoice.com\/2016\/01\/31\/speech-and-debate-team-triumphs-in-january-tournaments\/","content":"[caption id=\"attachment_115165\" align=\"aligncenter\" width=\"608\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12626178_528900193942710_1193858178_n1.jpg\"><img class=\" wp-image-115165\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12626178_528900193942710_1193858178_n1.jpg\" alt=\"Sophomores Frances Zhuang and Tanay Krishna, junior Candace Wang, and freshman Leyton Ho celebrating with their awards after the LD tournament.\" width=\"608\" height=\"435\" \/><\/a> Sophomore Frances Zhuang, junior Candace Wang, sophomore Tanay Krishna and freshman Letyon Ho celebrating with their awards after participating in the Lincoln-Douglas debate division at the CFL tournament. Photo by Anna Nakai.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Palo Alto High School's Speech and Debate team participated in the 2016 James Logan Martin Luther King invitational and the Coast Forensics League tournament on Jan. 17 and Jan. 24, resulting in a series of student accomplishments.<\/span>\r\n\r\nThe MLK tournament is known for the speech and persuasive debate divisions, according to senior Speech and Debate President Anna Nakai. Many Paly students broke and qualified for further rounds in Lincoln-Douglas debate, including three students that were in the double octafinals, two in the octafinals, two in the quarterfinals and two students in the semifinals.\r\n\r\n<span style=\"font-weight: 400;\">Two Paly students placed in the top 10 of all speakers: Nakai as third speaker and freshman Josh Singh as sixth speaker. Freshman Dominic Thibault ended the competition as a top 10 Congress debater as well. The award is given to the students who are the most persuasive and most informed on current affairs.  <\/span>\r\n\r\n[caption id=\"attachment_115164\" align=\"alignleft\" width=\"276\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12650650_528900200609376_1676569661_n.jpg\"><img class=\" wp-image-115164\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12650650_528900200609376_1676569661_n.jpg\" alt=\"Freshman Dominic thibault and ___Ujwal Srivastava at the CFL\" width=\"276\" height=\"192\" \/><\/a> Freshman Dominic Thibault and Ujwal Srivastava posing after doing well in the Congress debate at the CFL tournament.  Photo by Anna Nakai.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Paly’s Speech and Debate team also participated in the CFL Superdebate Tournament at Milpitas this last weekend.  The competition was a league tournament, so Paly only competed against local schools, according to Nakai. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Paly junior Candace Wang and sophomores Frances Zhuang and Tanay Krishna went 4-0 in the tournament and received a “wildcard,” a guaranteed spot at State Qualifications.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Paly already gets around eight spots [at State Qualifications], but when people ‘wildcard,’ it means we get extra spots,” Nakai said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Paly sophomore Adeline Zhou was a finalist at the CFL tournament this last weekend. She participated in the Original Oratory event, where each speaker gives a 10-minute speech they have been preparing for months, typically about a societal issue, according to Zhou. Zhou gave a presentation on the ego and how it affects people's life decisions.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I was honestly in total shock when they announced I was a finalist,” Zhou said.  “There were 21 semifinalists. After my semifinals round, I thought I was in the 15-17 range because the other competitors were so talented.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Even though Zhou wasn’t prepared to receive the award, she feels good earning it.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“There's always a self-satisfactory feeling when you’re presented with a medal on a platform and you can see your competitors in the crowd,” Zhou said.  “Half of you is like, ‘I shouldn't be up here, you [the other competitors] should be,’ while the other half is like ‘I won? Is this happening right now?’”<\/span>\r\n\r\nThe next Speech and Debate tournament for Paly is on Feb. 20.  Nakai says she thinks that the team is making a lot of accomplishments in the season so far.\r\n\r\n<span style=\"font-weight: 400;\">“I think our team is doing really well this year,” Nakai said.  “We’re definitely expanding our Congress and speech teams, which is great, and we’re continuing to do well in LD.”<\/span>","excerpt":"Palo Alto High School's Speech and Debate team looks forward to the rest of its season after a series of student accomplishments in the 2016 James Logan Martin Luther King invitational and the CFL  tournament on Jan. 17 and Jan. 24.","date":"2016-01-31 14:14:06","author":"Morgan Keller","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12626178_528900193942710_1193858178_n1.jpg","categories":["News"],"tags":["Award","congress","debate","paly","speech","tournament"]},{"id":114960,"title":"Admin implements new athletic clearance requirement","permalink":"http:\/\/palyvoice.com\/2016\/01\/28\/admin-implements-new-athletic-clearance-requirement\/","content":"[caption id=\"attachment_115150\" align=\"alignright\" width=\"331\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/DSCN32352.jpg\"><img class=\"wp-image-115150 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/DSCN32352.jpg\" alt=\"badminton\" width=\"331\" height=\"441\" \/><\/a> Sophomore May Leng prepares to strike a birdie during badminton practice. Students participating in badminton, a spring sport at Palo Alto High School, are one group of many athletes that will be affected by the new clearance requirement. Photo by Adrienne Kwok.[\/caption]\r\n\r\nPalo Alto High School athletes are required to complete a new athletic clearance process for the spring season in an effort to better verify a student's eligibility to play a sport.\r\n\r\nAccording to Athletic Director Kathi Bowers, students who plan on trying out for a spring sport must pick up a Health Clearance Card, in addition to having updated their physical, medical and contact information on Appryse, a system the school uses to verify an athlete’s participation eligibility. On the day of tryouts, athletes will hand the Health Clearance Card to their coaches.\r\n\r\nWhile the application process remains mostly the same, the only change is the new method for coaches to verify that an athlete is cleared to participate, even during tryouts.\r\n\r\n“It puts coaches in a tough position when the student would say ‘I am getting it [my physical clearance] tomorrow’ or ‘I uploaded it to Appryse, I don’t know why you can’t see it,’” Bowers said. “Coaches were having to spend too much time dealing with the physicals instead of working with their athletes, so what would happen is that some coaches would not take the time to verify that the student was cleared to participate.”\r\n\r\nStudents may pick up the Health Clearance Card in person on Friday from 2 to 4 p.m., and on Monday from 11:30 to 4 p.m. in Room 725.","excerpt":"Palo Alto High School athletes are required to complete a new athletic clearance process for the spring season in an effort to better verify a student's eligibility to play a sport.","date":"2016-01-28 22:22:56","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/DSCN3235.jpg","categories":["News"],"tags":["appryse","bowers","card","clearance","kathi","new","physical","requirement","sports","spring"]},{"id":115117,"title":"Newseum CEO to discuss freedom of expression at MAC","permalink":"http:\/\/palyvoice.com\/2016\/01\/28\/newseum-ceo-to-discuss-freedom-of-expression-at-mac\/","content":"[caption id=\"attachment_115118\" align=\"aligncenter\" width=\"466\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/mac.jpg\"><img class=\"wp-image-115118\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/mac.jpg\" alt=\"The school’s Media Arts Center will host Newseum CEO, Jeffery Herbst as part of the Media Arts Center’s Speaker Series.“There will be two more later this spring,” Event Organizer and Palo Alto High School Journalism teacher Esther Wojcicki said. Photo William Zhou.\" width=\"466\" height=\"349\" \/><\/a> Palo Alto High School's Media Arts Center will host Newseum CEO Jeffery Herbst as part of the Media Arts Center’s Speaker Series on Feb. 3. “Herbst is the CEO of the Newseum and is going to be talking about freedom of speech and the age of terrorism,” event organizer and Palo Alto High School journalism teacher Esther Wojcicki said. Photo by William Zhou.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">CEO of the Newseum, Jeffrey Herbst, will speak about the new dangers of freedom to expression at 7 p.m. on Wednesday in the Palo Alto High School Media Arts Center. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Newseum is a museum centered around the First Amendment, according to Newseum Board of Trustee member, Paly journalism teacher, and event organizer Esther Wojcicki.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The Newseum is the largest museum in the world about freedom of the press, First Amendment rights and news media,” Wojcicki said. “It’s located in Washington D.C. and is a non-profit that’s  home to a lot of retired famous journalists.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Wojcicki hopes Herbst can bring his experience and knowledge to the Palo Alto community. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Jeffery is the CEO of the Newseum and the former president of Colgate University,” Wojcicki said “He’s a very learned guy and has written several books, so I’d say we should listen to his thoughts. He would be great at leading this discussion.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">During his presentation, titled “The New Dangers for Freedom of Expression,” Herbst will focus on how freedom of expression is utilized in today's digital world. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Herbst is going to be talking about freedom of speech and the age of terrorism,” Wojcicki said. “Do we allow all hate speech online and in our media? Traditionally there hasn’t been a limit, but now the question is that is there a limit?\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Wojcicki wants audience members to leave thinking about ways to address this problem.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I want audience members to think of possible solutions,” Wojcicki said. “The solution has to be something that comes from the community, because you don’t want to do something to people, you want to do something with them.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The talk is sponsored by the school’s Media Arts Boosters and is part of the the MAC Speaker Series, which launched last year. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The purpose of these events  are to bring the community into the MAC building so they can enjoy some intellectually stimulating talks,” Wojcicki said.  “It [the speaker series] was really successful last year and there will be two more this year.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to the<\/span><a href=\"https:\/\/www.eventbrite.com\/e\/the-new-dangers-for-freedom-of-expression-by-newseum-ceo-jeffrey-herbst-tickets-20773684650\"><span style=\"font-weight: 400;\"> event page<\/span><\/a><span style=\"font-weight: 400;\">, student and adult tickets are available for purchase online at $5 and $10 respectively, and proceeds will benefit the Media Arts Center Boosters. <\/span>","excerpt":"CEO of the Newseum, Jeffrey Herbst, will speak about the new dangers of freedom to expression at 7 p.m. on Wednesday in the Palo Alto High School Media Arts Center. ","date":"2016-01-28 22:19:37","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/mac.jpg","categories":["News"],"tags":["ceo","ester","first amendment","freedom of speech","journalism","mac","Newseum","palo alto high school","wojcicki"]},{"id":115102,"title":"Liveblog: Boys’ Basketball vs. Gunn 2.0","permalink":"http:\/\/palyvoice.com\/2016\/01\/28\/liveblog-boys-basketball-vs-gunn-2-0\/","content":"Check back tomorrow at 7:45 p.m. for live coverage of the second match-up between the Palo Alto High School boys’ basketball team (12-6, 2-3) and Gunn High School (12-1, 3-0).\r\n\r\n[liveblog]","excerpt":"Check back tomorrow at 7:45 p.m. for live coverage of the second match-up between the Palo Alto High School boys’ basketball team (12-6, 2-3) and Gunn High School (12-1, 3-0).","date":"2016-01-28 20:04:32","author":"Victor Carlsson","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/IMG_58031.jpg","categories":["Sports"],"tags":[]},{"id":115092,"title":"School board opposes creation of new high school","permalink":"http:\/\/palyvoice.com\/2016\/01\/28\/school-board-opposes-creation-of-new-high-school\/","content":"[caption id=\"attachment_115093\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/IMG_5022.jpg\"><img class=\"size-full wp-image-115093\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/IMG_5022.jpg\" alt=\"Palo Alto Unified School District Supt. Max McGee adresses the PAUSD Board of Education on Tuesday Jan. 26. McGee emphasized his support for the creation of a new innovative high school at Cubberley to address the problem of overcrowding. Photo by Emma van der Veen.\" width=\"600\" height=\"450\" \/><\/a> Palo Alto Unified School District Supt. Max McGee addresses the Board of Education at a meeting on Tuesday. McGee emphasized his support for the creation of an innovative high school at Cubberley to address the problem of overcrowding, despite contrary opinions from board members. Photo by Emma van der Veen.[\/caption]\r\n\r\nThe Palo Alto Unified School District Board of Education took a stance against the creation of a third high school at Cubberley Community Center during the school board meeting on Jan. 26.\r\n\r\nThe board discussed several proposals set forth by the Enrollment Management Advisory Committee. Among these was the <a href=\"http:\/\/palyvoice.com\/2016\/01\/26\/new-school-or-not-school-board-to-debate-cubberley-question\/\">proposal to create a new high school at the Cubberley Community Center<\/a>, advocated for by PAUSD Superintendent Max McGee. Despite a more favorable outlook for the proposal in previous board meetings, after further discussion, school board members expressed both hesitation and opposition to the creation of a new high school.\r\n\r\n“We need to put millions of dollars behind helping ideas that have already been formed,” board member Melissa Baten Caswell said.\r\n\r\nDespite a majority dissent from the board during the meeting, McGee remained loyal to the ideal of creating a new high school.\r\n\r\n“I think there are some bigger issues [involving Cubberley] we need to discuss before dismissing a new high school,” McGee said.\r\n\r\nBoard members Ken Dauber and Terry Godfrey echoed Caswell’s opposition to the new high school at Cubberley, which currently serves many community functions. In contrast, board members Heidi Emberling and Camille Townsend expressed support for the creation of a subsequent task force to investigate the idea further.\r\n\r\n“A third high school is important,” Townsend said. “I don’t believe in experimenting. I do, however, believe in choice programs. I don’t see a whole-scale changing of our schools.”\r\n\r\nDistributing the responsibilities of the potential task force and allowing the staff of the already existing high schools to conduct their own reforms would serve the district much better, according to Caswell and Godfrey. Caswell recognized the community's interest in new schools, though emphasized that they were not a current necessity for the district.\r\n\r\n“I feel the need to parse things as well,” Caswell said. “Let’s first decide if we want these schools. I personally don’t feel we need new schools, we want them.”\r\n\r\nAccording to Caswell, City of Palo Alto officials also need to take part in the decision to redesign Cubberley's use.\r\n\r\n“How we use Cubberley needs to be in collaboration with the city,” Caswell said.\r\n\r\nDauber supported the improvement of current schools, pointing out the need for programs that promote the social and emotional well-being of PAUSD students.\r\n\r\n“It would be helpful to factor processes into different groups with different focuses,” Dauber said. “I appreciate the work that’s gone on here because for me what’s really surfaced is this really strong desire for the improvement of our schools.”\r\n\r\nThe school board is set to officially vote on the proposal for a new high school at Cubberley on Tuesday, Feb. 9.","excerpt":"The Palo Alto Unified School District Board of Education took a stance against the creation of a third high school at Cubberley Community Center at the school board meeting on Jan. 26.","date":"2016-01-28 11:37:42","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/IMG_50221.jpg","categories":["News","Spotlight"],"tags":["caswell","cubberley","dauber","emac","emberling","enrollment management advisory committee","godfrey","McGee","Palo Alto Unified School Board of Education","Palo Alto Unified School District","PAUSD","School Board","townshend"]},{"id":115057,"title":"Teachers voice salary concerns","permalink":"http:\/\/palyvoice.com\/2016\/01\/28\/teachers-voice-salary-concerns\/","content":"<span style=\"font-weight: 400;\">Palo Alto Unified School District teachers are lobbying the Board of Education for a salary raise due to the upcoming renegotiation of the Palo Alto Educators Association contract.<\/span>\r\n\r\nThe PAEA contract dictates specifics regarding tenures, salaries and peer review.\r\n\r\nA salary increase is the top priority for many teachers due to<span style=\"font-weight: 400;\"> their inability to find or maintain homes in and around Palo Alto amid the region's rising living costs. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Many teachers fear the continued increases in housing prices will not allow them to continue to work for Palo Alto’s schools, according to Corey Potter, Hoover Elementary School kindergarten teacher.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We are facing a very serious housing crisis, and many of us won’t be able to work here for much longer,” Potter said. “My husband and I were priced out of owning a home, and now we are being priced out of renting a one bedroom apartment.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Some teachers believe that a pay raise is justified because similar local school districts like the Los Altos School District have higher salaries for similar positions.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“If I were working at Los Altos, I’d be making $19,000 a year more than what I do now, which is just shocking to me,”  said Jordan Wells, a Gunn High School English teacher of 10 years.<\/span>\r\n\r\n<span style=\"font-weight: 400;\"> Helen Karns, Walter Hays Elementary School fifth grade teacher, says that living so far from the district disintegrates the quality of life for teachers. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“If you add the work we have to do after school hours, before school hours, plus commute, it ruins quality of life,” Karns said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The higher costs of living that are not supported by salaries cause teachers to live as far away as Santa Cruz, like Walter Hays Elementary School third grade teacher Tara Hunt. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“A typical day for me is to wake up at 4:45 a.m. so I can leave by 5:15 a.m. to take a two-hour commute to Palo Alto from Santa Cruz,” Hunt said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Living outside of the district and its neighboring cities makes it difficult to participate in school activities, according to Hunt. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"I <\/span><span style=\"font-weight: 400;\">can’t be a part of the community,\" Hunt said. \"I feel really disconnected, and I would really like to be a part of this wonderful community.”<\/span>","excerpt":"Palo Alto Unified School District teachers are lobbying to the Palo Alto Unified School District School Board for a salary raise due to the upcoming renegotiation of the Teacher’s Union contract.","date":"2016-01-28 11:33:41","author":"Sherwin Amsbaugh","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/IMAG0424.jpg","categories":["News"],"tags":["Contract","gunn high school","Housing Crisis","Jobs","palo alto high school","Palo Alto Unified School Board of Education","PASUD","Salary","School Board","Teacher","Teachers Union","Union","Union Contract"]},{"id":114845,"title":"City climate summit pushes green agenda","permalink":"http:\/\/palyvoice.com\/2016\/01\/28\/city-climate-summit-pushes-green-agenda\/","content":"<span style=\"font-weight: 400;\">The City of Palo Alto will use community input garnered from a summit on Sunday to jumpstart a new climate plan.\r\n<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Benjamin Privitt, who is responsible for city sustainability analytics and reporting, the Sustainability Climate Action Plan will improve the <\/span><a href=\"http:\/\/www.cityofpaloalto.org\/civicax\/filebank\/documents\/9946\"><span style=\"font-weight: 400;\">2007 Climate Protection Plan<\/span><\/a><span style=\"font-weight: 400;\"> to accommodate for the modern economic and environmental landscape. Privitt says the summit — which Mayor Patrick Burt called “possibly the largest and most important environmental gathering in our city’s history” — served as an opportunity for community members to collaborate and share ideas on the SCAP and the problems it will attempt to tackle.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Registration for the event filled to maximum capacity and the summit included about 300 community members, including City Council members, students and representatives from the student climate change group Project Enybody. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“What's important about an event like this is that we're bringing the community together to make some critical decisions about the future that we want to make for ourselves,” Privitt said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Chief Sustainability Officer Gil Friend outlined a plan to make Palo Alto a carbon-neutral city by 2030, among other goals. <\/span><span style=\"font-weight: 400;\">Audience members said they hoped to take actionable steps toward combating climate change and produce more alternatives to gasoline cars.<\/span>\r\n\r\nThe summit's keynote speaker, Colonel Mark \"Puck\" Mykleby, appeared via a <a href=\"https:\/\/www.youtube.com\/watch?v=sIWD7OQgEvM\"><span style=\"font-weight: 400;\">video<\/span><\/a> and <span style=\"font-weight: 400;\">answered questions by video chat<\/span> after a weather-related transportation glitch kept him from appearing in person. Mykleby is the <span style=\"font-weight: 400;\">founding director of the Strategic Innovation Lab at Case Western Reserve University. He also served as a special strategic assistant on to the Chairman of the Joint Chiefs of Staff on the role of climate change in US \"grand strategy.\"<\/span>\r\n\r\nThose who missed the Climate Summit but wish to learn more were able to attend a study session on Jan. 25 as part of a regular City Council meeting at Palo Alto City Hall.\r\n\r\n<em><span style=\"font-weight: 400;\">Photos by Adrienne Kwok.<\/span><\/em>\r\n<div id=\"cp_widget_096cc023-2537-467f-87d3-4e89f7435801\">\r\n\r\n...<script type=\"text\/javascript\">\/\/ <![CDATA[\r\nvar cpo = []; cpo[\"_object\"] =\"cp_widget_096cc023-2537-467f-87d3-4e89f7435801\"; cpo[\"_fid\"] = \"AYAAtMNCMviP\"; var _cpmp = _cpmp || []; _cpmp.push(cpo); (function() { var cp = document.createElement(\"script\"); cp.type = \"text\/javascript\"; cp.async = true; cp.src = \"\/\/www.cincopa.com\/media-platform\/runtime\/libasync.js\"; var c = document.getElementsByTagName(\"script\")[0]; c.parentNode.insertBefore(cp, c); })();\r\n\/\/ ]]><\/script><noscript>Powered by Cincopa <a href='http:\/\/www.cincopa.com\/video-hosting'>Video Cloud for Business<\/a> solution.<span>2016 Climate Summit<\/span><span>As part of Palo Alto’s climate action plan initiated in 2007, the city achieved an 80% reduction in its waste and now has 100% carbon free electricity.<\/span><span>originaldate<\/span><span> 1\/1\/0001 6:00:00 AM<\/span><span>width<\/span><span> 2100<\/span><span>height<\/span><span> 1182<\/span><span>Palo Alto Mayor Patrick Burt began the conference by introducing the overall issues of climate change and the importance of being environmentally conscientious. “It will help determine what type of city we will have for decades ahead,” Burt said.<\/span><span>originaldate<\/span><span> 1\/1\/0001 6:00:00 AM<\/span><span>width<\/span><span> 2100<\/span><span>height<\/span><span> 1182<\/span><span>Keynote speaker Colonel Mark “Puck” Mykleby addressed the audience in a question and answer session through a video call. As a result of stormy weather on the East Coast, Mykleby was unable to attend the event in person.<\/span><span>originaldate<\/span><span> 1\/1\/0001 6:00:00 AM<\/span><span>width<\/span><span> 2100<\/span><span>height<\/span><span> 1182<\/span><span>Project Enybody member and Gunn senior Emily Cao poses with Gunn junior Sarah Tan while listening to the conference speakers.<\/span><span>originaldate<\/span><span> 1\/1\/0001 6:00:00 AM<\/span><span>width<\/span><span> 2100<\/span><span>height<\/span><span> 1182<\/span><span>An attendee participates in the Q&A session with Colonel Mark Mykleby. As founding director of the Strategic Innovation Lab at Case Western Reserve University, Mykleby also served as a special strategic assistant on to the Chairman of the Joint Chiefs of Staff on the role of climate change in US \"grand strategy.\"<\/span><span>originaldate<\/span><span> 1\/1\/0001 6:00:00 AM<\/span><span>width<\/span><span> 2100<\/span><span>height<\/span><span> 1182<\/span><span>Palo Alto Unified School District Energy Specialist Rebecca Navarro attended the conference. Navarro taught English at JLS Middle School and has a bachelor’s degree in environmental science.<\/span><span>originaldate<\/span><span> 1\/1\/0001 6:00:00 AM<\/span><span>width<\/span><span> 2100<\/span><span>height<\/span><span> 1182<\/span><span>Those who missed the Climate Summit but wish to learn more will be able to attend a study session on Jan. 25 as part of a regular City Council meeting at Palo Alto City Hall.<\/span><span>originaldate<\/span><span> 1\/1\/0001 6:00:00 AM<\/span><span>width<\/span><span> 2100<\/span><span>height<\/span><span> 1182<\/span><span>According Palo Alto Mayor Patrick Burt, the 2016 Sustainability & Climate Action Summit is the “largest and most important environmental gathering in our city’s history.”<\/span><span>originaldate<\/span><span> 1\/1\/0001 6:00:00 AM<\/span><span>width<\/span><span> 2100<\/span><span>height<\/span><span> 1182<\/span><span>(From top to bottom, left to right) Senior William Zhou, Palo Alto Teen Program Specialist Jose Perez, freshman Leo Trejo, Gunn senior Emily Cao, freshman Raymond Fang, Gunn junior Helen Nguyen, Gunn junior Sarah Tan, freshman Vivian Feng, junior Adrienne Kwok, and Gunn junior Shannon Yang posed for a photo in front of the Jordan Climate Summit. Photo by Emily Hwang.<\/span><span>originaldate<\/span><span> 1\/1\/0001 6:00:00 AM<\/span><span>width<\/span><span> 2100<\/span><span>height<\/span><span> 1182<\/span><span>Approximately 300 people from Palo Alto and neighboring cities attended the Climate Summit from noon to 5p.m. Registration for the free event reached maximum capacity.<\/span><span>originaldate<\/span><span> 1\/1\/0001 6:00:00 AM<\/span><span>width<\/span><span> 2100<\/span><span>height<\/span><span> 1182<\/span><span>Senior William Zhou interviewed Sustainability Analytics & Reporting Benjamin Privitt as part of Project Enybody. “There are a lot of different versions of what a green Palo Alto looks like,” Privitt said. “The best version is the one that meets the needs and delivers the services that Palo Alto residents and businesses can experience and really thrive.”<\/span><span>originaldate<\/span><span> 1\/1\/0001 6:00:00 AM<\/span><span>width<\/span><span> 2100<\/span><span>height<\/span><span> 1182<\/span><span>The 2016 Sustainability & Climate Action Summit took place at Jordan Middle School at 750 N California Ave, Palo Alto.<\/span><span>originaldate<\/span><span> 1\/1\/0001 6:00:00 AM<\/span><span>width<\/span><span> 2100<\/span><span>height<\/span><span> 1182<\/span><span>The City of Palo Alto plans to make biking and walking more accessible to Palo Alto citizens, such as through expanding bicycle-share programs, according to Palo Alto Mayor Patrick Burt.<\/span><span>originaldate<\/span><span> 1\/1\/0001 6:00:00 AM<\/span><span>width<\/span><span> 2100<\/span><span>height<\/span><span> 1182<\/span><span>Sophomores Leo Trejo and Raymond Fang attended the conference as representatives for Project Enybody, a City of Palo Alto teen group dedicated to raising awareness for climate protection.<\/span><span>originaldate<\/span><span> 1\/1\/0001 6:00:00 AM<\/span><span>width<\/span><span> 2100<\/span><span>height<\/span><span> 1182<\/span><\/noscript>\r\n\r\n","excerpt":"The City of Palo Alto will use community input garnered from a summit on Sunday to jumpstart a new climate plan.\r\n","date":"2016-01-28 11:10:48","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Screen-Shot-2016-01-28-at-11.03.26-AM.png","categories":["News","Spotlight"],"tags":["action","Alto","benjamin","burt","city","climate","colonel","environment","friend","gil","Mark","mayor","mykleby","Palo","patrick","PLAN","privitt","puck","scap","sustainability"]},{"id":115071,"title":"Pilot evaluation survey results released, teachers&#8217; feedback mixed","permalink":"http:\/\/palyvoice.com\/2016\/01\/27\/pilot-evaluation-survey-results-released-teachers-feedback-mixed\/","content":"<span style=\"font-weight: 400;\">Palo Alto Unified School District teachers are reviewing results from an experimental district-wide <a href=\"http:\/\/palyvoice.com\/2015\/12\/17\/district-pilots-course-evaluation-survey-receives-mixed-reviews\/\">course evaluation survey<\/a> after students completed a questionnaire in December.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Teachers obtained scores ranging from one to six for 10 multiple choice questions based on student ratings as well as anonymous student comments. In addition, teachers can compare their results between different courses they teach. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">While open-ended comments were useful, others tended to be self-contradictory, according to physics teacher Michael Stern.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“One student would be like ‘I really like when we go off on a tangent and talk about things that we’re not being tested on’ and another student would be like ‘I really get annoyed when we go off on a tangent and talk about things we’re not going to be tested on,’ so some of it was less useful,” Stern said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Others did not find the standardized element of the survey practical.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“<\/span><span style=\"font-weight: 400;\">I think there’s so much value in getting feedback, but every teacher is in a very different place in their teaching<\/span><span style=\"font-weight: 400;\">,” Advanced Placement Psychology teacher Melinda Mattes said. “This sort of ‘one size fits all’ [survey] could be really valuable to one teacher and one course and then not at all for others. <\/span><span style=\"font-weight: 400;\">I would love to see the district work with teachers on a more individual basis to help them craft something that is useful for each individual.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">To Mattes, who regularly asks for feedback in her AP Psych course throughout the year, the survey’s questions did not offer an outlet for improvement.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“<\/span><span style=\"font-weight: 400;\">They [the survey questions] are not the questions I would ask, and they’re not the manner in which I would ask them to help me in honing my craft and improving my course,” Mattes said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to <\/span><a href=\"http:\/\/www.paeacta.org\/page\/page\/8619749.htm\"><span style=\"font-weight: 400;\">Palo Alto Educators Association<\/span><\/a><span style=\"font-weight: 400;\"> president Terri Baldwin, teachers have always been required to conduct student surveys by their contracts and have typically created their own surveys to give to students. Baldwin says PAUSD proposed the switch to an online standardized evaluation survey.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We [PAEA] agreed in a Memo of Understanding to try it out as a two-year pilot program and see how it works,” Baldwin said. “We want to make sure that teachers get valuable information back from the students that help them inform their instruction before we make this new program a permanent part of our contract.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Baldwin, PAEA will not take student surveys out of the contract language for the coming years but rather evaluate the questions and survey method’s effectiveness. <\/span>\r\n\r\n“We will convene the committee soon to look at the survey and the effectiveness of the feedback as well as the ease or lack thereof in administering it,” Baldwin said. “We will go back to negotiations next year and discuss the committee's findings after two to three semesters of surveys and make a decision [of keeping or discontinuing the district-wide survey] then.”\r\n\r\n&nbsp;","excerpt":"Palo Alto Unified School District teachers are receiving course evaluation survey results after students completed a questionnaire in December about their classes and teachers.","date":"2016-01-27 20:50:37","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/emmaugh.jpg","categories":["News","Spotlight"],"tags":["Alto","baldwin","course","evaluation","gunn","mattes","michaels","Palo","paly","questionnaire","stern","survey","terri"]},{"id":114860,"title":"Student film &#8220;Unmasked&#8221; wins Student Filmmaker Tournament","permalink":"http:\/\/palyvoice.com\/2016\/01\/26\/student-film-unmasked-wins-student-filmmaker-tournament\/","content":"[caption id=\"attachment_114879\" align=\"aligncenter\" width=\"690\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/11782424_1610903165833677_814416713129292984_o.jpg\"><img class=\" wp-image-114879\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/11782424_1610903165833677_814416713129292984_o.jpg\" alt=\"Unmasked, is a student film created to uncover Palo Alto's mental health issues and the ways to overcome them. Photo: Docx Films\" width=\"690\" height=\"388\" \/><\/a> \"Unmasked\" is a student film created to uncover Palo Alto's mental health issues and the ways to overcome them.  The film premiered on <a href=\"http:\/\/studentfilmmakerawards.com\/matchup\/1538\/\" target=\"_blank\">Sept 12<\/a>.  Photo courtesy of DocX films.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">\"<span style=\"font-weight: 400;\"><a href=\"https:\/\/www.youtube.com\/watch?v=s3b6Lh6gixw\" target=\"_blank\">Unmasked<\/a>,<i>\"<\/i><\/span> a Palo Alto student-produced film, earned first place for the audience choice category of the Student Filmmaking Awards Tournament, according to an announcement on the organization's <a href=\"http:\/\/studentfilmmakerawards.com\/matchup\/1538\/\" target=\"_blank\">website<\/a> Sunday night.<\/span>\r\n\r\n<i>\"<\/i><span style=\"font-weight: 400;\">Unmasked<\/span><i>\"<\/i><span style=\"font-weight: 400;\"> competed against 31 other colleges and high schools from around the country in December and January. T<\/span><span style=\"font-weight: 400;\">he public supported the film through four rounds of voting, taking the Palo Alto production to the finals round against the <a href=\"https:\/\/www.youtube.com\/watch?v=ZJo-gGTudGM\" target=\"_blank\">University of Nebraska<\/a>. \"<\/span><span style=\"font-weight: 400;\">Unmasked<\/span><i>\"<\/i><span style=\"font-weight: 400;\"> won by 145 votes, with the final voting to be 1488-1343, according the the organization's website.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Although the <a href=\"http:\/\/palyvoice.com\/2015\/08\/27\/students-unmask-teen-mental-health-discussion-through-documentary\/\" target=\"_blank\">film<\/a> was created for the  purpose of aiding and supporting Palo Alto’s community, \"<\/span><span style=\"font-weight: 400;\">Unmasked<\/span><i>\" <\/i><span style=\"font-weight: 400;\">has been involved in two film tournaments, including the Student Filmmaker Awards Tournament since its release. The film also took home the award for the Best Short Film in November 2015 from the Big Asian Festival in Los Angeles.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It's nice to have the film recognized at the competition,” film co-director and Paly senior Christian Leong said.  “But the real sense of accomplishment was getting a film out to impact the Palo Alto community in a positive way.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">In the future, Leong and his co-director Andrew Baer look forward to continuing supporting students dealing with mental health issues.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It [the award] doesn’t mean much in terms of the future for the film,” Leong said.  “One benefit from entering into this contest, though, was that with each audience member viewing the film, we were able to spread our messages and awareness of the rising issue of teen suicide.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"<\/span><span style=\"font-weight: 400;\">Unmasked\"<\/span><span style=\"font-weight: 400;\"> was produced by DocX Films and created by 13 students: Palo Alto High School seniors Baer, Leong, Josh Yuen, Joseph Kao, Daniel Cottrell, Leslie Garcia, Natalie Snyder and Stas Ilyasov; Paly junior Zack Gibson; and Gunn High School seniors Yui Sasajima, Lydia Sun, Tanner Kerrins and Rachel Rothberg. <\/span>\r\n\r\n\"The message of the film was to encourage conversation between youth and adults and throughout the community, reduce the stigma surrounding mental health,\" Baer said.\r\n\r\n<span style=\"font-weight: 400;\">Both Leong and Baer are passionate about helping teens realize that there is always hope. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We want teens to realize that there is a lot to live for and that if problems do arise, many adults in the community are open to talking to them,” Leong said. <\/span>","excerpt":"\"Unmasked,\" a Palo Alto student produced film, earned first place for the audience choice category of the Student Filmmaking Awards Tournament last night at 11 p.m.","date":"2016-01-26 15:40:52","author":"Morgan Keller","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/11782424_1610903165833677_814416713129292984_o.jpg","categories":["News","Spotlight"],"tags":["baer","gunn","leong","mental health","paly","student film","student filmmaker tournament","unmasked"]},{"id":114851,"title":"New school or not? School board to debate Cubberley question","permalink":"http:\/\/palyvoice.com\/2016\/01\/26\/new-school-or-not-school-board-to-debate-cubberley-question\/","content":"<span style=\"font-weight: 400;\">Will a new school re-open at Cubberley Community Center? The Palo Alto Unified School District Board of Education will discuss plans for a possible new school at Cubberley and future investments into schools at the board meeting at 6:30 p.m. today. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to the <\/span><a href=\"https:\/\/www.pausd.org\/sites\/default\/files\/pdm-meeting\/agenda\/160126_agenda.pdf\"><span style=\"font-weight: 400;\">meeting agenda<\/span><\/a><span style=\"font-weight: 400;\">, the board will talk about the goals for a task force to be commissioned to “explore educational models for the Cubberley site and contiguous school properties.” Possible foci for the task force include a proposal to build an innovative secondary school and to create better education opportunities for the district as a whole. Since it is only a discussion item on the agenda, there will be no voting involved. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to board member Melissa Baten-Caswell, it might be too ambitious for one task force to tackle all the issues that concern the Cubberley site.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I personally feel like this is a lot of stuff for one task force to do,\" Baten-Caswell said. \"I feel like it would be easier if we could parse this out.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Baten-Caswell says the opinions of the board members are split on enrollment issues and the possibility of building new schools. Supt. Max McGee and Baten-Caswell both say they expect ample discussion on these topics.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“<\/span><span style=\"font-weight: 400;\">My expectation is that we will have a good discussion and that the outcome would be for the Feb. 9 meeting to have some actionable recommendations,” McGee said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">McGee supports the formation of a new K-12 campus, while Baten-Caswell says she feels that it would be more worthwhile to expand current programs.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Rather than to invest in a new secondary school, [I’d like] to put our investment into our current secondary schools so that we can invest in innovative programs,” Baten-Caswell said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Baten-Caswell predicts there will be several community members who will speak during the open forum portion of the meeting on both sides of the issue.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I think there's going to be a lot [of open forum speakers],” Baten-Caswell said. “I think there's some very strong feelings both ways, particularly about the high schools, about whether we should use our time, talent and money to invest in our existing schools or whether we should split that investment and invest in a brand new school as well as existing schools.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Baten-Caswell, the school board reviewed a survey that found the majority of students and teachers at the high school and middle school levels, along with parents from the elementary through high school levels, said that they would like to see smaller class sizes. However, Baten-Caswell says that based on enrollment data, she is not convinced that a new school is needed to fix overcrowding issues.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“If we don't need a new school, do we want a new school?” Baten-Caswell said. “I think that's really the question we need to ask at this point is do we want a new school, not whether we need it. But there are some people, including the committee [Enrollment Management Advisory Committee], that <\/span><a href=\"https:\/\/www.pausd.org\/sites\/default\/files\/pdf-faqs\/attachments\/EMACSecondarySubcommitteeFinalReport.pdf\"><span style=\"font-weight: 400;\">think our schools are too big<\/span><\/a><span style=\"font-weight: 400;\">.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Baten-Caswell notes that at the elementary school level, one solution could be shifting the flow of students so it’s spread evenly throughout all the elementary schools. The board will discuss elementary school boundary lines at the meeting.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I'd say I don't believe we do [need to open another elementary school], but I do believe we need to rejigger boundaries so we're not overflowing kids from the same school,” Baten-Caswell said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The decision to create a new school will require a lot of thought and contemplation of the consequences, including the impact on the community center aspect “<\/span><span style=\"font-weight: 400;\">because Cubberley really belongs to the community<\/span><span style=\"font-weight: 400;\">,” according to Baten-Caswell.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Conceptually, I think starting something new is fun,” Baten-Caswell said. “Are you willing to use some of your money and some of your people's time to do it? That means that they won't be able to spend that same time and money on existing programs. You have to decide if that's the most important thing.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">McGee aims to be mindful of the district’s mission: to improve the preparedness of students and enrich their educational opportunities.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I think that even more importantly they [EMAC] pointed out to really think about student connectedness, about opportunities and access, about how to make our schools even better than the excellent schools they already are,” McGee said.<\/span>","excerpt":"The Palo Alto Unified School District Board of Education will discuss plans for a possible new school at Cubberley and future investments into schools at the board meeting at 6:30 p.m. today. ","date":"2016-01-26 15:39:09","author":"Ana Caklovic","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/12346906_939036946172394_37820261_n.jpg","categories":["News","Spotlight"],"tags":["class sizes","discussion","elementary school","future investments","high school","innovative programs","McGee","meeting","melissa baten-caswell","middle school","new school","overcrowding","School Board","secondary school","superintendent"]}]