[{"id":123802,"title":"Girls&#8217; tennis trounces Milpitas to stay undefeated","permalink":"http:\/\/palyvoice.com\/2016\/10\/10\/girls-tennis-trounces-milpitas-to-stay-undefeated\/","content":"[caption id=\"attachment_123803\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9422.jpg\"><img class=\"wp-image-123803\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9422.jpg\" alt=\"IMG_9422\" width=\"600\" height=\"400\" \/><\/a> Paly Varsity captain Meredith Cummings prepares for a volley  during a tough doubles match with senior partner Brin Elliott on Thursday against Milpitas High School. The girls' tennis team went on to win the game, 7-0. Photo: Sid Sharma[\/caption]\r\n\r\nThe Palo Alto High School girls’ tennis team (7-0) routed Milpitas High School, 7-0, in an El Camino League match on Thursday at home.\r\n\r\nThe team’s second blowout win of the season against Milpitas helped Paly maintain its undefeated record and stay No. 1 in the league, despite the absence of a top singles player, senior Avanika Narayan, who was out due to a shoulder injury.\r\n\r\nThe Vikings expressed varying opinions on what they need to do to improve going forward.\r\n\r\n“As the season progresses, we’re trying to play smarter and think more about shot placement and technique,” doubles player Alice Zhang said.\r\n\r\nSenior Captain Meredith Cummings added some slightly differing views on what the team should improve on.\r\n\r\n“I think we need to work on making sure each player has a safety serve to ensure an opportunity to play out the point, instead of giving the team easy points,” Cummings said. “We also need to be more confident and aggressive at the net.”\r\n\r\nGirls' tennis has continued to find success in its mental dominance.\r\n\r\n“We succeed in our matches because we keep a positive mindset intact for most of the game and focus on smart shots,” Cummings said.\r\n\r\nDespite the blowout result, the games did not come without difficulty. Both Brin Elliott and Cummings (doubles) and Mailinh Truong, who stepped in for Narayan, faced lengthy and close matches, according to Zhang.\r\n\r\nThe streak of wins gives legitimacy to early season sentiments of Coach Andy Harader, who stated that he is confident that the girls can win the league championship.\r\n\r\n“The only thing keeping us from winning the championship will be ourselves this season,” Harader said in September — a day before the season started.\r\n\r\nIf the team continues on to win in the El Camino League, the girls will move back up to the De Anza League next year. The team's poor record in that same league last year forced the Vikings to move down this year.\r\n\r\n<span style=\"font-weight: 400;\">The next game will be Tuesday at Mountain View High School, which Paly beat, 5-2, in their last match.<\/span>","excerpt":"The team’s second blowout win against Milpitas helped the team maintain its undefeated record and stay No. 1 in the league, despite the absence of a top singles player, senior Avanika Narayan, who was out due to a shoulder injury.","date":"2016-10-10 09:43:40","author":"Siddarth Sharma","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_94221.jpg","categories":["Sports"],"tags":["andy harader","Avanika Narayan","Brin Elliott","el camino","girls tennis","meredith cummings","milpitas","undefeated"]},{"id":123437,"title":"Verbatim: Has Colin Kaepernick drawn a flag with his protest?","permalink":"http:\/\/palyvoice.com\/2016\/10\/08\/verbatim-has-colin-kaepernick-drawn-a-flag-with-his-protest\/","content":"Before the final game of the preseason of the National Football League in San Diego on September 1st, San Fransisco 49er quarterback Colin Kaepernick knelt during the national anthem to protest police brutality against African-Americans in the United States.\r\n\r\nKaepernick's protest angered many people throughout the country, who said felt Kaepernick was disrespecting America's military by kneeling during the anthem.\r\n\r\nNow entering Week 4 in the NFL, Kaepernick's protest has been mirrored by teammates, other fellow NFL players, members of the US women's national soccer team and the players from the Woman National Basketball Association who have either taken a knee, raised a fist, or sat during the national anthem.\r\n\r\nKaepernick's protest has been followed, spread over social media and has accumulated an enormous amount of attention.The Paly Voice asked other Palo Alto High School students what they thought about Kaepernick's actions.\r\n\r\n<iframe src=\"https:\/\/docs.google.com\/presentation\/d\/1EhpIQJZ0jZJgWnxP5kRIWWN1UeK5G-M4e79ibGkgupI\/embed?start=true&amp;loop=true&amp;delayms=10000\" width=\"960\" height=\"569\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"Before the final game of the preseason of the National Football League in San Diego on September 1st, San Fransisco 49er quarterback Colin Kaepernick knelt during the national anthem to protest police brutality against African-Americans in the United States.\r\n\r\n","date":"2016-10-08 11:52:35","author":"Kasra Orumchian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Kaep600x800.png","categories":["Features","Uncategorized","Verbatims"],"tags":["2016","49ers","football","Kaepernick","nfl","palo alto","palo alto high school","paly","San Francisco","slideshow","sports","vikings"]},{"id":123748,"title":"Spider sets off fire alarm","permalink":"http:\/\/palyvoice.com\/2016\/10\/06\/spider-sets-off-fire-alarm\/","content":"&nbsp;\r\n\r\n[caption id=\"attachment_123750\" align=\"alignnone\" width=\"531\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9313.jpg\"><img class=\" wp-image-123750\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9313.jpg\" alt=\"Students find their classes on the football field after the fire alarm went off this morning during second period. Photo: Sherwin Amsbaugh\" width=\"531\" height=\"354\" \/><\/a> Palo Alto High School students find their fourth period teachers on the football field after the fire alarm went off this morning during second period. Photo: Sherwin Amsbaugh.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Crowds of confused Palo Alto High School students meandered around the football field after a fire alarm went off today during second period due to what administrators said was a spider that set off a smoke alarm. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The triggered smoke detector was in the 700s building, which is currently used for Physical Education locker rooms and the athletic offices, according to Assistant Principal Jerry Berkson. When maintenance investigated the cause of the fire alarm, they found the culprit responsible for the school-wide disturbance. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“There was a faulty smoke alarm, and the district maintenance crew went and checked it out and it ended up being a spider crawling into the smoke alarm,” Berkson said.\r\n<\/span>\r\n\r\n<span style=\"font-weight: 400;\">As practiced during previous fire alarms, students left their classrooms and headed for the football field to find their fourth period teachers. Because this was the freshman class’ first fire alarm, there was added chaos and many of them did not know where they were supposed to go.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It was confusing because we didn’t know where to go on the football field,” freshman Sarah Salinas said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Many classes were interrupted in the middle of tests, lessons and other activities.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It was kind of surprising because we were [taking] a test, so when we came back we really didn’t have that much time,” Salinas said.<\/span>\r\n\r\nStudents and teachers will have to work together to reorganize lessons and manage changed work schedules to make up for time lost during the disturbance.","excerpt":"The fire alarm went off at Palo Alto High School went off this morning during second period.","date":"2016-10-06 22:42:03","author":"Maya Akkaraju","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9313.jpg","categories":["News","Spotlight"],"tags":["administration","fire alarm","spider"]},{"id":123768,"title":"College essay help will be available from teachers in the morning on Wednesday, Oct. 19 in the MAC","permalink":"http:\/\/palyvoice.com\/2016\/10\/06\/college-essay-help-from-english-teachers-will-be-available-in-the-morning-on-wednesday-oct-19-in-the-mac\/","content":"","excerpt":"","date":"2016-10-06 20:22:10","author":"Chirag Akella","categories":["Ticker"],"tags":[]},{"id":123698,"title":"Rise Together Education offers Spirit Week store","permalink":"http:\/\/palyvoice.com\/2016\/10\/06\/rise-together-education-offers-spirit-week-store\/","content":"<span style=\"font-weight: 400;\">A school-based nonprofit is raising scholarship funds through its <a href=\"http:\/\/www.risetogethered.org\/spirit-week-fundraiser.html\">online Spirit Week store<\/a>, where students can purchase cheap accessories for the themed days of Spirit Week. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Rise Together Education store will be open until Oct. 11 or until supplies run out, according to RTE volunteer and Palo Alto High School junior Katie Laursen, who added that purchases will be distributed on the Quad on Oct. 13 and 14, and any leftover supplies will be sold at that time. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Rise Together Education is a nonprofit organization founded last year by special education teacher Laura Bricca. The organization provides mentoring and scholarship money to low income Paly students to help them get into college and succeed once they leave high school. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The idea was born actually first out of a former student of mine who came to me in her senior year, when she realized she had gotten into colleges, but they were expecting a housing payment,” Bricca said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The student did not have the money for the payment and was surprised by the complex process involved with getting into college and the required fees, according to Bricca. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“She was a low income student, had been homeless off and on all through high school, and she didn’t realize that despite all of that, her financial aid package still wasn’t going to be enough to cover all her costs,” Bricca said. “I actually started a personal fundraising campaign for her to help her with all of those fees, and from there it made me wonder how many other students were in a similar situation.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Bricca found that at least 20 to 25 Paly graduates per year were in a similar situation. Now, RTE aids students from their junior year through college by pairing them up with an adult mentor who guides them through the college application process and any other processes once they are in college. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Laursen has been volunteering with RTE since summer. She found that since the organization is new, not many Paly students know about it.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I wanted to help think of a way to get Paly students aware of what RTE is this year,” Laursen said. “I thought anything that we could do related to Spirit Week would be a great way to raise money and awareness since so many people participate in Spirit Week and it really brings the Paly community closer together.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Laursen says the Spirit Week store is a great way for students to find gear while supporting RTE.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The appeal of buying your Spirit Week gear from RTE is that it is convenient ... and you can support Paly students by purchasing from us,” Laursen said. “Also, we’re hoping that this will save you trips to multiple stores looking for different Spirit Week items.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">All of the proceeds from the Spirit Week store will go directly towards the organization and scholarships, according to Bricca.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Right now, we’re keeping our organizational costs really low,” Bricca said. “Our entire board is a volunteer board, so the only thing that we spend any money on are just to keep the foundation up and running, ... but between 90 and 95 percent of our proceeds go directly to students in the form of scholarships.”<\/span>\r\n\r\nTo learn more about Rise Together Education, visit its <a href=\"http:\/\/www.risetogethered.org\/\"> website<\/a>.","excerpt":"A school-based nonprofit is raising scholarship funds through its online Spirit Week store, where students can purchase cheap accessories for the themed days of Spirit Week. ","date":"2016-10-06 20:18:17","author":"Maya Akkaraju","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/I9P4076.jpg","categories":["News","Spotlight"],"tags":["Laura Bricca","Rise Together Education","Spirit Week","spirit week store"]},{"id":123665,"title":"Early decision: A stacked playing field","permalink":"http:\/\/palyvoice.com\/2016\/10\/06\/early-decision-a-stacked-playing-field\/","content":"Senior Chinmay Tyagi, like most of his peers at Palo Alto High School, is stressed. After 12 years of schooling, college applications are soon due. He says he feels pressured to get into not just any college, but an elite school, just like his parents did. In this way, he represents most high achieving Palo Alto High School students.  He has lived his entire life in an affluent and safe community, with supportive parents and a strong push for higher education and good grades. For students looking to get into schools like the University of Pennsylvania or Duke University that have a sub-15 percent acceptance rate, any little boost in chances helps.\r\n\r\nHow does one boost their chances in a sea of hundreds of thousands of applicants? For many students, the answer is early decision. Early decision, also known as ED, is a binding admissions process in which students must submit their applications early, usually in October or November, in exchange for a varying boost in acceptance chances.\r\n\r\nWhile ED is meant to allow colleges to build out their classes early, the actual effect ends up being an admissions process that favors wealthier students, who are typically better prepared to take advantage of this situation. The advantage is so pronounced that applying ED is the equivalent of gaining a 100 point boost on the SAT, something students pay thousands of dollars in test prep to achieve, according to Priceonomics, a research group based in San Francisco.\r\n\r\nThe process has gained popularity with students at Paly. This year so far, about 260 students are planning to take advantage of some kind of early process, up roughly three times from the year before, according to Ann Deggelman, who handles most of the college forms in the Guidance Department.\r\n\r\nApplying ED is a tough decision to make. A student has to commit himself or herself to one college and retract all the other applications if one gets in. The single resounding piece of advice for ED seekers is summed up by new Paly college and career counselor Stephanie Mendoza. \"Regularly within that pool are... students who know which school they want to go to, have visited, financial aid is not an issue, and they know the program that they want to go into,\" Mendoza says.\r\n\r\nFor many, the unfortunate reality is that one cannot be sure whether tuition and financial aid is feasible or not. The rapid increase of 1,120 percent in college costs since 1970 has led to uncertainty about financial aid and chances for social mobility, according to the Brookings Institute. When a Paly student applies ED, he\/she knows they will most likely be able to deal with the financial aid package offered. When a lower income student applies ED, he\/she might not get an adequate package. While one can appeal the school's offer, many times the student will be forced to contend with paying up money they do not have or not even going to college at all. The student can break the agreement but the college will make it hard for that person to go to any other school.\r\n\r\nBecause of high costs and uncertainty, wealthier students tend to be the first to take advantage of ED, according to Mendoza.\r\n\r\nDespite these concerning trends, top universities continue to increase their reliance on ED as a form of enrollment management. In 2015, the Washington Post found that 37 schools were enrolling more than 40 percent of their student body during early decision. The most notable examples include University of Pennsylvania and Claremont McKenna College, both of which enroll 54 percent, Tufts University which enrolls 53 percent and Duke, which enrolls 47 percent of its total class in the ED process.\r\n\r\n[caption id=\"attachment_123666\" align=\"alignnone\" width=\"620\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Screen-Shot-2016-10-04-at-9.16.03-PM.png\"><img class=\"size-full wp-image-123666\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Screen-Shot-2016-10-04-at-9.16.03-PM.png\" alt=\"This infographic highlights the advantage provided by applying early at a few selected schools. These high acceptance rates tend to benefit affluent students. Data aggregated by the Washington Post. Infographic made by Sid Sharma. \" width=\"620\" height=\"627\" \/><\/a> This infographic highlights the advantage provided by applying early at a few selected schools. These high acceptance rates tend to benefit affluent students. Data aggregated by the Washington Post. Infographic by Sid Sharma.[\/caption]\r\n\r\nIn the mid-2000s, schools began to move away from ED. The most notable example was Harvard University which ended its ED in 2006, citing a disproportionately high number of white, affluent applicants. In 2011, Harvard reversed itself with mixed opinions from the media. Princeton and Yale soon followed suit in reintroduction. Today, the school which has a 3.5 percent regular decision rate accepts 14 percent in early decision.\r\n\r\nSchools also use ED as an enrollment and financial aid management technique. “The increased use of early decision shows the strong drive for colleges to make themselves look better statistically,\" wrote James Fallows, a writer for the Atlantic. \"The increased emphasis on SAT scores shows the same thing.”\r\n\r\nThe process is successful in boosting schools' numbers in the gradually more competitive rankings war. ED helps colleges look like they have a more selective regular decision rate. By siphoning students into the early decision pool and having a greater acceptance rate there, the universities can accept less students out of a greater pool in regular decision. This makes their regular decision rates look significantly lower, boosting their US News and World Report Best Colleges rating.\r\n\r\nThe process does have some merits. Accepting people who are bound helps schools consistently estimate their student body, so crowded dorms and empty college classrooms can be avoided. It also shows the college that the student is very much into a specific school, bolstering school spirit. Early Decision applicants tend to be of a slightly higher caliber academically than regular decision applicants, according to the College Board.\r\n\r\n<span style=\"font-weight: 400;\">Despite this, early decision tends to be stacked against those who already have factors weighing against their chances of going to college. Universities should try to move away from heavy reliance on enrollment management techniques and towards a more equitable system of financial aid and acceptance.<\/span>","excerpt":"Senior Chinmay Tyagi, like most of his peers at Palo Alto High School, is stressed. After 12 years of schooling, college applications are soon due. <a href=\"http:\/\/palyvoice.com\/2016\/10\/06\/early-decision-a-stacked-playing-field\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2016-10-06 17:25:40","author":"Siddarth Sharma","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/ocd.jpg","categories":["Features","Spotlight"],"tags":[]},{"id":123703,"title":"Two big changes come to FAFSA","permalink":"http:\/\/palyvoice.com\/2016\/10\/06\/two-big-changes-come-to-fafsa\/","content":"[caption id=\"attachment_123704\" align=\"alignnone\" width=\"714\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Screen-Shot-2016-10-05-at-10.12.36-PM.png\"><img class=\" wp-image-123704\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Screen-Shot-2016-10-05-at-10.12.36-PM.png\" alt=\"One of the changed portions of the new FAFSA that requires last year's (2015) tax info instead of current year estimates and later revision. Form courtesy of studentaid.gov.\" width=\"714\" height=\"371\" \/><\/a> One of the changed portions of the new FAFSA that requires last year's (2015) tax info instead of current year estimates and later revision. Image: studentaid.gov.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Free Application for Federal Student Aid - or the FAFSA - has some key alterations this year that will greatly affect how students receive grants, scholarships, student loans, and work-study opportunities.  <\/span>\r\n\r\nThere are two important changes to the application this year.  The application became available on Oct. 1 this year instead of the normal release of Jan. 1. Instead of estimating income for the current tax year and then going back and correcting it once tax returns are officially filed, students will be able to use their parents' returns from 2015, which have already been filed.\r\n\r\nAccording to studentaid.gov, it is important that students of all backgrounds fill out the FAFSA in a timely manner. Some aid is first-come, first-serve, meaning those funds may get depleted quickly. Students should check with their respective colleges for specific priority deadlines.\r\n\r\nMany families in Palo Alto say that their incomes will be too high to qualify for aid of any kind.\r\n\r\n“I think it will be worth it to fill out the FAFSA but only because you also need the FAFSA for merit-based financial aid opportunities,” senior Kevin Chen said.\r\n\r\nOthers are relying on need-based help to pay for college.\r\n\r\n<span style=\"font-weight: 400;\">“Only my mom works, so we are a single-income household, making it hard for us to afford college for both me and my brother,\" senior Natalie Maloney said, \"So I will definitely be applying for financial aid, and fingers crossed I get some.\"<\/span>\r\n\r\nThe reality is that the universities will most likely cover a large part of the difference between the sticker price of the college and the effective family contribution with a package of grants and loans, according to the US Department of Education's blog. This applies to even high income families. A study by <a href=\"https:\/\/www.nerdwallet.com\/blog\/loans\/student-loans\/college-students-fafsa-money\/\">NerdWallet<\/a> found that 37 percent of California graduates did not fill out their FAFSA last year, leaving approximately $342 million of aid on the table.\r\n\r\nMost aspects of the financial aid process will remain the same. Students will still be required to reapply each year and the aid amount will be more or less stagnant.\r\n\r\n“The FAFSA benefits our students who are applying early decision or early action because they do get to hear earlier about the school’s financial aid package, so you have more time to discuss about the financial aid process with your parents,” college counselor Stephanie Mendoza said.\r\n\r\nFAFSA deadlines, which are national, differ from California resident aid requirements. Students in California are most notably encouraged to apply for the Cal Grant. The deadline for that is March 2 and the requirements will remain the same, according to the California Student Aid Commission.","excerpt":"The Free Application for Federal Student Aid &#8211; or the FAFSA &#8211; has some key alterations this year that will greatly affect how students receive <a href=\"http:\/\/palyvoice.com\/2016\/10\/06\/two-big-changes-come-to-fafsa\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2016-10-06 17:22:38","author":"Siddarth Sharma","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_93481.jpg","categories":["News","Spotlight"],"tags":[]},{"id":123643,"title":"Boys&#8217; water polo routed by Gunn for the second time","permalink":"http:\/\/palyvoice.com\/2016\/10\/05\/boys-water-polo-routed-by-gunn-for-the-second-time\/","content":"[caption id=\"attachment_123652\" align=\"alignleft\" width=\"684\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/DSC_0027.jpg\"><img class=\" wp-image-123652\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/DSC_0027.jpg\" alt=\"Senior field player Eric Maser scores on a volley from the left side of the pool in the 3rd quarter to tie the game. Photo by Ethan Kao. \" width=\"684\" height=\"479\" \/><\/a> Paly senior field player Eric Maser scores on a volley from the left side of the pool in the 3rd quarter to tie the game against the Titans on Tuesday at Gunn. Despite a hard fought effort, the Vikings fell against Gunn, bringing the Vikings to .500 on the season. Photo by Ethan Kao.[\/caption]\r\n\r\nThe Palo Alto High School boys’ water polo team (8-8, 5-2) suffered a loss for the second time by the Gunn High School Titans this season (6-3, 6-0) this season by a score of 8-5 on Tuesday at Gunn.\r\n\r\nThis loss marks the second De Anza League loss for Paly, with both losses coming against Gunn. Although junior field player Jack Andersen and several senior field players gave their best efforts, the Vikings fell short to the overpowering Titans who led the Vikings for the majority of the game.\r\n\r\nAfter Andersen’s first goal early in the game, the Titans scored four straight. However, the Vikings persevered and continued to battle for the entire length of the game, unlike their last match against Gunn, according to Paly senior field player Tommy Smale.\r\n\r\n“I don’t like losing to Gunn at all, but we have gotten better since the first game,” Smale said. “Last game, we died in the second quarter. But this time we fought to the fourth quarter.”\r\n\r\nAlthough Anderson credited his goals to clear communication and constant activity, he said the team could have fared better in those key areas.\r\n\r\n“We were on and off,” Andersen said. “We scored when we had teamwork. Both of the times I scored, it was off drives created through my teammates moving. As a result, I could get open because the defense had to move, and I took advantage of that. We need to work on having that great movement throughout the entire game. We didn’t have that movement the whole time, especially the third quarter.”\r\n\r\nGoalkeeper Ben Rapperport also had his own perspective to offer on what type of improvements the team can make.\r\n\r\n“We need to consistently get back on defense and make our shots, and if we do that, we can limit the goals we let in and win our games against Gunn,” Rapperport said.\r\n\r\nIn addition to Andersen’s two goals, senior field players Alex Beaudry, Eric Maser and Andrew Jozefov each scored a goal, in that respective order.\r\n\r\nWith these improvements regarding team movement and defense, Andersen said the team can bounce back with a win.\r\n\r\nThe Vikings will play their next game at 3 p.m. on Wednesday at Saint Francis High School.","excerpt":"School boys’ water polo team (8-8, 5-2) suffered a loss for the second time by the Gunn High School Titans this season (6-3, 6-0) this season by a score of 8-5 on Tuesday at Gunn.","date":"2016-10-05 18:22:26","author":"Sam Lee","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/DSC_0027.jpg","categories":["Sports","water polo"],"tags":["ben rapperport","Boys","gunn","jack andersen","paly","rival","sports","Tommy Smale","vikings","water polo"]},{"id":123622,"title":"Walk and Roll Day in numbers","permalink":"http:\/\/palyvoice.com\/2016\/10\/04\/walk-and-roll-day-in-numbers\/","content":"Palo Alto High School students show their support for going green this morning as they bike, rollerblade, skateboard and walk onto campus participating in the annual Walk &amp; Roll Day tradition. Walk &amp; Roll Day is an annual event which encourages eco-friendly and physically active methods of commuting to school, according to <a href=\"http:\/\/www.pausd.org\/palo-alto%E2%80%99s-walk-roll-week-safer-streets-healthier-bodies-and-greener-planet\">Palo Alto Unified School District’s website<\/a>.\r\n\r\nIn previous years, parent volunteers handed out candy to those who walked or rolled to school. However, due to the <a href=\"http:\/\/palyvoice.com\/2015\/09\/10\/candy-banned-from-club-day\/\">new school policy<\/a> banning the distribution of candy on campus, students received colorful 'Go Green!' stickers instead. Despite the change, Walk &amp; Roll Day was still a hit with hundreds of students opting to take the \"green\" route to school.\r\n\r\n&nbsp;\r\n\r\n<iframe style=\"overflow-y: hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/16815476-new-piktochart\" width=\"650\" height=\"1280\" frameborder=\"0\" scrolling=\"no\"><\/iframe>","excerpt":"Palo Alto High School students participated in the annual Walk & Roll day this morning through by riding their bikes, rollerblading, skateboarding or walking to school. ","date":"2016-10-04 21:46:14","author":"Aisha Chabane","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_7667.jpg","categories":["Lifestyle"],"tags":["biking","no candy","public transport","roll","rollerblading","walk","walk and roll","walk and roll in numbers"]},{"id":123550,"title":"Performing Arts Center formally introduced","permalink":"http:\/\/palyvoice.com\/2016\/10\/04\/performing-arts-center-formally-introduced\/","content":"<iframe src=\"https:\/\/www.youtube.com\/embed\/CaijhHqrhRU\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\nThe highly anticipated Performing Arts Center is officially open for use by the Paly community after a grand opening Saturday, after a large crowd of Palo Alto teachers, parents, students and community members came for a celebratory gala.\r\n\r\n<span style=\"font-weight: 400;\">To open the four-hour ceremony, instrumental music teacher Jeff WIllner and the Paly Symphonic Band took the stage, playing “Magic To Do” from \"Pippin\", and finishing with the Paly fight song, which raised a roar from those in attendance, many of whom were Paly alumni.<\/span>\r\n\r\nPrincipal Kim Diorio explained the importance of the building, and what it will bring to the community.\r\n\r\n“It’s so amazing that we now have this humungous stage,\" Diorio said. \"Our [performing arts] program has grown over the last several years, so it [opening of PAC] good timing.\"\r\n\r\nFollowing Diorio’s speech, the Theater 3 and 4 honors classes used the state-of-the-art lighting and control center to put on a psychedelic and colorful display, while Willner’s orchestra and band played below the stage in the Orchestra pit.\r\n\r\n“I was thrilled to be a part of the new theater’s big opening, because many people put in hard work to get it done,\" said Arman Chalwa, a Theater 3 student. \"I was really nervous because I felt like we had to do an excellent job introducing this building, but once I walked on stage I forgot all about my nerves.\"\r\n\r\nMadrigals, an advanced and selective vocal group, began its performance on the second level of the of the PAC, and strode through the theatre allowing the audience to view and capture the spirit of the program. The Madrigals enchanted the crowd with their extravagant clothing and marvelous tones. This performance also marked the beginning of the 50th year of the program.\r\n\r\n“The Gala was such a mind-blowing experience,\" said senior member of the Madrigal program Joao-Gabriel Carvalho De Pina. \"To see all of the performing arts programs come together was amazing and unforgettable. You don’t get to see an event like this everyday and I’m so honored and so glad I was a part of it.\"\r\n\r\nPaly graduate and Broadway performer Alex Nee showcased his talents in a duet with senior Soo Kim and a solo acoustic guitar performance.\r\n\r\nFollowing the orchestra’s initial performance, Paly choir groups filled the rafters behind the last line of cellos and violas, combining for a masterful performance, where vocals, instruments and technological lighting exhibited the potential of the venue. Almost interactive, the choir groups moved into the isles of the theatre, and then proceeded to captivate the crowd with the hymn “Gloria.”\r\n\r\n<span style=\"font-weight: 400;\">The grand finale brought together all of the ensembles as members of choir, orchestra, jazz band and theatre were brought together to perform multiple songs and broadway numbers, most notably “For Good” and “Defying Gravity” from the musical \"Wicked.\"<\/span>\r\n\r\nPalo Alto native Rob Minkoff, director of \"The Lion King,\" introduced the final song, a Lion King Medley, which included the “Circle of Life.” As the crowd sang along, choir, orchestra, theater and band members provided the background vocals and music. Minkoff showed that he is much more than a Hollywood director, singing the lead part for a medley of songs from \"The Lion King.\"\r\n\r\nArchitect Erwin Lee worked hard with a committee of Paly teachers and administrators to model the PAC after Spanish mission style architecture, similar to that of the Tower Building, bringing a modern yet traditional aspect to the campus.\r\n\r\nThe next PAC event will feature \"The Important of Being Earnest,\" the upcoming fall play on Friday, Nov 4.","excerpt":"The highly anticipated Performing Arts Center is officially open for use by the Paly community after a grand opening Saturday, after a large crowd of Palo Alto teachers, parents, students and community members came for a celebratory gala.\r\n\r\n","date":"2016-10-04 13:46:24","author":"Isabella Marcus","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/14572016_583986368478428_1704082268_o.jpg","categories":["News","Spotlight"],"tags":["2016","band","choir","construction","Kim Diorio","music","orchestra","pac","palo alto","palo alto high school","paly","paly theatre","spectrum singers","student","symphonic band","theater","theatre"]}]