[{"id":116621,"title":"Girls&#8217; soccer defeats Santa Clara on Senior Night, looks toward CCS","permalink":"http:\/\/palyvoice.com\/2016\/02\/22\/girls-soccer-defeats-santa-clara-on-senior-night-looks-toward-ccs\/","content":"[caption id=\"attachment_116714\" align=\"aligncenter\" width=\"635\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Senior-night.png\"><img class=\" wp-image-116714\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Senior-night.png\" alt=\"Photo by Dami Bolarinwa\" width=\"635\" height=\"476\" \/><\/a> Graduating seniors Ansley Queen, Jacey Pederson, Alison Lu, Nika Woodfill, Linnea Carlstrom and Heidi Moeser stand triumphantly in the rain. They celebrated Senior Night and a win of the their last game of the regular season, as the Vikings beat the Santa Clara High School Bruins 4-0. Photo by Dami Bolarinwa.[\/caption]\r\n\r\n&nbsp;\r\n\r\nThe Palo Alto High School girls' soccer team (10-1-1) cruised through the last game of the regular season, making way for the upcomingCentral Coast Section playoffs. The Vikings defeated Santa Clara High School (4-5-3) 4-0 on Senior Night last Friday at Paly.\r\n\r\nThe Vikings held possession fiercely throughout the match, ultimately scoring once in the first half and three times in the second. The first goal was an own goal, when a throw-in by junior Talia Malchin bounced off a Santa Clara defender's head and into the goal. Sophomore Emily Tomz scored the second with an assist from senior captain Heidi Moeser. Senior Alison Lu scored twice, with the second goal occurring within 20 seconds of the first. Santa Clara held strong the first half, blocking seven goal attempts by Paly, but continuously lost possession after halftime.\r\n\r\nThe Vikings now set their sights on improving in preparation for CCS.\r\n\r\n\"Although we won, and morale is high, there are definitely things we need to improve on before CCS,\" Moeser said. \"I think we could work on capitalizing on set plays and corner kicks. We can always continue to work on our communication and playing the simple passes.\"\r\n\r\nWith a near perfect record, except for a loss to Mountain View High School (10-0-2), the Vikings constantly strive to progress.\r\n\r\nAccording to Tomz the Vikings bounced back from the Mountain View loss quickly, and focus on preparing for CCS.\r\n\r\n\"Although we didn't have a perfect season, we played extremely well, \" Tomz said. \"We let in few goals, scored a heck of a lot of them, and overall we should be proud of a really great season. Of course, our loss to Mountain View [High School] was a downer, but we bounced back and finished strong. Now we push on and set our sights for a CCS victory.\"\r\n\r\nSenior Night was dedicated to celebrating the six starting seniors on the team.  Assistant Coach Eric Seedman says each senior has her own strength.\r\n\r\n\"Linnea was huge for us this year as goalie,\" Seedman said. \"Ansley is the hardest worker and foundation of our midfield, Alison is an amazing aggressive defender, Jacey is an incredible player and great team leader, Nika is a fantastic winger, is fast and scores often, and Heidi holds strong as a center forward and is a great motivational caption. These six seniors are an incredible part of the team, and next year we will miss them on and off the field.\"\r\n\r\nSeedman says the Vikings are ready to take on the challenge of CCS.\r\n\r\n\"The season isn't over yet. We still have Open Division of CCS, and we are motivated, pumped up and ready to go,\" Seedman Said.\r\n\r\nThe Vikings will have their first CCS playoff game at Archbishop Mitty High School (13-2-5)1 p.m. on Saturday, Feb. 27 at San Jose.","excerpt":"Girls' soccer defeated Santa Clara High School 4-0 during Senior Night, and is currently setting its sights on a CCS win. ","date":"2016-02-22 22:55:36","author":"Bianca Al-Shamari","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Senior-night.png","categories":["Sports","Spotlight"],"tags":[]},{"id":116737,"title":"AP Exam registration ends on March 9","permalink":"http:\/\/palyvoice.com\/2016\/02\/22\/ap-exam-registration-ends-on-march-9\/","content":"","excerpt":"","date":"2016-02-22 22:00:16","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":116732,"title":"Spring Sports Parent Night is at 6 p.m. on Tuesday, Feb. 23 in the library","permalink":"http:\/\/palyvoice.com\/2016\/02\/22\/spring-sports-parent-night-is-at-6-p-m-on-tuesday-feb-23-in-the-library\/","content":"","excerpt":"","date":"2016-02-22 21:56:11","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":116730,"title":"Course selections for next year are due this Thursday, Feb. 25","permalink":"http:\/\/palyvoice.com\/2016\/02\/22\/course-selections-for-next-year-are-due-this-thursday-feb-25\/","content":"","excerpt":"","date":"2016-02-22 21:54:39","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":115730,"title":"&#8216;Spotlight&#8217; shines a light on concealed injustice","permalink":"http:\/\/palyvoice.com\/2016\/02\/22\/spotlight-shines-a-light-on-concealed-injustice\/","content":"[caption id=\"attachment_115851\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/spotlight-1024x6581.jpg\"><img class=\"size-full wp-image-115851\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/spotlight-1024x6581.jpg\" alt=\"Spotlight reporters Sacha Pfeiffer (Rachel McAdams), Walter Robinson (Michael Keaton), Michael Rezendes (Mark Ruffalo), Marty Baron (Liev Shreiber) and Matt Carroll (Brian D'arcy James) (left to right) discuss their investigation of religious figures in the Boston area. The stellar cast and dramatic plot line contributed to the film's emotional appeal and propelled it to earn six Academy Award nominations. Photo courtesy of Open Road Films.\" width=\"600\" height=\"386\" \/><\/a> A group of Spotlight reporters Sacha Pfeiffer (Rachel McAdams), Walter Robinson (Michael Keaton), Michael Rezendes (Mark Ruffalo), Marty Baron (Liev Shreiber) and Matt Carroll (Brian D'arcy James) (left to right) discuss their investigation of religious figures in the Boston area. The stellar cast and dramatic plot line contributes to the film's emotional appeal and propelled it to earn six Academy Award nominations. Its nominations include Best Picture, Directing, Film Editing, Writing (Original Screenplay), Actor in a Supporting Role (Mark Ruffalo) and Actress in a Supporting Role (Rachel McAdams). Photo: Open Road Films.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The purpose of journalism is to uncover hard truths. Sometimes stories are hidden not because people are unaware, but because they are afraid to speak. Such stories often take an emotional toll on journalists, who may face backlash from the public and those targeted by the press. The scandal with the Catholic Church, which involved the sexual abuse of hundreds of children by priests, is one such example. While “Spotlight”  encompasses stellar acting and a dramatic script, it falls slightly flat due to an underwhelming conclusion and meager character development.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Spotlight” tells the true story of an investigative journalism team from the Boston Globe’s ‘Spotlight’ section, and how they uncovered sexual abuse cases perpetrated by religious figures nearly 20 years ago. The priests' actions went unpunished due to fearful victims and determined Church members such as the Archbishop of Boston, Bernard Law (Len Cariou). The team encountered constant pushback from community members, especially those with strong ties to the Catholic Church. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">By the time the team published the story, they had enough damaging evidence that the issue couldn’t be swept under the rug, with proof of over 100 cases of sexual abuse by priests and a strong suspicion that the system allowed such behavior.<\/span>\r\n\r\nDirector Tom McCarthy maintains a fast pace with smooth scene changes that not only keeps the audience interested by the influx of information but also creates a contrast in emotions. In one scene, journalists Rezendes and Pfeiffer are both conducting interviews with victims in two different places, with two different men. The emotions of the victims’ testimonies are amplified by the scene switching from one man to the other, making it painfully clear how so few victims survive the mental strain of reliving their experiences. The camera zoomed in on faces, allowing small facial expressions to convey sadness and shame instead of just using words. Scene switches were also accompanied by a melodic, soft piano music that adds a somber tone, but at times, it is more distracting than helpful.\r\n\r\n<span style=\"font-weight: 400;\">The constant tension in a dogged chase for information, and high turmoil of emotions comes to life with a talented cast. Walter “Robby” Robinson (Michael Keaton), the editor in charge of the Spotlight team, struggles with opposition from friends over the decision to write the story and helps provide context to the Spotlight team’s acceptance of the case. Mike Rezendes and Sacha Pfeiffer stand out among the cast, with the script placing most of its focus on their efforts to track down scandals within the Catholic Church. Their dramatic efforts to uncover a string of abuse help dramatize the plot and connect the audience to its emotional undertones. Mitchell Garabedian (Stanley Tucci) demonstrates the struggle of citizens against groups or organizations to promote justice as a strict but virtuous lawyer who was previously unable to derail the Church’s consistent cover-ups. Editor Marty Baron (Liev Schreiber), who pushes the Spotlight team to focus on the story, serves a limited yet important role and his gruff personality juxtaposes those of his fellow writers.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">While all actors expertly performed their roles, character development was limited throughout. “Spotlight” offered little context to address why each character was pursuing the story and their goals in the process. In addition, the film’s large cast ensured that it was difficult to fully comprehend each character’s background, motives and desires. Other factors limited “Spotlight's” coherency. The convoluted plot created confusion because so many names were thrown around. Much of the action was conveyed through the dialogue, so it was easy to miss the investigation’s details.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The movie raises one very important question, but never fully answered it: Why wasn’t the story covered earlier, when the scandals first occurred? Lawyers and victims told the Globe that they had sent the information years ago, but they never mentioned what had happened to it. An unclear conclusion, amplified by the final scene’s underwhelming representation of a busy office, negatively affected the movie’s clarity and the urgency of the story being written.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Spotlight” combines a stellar cast with an intense plot to create a unique look into the world of journalism. This thriller was not only enjoyable to watch, but also informative because of the in-depth look into the Catholic Church scandal. “Spotlight” provides depth by illuminating one of the greatest challenges we face today: Shining the spotlight on issues some would rather leave covered up.<\/span>\r\n\r\n<strong>\"Spotlight\"<\/strong>\r\n\r\n<strong>2 hours, 9 minutes<\/strong>\r\n\r\n<strong>Rated: R for some language including sexual references.<\/strong>\r\n\r\n<strong>Directed by Tom McCarthy<\/strong>\r\n\r\n<strong>Starring: Mark Ruffalo, Michael Keaton, Rachel McAdams, Live Schrieber, John Slattery and Brian D'arcy James<\/strong>","excerpt":"The stellar cast and dramatic plot line contributes to the film's emotional appeal and propelled it to earn six Academy Award nominations. ","date":"2016-02-22 12:02:16","author":"Ana Caklovic","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/maxresdefault1.jpg","categories":["Oscars 2016"],"tags":["2016","boston globe","liev schreiber","mark ruffalo","michael keaton","movie review","oscars","rachel mcadams","roman catholic church","sexual abuse","spotlight","stanley tucci","tom mccarthy"]},{"id":115318,"title":"&#8220;The Martian&#8221; leaves no space for boredom","permalink":"http:\/\/palyvoice.com\/2016\/02\/22\/the-martian-leaves-no-space-for-boredom\/","content":"[caption id=\"attachment_115347\" align=\"alignnone\" width=\"561\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/themartianstill-1024x576.jpg\"><img class=\" wp-image-115347\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/themartianstill-1024x576.jpg\" alt=\"Matt Damon stars as astronaut Mark Watney in the space thriller &quot;The Martian&quot;. &quot;The Martian&quot; has been nominated for seven Oscars, including the Best Actor award. The Oscars will be announced at 5:30 p.m. on February 28th on ABC. Photo by 20th Century Fox.\" width=\"561\" height=\"421\" \/><\/a> Matt Damon stars as astronaut Mark Watney in the space thriller \"The Martian,\" nominated for seven Oscars, including the Best Actor award. The Oscars will be announced at 5:30 p.m. on Feb. 28 on ABC. Photo by 20th Century Fox.[\/caption]\r\n\r\nGoing to Mars is an unthinkable proposition for all of mankind. Getting stuck on the reddish-brown planet is even more inconceivable. The Oscar-nominated film \"The Martian,\" directed by Ridley Scott, tells the thrilling story of a man who gets stuck on Mars and fights to survive against all odds.\r\n\r\nThe film is based on a novel by author Andy Weir, and follows the story of an astronaut, Mark Watney (Matt Damon), who is mistakenly left on Mars by his team following a bad storm. Due to limited supplies, Watney has to use his background in botany to find a way to grow food on the desolate planet and survive until National Aeronautics and Space Administration (NASA) and his team can rescue him. This film takes the notion of man versus nature to the next level.\r\n\r\nAcademy Award-winning actor Matt Damon leads an all-star cast including big industry names like Jeff Daniels, Michael Pena, Kristen Wiig, Chiwetel Ejiofor, Jessica Chastain and Sean Bean. Damon does an exceptional job of adopting the character of Watney, a desperate but cool-headed man. He also does a phenomenal job conveying Watney’s loneliness, which is depicted in one of the first scenes where Watney stirs back to consciousness after the disaster only to realize he has to survive on his own. He also displays a multitude of emotions throughout the film, intertwining well-timed humor and creativity in an extremely unfortunate situation.\r\n\r\nDespite the lack of a human villain, the film’s plot is quite gripping due to Damon’s outstanding portrayal of a man trying to brave the unknown elements and a script that balances timely comedy and action. The supporting cast also does a fine job in complementing Damon as Daniels, Wiig, Bean, Chastain and Ejiofor all step up to create an fresh alternative view of Watney’s struggle from NASA Headquarters on Earth. Actor Danny Glover, also known as Childish Gambino under his rap name, also makes a cameo in the film, which is an exciting sight for his musical fans.\r\n\r\nOne of the film's main strength is in its visual effects, something that the film industry which has been recognized and therefore nominated the movie for the Oscar category of Best Visual Effects. Amazing landscape shots by Scott not only highlight the loneliness that Watney experiences on the planet, but also the haunting beauty of the Red Planet.\r\n\r\n\"The Martian\" should be lauded for the balance it has between visual effects and scientific accuracy, specifically when it comes to the setting. To faithfully recreate the planet Mars, British visual effects company, Framestone, worked with NASA to make sure that specific features, such as the sky and terrain, were as realistic as possible. Scott also worked meticulously to make sure that the film accurately represented what could happen in real life. For example, the main plot line regarding Watney’s attempt to grow food on the planet was approved by real life experts like astrophysicist Michael Shara who, when speaking to the New York Post, said, “We could probably grow something on Mars.” Despite minor scientific accuracy errors, like the exaggerated effects of the wind storm that begins the film, Scott does an applaudable job that will please both moviegoers who are looking forward to the thrilling story and those who are looking forward to the science.\r\n\r\n\"The Martian\" is a thrilling story worthy of its seven nominations. However, while it should be competitive in many of the categories, the most deserving and most likely award for \"The Martian\" should be in the Visual Effects category, a category won by last year’s space drama \"Interstellar.\"\r\n\r\n\"The Martian\" is one of the newer editions of a series of space thrillers, following the recent blockbusters \"Interstellar\" and \"Gravity.\" However, \"The Martian\" distinguishes itself from both of the films as it is more engaging than \"Gravity\" but less emotional – and less bizarre – than \"Interstellar.\" Overall, it is a captivating movie and a must-watch for all, especially science aficionados.\r\n\r\n<strong><strong>“The Martian”<\/strong><\/strong>\r\n\r\n2 hours, 24 minutes\r\n\r\nPG-13 (for some strong language, injury images, and brief nudity)\r\n\r\nDirected by Ridley Scott\r\n\r\nWith Matt Damon, Jessica Chastain, Kristen Wiig, Kate Mara, Michael Peña, Jeff Daniels, Chiwetel Ejiofor, and Donald Glover.\r\n\r\nOscar Nominations: Best Picture, Actor in a Leading Role (Matt Damon), Visual Effects, Sound Editing, Writing (Adapted Screenplay), Sound Mixing and Production Design.","excerpt":"Going to Mars is an unthinkable proposition for all of mankind; getting stuck on the reddish-brown planet is even more inconceivable. The Oscar nominated film \"The Martian\" tells the thrilling story of a man who fights to survive against all odds. ","date":"2016-02-22 11:42:12","author":"Sam Lee","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/the-martian.jpg","categories":["A&amp;E Section Spotlight","Oscars 2016","Spotlight"],"tags":["best picture","Childish Gambino","chiwetel ejiofor","Danny Glover","film","Jeff Daniels","Kristen Wiig","matt damon","movie","nominations","oscar","review","Sean Bean","the martian"]},{"id":115220,"title":"SRP vs AAR: Which should you choose?","permalink":"http:\/\/palyvoice.com\/2016\/02\/20\/srp-vs-aar-which-should-you-choose\/","content":"<span style=\"font-weight: 400;\">Palo Alto High School is offering two research courses next year, Advanced Authentic Research — currently in its pilot year — and long-running Science Research Project.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Both AAR and SRP are programs that hope to ignite student passion by having students conduct real-world research with mentors working in a variety of fields. <\/span>While the two courses may seem to be identical project-based classes, they have a few key differences that students should take note of when signing up for courses for next year, many of which are shown in the Venn Diagram below.\r\n\r\n[caption id=\"attachment_116690\" align=\"aligncenter\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/lastone.jpg\"><img class=\"size-full wp-image-116690\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/lastone.jpg\" alt=\"A Venn Diagram comparing AAR and SRP for the 2016-17 school year. Junior David Willner thinks that taking a class such as SRP and AAR, that are focused on project-based learning has many benefits. “It is a great opportunity to complete your career tech ed because you’re able to choose the project you want to work on to fit the field of study you want to ultimately work in as a career,” Wilner said. Diagram created by Aisha Chabane.\" width=\"800\" height=\"600\" \/><\/a> A Venn Diagram comparing AAR and SRP for the 2016-17 school year. Junior David Willner thinks that taking a class such as SRP and AAR, that are focused on project-based learning has many benefits. “It is a great opportunity to complete your career tech ed because you’re able to choose the project you want to work on to fit the field of study you want to ultimately work in as a career,” Wilner said. Diagram created by Aisha Chabane.[\/caption]\r\n\r\nThe main difference lies in what type of research projects participating students can pursue.\r\n\r\nJunior Timothy Liu, an AAR participant whose project is a business idea targeted at students, says that while SRP students are limited to researching STEM topics, AAR students are connected with mentors in a variety of fields.\r\n\r\n<span style=\"font-weight: 400;\">“With AAR, you get a lot more variety in terms of projects and mentors,\" Liu said. \"For instance, my project is on business, something that I'm much more interested in than science.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Although SRP students must find their own mentors, Liu is one of many students in AAR who was connected to a mentor.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"Although I had the option of finding my own mentor, I didn't previously have that many connections in the business world so getting assigned one was definitely helpful,” Liu said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">While having a mentor found for you is an upside that many students from both AAR and SRP stand by, some believe that having to find your own mentor can be beneficial.<\/span>\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">“Drafting my email and interviewing [with labs] was really valuable, and I think that's a really good skill that SRP teaches students,” senior and SRP Participant Gabi Rossner, whose research is about speech processing in natural conversations, said.<\/span><span style=\"font-weight: 400;\"> <\/span><\/p>\r\n<span style=\"font-weight: 400;\">Both AAR and SRP will be offered as 8th period classes next year. AAR students will meet with Dr. Jeong Choe during tutorial, and SRP students will attend class meetings once a week at lunch with Keith Geller, the physics teacher in charge of SRP.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Rossner explains that having SRP meetings during Lunch helped her because she didn’t have enough room in her schedule to take SRP.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"I never had time in my schedule junior or senior year to take any extra science classes, so SRP being an 8th-period class is great because otherwise, I wouldn't have been able to take another science class,” Rossner said.<\/span>\r\n\r\nAlthough similar, each course teaches students different skills and expects them to complete different assignments.\r\n\r\nFor SRP, students must write an abstract about their research in January, submit a poster on their research in February, and write a technical scientific paper as well as present a 15-minute multimedia presentation on their research in May.\r\n\r\nAAR on the other hand requires students to write a research proposal in October, collect data through the end of March and present their work at a PAUSD celebratory showcase in May.\r\n\r\n<span style=\"font-weight: 400;\">The two programs also differ in the way students are expected to conduct research.<\/span>\r\n\r\n[caption id=\"attachment_116085\" align=\"alignright\" width=\"261\"]<img class=\"wp-image-116085\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/12695139_1003482599726249_825678381_o2.jpg\" alt=\"12695139_1003482599726249_825678381_o\" width=\"261\" height=\"348\" \/> AAR participant, junior David Willner, working on his code for his research on creating noise canceling software that works with any type of headphones. Photo by Daniella Maydan.[\/caption]\r\n\r\nSRP students often get a feel for what it's like to work in a research lab, write a research paper and help with their mentor's pre-existing research, while most AAR students come up with their own thesis and conduct their research independently from their mentors.\r\n\r\nJunior Gaby Pelayo, an SRP participant whose research is focused on using drugs to improve muscle regeneration, explains that she helps her mentor with a specific research project that she has been working on for a long time.\r\n<div class=\"_5wd4 _1nc6 direction_ltr\">\r\n<div id=\"js_m3\" class=\"_5wd9\" data-hover=\"tooltip\" data-tooltip-position=\"right\">\r\n<div class=\"_5wde _n4o\">\r\n<div class=\"_5w1r _3_om _5wdf\">\r\n<div class=\"_4gx_\">\r\n<div class=\"_d97\">\r\n\r\n<span class=\"_5yl5\">\"I didn't create my own research proposal, but my mentor explained her research thesis to me, and I go to the lab a few days after school to conduct experiments on my own to further that research,\" Pelayo said.<\/span>\r\n<div class=\"_d97\">\r\n<div class=\"_d97\">\r\n\r\nContrastingly, AAR participant junior Ahana Ganguly, who is researching how Paly students define success, explains that she and her research partners conduct most of the research on their own.\r\n\r\n\"[My research partners and I] schedule appointments with [our mentor] when we think it's necessary,\" Ganguly said. \"We go to him for advice and he helps edit our work, but we're really the ones driving the project.\"\r\n<div class=\"_3ry4\">\r\n\r\n<span style=\"font-weight: 400;\">Despite the courses' similarities, Choe and Geller are unsure about whether or not the two courses will be ever be combined.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Choe, the prospect of the two programs merging has been considered, but it is still unsure if it will ever happen. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I have been discussing [the possibility of merging the two courses] with Mr. Geller,\" Choe said. \"We want to first see what the sign-ups for both of the courses look like and then figure out what our next step is.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Rossner, participating in SRP has been a great experience and has given her an idea of what it is like to work in a STEM-related field. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“<\/span><span style=\"font-weight: 400;\">It's really given me a window into a world that I don't think I would have gotten to see until late into college,\" Rossner said. \"I never imagined myself doing anything related to STEM as a career, but working in a lab has made me really interested in both neuro research and just medicine in general.\" <\/span>\r\n\r\n<span style=\"font-weight: 400;\">To sign up for SRP, students should sign up for the course on Infinite Campus, and turn in <a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Application_Form_Science_Proj_12.doc\">this<\/a> form to Geller by the end of March. To sign up for AAR, register on <\/span><span style=\"font-weight: 400;\">Infinite Campus and fill out a letter of intent at <\/span><a href=\"https:\/\/aar.pausd.org\/user\/register\"><span style=\"font-weight: 400;\">this<\/span><\/a><span style=\"font-weight: 400;\"> web page by mid March.<\/span>\r\n\r\n<em>Editor's Note: AAR is an 8th period class and a student wanting to take the class must fill out a letter of intent by mid-March, not the block of time or sign-up procedure that was previously stated.<\/em>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","excerpt":"Palo Alto High School is offering two research courses next year, Advanced Authentic Research—currently in its pilot year—and long-running Science Research Project, which have a few key differences that students should take note of when signing up for courses next year.","date":"2016-02-20 18:51:28","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/lastone.jpg","categories":["Features"],"tags":["aar","advanced","advanced authentic research","america","authentic","business","cuba","david wilner","geller","history","junior","liu","may","mentors","patwardhan","project","research","science","srp","timothy","tutorial"]},{"id":116552,"title":"Wrestling optimistic for CCS","permalink":"http:\/\/palyvoice.com\/2016\/02\/18\/wrestling-optimistic-for-ccs\/","content":"[caption id=\"attachment_116559\" align=\"alignnone\" width=\"595\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Screenshot-2016-02-18-at-8.50.58-AM.png\"><img class=\" wp-image-116559\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Screenshot-2016-02-18-at-8.50.58-AM.png\" alt=\"Members of the Palo Alto [[\" width=\"595\" height=\"407\" \/><\/a> Members of the Palo Alto wrestling team pose after competing at the Santa Clara Valley Athletic League Championships last weekend. The team placed sixth at the SCVAL tournament and will be dropping to the El Camino division next season. Five varsity wrestlers will continue their seasons and attend the Central Coast Section finals on Friday. Photo: Jonathan Kessler.[\/caption]The Palo Alto High School wrestling team (0-6) will send five members to the Central Coast Section finals this weekend at Independence High School.\r\n\r\nThe five wrestlers going to CCS are freshmen Andrew Wang, Kevin Giffen and Masako Perez, sophomore Aishah Maas and junior Sara Aguilar, according to head coach Jonathan Kessler.\r\n\r\n\"[Sophomore] Calvin Grewel is the first alternate at 120 pounds,\" Kessler said. \"If [junior] Seth Goyal is healthy enough to wrestle, he will represent Paly at CCS and be a top seed.\"\r\n\r\nDespite having a young varsity team and season-ending injuries, Kessler said that the team expects one wrestler to qualify to the California Interscholastic Federation State Championships. To qualify for states, wrestlers need to place in the top three.\r\n\r\n\"Returning CCS champion [junior] Sara Aguilar is excited to have the chance to get back on the top of the podium and return to the CIF state tournament,\" Kessler said.\r\n\r\nAccording to Aguilar, the team is training hard to prepare for CCS.\r\n\r\n\"This season the team and I really focused on strength training and technique,\" Aguilar said. \"The intensity in the room is much greater than before, with more live sparring and intensive drilling.\"\r\n\r\nThe team will participate in the first day of CCS finals on Friday at Independence High School.","excerpt":"The Palo Alto High School wrestling team will send three members to the Central Coast Section finals this weekend at Independence High School.\r\n","date":"2016-02-18 10:56:52","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Screenshot-2016-02-18-at-8.50.58-AM.png","categories":["Sports"],"tags":["aguilar","andrew","CCS","giffen","jonathan","kessler","kevin","palo alto high school","paly","sara","Wang","wrestling"]},{"id":116130,"title":"School Board forms committee to explore renaming schools","permalink":"http:\/\/palyvoice.com\/2016\/02\/17\/school-board-forms-committee-to-explore-renaming-schools\/","content":"[caption id=\"attachment_116330\" align=\"aligncenter\" width=\"583\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMAG0444.jpg\"><img class=\"wp-image-116330\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMAG0444.jpg\" alt=\"IMAG0444\" width=\"583\" height=\"437\" \/><\/a> Palo Alto Unified School District Board of Educations members voice their thoughts on the movement to form a committee to research new school names. \"I think the case has been made that we should have a committee that looks at a range of viewpoints and historical perspectives,” School Board Member Camille Townsend said. “As we can see this is a much bigger issue than just this room, it’s a topic that affects our whole community.”[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto Unified School District Board of Education is forming a citizens advisory committee to research and consider if a name change is necessary for any PAUSD school after a unanimous vote Feb. 9 during a board meeting. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The advisory committee will research fiscal, cultural and practical complications of changing school names with a focus that is largely on but not limited to <a href=\"http:\/\/palyvoice.com\/2016\/01\/23\/plan-to-rename-jordan-takes-next-step-forward\/\">renaming David Starr Jordan Middle School<\/a>, based on Jordan's history as a eugenicist, or person who believe in the improvement of the gene pool, according to Supt. Max McGee.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">During the meeting, board member Camille Townsend made sure to note people should take into account that 100 years ago, Jordan's ideas weren’t so radical. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I think the case has been made that we should have a committee that looks at a range of viewpoints and historical perspectives,” Townsend said. “As we can see this is a much bigger issue than just this room, it’s a topic that affects our whole community.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Board Member Melissa Caswell also voiced her support for the formation of the committee.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I was just thinking what it must feel like to walk into a place every day and know you don’t feel welcome,\" Caswell said. \"And it's our job to make sure all of our students feel welcome.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The vote was conducted after over a dozen Social Justice Pathway students from Palo Alto High School spoke, solidifying many of the community member's arguments voiced in previous meetings. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Junior Mariah Poitier, Paly's social justice and school climate commissioner, gave an impassioned speech about her experience as a minority who walked through the halls of Jordan. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It's been hard going to this school in this district and knowing that people support someone who, given the opportunity, would have sterilized me and called me stupid,” Poitier said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The committee findings are due by Dec. 31 and will be presented soon after, according to McGee.<\/span>","excerpt":"The Palo Alto Unified School District Board of Education is forming a citizens advisory committee to research and consider if a name change is necessary for any PAUSD school after a unanimous vote last Feb. 9 during a board meeting.\r\n","date":"2016-02-17 10:45:06","author":"Sherwin Amsbaugh","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMAG0444.jpg","categories":["News"],"tags":["Camille Townsend","David Starr Jordan","erin angell","Jordan Middle School","mariah poitier","Melissa Caswell","palo alto school board","Palo Alto Unified School Board of Education","PAUSD","social justice"]},{"id":116525,"title":"Admin investigates Franco mural vandalism","permalink":"http:\/\/palyvoice.com\/2016\/02\/16\/admin-investigates-franco-mural-vandalism\/","content":"[caption id=\"attachment_116533\" align=\"alignnone\" width=\"594\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/FullSizeRender.jpg\"><img class=\"wp-image-116533\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/FullSizeRender.jpg\" alt=\"james franco mural graffiti\" width=\"594\" height=\"455\" \/><\/a> Sophomores Chloe Hong and Julia Qiao ate beside a mural painted on the Student Center wall today during lunch. Administration discovered the words, \"How do you vandalize garbage?\" after school today and are taking prompt action to remove it. Photo by Adrienne Kwok.[\/caption]\r\n\r\nThe Palo Alto High School administration is looking to investigate damages done to a mural painted by Paly alumnus and actor James Franco as of Feb. 16.\r\n\r\nStudents and staff were greeted after the President’s Day weekend with red, spray-painted letters graffitied onto one of two murals Franco had painted last year on the Student Center. The words, “How do you vandalize garbage?” covered his painting depicting student football players.\r\n\r\n<span style=\"line-height: 1.5;\">According to Assistant Principal Jerry Berkson, the district is searching for a method to remove the red paint without affecting the original work.<\/span>\r\n\r\n“I have to see if the district can fix it, remove that painting without removing the real painting,” Berkson said.\r\n\r\nAccording to Berkson, identifying those responsible was made harder due to the extended weekend.\r\n\r\n“The problem is catching someone,” Berkson said. “Since we noticed it today, it was probably done over a four [five] day weekend. But we’re on it.”\r\n\r\n[caption id=\"attachment_116530\" align=\"alignright\" width=\"332\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/franco6.jpg\"><img class=\"wp-image-116530\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/franco6.jpg\" alt=\"james franco mural graffiti\" width=\"332\" height=\"254\" \/><\/a> Students observed as one of James Franco's murals was painted in fall 2014. Photo by Adrienne Kwok.[\/caption]\r\n\r\nVandalism can result in a variety of consequences.\r\n\r\n“It could go anywhere from a legal matter [such as] bringing in the police to community service to suspension,” Berkson said.\r\n\r\nBefore the break, the administration <a href=\"http:\/\/palyvoice.com\/2016\/02\/11\/admin-removes-james-franco-mural-from-student-center\/\">painted over the mural<\/a> displaying students reading Paly’s newspaper, The Campanile. In addition to the murals, Franco, a graduate of 1996, has also donated multiple other paintings that are currently on display around campus.\r\n<div class=\"_5wd4 _1nc7 direction_ltr\">\r\n<div class=\"_5wd9\">\r\n<div class=\"_5wde _n4o\">\r\n<div class=\"_5w1r _3_om _5wdf\">\r\n<div class=\"_4gx_\">\r\n<div class=\"_d97\">\r\n\r\n<span class=\"_5yl5\">Some students responded by expressing their disapproval of the graffiti.<\/span>\r\n<div class=\"_5wd4 _1nc7 direction_ltr _2cnu\">\r\n\r\n“Even if you disapprove or dislike someone’s work, you’re still not entitled to vandalize it,” sophomore Adeline Zhou said. “Honestly it’s pretty disrespectful to Franco. I know I would be hurt if someone trashed my work.”\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","excerpt":"The Palo Alto High School administration is looking to investigate damages done to James Franco’s mural on the Student Center as of Feb. 16.","date":"2016-02-16 22:12:38","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/FullSizeRender.jpg","categories":["News","Spotlight"],"tags":["admin","art","center","football","franco","graffiti","james","mural","paly","student","vandalized"]}]