[{"id":125105,"title":"Editorial: The Paly Voice endorses Collins, Caswell and DiBrienza","permalink":"http:\/\/palyvoice.com\/2016\/10\/27\/editorial-the-paly-voice-endorses-collins-caswell-and-dibrienza\/","content":"<span style=\"font-weight: 400;\">With the upcoming election, three Palo Alto Unified School District Board of Education seats will be up for grabs. <\/span><a href=\"http:\/\/palyvoice.com\/2016\/09\/29\/school-board-candidates-vie-for-three-opening-seats\/\"><span style=\"font-weight: 400;\">Five candidates<\/span><\/a><span style=\"font-weight: 400;\"> have been competing for the opening positions, two of whom are incumbents Heidi Emberling and Melissa Baten Caswell; the newcomers include Todd Collins, Jay Blas Jacob Cabrera and Jennifer DiBrienza.<\/span>\r\n\r\nThe Paly Voice staff and editors took time to research and evaluate the various candidates and their positions on topics ranging from the homework policy to budget deficit and the conduct of teachers on campus. Additionally, members of staff spent time attending forums with all five candidates present and interviewing the incumbents on current issues.\r\n\r\n<span style=\"font-weight: 400;\">After much deliberation as a staff, The Paly Voice has decided to endorse Todd Collins, incumbent Melissa Baten Caswell and Jennifer DiBrienza. <\/span>\r\n<p style=\"text-align: left;\"><b>Todd Collins: The Fiscally Responsible Candidate<\/b><\/p>\r\n\r\n\r\n[caption id=\"attachment_122806\" align=\"alignleft\" width=\"272\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/DSC_6355-1.jpg\"><img class=\"wp-image-122806\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/DSC_6355-1.jpg\" alt=\"Todd Collins, a candidate for school board, referenced his experiences serving on various committees to voice his perspective. Photo: Zahra Muzaffar\" width=\"272\" height=\"384\" \/><\/a> Todd Collins, a candidate for school board, referenced his experiences serving on various committees to voice his perspective. Photo: Zahra Muzaffar[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Collins, a private investor, has spent time engaged with the board, but brings a new perspective that current conditions warrant. Over the years he has spent time <\/span><span style=\"font-weight: 400;\">involved in various school board committees such as the Citizens’ Oversight Committee of a school bond program and the school board’s <a href=\"http:\/\/palyvoice.com\/2015\/12\/07\/school-board-delays-vote-on-opening-new-secondary-school\/\">Enrollment Management Advisory Committee<\/a> over the 2015-16 school year.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Collins earns our support because of his continued vocal concerns regarding the <a href=\"http:\/\/palyvoice.com\/2016\/08\/28\/principal-no-need-to-panic-about-budget\/\">several <\/a><\/span><a href=\"http:\/\/palyvoice.com\/2016\/08\/28\/principal-no-need-to-panic-about-budget\/\"><span style=\"font-weight: 400;\">million dollar budget deficit<\/span><\/a><span style=\"font-weight: 400;\">. While other candidates have acknowledged the issue, he has been the only one to recognize that innovation is contingent upon the availability of funds. Collins supports new pathways and programs, but doesn’t consider them to be feasible given current financial conditions. Collins not only has the financial background, but is an asset because of his attention to detail and exposure to the board's past finances via various committees.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Additionally, in keeping with his recommendations following his time on EMAC, Collins concurs with The Paly Voice staff in <\/span><a href=\"http:\/\/palyvoice.com\/2016\/01\/25\/editorial-explore-other-avenues-to-counter-overcrowding\/\"><span style=\"font-weight: 400;\">standing against<\/span><\/a><span style=\"font-weight: 400;\"> the creation of new schools within the district due to declining enrollment in elementary schools the past few years.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Collins persistently emphasizes the need for data-driven decision making, whether it be concerning the homework policy or the continuation of the current teacher evaluation system.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Collins values resiliency, an integral part of the learning process, and wants to see PAUSD students “experience and overcome failure.\"<\/span>\r\n\r\n<b>Melissa Baten Caswell: The Experienced Incumbent<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Caswell will be completing her second term, and while outside of the norm, electing her to a third this coming November will benefit the Palo Alto community because of her extensive knowledge regarding administrative procedures. <\/span><span style=\"font-weight: 400;\">She has previously served as board president and has experience serving on various school specific Parent Teacher Association councils.<\/span>\r\n\r\n[caption id=\"attachment_122810\" align=\"alignright\" width=\"302\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/DSC_6360-1.jpg\"><img class=\" wp-image-122810\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/DSC_6360-1.jpg\" alt=\"Melissa Baten Caswell, who has completed two terms on the school board, acknowledged areas of improvement and strengths of the current school board. Photo: Zahra Muzaffar\" width=\"302\" height=\"328\" \/><\/a> Melissa Baten Caswell, who has completed two terms on the school board, acknowledged areas of improvement and strengths of the current school board. Photo: Zahra Muzaffar[\/caption]\r\n\r\nCaswell is one of few current members to strongly support student voice, recognizing that the zero period controversy at Gunn High School was a top-down decision.\r\n\r\n<span style=\"font-weight: 400;\">Caswell’s focus on garnering the creativity within our teachers and providing ample resources and time to allow them to innovate within the classroom resonates with The Paly Voice. As students we benefit from inventive programs, many of which have been implemented during her time on the board. Flipped classrooms, blended learning and programs such as Social Justice and Advanced Authentic Research allow for individualized learning experiences, enhancing our development as 21st century learners.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Caswell displays some of the best features of the current board. She not only recognizes its shortcomings, but actively works to provide efficient solutions.  During school board forums she has addressed that the mission of the district is to educate its students and that the \"quality of the teachers preempts everything.\" A pragmatic decision maker, Caswell advocates for an improved system of mental health services while acknowledging<\/span> the district’s limitations.\r\n\r\nIncumbents, including Caswell, have been criticized for their lack of transparency and mismanagement in regards to finances and dealing with the Office of Civil Rights over the past few years. However, Caswell has remained consistent in her stances and takes the time to deliberate before outlining her position. Although she voiced her <a href=\"http:\/\/palyvoice.com\/2016\/05\/26\/board-approves-raise-for-teachers\/\">support for the teacher pay raise<\/a>, Caswell is in favor of aggressive measures to reduce the deficit.\r\n\r\n<b>Jennifer DiBrienza: The Needed Educator<\/b>\r\n\r\n[caption id=\"attachment_122799\" align=\"alignleft\" width=\"263\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/DSC_6351-1.jpg\"><img class=\" wp-image-122799\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/DSC_6351-1.jpg\" alt=\"Jennifer Dibrienza relied on her experiences as a Educational Consultant to provide explanations for her various stances. Photo: Zahra Muzaffar\" width=\"263\" height=\"302\" \/><\/a> Jennifer Dibrienza relied on her experiences as an Educational Consultant to provide explanations for her various stances. Photo: Zahra Muzaffar[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">DiBrienza, a teacher and staff developer for primary schools, embodies the necessary background for a seat on the school board. <\/span><span style=\"font-weight: 400;\">Previously, DiBrienza was an educational consultant and has served on Ohlone Elementary School’s site council.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">While the achievement gap and inequity in education have recently become synonymous with PAUSD, DiBrienza was one of few to continuously reference the importance of equitable access to the choices available at our schools.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">DiBrienza’s experience within the classroom will provide an integral perspective that the school board has been lacking. Hopefully, she will help the board as a whole to recognize how each decision truly impacts the experience of a student.<\/span>\r\n\r\n<strong>Acknowledging the Competition<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">Cabrera and Emberling have put up valiant efforts and their desire to aid the district’s students should be recognized. Cabrera offers the grass-roots perspective and should be applauded for his campaign based entirely upon small donations. He offers bold ideas that would add value to innovations within any district. Similarly, Emberling’s efforts over the past years have not been forgotten. Her emphasis on the best practices for each individual school is worth noting.<\/span>\r\n\r\nCabrera, despite his ingenuity, has drawbacks; he has focused his efforts on emphasizing his personal beliefs against the current system of politics reliant upon money. He strays away from providing adequate solutions to the specific problems faced by our community.\r\n\r\nEmberling, despite her time on the board, does not have a consistent stance on issues that we feel are pertinent. She has contributed to the ambiguous statements that prevent the current board from efficiently making decisions.\r\n\r\nWhile many of us as minors cannot express our support via an actual vote, our hope is to garner support for those who we believe will serve our best interests as students and community members. Their actions and decisions will outlive our legacies as Palo Alto High School students, but the election of Collins, Caswell and DiBrienza will ensure the best experience for future PAUSD students.","excerpt":"After much deliberation as a staff, The Paly Voice has decided to endorse Todd Collins, incumbent Melissa Baten Caswell and Jennifer DiBrienza. ","date":"2016-10-27 21:17:42","author":"The Paly Voice","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/schoolboard051016.jpg","categories":["Editorial","Election 2016","Opinion","Opinion Editor's Pick","Spotlight"],"tags":["2016","2016 election","Baten Caswell","collins","DiBirenza","elect","election","melissa","opening","PAUSD","School Board","seats","todd","vote"]},{"id":125051,"title":"Spirit Week 2016 in review","permalink":"http:\/\/palyvoice.com\/2016\/10\/27\/spirit-week-2016-in-review\/","content":"Spirit Week at Palo Alto High School is nothing short of spectacular. From thunderous rallies that can be heard from Stanford University, to awe-inspiring floats put together in a short week's time, each year brings something new and exciting to the famous tradition. With outrageous outfits and tight competitions, Spirit Week is regarded by many students as their favorite week of the school year. The Paly Voice takes a look at what made Spirit Week 2016 so memorable.\r\n\r\n<iframe src=\"https:\/\/cdn.knightlab.com\/libs\/timeline3\/latest\/embed\/index.html?source=1Ox71NOoGxroDm0MNZ9P4UyeOlBJ3pdDolM1hBEcLn6A&amp;font=Default&amp;lang=en&amp;initial_zoom=2&amp;height=750\" width=\"125%\" height=\"750\" frameborder=\"0\"><\/iframe>","excerpt":"Spirit Week at Palo Alto High School is nothing short of spectacular. The Paly Voice takes a look at what made Spirit Week 2016 so memorable.","date":"2016-10-27 08:29:35","author":"Maya Reuven","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/DSC_0107-1.jpg","categories":["Spirit Week 2016","Spotlight"],"tags":["review","Spirit Week","spirit week 2016","timeline"]},{"id":124954,"title":"Spirit Dances 2016","permalink":"http:\/\/palyvoice.com\/2016\/10\/23\/spirit-dances-2016\/","content":"Palo Alto High School Spirit Week came to a close with the after school rally on Friday. Per Paly tradition, the rally featured a Float and Spirit Dance from each grade. Additionally, several teachers performed an encore to the annual Teacher Spirit Dance.\r\n\r\nClick on the link to view the full dances and photos of each float.\r\n\r\n<iframe style=\"border: none;\" src=\"https:\/\/social.shorthand.com\/thepalyvoice\/embed\/jgdHli1J1T\" width=\"100%\" height=\"500px\"><\/iframe>","excerpt":"Palo Alto High School Spirit Week came to a close with the after school rally on Friday. Per Paly tradition, the rally featured a Float and Spirit Dance from each grade. Additionally, several teachers performed an encore to the annual Teacher Spirit Dance.","date":"2016-10-23 14:38:32","author":"Zahra Muzaffar","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/DSC_0440.jpg","categories":["Multimedia","Spirit Week 2016","Spotlight","Video"],"tags":["#palyspirit","2016","after school","afterschoolrally","dance","dances","day 5","float","float building","frehman","juniors","rally","seniors","Sophomores","spirit","spiritweek","themes","week"]},{"id":124751,"title":"Final Spirit Week score results","permalink":"http:\/\/palyvoice.com\/2016\/10\/23\/final-spirit-week-score-results\/","content":"On the <a href=\"http:\/\/palyvoice.com\/2016\/10\/22\/seniors-end-final-day-of-spirit-week-strong\/\" target=\"_blank\">final day of Spirit Week<\/a>, the underclassmen and juniors showed their Paly pride by dressing in green and white while the seniors wore camouflage gear. Spirit Week then finished off with the exhibition of each grade's dances and floats Friday after school.\r\n\r\nThe junior class claimed the victory in float in a senior upset. Despite placing second in float, the senior class finished 1st in dance and topped the overall rankings. After a strong dance performance, the sophomore class earned 2nd place, leaving them in 3rd overall. Finally, after a strong effort, the freshmen finished 4th overall.\r\n\r\n<iframe style=\"overflow-y: hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/17361475-spirit-week-2016-day-5\" width=\"800\" height=\"1896\" frameborder=\"0\" scrolling=\"no\"><\/iframe>\r\n\r\n&nbsp;","excerpt":"Despite a junior upset over the seniors on the float, the seniors were victorious overall. The juniors, sophomores and freshmen placed second, third and fourth, respectively.","date":"2016-10-23 13:51:01","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Spirit-Week-2016-Featured-Images1.png","categories":["Multimedia","Spirit Week 2016"],"tags":["2016","dance","final","final scores","float","freshmen","juniors","results","seniors","Sophomores","Spirit Week"]},{"id":124801,"title":"Football falls to Los Gatos in Homecoming game","permalink":"http:\/\/palyvoice.com\/2016\/10\/22\/football-falls-to-los-gatos-in-homecoming-game\/","content":"[caption id=\"attachment_124938\" align=\"alignnone\" width=\"750\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/los-altos-v-pa.jpg\"><img class=\"size-full wp-image-124938\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/los-altos-v-pa.jpg\" alt=\"Senior wide receiver Nick Smallwood prepares for the snap. Paly would go on to lose to Los Gatos 35-6. Photo: Jackson Doerr\" width=\"750\" height=\"499\" \/><\/a> Palo Alto High School senior wide receiver Nick Smallwood prepares for the snap. Paly would go on to lose to Los Gatos High School, 35-6 on Friday night at home. Photo: Jackson Doerr.[\/caption]\r\n\r\nThe Palo Alto High School Vikings football team (3-5, 2-2) is fighting for a spot in the De Anza league playoffs after losing its homecoming game against the Los Gatos Wildcats (4-3, 3-0), 35-6, last night on the Paly football field.\r\n\r\nThe game was an ordeal for the Vikings, who struggled to put the Wildcats' strong offense on hold, throughout the entirety of the game.\r\n\r\nJust five minutes into the game, the Wildcats broke through the Paly defense to score the first touchdown of the game. The rest of the first quarter was a scoreless standoff, and the ball did not leave Paly's half.\r\n\r\nIn the second quarter, Los Gatos gained 96 yards in ten plays over the course of two minutes and 12 seconds, and added another Wildcat touchdown to the scoreboard.\r\n\r\nOn the very next play, a player from each team was ejected for personal fouls, including Paly junior offensive lineman Bryant Jefferson.\r\n\r\nViking head coach Danny Sullivan said he disagrees with the call and he believes that the skirmish was not grounds for ejection of either player.\r\n\r\n\"It was just an overreaction to the play,\" Sullivan said. \"I was looking at it the whole time and I don't think anybody should have gotten ejected, including their kid.\"\r\n\r\nLos Gatos would go on to score twice in the 3rd and once in the 4th, bringing the score to 35-0. But with three minutes left in the game, Paly was able to get a touchdown, preventing the Wildcats from securing a shutout win.\r\n\r\nAccording to Sullivan, Paly struggled with performing smaller plays.\r\n\r\n\"We started moving the ball but we hit a wall,\" Sullivan said. \"Simple execution on little things is the difference between the two scores so we've got to get better at doing that.\"\r\n\r\nAccording to Sullivan, the Vikings will continue to focus on working the kinks out of their play.\r\n\r\n\"It's just doing the fine tuning that we really have to focus on,\" Sullivan said. \"We've gotten so much better over the course of the season and we're only going to keep getting better.\"\r\n\r\nSullivan said the season is far from over, and the Vikings are in competition for a spot in the playoffs.\r\n\r\n\"We're playing for a playoff spot in these next two weeks,\" Sullivan said. \"Next week is a bye week. We need to get a couple things neatened up and then it's off to Mountain View.\"\r\n\r\nAccording to Sullivan, the Week Nine bye is a blessing in disguise.\r\n\r\n\"We were looking at it and Week Nine looks like the worst time for a bye,\" Sullivan said. \"[However,] It comes at a perfect time because we need to jump back on the horse.\"\r\n\r\nThe Vikings will fight for a spot in the playoffs against the Mountain View High School Spartans (6-3, 3-2) at 7:00pm on Nov. 4 at Mountain View.","excerpt":"The Palo Alto High School Vikings football team (3-5, 2-2) are fighting for a spot in the De Anza league playoffs after losing their homecoming game against the Los Gatos Wildcats (4-3, 3-0) 35-6 last night on the Paly football field.","date":"2016-10-22 16:56:02","author":"William Sallomi","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/los-altos-v-pa.jpg","categories":["Football","Sports"],"tags":["danny sullivan","football","paul jackson iii","sports"]},{"id":124911,"title":"Video: Spirit Week Day 5 ends with dazzling performances","permalink":"http:\/\/palyvoice.com\/2016\/10\/22\/video-spirit-week-day-5-ends-with-dazzling-performances\/","content":"The Paly Voice documented the fifth and final day of Palo Alto High School's Spirit Week. \"Paly Spirit Day\" featured the exciting \"Hula Hoop\" race at the lunch rally, as well as the unveiling of class floats and class dance performances after school\r\n\r\nFinal scores for Spirit Week will be released today during the Homecoming dance at Gunn High School. Check The Paly Voice for more updates on Spirit Week 2016 under the new <a href=\"http:\/\/paly.io\/spiritweek16\" target=\"_blank\">Spirit Week tab<\/a>.\r\n\r\nhttps:\/\/www.youtube.com\/watch?v=2mTWglu122M&feature=youtu.be\r\n\r\n&nbsp;","excerpt":"The Paly Voice documented the fifth and final day of Palo Alto High School's Spirit Week. \"Paly Spirit Day\" featured the exciting \"Hula Hoop\" race at the lunch rally, as well as the unveiling of class floats and class dance performances after school","date":"2016-10-22 15:09:58","author":"Julia Qiao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Screen-Shot-2016-10-22-at-1.35.30-PM.png","categories":["Multimedia","Spirit Week 2016","Video"],"tags":["2016","day 5","paly","paly spirit week 2016","Spirit Week"]},{"id":124859,"title":"Seniors end final day of Spirit Week strong","permalink":"http:\/\/palyvoice.com\/2016\/10\/22\/seniors-end-final-day-of-spirit-week-strong\/","content":"<iframe src=\"https:\/\/docs.google.com\/presentation\/d\/1UUiFKcxomE6tZZ0IZIFTc8SkKQQfBwlz3BEhXVKkdTs\/embed?start=false&amp;loop=false&amp;delayms=5000\" width=\"650\" height=\"400\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\nPalo Alto High School students await the final results for Spirit Week 2016, after the last day featured both a lunch and after school rally.\r\n\r\nDuring this final day of Spirit Week, freshmen, sophomores and juniors all sported Paly colors and Viking gear while the seniors wore camouflage as part of a Paly tradition.\r\n\r\nToday's lunch rally featured the Hula Hoop Chain race, where participants stood in a line holding hands in an attempt to maneuver a hula hoop from one side of the line to the other.\r\n\r\nIn the first round, the seniors easily beat the freshman team, and the juniors triumphed over the sophomores. The final round between the two upperclassmen teams came down to the last second, but a last minute error from the juniors led to seniors to victory.\r\n\r\nJunior and Hula Hoop Chain participant Will Schmutz, though content with his team's overall performance, discussed what went wrong in the final round.\r\n\r\n“If we had better executed our game plan, we would have beaten the seniors,\" Schmutz said.\r\n\r\nThe lunch rally ended with teachers breaking it down with their own prepared spirit dance. During their dance, however, a <a href=\"http:\/\/palyvoice.com\/2016\/10\/21\/streaker-disrupts-friday-lunch-rally\/\">streaker<\/a> ran across the football field and escaped into a getaway car.\r\n\r\nPer Paly tradition, Spirit Week concluded with an after school rally, where each grade presented a float and a spirit dance.\r\n\r\nSenior Tanner Newell expressed his pride in both his float and his class.\r\n\r\n“It was a lot of hard work, but I'm proud of how my class pulled together and made this amazing float,” Newell said.\r\n\r\nWhile the final standings for the four floats are still to be determined, the senior class performed its winning dance during halftime of the <a href=\"http:\/\/palyvoice.com\/2016\/10\/21\/liveblog-homecoming-football-game-against-los-gatos\/\" target=\"_blank\">homecoming game<\/a>. The dance results for the remaining freshmen, sophomores and juniors have not yet been announced.\r\n\r\nAs of now, the current overall standings remain in grade order. The seniors are in lead with 10800 points, the juniors in second with 10050, followed by sophomores and freshmen with 9595 and 6595, respectively.\r\n\r\nFinal overall results and the winning class of Spirit Week 2016 will be announced tonight at the homecoming dance.","excerpt":"Palo Alto High School students await the final results for Spirit Week 2016, after the last day featured both a lunch and after school rally.","date":"2016-10-22 14:31:29","author":"Maya Reuven","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/14812839_593287490876233_1083444871_o.jpg","categories":["News","Spirit Week 2016","Spotlight"],"tags":["final rally","floats","newell","spirit dance","Spirit Week","spirit week 2016"]},{"id":124737,"title":"Spirit Week Day Four results","permalink":"http:\/\/palyvoice.com\/2016\/10\/21\/spirit-week-day-four-results-3\/","content":"With one more day of Spirit Week left remaining, the seniors are in the lead with 9,200 points and the juniors are in second place, 650 points behind. Despite scoring higher than the seniors in both the Pool Ring Toss and Name That Tune,  the sophomore class is still in third place, leaving the freshmen in last.\r\n\r\nThe theme for Day Four was \"Generations,\" and the senior class won best dressed for its senior citizen dress-up. Cheers remained a competition between the juniors and seniors, with the seniors emerging victorious.\r\n\r\nCheck back later today as The Paly Voice continues its coverage for the last day of Spirit Week.\r\n<div class=\"piktowrapper-embed\" style=\"height: 300px; position: relative;\">\r\n<div class=\"embed-loading-overlay\" style=\"width: 100%; height: 100%; position: absolute; text-align: center;\">\r\n\r\n<img style=\"margin-top: 100px;\" src=\"https:\/\/magic.piktochart.com\/loading.gif\" alt=\"Loading...\" width=\"60px\" \/>\r\n<p style=\"margin: 0; padding: 0; font-family: Lato, Helvetica, Arial, sans-serif; font-weight: 600; font-size: 16px;\">Loading...<\/p>\r\n\r\n<div class=\"pikto-canvas-wrap\">\r\n\r\n<script>\/\/ <![CDATA[\r\n(function(d){var js, id=\"pikto-embed-js\", ref=d.getElementsByTagName(\"script\")[0];if (d.getElementById(id)) { return;}js=d.createElement(\"script\"); js.id=id; js.async=true;js.src=\"https:\/\/magic.piktochart.com\/assets\/embedding\/embed.js\";ref.parentNode.insertBefore(js, ref);}(document));\r\n\/\/ ]]><\/script>\r\n\r\n\r\n\r\n","excerpt":"With one more day of Spirit Week left remaining, the seniors are in the lead with 9,200 points and the juniors are in second place, <a href=\"http:\/\/palyvoice.com\/2016\/10\/21\/spirit-week-day-four-results-3\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2016-10-21 18:16:20","author":"Maya Akkaraju","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/DSC_0105.jpg","categories":["Uncategorized"],"tags":[]},{"id":124786,"title":"Streaker disrupts Friday lunch rally","permalink":"http:\/\/palyvoice.com\/2016\/10\/21\/streaker-disrupts-friday-lunch-rally\/","content":"Amid the craze of the final lunch rally of Palo Alto High School’s Spirit Week, a student streaked across the football field during the teacher dance.\r\n\r\nThe student ran from the north side of the football field toward Churchill Avenue and hopped the fence. Assistant Principal Jerry Berkson, Assistant Principal Adam Paulsen and Campus Supervisor Scott Reese chased the streaker into the Southgate neighborhood.\r\n\r\n“The streaker came to the fence, had to make an adjustment because I was right there, made an adjustment, and took off down Castilleja,” Berkson said. “There was a getaway car waiting.”\r\n\r\nThe streaker was not caught in the act, but the administrators in pursuit wrote down the getaway car’s license plate number, according to Berkson.\r\n\r\n“We have to run the license plate,” Berkson said. “Whether we got it accurately [or not] is another story. We’ll go from there.”\r\n\r\nAccording to Student Activities Director Matt Hall, streaking is inadmissible.\r\n\r\n“It was regrettable,” Hall said. “I disagree with that type of behavior [streaking] during Spirit Week.”\r\n\r\nThe incident was distracting and detracted from the teacher dance, according to junior Spirit Commissioner Claire Billman.\r\n\r\n“It was unfortunate timing because it was the staff’s chance to show what they’ve been working so hard on, so it kind of took away from that,” Billman said.\r\n\r\nSome students, such as freshman Miranda Wiener, find streaking to be disruptive, especially considering the illegality of the act.\r\n\r\n“It’s really disturbing,” Wiener said. “It is counted as sexual harassment, so it’s really not a good thing to do, especially if people came out here to have a good time.\"\r\n\r\n&nbsp;","excerpt":"Amid the craze of the final lunch rally of Palo Alto High School’s Spirit Week, a student streaked across the football field during the teacher dance.","date":"2016-10-21 14:29:43","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/DSC_0123.jpg","categories":["News","Spirit Week 2016","Spotlight"],"tags":["Berkson","Billman","friday","hall","kamarei","lunch rally","paulsen","Spirit Week","spirit week 2016","streaker","streaking"]},{"id":124695,"title":"Committee to address bell schedule, C-days","permalink":"http:\/\/palyvoice.com\/2016\/10\/21\/committee-to-address-bell-schedule-c-days\/","content":"The Palo Alto High School administration is forming a new Bell Schedule Review Committee, which will consider changing the current bell schedule for the 2017-18 school year.\r\n\r\nAccording to Principal Kim Diorio, the administration created this committee to deal with the stress that goes along with C-days.\r\n\r\n\"On C-days there is no consistency,\" Diorio said. \"There is still this issue of test stacking and homework load and students say that block days are better because at least on a block day you only have a few classes.\"\r\n\r\nAccording to Diorio, the committee will consist of parents, students and teachers from different backgrounds in order to create a balanced decision-making process. In the coming days, Diorio will send out an email detailing the application process to be on the committee.\r\n\r\n“The email will have a quick application about the committee,\" Diorio said. \"We want to have students on the committee, about five to six parents, a staff member representing each department and maybe someone from the counseling department and one administrator so it will be fairly balanced. I also want a facilitator who will be neutral to help the process.”\r\n\r\n<span style=\"font-weight: 400;\">The idea for such a committee came about two years ago as a response to the <\/span><span style=\"font-weight: 400;\"><a href=\"http:\/\/www.paly.net\/sites\/default\/files\/PalyWASC1415_Feb23.pdf\">Western Association of Schools and Colleges Visiting Committee<\/a>’s recommendation to reevaluate the C-day bell schedule.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“<\/span><span style=\"font-weight: 400;\">We [Paly Admin] were doing a lot of surveys and focus groups and hearing from students about C-days and realizing that some things don't work for kids,” Diorio said. <\/span>\r\n\r\nPaly students are encouraged to fill out an application and apply to be a part of the committee. The <a href=\"https:\/\/docs.google.com\/forms\/d\/e\/1FAIpQLScY61XPGmUcwLAUeWHd9ZqVWODy3lC2Cn3aE_69FUi2H0dgPw\/viewform?c=0&amp;w=1\">application<\/a> is due by Oct. 31 and the committee will be selected by Nov. 4.\r\n\r\n\"We will choose applicants who can commit to dates and times,\" Diorio said. \"We want to make sure to represent different types of students to have a good cross representation.”","excerpt":"Palo Alto High School Administration is forming a new Bell Schedule Review Committee which will consider changing the current bell schedule.","date":"2016-10-21 13:40:25","author":"Aisha Chabane","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/12\/Screen-shot-2013-12-20-at-12.59.22-PM.png","categories":["News","Spotlight"],"tags":["c day","diorio","paly","schedule","WASC"]}]