[{"id":125385,"title":"Admin alters GPA weighting action","permalink":"http:\/\/palyvoice.com\/2016\/11\/04\/school-board-alters-gpa-weighting-action\/","content":"Palo Alto High School will not — at least not yet — be sending weighted grade point average’s to schools who seniors have submitted early applications, contrary to the Board of Education’s <a href=\"http:\/\/palyvoice.com\/2016\/11\/02\/board-votes-for-weighted-on-mid-year-transcripts-for-class-of-2017\/\">ruling on Tuesday<\/a> and the announcement given to seniors during Advisory on Thursday, according to a statement released by Principal Kim Diorio during 5th period on Schoology.\r\n\r\n<span style=\"font-weight: 400;\">According to Diorio’s statement, this change has come because of newly found, unspecified data that shows how many Paly students’ GPAs will decrease when weighted with the UC system compared to their unweighted GPAs. Administrators and members of the Board of Education Agenda Setting committee reviewed the information and have suggested that “we do need to return to the Board with a short-term recommendation for second semester transcripts,\" according to the statement on Schoology. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Diorio confirmed stating that there <\/span>\"will be no further action before the next Board of Education meeting.\"\r\n\r\n<span style=\"font-weight: 400;\">Despite stated, students will be given the option to send their weighted GPAs to schools to which they have submitted early applications. To do this, students must submit a <a href=\"https:\/\/docs.google.com\/forms\/d\/e\/1FAIpQLSdfgd9XwZzUSNIjZ4ecyeFSfZnfQ1NaG_HnhKgbJMZKir5Fsw\/viewform?c=0&amp;w=1\">google form<\/a>.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">--<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Diorio’s statement as is posted on Schoology:<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Good afternoon and TGIF! <\/span>\r\n\r\n<span style=\"font-weight: 400;\">I'm writing with <\/span><b>new information<\/b><span style=\"font-weight: 400;\"> regarding the Board of Education's vote earlier this week to report weighted CSU\/UC grades on our senior's mid-year transcripts. Please read this info carefully. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Yesterday afternoon, our district Department of Technology Services, led by Chief Technology Officer Derek Moore, was able to pull the data for the Paly class of 2017 to determine the exact number of students whose weighted CSU\/UC GPAs are lower than the cumulative unweighted GPA. The data were very compelling.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">After reviewing this new information, Superintendent Dr. McGee, Derek Moore, and I consulted with the Board of Education Agenda Setting committee and determined that we do need to return to the Board with a short-term recommendation for second semester transcripts. .  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">In an e-mail sent to the Board of Education last evening, here is what Superintendent Dr. McGee and I recommend instead:<\/span>\r\n\r\n<i><span style=\"font-weight: 400;\">\"We will not be sending WGPA transcripts to schools to which students applied for early decision or have already been admitted on a rolling basis unless the student fills out a written request that we do so. <\/span><\/i>\r\n\r\n<i><span style=\"font-weight: 400;\">...We are reconsidering the necessity for reporting both weighted and unweighted grades on second semester transcripts because we do not want to disadvantage any student's college application or scholarship opportunities and will report back to our students and families following the next Board meeting. <\/span><\/i>\r\n\r\n<i><span style=\"font-weight: 400;\">Prior to the next Board meeting, we will strive to have a staff recommendation for the short term that will assure the best possible outcomes for our students, assure we continue to have a credible relationship with our colleges and universities, and assure that we take into account all voices.\"<\/span><\/i>\r\n\r\n<span style=\"font-weight: 400;\">To reiterate, <\/span><b>we will be taking no further action before the next Board of Education meeting. <\/b><span style=\"font-weight: 400;\">However, if you have already submitted a college application and would like to send a revised transcript that contains the weighted CSU\/UC GPA to colleges before January 1, we will do so.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">To request for us to send a hard copy of your revised transcript, please complete <\/span><a href=\"https:\/\/goo.gl\/forms\/vosHIPazYfkudhHN2\"><span style=\"font-weight: 400;\">this google form<\/span><\/a><span style=\"font-weight: 400;\">. Keep in mind the deadline for us to send this information is<\/span><b>December 2nd<\/b><span style=\"font-weight: 400;\">, so please be sure to let us know before then. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Finally, I apologize for the confusion and any anxiety this week has caused and am grateful for your continued support and understanding as we work toward an optimal solution. We love our seniors and have confidence that in the end, things will work out. Remember, \"college is a match to be made, not a prize to be won.\"  In my time at Paly, I've seen over 4,000 seniors graduate from our school and \"find their match.\" I have faith that the class of 2017 will distinguish itself with amazing accomplishments beyond graduation too. I am so proud of our seniors. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">And boy, am I looking forward to an extra hour of sleep this weekend!  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Take care,<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Ms. D”<\/span>\r\n\r\n<em>Editor's note: Previously, the headline of this article suggested that the PAUSD School Board made the decision to revoke the motion they passed on Tuesday evening, to include unweighted and weighted GPAs on student transcripts. It was in fact Paly Principal Kim Diorio and PAUSD Supt. Max McGee who ultimately made the decision to hold off on sending students' weighted GPAs. The headline has been altered to reflect this.<\/em>","excerpt":"Palo Alto High School will not be sending weighted grade point average’s to schools to which seniors have submitted early applications, contrary to the Board of Education’s ruling on Tuesday and the announcement given to seniors during Advisory on Thursday, according to a statement released by Principal Kim Diorio during 5th period on Schoology.","date":"2016-11-04 15:39:27","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/IMG_5419.png","categories":["News","Spotlight"],"tags":["administration","Board of Education","college","college applications","diorio","drama","google form","gpa","max mcgee","McGee","palo alto high school","Palo Alto Unified School District","PAUSD","School Board","unweighted","weighted"]},{"id":125323,"title":"Editorial: The costs of a premature school board decision","permalink":"http:\/\/palyvoice.com\/2016\/11\/03\/editorial-the-costs-of-a-premature-school-board-decision\/","content":"A contentious debate has arisen in the Palo Alto Unified School District over the advantages and drawbacks of including weighted grade point averages on student transcripts for college applications. While administrators at both Palo Alto High School and Gunn High School have spoken in favor of adopting Supt. Max McGee’s proposed district-wide policy of reporting unweighted GPAs only, many students and parents have vehemently argued against it, on the grounds that such a policy disadvantages students for certain merit scholarships and represents an infringement on student freedom.\r\n\r\n<span style=\"font-weight: 400;\">On Tuesday night, the Board of Education <\/span><a href=\"http:\/\/palyvoice.com\/2016\/11\/02\/board-votes-for-weighted-on-mid-year-transcripts-for-class-of-2017\/\"><span style=\"font-weight: 400;\">passed a motion<\/span><\/a><span style=\"font-weight: 400;\"> to change the GPA reporting practice for the Class of 2017 at both Paly and Gunn - seniors who are currently in the midst of the college application process. For the mid-year report that will be sent to colleges, both the unweighted and weighted GPAs will be recorded on transcripts.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">At first glance, this may seem like a simple solution; reporting weighted GPAs eliminates any risk, however infinitesimal it may be, of a student being disadvantaged for scholarships. Additionally, weighted GPAs will emphasize the AP and honor classes that students take and supposedly give them the appropriate credit for challenging coursework. But what is ostensibly a straightforward solution will in reality open up a Pandora’s box of other issues, and we urge community members to critically consider the long term repercussions.<\/span>\r\n\r\n<b>Considering the consequences<\/b>\r\n\r\n<span style=\"font-weight: 400;\">To begin, the practice of reporting weighted GPAs will almost certainly reinforce the excessively competitive academic culture that has become associated with Palo Alto. Weighting GPAs will encourage people to take AP- and honors-heavy course loads, at the expense of regular lane and\/or elective classes. Furthermore, since Paly and Gunn offer far more weighted STEM classes than humanities and social science classes, the practice of reporting weighted GPAs in effect diminishes the value of non-STEM courses. And alarmingly, reporting weighted GPAs is just a step away from ranking students, either formally or in a de facto manner, because weighted GPAs make it far easier to delineate between students’ GPAs. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The programs that board members have touted as examples of educational innovation, such as Advanced Authentic Research, the Social Justice Pathway and the journalism program, as well as performing and visual arts classes, will likely see declining enrollment as a result of the GPA decision. When forced to compete with peers and choose between programs that will add to their overall high school experience or boost their GPA, many will choose the latter.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Additionally, the recording of weighted GPAs on transcripts could exacerbate another dogged problem in our district: the achievement gap. Only relatively wealthy students will be able to afford the outside tutoring for honors and AP courses, or off-campus instruction that allows them to accumulate more weighted credit, creating an even larger chasm between the privileged and the underserved in our community.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The concern about the practice of weighting GPAs harming our most vulnerable students isn’t a hypothetical one; it is very much grounded in anecdotal evidence. Because most weighted GPA methodologies do not take into account classes such as Living Skills and Physical Education, students who have earned high grades in those courses but have struggled in academic core classes may have lower weighted GPAs than unweighted GPAs. At the board meeting on Tuesday night, Paly Principal Kim Diorio reported that the administration has identified approximately 50 Paly students for whom this is the case. These students are disproportionately ethnic minorities, come from low-income families and have Individualized Education Programs. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Weighted GPAs also present a whole host of logistical issues and unnecessary confusion. For the updated reports that will be sent out to all schools students have applied to early, in addition to the mid-year reports that will be sent out for the Class of 2017, Paly will adopt the UC\/CSU methodology to calculate students' GPAs, while Gunn will be sticking with the algorithm it has been using for the past several years. Though board members claimed they prioritized standardizing practices between the two schools, their proposal doesn’t even address the problem: there is <\/span><i><span style=\"font-weight: 400;\">still<\/span><\/i><span style=\"font-weight: 400;\"> a disparity between Paly and Gunn. And if the schools were to continue weighting students’ grades, what weighting methodology would they employ? Would they use the UC system, which doesn’t consider many underclassmen honors classes for weighted credit and caps students to a maximum of eight semesters of weighted courses? Or would they devise another methodology, that would ultimately be arbitrary because colleges recalculate GPAs on their own? This is just a small sampling of the never-ending stream of questions that would arise.<\/span>\r\n\r\n<b>Dispelling fictions<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Though we are concerned about the effects of this decision on our school climate, we would like to emphasize that current seniors should not be concerned about the change in GPA reporting practices affecting their chances for college applications.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">College admissions officers across the nation will unequivocally say that your transcript is considered within the context of your high school, and obviously, a Paly student’s unweighted GPA is not being compared, from a purely numerical standpoint, with another applicant’s weighted GPA. At the most recent school board meeting, proponents of weighted GPAs presented evidence that seemed to show that students with weighted GPAs receive a boost in college admissions. But those sources are misleading, because information was selectively cherry-picked. And significantly, our college counseling professionals and various admissions officers have told us the complete opposite: they state that high schools' GPA reporting practices do not have bearing on students' chances for acceptance.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">In addresses to the school board, some people have mentioned the scholarship opportunities that students will be deprived of if the district does not report weighted GPAs. We strongly believe that the district should do everything in its capacity to help students procure financial aid. However, it is nonsensical to use merit scholarships as a justification for changing the GPA practice because administrators have yet to find a college that will not accept a letter vouching for a student's weighted GPA in place of it on a transcript. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">In the case of a Paly student missing the GPA cutoff for a merit scholarship at the University of Oregon because her unweighted GPA was reported, Kim Diorio contacted an admissions officer at Oregon and resolved the issue; the student is now eligible to receive the scholarship. According to Diorio, the admissions representative did not want Paly to change its GPA reporting policy for one student, and as such, Oregon has agreed to accept letters from Paly and Gunn administrators vouching for weighted GPAs.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Lastly, many in the pro-weighted GPA camp have said that reporting unweighted GPAs de-incentivizes students from challenging themselves academically. But this cannot be true, because many people at Paly and in general have taken difficult class loads knowing full well that only their unweighted GPAs will be reported to colleges. What reporting weighted GPAs could do, however, is compel students who aren’t prepared for or interested in the content of AP classes to take them, and further contribute to a hyper-competitive academic atmosphere.<\/span>\r\n\r\n<b>Moving forward<\/b>\r\n\r\n<span style=\"font-weight: 400;\">The choice to report weighted GPAs is a drastic one, and likely irrevocable; we believe it will be near impossible to revert to the old system if the district elects to formally adopt reporting weighted GPAs.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Perhaps the most appalling part about this decision is that students and parents were assured in writing that nothing would change for this college admissions cycle, and the school board, in unanimously voting to put weighted GPAs on our transcripts, has completely walked back on that promise. <\/span><span style=\"font-weight: 400;\">A letter sent out to parents by the Parent Teacher Student Association on Oct. 13 stated, “As parents, we ask that you please share with your teen that for this school year, nothing will change. Anything about the issue will not affect the Class of 2017.” Supt. McGee expressed similar sentiments in his weekly message published on Oct. 28, stating “<\/span><span style=\"font-weight: 400;\">For this year we are not recommending changing the current practices for grade reporting at either Gunn or Paly.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Suffice to say, <\/span><span style=\"font-weight: 400;\">w<\/span><span style=\"font-weight: 400;\">e are deeply disappointed with the board members — who have run on platforms of promoting student wellbeing — for ignoring the recommendations of professional educators and proceeding with a motion that has the potential to increase stress among the student body. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The extremely abrupt school board decision also failed to follow previously established norms of evaluating both sides of the issue prior to making tangible changes. In the past, PAUSD has spent months forming committees, fostering discussion and reviewing board reports when making a decision affecting students. It is shocking that the board did not follow the same procedure in considering the GPA issue — what should have been a thoughtful and comprehensive evidence-gathering process became a rushed political maneuver to satiate the demands of an aggressive lobby.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">But while this hasty short-term proposal has been agreed on for this year's senior class, it is not too late for the district to reevaluate this decision and thoroughly examine the consequences that this will have on the culture of Palo Alto high schools for years to come.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">We’ve worked so hard, for so long, to fundamentally address the issue of student stress across Palo Alto schools. We take great pride in our community but far too many of us have felt the effects of a suffocatingly competitive environment that overemphasizes academic achievement and contributes to a reduced sense of self-worth. The practice of r<\/span>eporting weighted GPAs is a multifaceted issue that has the potential to affect our school culture — and it certainly deserves more than the cursory consideration it received.\r\n\r\n<i>Editor's Note: To avoid a conflict of interest with his involvement in this issue, The Paly Voice's adviser disengaged himself from the writing of this editorial. He has not participated in class discussions about the editorial nor seen any drafts prior to publishing<\/i>","excerpt":"Though the hasty short-term proposal to report students' weighted and unweighted GPAs has been agreed on for this year's senior class, it is not too late for the district to reevaluate this decision and thoroughly examine the consequences that this will have on the culture of Palo Alto high schools for years to come.","date":"2016-11-03 22:41:20","author":"The Paly Voice","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0979.jpg","categories":["Editorial","Opinion","Opinion Editor's Pick","Spotlight"],"tags":["gpa","gunn","paly","PAUSD","School Board","unweighted","weighted"]},{"id":125300,"title":"Petition urges board to reconsider GPA decision","permalink":"http:\/\/palyvoice.com\/2016\/11\/03\/petition-circulating-to-reconsider-board-decision\/","content":"A student-led <a href=\"https:\/\/www.change.org\/p\/students-and-community-members-against-reporting-weighted-gpas-for-the-2016-2017-cycle?source_location=topic_page\" target=\"_blank\">petition<\/a> asking the Palo Alto Unified School District Board of Education to revisit its decision to include weighted grade point averages (GPA) on midyear transcripts for the Palo Alto High School Class of 2017 is making its rounds on social media this afternoon after the board meeting Tuesday night.\r\n\r\nAccording to the petition, weighted GPAs create a competitive culture counter to the district's supposed goals. The petition also cites the higher number of science, technology, engineering and mathematics Advanced Placement courses compared to ones focused on the humanities.\r\n\r\n\"There are so many cultural benefits to unweighted GPAs and I was really surprised by the school board's decision,\" senior Joelle Dong said.\r\n\r\nThe decision came as a surprise to many, especially after an email from the Parent Teacher Student Association claiming no board decision would affect the graduating class.\r\n\r\n\"As parents, we ask that you please share with your teen that for this school year, nothing will change,\" stated the email send on Oct. 13. \"Anything about this issue will not affect the Class of 2017.\"\r\n\r\nStudents from Gunn High School previously created a <a href=\"https:\/\/www.change.org\/p\/palo-alto-school-board-members-and-superintendent-petition-pausd-students-for-keeping-weighted-gpa\" target=\"_blank\">petition<\/a> to advocate for weighted GPA before the debate at the school board meeting, garnering a significant amount of signatures.\r\n\r\nStudents in favor of weighted GPA say that it compensates for the elevated work load and difficulty level that AP courses require.\r\n\r\n\"There's no doubt that weighted grades are a controversial issue, and much thought and debate should go into deciding WGPA's role at PAUSD in the longterm,\" Associated Student Body Board Representative David Tayeri said.","excerpt":"A student-led petition is making its rounds on social media this afternoon after the Palo Alto Unified School District Board of Education made a decision Tuesday night to add weighted GPA's onto current senior's midyear transcripts. \r\n","date":"2016-11-03 17:10:21","author":"Maya Reuven","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/DSC_0023.jpg","categories":["News","Spotlight"],"tags":["advanced placement","David Tayeri","gpa","joelle dong","palo alto school board","PTSA","School Board","WGPA"]},{"id":125256,"title":"Verbatim: Students weigh in on combined homecoming dance","permalink":"http:\/\/palyvoice.com\/2016\/11\/02\/verbatim-students-weigh-in-on-combined-homecoming-dance\/","content":"Palo Alto High School recently held its first-ever joint homecoming dance with Gunn High School. The Paly Voice asked students what their thoughts were about this event.\r\n\r\n<img class=\"alwaysThinglink\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/850045450458234880\/1024\/10\/scaletowidth#tl-850045450458234880;1043138249'\" alt=\"\" \/>\r\n\r\n&nbsp;\r\n\r\n<script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script>","excerpt":"Palo Alto High School recently held its first ever joint homecoming dance with Gunn High School. The Paly Voice asked students what their thoughts were about this event.","date":"2016-11-02 19:58:54","author":"Katie Cox","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/Screen-Shot-2016-11-01-at-7.12.24-PM.png","categories":["Multimedia","Verbatims"],"tags":["2016","gunn","homecoming","opinions","paly","verbatim"]},{"id":125280,"title":"Board votes for weighted GPAs on mid-year reports for Class of 2017","permalink":"http:\/\/palyvoice.com\/2016\/11\/02\/board-votes-for-weighted-on-mid-year-transcripts-for-class-of-2017\/","content":"[caption id=\"attachment_125289\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/DSC_0001.jpg\"><img class=\" wp-image-125289\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/DSC_0001.jpg\" alt=\"The school board makes preliminary recommendations before allowing community input on the weighted GPAs. The school board voted unanimously to move towards a weighted GPA on mid year transcripts. Photo : Sid Sharma\" width=\"600\" height=\"400\" \/><\/a> Palo Alto Unified School District Supt. Max McGee makes preliminary recommendations before allowing community input on the topic of weighted GPAs. The school board voted unanimously to move to include a weighted GPA on mid-year transcripts, starting in January for the Class of 2017, with further discussion pending for a longer term policy. Photo: Sid Sharma[\/caption]\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">Before a packed and impassioned audience, the Palo Alto Unified School District Board of Education during a lengthy meeting last night voted unanimously to include both weighted Grade Point Averages on mid-year reports to be sent to colleges for the current senior class.<\/span><\/p>\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">Already-uploaded transcripts will not be amended to include the weighted GPA, but if students need accommodations before the mid-year transcript, the board directed staff at the high schools “to do their best to accommodate those students.”<\/span><\/p>\r\n<p style=\"text-align: left;\">The board members left unresolved whether they would give students the option to choose between weighted and unweighted GPAs or to include both automatically.<\/p>\r\n<p style=\"text-align: left;\">There are several weighted GPA options currently being considered. Paly Principal Kim Diorio clearly supports only including unweighted GPAs, but forced to choose, she recommended including the UC-weighted GPA.<\/p>\r\n<p style=\"text-align: left;\">Diorio also said that she knows that at least 50 students will be negatively affected by this decision. Those students, according to Diorio, tend to be low-income, historically underrepresented, and students with Individual Education Programs.<\/p>\r\n<p style=\"text-align: left;\">The decision came less than an hour before the Early Decision deadline for college applications, effectively changing how students are assessed for all high school classes they have already completed.<\/p>\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">Last night's debate revolved mainly around the issue of reporting weighted versus unweighted GPAs on transcripts for students. <\/span><span style=\"font-weight: 400;\">This topic recently arose due to a Palo Alto High School senior voicing concerns about the disparities between how Gunn High School and Paly report GPAs.<\/span><\/p>\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\"> The student, Maya Katz, asserted that because Paly does not currently report weighted GPAs, she is disadvantaged for certain merit scholarships that consider GPA as the primary criteria, most notably scholarships at the University of Oregon. The current practice at Paly is that, if a student would benefit in the scholarship consideration process from having his or her weighted GPA reported, the Guidance Office will contact the specific universities and vouch for the student's weighted GPA.<\/span><\/p>\r\n<p style=\"text-align: left;\">The board essentially overruled a more tempered proposal from Supt. Max McGee that called for a committee to explore the implications of a weighted GPA.<\/p>\r\n\r\n\r\n[caption id=\"attachment_125291\" align=\"alignleft\" width=\"323\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/DSC_0023.jpg\"><img class=\" wp-image-125291\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/DSC_0023.jpg\" alt=\"Palo Alto High School senior Maya Katz speaks out in support of having a weighted GPA reported on transcripts. Katz is one of the most vocal students in support of weighted GPAs. Photo: Sid Sharma \" width=\"323\" height=\"215\" \/><\/a> Palo Alto High School senior Maya Katz speaks out in support of having a weighted GPA reported on transcripts. Katz is one of the most vocal students in support of weighted GPAs. Photo: Sid Sharma[\/caption]\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">Gunn currently reports weighted GPAs in the Common Application — but not on transcripts — and contacts specific colleges if necessary, as Paly does.<\/span><\/p>\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">The school board meeting, which was extended until 11:30 p.m. to focus more deeply on this issue, featured 35 speakers, the majority of whom were parents, although three students did speak. The speakers voiced unanimous support for reporting weighted GPAs.<\/span><\/p>\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">Katz, who spoke at the meeting, said she believes that the problem stems from students not being fully informed about how the GPAs are reported. <\/span><\/p>\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">“I just feel that other students don’t necessarily have the information that they needed,” Katz said.  “There’s a lot of things that the teachers are saying, that the admin is saying. There is just so much information. It’s all so complicated, and I just don’t know why it should be that complicated, but it is. I don't think students have access to the right sources, from the right people.\"<\/span><\/p>\r\n\r\n\r\n[caption id=\"attachment_125287\" align=\"alignright\" width=\"238\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/DSC_00731.jpg\"><img class=\" wp-image-125287\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/DSC_00731.jpg\" alt=\"Terry Godfrey expressed the strongest reservations about the current plan. She ended up voting yes on the final proposition. Photo by Sid Sharma.\" width=\"238\" height=\"158\" \/><\/a> Board member Terry Godfrey expressed the strongest reservations about the current plan. She ended up voting yes on the final proposition. Photo: Sid Sharma.[\/caption]\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">A <\/span><a href=\"https:\/\/www.change.org\/p\/palo-alto-school-board-members-and-superintendent-petition-pausd-students-for-keeping-weighted-gpa\"><span style=\"font-weight: 400;\">petition<\/span><\/a><span style=\"font-weight: 400;\"> to move towards reporting weighted GPAs that has been circulating among the Palo Alto community reached 430 signatures as of Wednesday morning.<\/span><\/p>\r\n<p style=\"text-align: left;\">A dissenting petition by tenured Paly teachers has reached 68 signatures. There are only 100 tenured teachers on the campus.<\/p>\r\n<p style=\"text-align: left;\">Part of the rushed decision-making hinged on school board candidate Todd Collins' impassioned denunciation of the slower committee approach supported by McGee. Collins voiced strong support for reporting weighted GPAs on transcripts.<\/p>\r\n<p style=\"text-align: left;\">School Board member Terry Godfrey, who has a senior at Paly, tearfully expressed reservations about the decision regarding weighted GPAs.<\/p>\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">“I want to be sure the voices of the students who aren’t comfortable coming to the board to speak are included,” Godfrey said. “If changing the way we report GPAs is going to change behaviors we should know what those changes are and make a conscious decision.”<\/span><\/p>\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">The board agreed to hash out the details of a long-term solution at a later point. <\/span><span style=\"font-weight: 400;\">More details will be published soon. You can read the full board report <\/span><a href=\"https:\/\/www.pausd.org\/explore-pausd\/news\/board-report-nov-1-2016\"><span style=\"font-weight: 400;\">here<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/p>","excerpt":"Before a packed and impassioned audience, the Palo Alto Unified School District Board of Education during a lengthy meeting last night voted unanimously to include both weighted Grade Point Averages on mid-year reports to be sent to colleges for the current senior class.","date":"2016-11-02 13:58:18","author":"Jackson Doerr","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/DSC_0001.jpg","categories":["News","Schoolboard","Spotlight"],"tags":["gpas","gunn","maya katz","november 1st","paly","PAUSD","School Board","terry godfrey","unweighted","weighted"]},{"id":125235,"title":"Boys&#8217; water polo falls short in overtime championship thriller","permalink":"http:\/\/palyvoice.com\/2016\/11\/01\/boys-water-polo-falls-short-in-overtime-championship-thriller\/","content":"[caption id=\"attachment_125237\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/candid1.jpg\"><img class=\"size-full wp-image-125237\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/candid1.jpg\" alt=\"Senior field player Tommy Smale passes down the pool during the league championship against Gunn on Oct. 29 at Los Altos High School. Photo by Sam Lee\" width=\"600\" height=\"527\" \/><\/a> Senior field player Tommy Smale passes down the pool during the league championship against Gunn on Oct. 29 at Los Altos High School. Photo by Sam Lee.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto High School boys’ water polo team (16-9, 12-2) came up short in a four overtime thriller with a 10-9 loss to the Gunn High School Titans (16-6, 11-o) in the Santa Clara Valley Athletic League finals on Oct. 29 at Los Altos High School.<\/span>\r\n\r\nThe two teams traded goals for the majority of the match, with neither Paly nor Gunn able to break away with a significant lead.\r\n\r\nWith senior field player Andrew Jozefov leading the team in points with three goals, the Vikings fought hard until the end of the fourth overtime, during which the Titans scored the game-winning golden goal to take the championship trophy.\r\n\r\n<span style=\"font-weight: 400;\">Gunn was able to take a slight advantage by eliminating Paly’s senior star player, Jared Stanley, from the game in the second quarter by frustrating him into three ejections, disqualifying him from the game. Despite having to watch from the bench, Stanley said he was still proud of how his team performed.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I got majored in the second quarter, but the team did a good job stepping up and this is honestly the best game of water polo we have ever played,” Stanley said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Although the match ended in a loss, the quadruple overtime thriller displayed the Viking’s intensity and heart, according to Stanley. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We played our absolute hardest throughout the entire match,” Stanley said. “We fought on every possession and our defense really connected forcing four overtimes.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior Tommy Smale was pleased with the team’s performance, but felt they could have capitalized on key opportunities. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It was a very hard fought game on both sides all the way to the end,” Smale said. “It was really frustrating because we got their two best players Patrick [Zhao] and Quinn [Hamilton] out and we should’ve capitalized on that. We thought we could definitely put it away at that point but we never did.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior field player Andrew Jozefov, who scored with less than a minute left in regulation to tie the game at 8-8, describes the Viking’s game plan.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I matched up with their team's best players and ended up getting them out of the game,” Jozefov said. “I forced them to take ejections and eventually getting a major.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Stanley also acknowledged the Paly student section's for the increased intensity of the game.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Without the student section, we definitely would not have played as well as we did today,\" Stanley said. \"The energy in this pool arena really helped us.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Despite the loss, the team is looking forward to a rematch versus Gunn in Central Coast Section, according to Stanley.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We are building up momentum and character for CCS and we’re gonna come out fighting harder than we ever have,” Stanley said. “We are definitely going to beat Gunn in CCS.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Vikings' next match will be in the CCS playoffs. The date and location are TBA. <\/span>\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School boys’ water polo team (16-9, 12-2) came out short with a 10-9 loss to Gunn High School (16-6, 11-o) in the Santa Clara Valley Athletic League finals on Saturday at Los Altos High School.","date":"2016-11-01 22:59:13","author":"Sam Lee","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/candid1.jpg","categories":["Sports","water polo"],"tags":["Andrew Jozefov","championship","gunn","jared stanley","league","los altos","paly","scvals","senior","sports","titans","Tommy Smale","vikings","water polo"]},{"id":125091,"title":"Slideshow: Girls’ tennis plays Los Altos on Senior Night","permalink":"http:\/\/palyvoice.com\/2016\/10\/29\/slideshow-girls-tennis-plays-los-altos-on-senior-night\/","content":"The Palo Alto High School girls' tennis team (7-0) defeated the Los Altos High School Eagles (16-4), 4-3, on senior night. The team will compete in the Central Coast Section (CCS) championship tournament.\r\n\r\n<iframe src=\"https:\/\/docs.google.com\/presentation\/d\/1vSbAQU6zVVC_niZlQADVfpY55BiRfwJY5GMRxMiMZnU\/embed?start=false&amp;loop=false&amp;delayms=3000\" width=\"960\" height=\"569\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Palo Alto High School girls' tennis team (7-0) defeated the Los Altos High School Eagles (16-4), 4-3, on senior night. The team will compete in the Central Coast Section (CCS) championship tournament.","date":"2016-10-29 12:39:25","author":"Ethan Kao","categories":["Uncategorized"],"tags":["Boys","boys tennis","girls","girls tennis","paly","Soccer","sports","tennis","VIKES"]},{"id":125082,"title":"Girls&#8217;s tennis advances to CCS","permalink":"http:\/\/palyvoice.com\/2016\/10\/29\/girlss-tennis-advances-to-ccs\/","content":"[caption id=\"attachment_125083\" align=\"aligncenter\" width=\"620\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_7063.jpg\"><img class=\"size-full wp-image-125083\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_7063.jpg\" alt=\"Freshman Anuva Banwasi serves the ball in a doubles match with senior captain Meredith Cummings. The undefeated Vikings went on to win the game 4-3 on senior night. Photo by Ethan Kao\" width=\"620\" height=\"457\" \/><\/a> Freshman Anuva Banwasi serves the ball in a doubles match with senior captain Meredith Cummings.  The undefeated Vikings went on to win the game 4-3 on senior night. Photo by Ethan Kao.[\/caption]\r\n\r\nThe Palo Alto High School girls’ tennis team (12-0) routed Los Altos High School (14-6) 4-3, in an El Camino League match on Tuesday at home.\r\n\r\nPer tradition, the last home game coincided with senior night. Before the game, parents took photos and gave flowers to the girls. The team's seniors include Cummings, Pearson, Alice Zhang, Brin Elliott, and Mayerly Grace Short.\r\n\r\n<span style=\"font-weight: 400;\">The team’s last regular season win helps seal their undefeated record and finish the season in first place in the ECL, giving them a chance to the Central Coast Section (CCS) championship tournament. Only the top team from the El Camino League gets to compete in the championship tournament, which is predominantly reserved for the De Anza League.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Vikings played in the De Anza League last year before Coach Andy Harader dropped the team down. Buoyed by young talent and solid leadership, the team has enjoyed a breakout season, according to Harader. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to senior doubles player, Avery Pearson, the Vikings won with perseverance. Pearson and her doubles partner, senior Alice Zhang, clinched the deciding match in a game that went to the third set. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Los Altos is a tough team and a lot of the matches went into a third set,\" Pearson said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior captain Meredith Cummings acknowledged some weakness in today’s game.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"Today was a tough match,” Cummings said. \"We played well at the baseline overall, but on my court and the others that I could see, our volleys were mainly going into the net. We needed to improve on our net play, as well as moving our feet to the ball.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">With the regular season over, the team has shifted its focus to CCS. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Cummings feels that a focused exercise regimen will be  a key aspect to winning the championship. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I have the feeling that if we train hard in practice, eat healthy, and exercise on the weekend, we will be in great shape to try and win it all,” Cummings said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Additionally, Pearson feels the team needs to focus on mental stamina to win. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“To win CCS, I think we all need to be in the right mindset the day of the tournament.  Tennis is a mind game as much as it is a physical sport,” Pearson said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">After the undefeated regular season, Harader is confident that the girls can win the league CCS championship. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The only thing keeping us from winning the championship will be ourselves this season,” Harader said in September — a day before the season started.  <\/span>\r\n\r\n[caption id=\"attachment_125085\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/DSC_01232.jpg\"><img class=\"size-full wp-image-125085\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/DSC_01232.jpg\" alt=\"The team's seniors (in the back) line up to take a photo with their younger counterparts. Photo by Ethan Kao. \" width=\"600\" height=\"400\" \/><\/a> The team's seniors (in the back) line up to take a photo with their younger counterparts on senior night held on Tuesday. Photo by Rachel Code.[\/caption]\r\n\r\n&nbsp;\r\n\r\n<span style=\"font-weight: 400;\">The team’s first game in the playoff series will come next Tuesday with the date, location, and opponent currently listed as “TBA.”<\/span>\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School girls’ tennis team (12-0) routed Los Altos High School, 4-3, in an El Camino League match on Tuesday at home.","date":"2016-10-29 12:38:29","author":"Siddarth Sharma","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/DSC_01232.jpg","categories":["Tennis"],"tags":["CCS","de anza","el camino","girls","league final","tennis 2016","undefeated season"]},{"id":122247,"title":"Coffee Chats: Biology teacher Tara Verekyen","permalink":"http:\/\/palyvoice.com\/2016\/10\/29\/coffee-chats-biology-teacher-tara-verekyen\/","content":"&nbsp;\r\n\r\n[caption id=\"attachment_123615\" align=\"alignnone\" width=\"601\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Tara-Verekyen.jpg\"><img class=\" wp-image-123615\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Tara-Verekyen.jpg\" alt=\"Biology teacher Tara Verekyen in her classroom. Photo: Daniella Maydan\" width=\"601\" height=\"451\" \/><\/a> Biology teacher Tara Verekyen sits in her classroom full of students during Flex. Photo: Daniella Maydan.[\/caption]\r\n\r\n<i>This is the sixth installment of Coffee Chats, where The Paly Voice gets to know staff members over a cup of coffee.<\/i>\r\n\r\nThe Paly Voice sat down with new Palo Alto High School biology teacher Tara Verekyen, and discussed her interests and her journey to becoming a teacher over a medium iced coffee.\r\n\r\nWhile this is Verekyen’s 7th year teaching biology, she began her academic journey with an interest in anthropology and was fascinated by evolution and the way in which organs evolve over time.\r\n\r\n“I wanted to pursue anthropology because I like having a deeper insight into the biology behind human evolution and human origins,\" Verekyen said. \"However, I found through volunteering as a tutor and volunteering at a museum that I enjoyed working in science education. When I graduated, I decided to put my interest of science together with my interest of teaching, and start a post-bachelor teaching program.\"\r\n\r\nVerekyen moved to the Bay Area from Arizona in search of a change, as well as a way to be closer to family. She currently enjoys working with her stepmother, AP Statistics teacher Misha Stempel, at Paly.\r\n\r\n\"It's awesome, but it's kind of crazy,\" Verekyen said. \"We [Verekyen and Stempel] drive in to work together and we wave to each other in meetings. It's great!\"\r\n\r\nAccording to Stempel, it's great to see her stepdaughter at Paly because she is able to reconnect with her as well as reminisce about old times.\r\n\r\n\"It's just kind of cool because when she was younger and she and her sister would get out of school they would come to Paly and draw on the chalkboards,\" Stempel said.  \"I still have those pictures they drew for me back then so having  her here now is really cool. It's fun catching up with her and being a part of her life.\"\r\n\r\nAccording to Verekyen, she appreciates the environment at Paly and enjoys interacting with the students.\r\n\r\n“It's awesome, there is so much support here and so many great things going on on campus that I didn't see at my other schools,” Verekyen said.\r\n\r\nVerekyen believes that biology is an important class to take in high school.\r\n\r\n\"I love teaching freshman biology because I think it sets a really good foundation for what students are going to need later on in high school and in college\" Verekyen said.\r\n\r\nOther than teaching, Verekyen enjoys traveling and advises her students to consider studying abroad when in college.\r\n\r\n\"It really gives unique perspective and helps you to see how your major connects to the world in a more authentic way,\" Verkeyen said.\r\n\r\nTo students planning on pursuing biology, Verekyen encourages curiosity.\r\n\r\n“My advice for students that pursue biology is to find a topic that you really love and start exploring it, see how you can use that passion to solve modern day challenges or help people,\" Verekyen said. \"And question everything. Ask a lot of questions. Question it all.\"","excerpt":"The Paly Voice sat down with Palo Alto High School Biology teacher Tara Verekyen, and discussed her interests and her journey to becoming a teacher over a medium iced coffee.","date":"2016-10-29 12:06:55","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Tara-Verekyen.jpg","categories":["Coffee chats","Features","Spotlight"],"tags":["anthropology","biology","coffee chat","freshman","freshman biology","misha stempel","new teacher","tara verekyen","Teacher"]},{"id":125001,"title":"Groundbreaking Homecoming dance is groundbreakingly average","permalink":"http:\/\/palyvoice.com\/2016\/10\/28\/groundbreaking-homecoming-dance-is-groundbreakingly-average\/","content":"Palo Alto Homecoming traditions continue to be formed and broken: After a <a href=\"http:\/\/palyvoice.com\/2015\/10\/15\/asb-breaks-tradition-with-new-homecoming-plans\/\">historical<\/a> dance last year, the Paly Associated Student Body and Gunn Student Executive Council hosted the first-ever joint Homecoming dance last Saturday. Despite the exciting intermingling between Paly and Gunn students, this year’s dance was also plagued with lengthy lines, minimal food and general confusion.\r\n\r\n<span style=\"font-weight: 400;\">The dance took place in two gyms at Henry M. Gunn High School, and students were free to walk from one building to another to dance or play games such as ping pong or foosball with friends. While the buildings provided ample space, the hallway between the two had a bottleneck effect due to its small width and the large number of students constantly passing through. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The real trouble, however, began outside the front door. Several lines of roughly 2,100 students wound their way down to the parking lot, blocking cars. Many students were confused as to which line they had to stand in, and the process took over an hour for some. According to Paly Assistant Principal Kathleen Laurence, ticket takers aimed to spend five seconds admitting each student into the dance.<\/span>\r\n\r\n“We actually finished getting kids in seven minutes faster than we thought possible,” Laurence said.\r\n\r\n[caption id=\"attachment_125027\" align=\"alignright\" width=\"438\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMAG0068.jpg\"><img class=\"wp-image-125027\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMAG0068.jpg\" alt=\"IMAG0068\" width=\"438\" height=\"281\" \/><\/a> Students stand in a line stretching from the gym entrance into the parking lot to enter the dance. \"Waiting in line for nearly an hour ended up taking up a significant portion of the dance itself,\" senior Alix Westgaard said. Photo: Aidan Maese-Czeropski.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">While long waits are understandable, administration breathalyzed every single student, which was a waste of time. An alternative would be to breathalyze one in five or one in 10 students, saving time and still preventing underage drinking. Furthermore, the lack of signs made it so many people were unaware if they were in line to purchase tickets or enter the dance, and administration did little to prevent students from cutting in line. Some students spent over one third of their allotted time standing in line, yet the dance was not extended. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">When I finally entered the gymnasium one hour after I arrived, I was eager to eat. Unfortunately, nearly all the food had been consumed by the time I arrived, save for a bowl of colorful chips and salsa. Attendants occasionally brought out stacks of cookies or chocolate covered strawberries, and while they were delicious, they rarely lasted long. With thousands of students attending the dance, ASB and SEC should have expected the food to be quickly devoured and prepared accordingly.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The long lines and minimal food were partially compensated by enjoyable music and dancing: the most anticipated part of Homecoming was, as always, the dance floor. The DJ accepted student song requests and played a large variety of genres that were generally danceable. Iridescent lights and images of stars flashed across the walls, and most students were receptive to the music. Reconnecting with friends from other schools and meeting new people was both easy and encouraged, on and off the dance floor.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The dance featured entertaining games, including ping pong and foosball, as well as photo booths and a caricature artist. However, these areas remained extremely crowded. Increasing the number of ping pong tables from the two present would have allowed more people to take part in the fun. Special effects such as lights and banners outside the dance room were also minimal. This itself was fine, as streamers don’t necessarily entertain; however, students were promised extra amenities in exchange for an inexpensive venue so the rooms felt almost bare.<\/span>\r\n\r\nPaly senior Alix Westgaard says that while Homecoming was an enjoyable experience, it could have been planned much better.\r\n\r\n\"I think the challenge of having so many people attending the same venue needed to be addressed,\" Westgaard said. \"There wasn't enough space for all the cars picking up students and there weren't enough entrances to the dance, causing a very long line. In the future, they could try to stagger the homecomings so they occurred on different weekends or try to find a different location for Paly's homecoming. Leaving the parking lot after the dance also took forty-five minutes.\"\r\n\r\n<span style=\"font-weight: 400;\">Homecoming 2016 wasn’t entirely \"bad.\" But when sprinting to the food table to grab a snickerdoodle or two before they run out is one of the dance’s high points, you know the night didn’t live up to its potential. <\/span>","excerpt":"Despite the exciting intermingling between Paly and Gunn students, this year’s Homecoming dance was plagued with lengthy lines, minimal food and general confusion.","date":"2016-10-28 20:57:57","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMAG0068.jpg","categories":["Entertainment","Spotlight"],"tags":["2016","ASB","dance","groundbreaking","gunn","homecoming","joint","palo alto","paly","sec"]}]