[{"id":116100,"title":"County to begin health investigation","permalink":"http:\/\/palyvoice.com\/2016\/02\/13\/county-to-begin-health-investigation\/","content":"The Santa Clara County Public Health Department is scheduled to start field work later this month in its Epi-Aid project that will look into suicide data for local school districts, according to Public Health officials who spoke at the Palo Alto Unified School District Board of Education meeting on Tuesday in the district office.\r\n\r\nAccording to Pam Stoddard, director of research for Public Health at the Santa Clara County Public Health Department, the Epi-Aid for Santa Clara County is aimed to combat suicides and the issues that surround it in the county, because of the strong of suicides among incoming, current and alumni members of PAUSD from 2009-2015.\r\n\r\n“An ‘Epi-Aid’, or epidemiological assistance, is an investigation of an urgent public health problem,” Stoddard said to the board. “The CDC [Center for disease control] has this mechanism in place so that state and local public health officials can request assistance with these urgent problems because they may not have the local capacity or subject matter expertise to fully address them. The goal is to determine the causes and the extent of the problem, so these are really about developing prevention and control recommendations.”\r\n\r\nThe preparation period for the Epi-Aid occurred during December and January, and will now move on to the fieldwork portion of the project, which is scheduled to take place from February 16-29, according to Stoddard. Stoddard says that when this stage is completed, a follow-up stage will take place.\r\n\r\nThe Epi-Aid is aimed at giving the county short term-assistance by providing epidemiology-focused objectives and recommendations, which are based on the incidence, distribution and possible control of health issues, according to Stoddard.\r\n\r\n“Focusing on the county will provide us some flexibility in comparing cities and school districts within the county to see if we can understand more about patterns and trends,” Stoddard said. \"The main goal is to make some recommendations on prevention strategies that can be used in the school district, the city and the county.”\r\n\r\nThe investigation will also include a review of media coverage, prevention activities and protocols used by communities and school districts, comparing them to national recommendations around suicide prevention, according to Stoddard.\r\n\r\nThe Epi-Aid staff will not be allowed to conduct any new research but can take data from the county coroner’s office, death certificates, hospital data, school surveys and 911 calls, according to Stoddard. Additionally, the CDC will be able to design objectives, provide technical assistance, complete a wide-range media scan to ensure safe reporting, meet with local agencies, analyze data, draft reports and provide feedback and recommendations for the county and city, according to Stoddard.\r\n\r\n“This is an epidemiological approach, so it doesn’t use methods like psychological autopsies, so they won’t be able to investigate individual deaths,” Stoddard said.","excerpt":"The Santa Clara County Public Health Department is scheduled to start field work in its Epi-Aid project for local school districts, according to Public Health Department officials at the Palo Alto Unified School District Board of Education meeting on Tuesday at the district office.","date":"2016-02-13 17:30:17","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMAG0439.jpg","categories":["News"],"tags":["cdc","center for disease control and prevention","district office","epi-aid","Palo Alto Unified School District","palo alto unified school district board of education","public health department","School Board"]},{"id":116278,"title":"Students showcase work in Arts in Unusual Places","permalink":"http:\/\/palyvoice.com\/2016\/02\/13\/students-showcase-work-in-arts-in-unusual-places\/","content":"<hr \/>\r\n\r\nVisual and performing arts students showcased their talents in demonstrations during the annual Art in Unusual Places celebration at Palo Alto High School.\r\n\r\n<iframe style=\"border: none;\" src=\"https:\/\/social.shorthand.com\/thepalyvoice\/embed\/jgcstJdSbf\" width=\"100%\" height=\"500px\"><\/iframe>","excerpt":"Visual and performing arts students showcased their talents in demonstrations during the annual Art in Unusual Places celebration at Palo Alto High School.\r\n","date":"2016-02-13 00:27:45","author":"Emilia Diaz-Magaloni","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/12735685_1668667386726622_1927706921_n-12.jpg","categories":["Multimedia"],"tags":["Andy Goldsworthy","art","art in unusual places","Claudio Malagrino","Elizabeth Wilkinson","josh code","Kaitlyn Nakamura","Keith Haring","najar","steve ferrera"]},{"id":116173,"title":"Admin removes James Franco mural from Student Center","permalink":"http:\/\/palyvoice.com\/2016\/02\/11\/admin-removes-james-franco-mural-from-student-center\/","content":"[caption id=\"attachment_116177\" align=\"alignnone\" width=\"592\"]<img class=\"wp-image-116177\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/james-franco-mural1.jpg\" alt=\"james franco mural\" width=\"592\" height=\"395\" \/> One of James Franco's murals on the Student Center was painted over yesterday evening. \"Our art department is working with some students on other murals to put up around campus,\" Palo Alto High School Principal Kim Diorio said. Photo by Adrienne Kwok.[\/caption]\r\n\r\nThe Palo Alto High School administration plans to add new student artwork to campus after removing a mural, painted by Paly actor and alum James Franco, from the Student Center yesterday afternoon.\r\n<div class=\"_5wd4 _1nc7 direction_ltr\">\r\n<div class=\"_5wd9\">\r\n<div class=\"_5wde _n4o\">\r\n<div class=\"_5w1r _3_om _5wdf\">\r\n<div class=\"_4gx_\">\r\n<div class=\"_d97\">\r\n\r\n<span class=\"_5yl5\">Because of its dreary aspects, maintenance painted over a mural depicting students reading Paly's newspaper, the Campanile, according to Paly Principal Kim Diorio.<\/span>\r\n<div class=\"_3ry4\">\r\n<div class=\"_3ry4\">\r\n\r\n“Given what our community went through last year with the student suicides, I think that there were some people who felt that this mural gave a ghoulish kind of effect,” Diorio said.\r\n\r\nThe Paly Visual and Performing Arts Department plans to add new murals to the campus, partly to replace the piece removed yesterday.\r\n\r\n“We’re hoping to put up something else up in this space that is painted by Paly students,” Diorio said.\r\n\r\nAccording to Diorio, Franco was previously notified that his painting would be removed.\r\n\r\n“We told Mr. Franco at the time when he painted the murals that they were temporary and we would eventually paint over them,” Diorio said.\r\n\r\n[caption id=\"attachment_116180\" align=\"aligncenter\" width=\"548\"]<img class=\"wp-image-116180\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/franco-murals.png\" alt=\"franco murals\" width=\"548\" height=\"182\" \/> James Franco's painted-over mural (left) depicted students reading The Campanile. According to Diorio, Franco's other mural (right) will remain on the Student Center. Photos by Adele Bloch.[\/caption]\r\n\r\nSophomore art student Annie Zhou says she looks forward for the opportunity to showcase students' work and says she understands why Franco's piece was removed.\r\n\r\n“From what I’ve heard, not that many people loved his mural,” Zhou said. “Paly should give the students the opportunity to paint some murals.”\r\n\r\nAccording to Diorio, Franco’s other artwork, including the second Student Center mural depicting a football game, will not be removed.\r\n\r\nFranco, a Class of 1996 graduate, based his paintings and murals off of Paly yearbook photos. He <a href=\"http:\/\/palyvoice.com\/2014\/10\/13\/campus-is-canvas-for-celebrity-alum-james-franco\/\">painted the Student Center murals<\/a> in 2014 and donated other various art pieces to Paly.\r\n\r\n“We're very appreciative for all the artwork that he's donated,” Diorio said.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","excerpt":"The Palo Alto High School administration plans on adding new student artwork to campus after removing a James Franco mural from the Student Center yesterday afternoon.","date":"2016-02-11 23:09:28","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/james-franco.png","categories":["News","Spotlight"],"tags":["actor","Alto","alum","art","center","department","franco","High","james","mural","paint","painting","Palo","paly","School","student","writer"]},{"id":115764,"title":"&#8216;Room&#8217; transcends tragedy to portray hope in the horrifying","permalink":"http:\/\/palyvoice.com\/2016\/02\/11\/room-transcends-tragedy-to-portray-hope-in-the-horrifying\/","content":"[caption id=\"attachment_115774\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Room-2015-Lenny-Abrahamson-01-1024x614.jpg\"><img class=\"wp-image-115774 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Room-2015-Lenny-Abrahamson-01-1024x614.jpg\" alt=\"Room-2015-Lenny-Abrahamson-01-1024x614\" width=\"600\" height=\"360\" \/><\/a> Ma (Brie Larson) and Jack (Jacob Tremblay) rely on the strength of their connection to cope with trauma in \"Room.\" The film is nominated for Best Picture and Direction. Larson is nominated for Best Actress in a Leading Role for her captivating performance as a woman kidnapped for seven years. Photo: A24 films.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">It’s hard to imagine living in just one room for seven years. It’s even harder to imagine turning the survival story of the woman held captive and the coming-of-age story of her son into a successful, uplifting movie. Instead of portraying a tragedy as yet another emotionally draining drama, “Room” manages to find hope in the horrifying, resulting in a powerful film that carries the weight necessary to contend with the other great works in its Oscars nomination category.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Room,” based on the New York Times bestselling book of the same title by Emma Donoghue, tells the story of 17-year-old Joy Newsome (Brie Larson) who is kidnapped and held in a shack for seven years by her kidnapper Old Nick (Sean Bridgers). In that time, she gives birth to a boy named Jack (Jacob Tremblay) and raises him to the best of her ability, teaching him that their garden shed, Room, is all there is to the world. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">One of the highlights and unique features of the movie is the fact that it is narrated by 5-year-old Jack. His innocent perspective not only provides optimism in a bleak situation, but also depth as he explains how Room is his world, and humor as he explains how aliens control heaven and birth. For such a young child actor, the depth of emotion accurately portrayed is nothing short of amazing. His dialogue is also carefully constructed, taking into consideration how Jack bases his whole existence off one room. The outside world is simply “space” and his disbelief in the existence of things like dogs and trees is communicated through his anger and fear manifesting in a tantrum and the words “You’re lying!” In other scenes, however, Jack plays with the childlike abandon shared by all 5-year-olds, resulting in a compelling character able to tie innocence and joy to what is by all accounts a nightmare.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Director Lenny Abrahamson, also nominated for an Oscar, utilizes camera angles and lighting to full effect. When Jack sees outside the room for the first time, the glaring light hitting the camera matches what his sensitive eyes would see. When he’s crouched on the floor the camera also lowers, and when he’s in argument with his mother the close-up facial shots convey the smallest changes in emotion. One issue with Abrahamson’s use of the camera is that at certain times it feels overly realistic. Shaky cameras, when used in moderation, add to the performance, but in excess make the scene overwhelming for the wrong reasons.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">In all aspects of the movie, a clear effort to strip away the glamour of the traditional Hollywood drama is apparent: ordinarily beautiful Larson appears limp and pallid in soiled costumes, Old Nick is a rationalizing<\/span><span style=\"font-weight: 400;\">, unemployed middle-aged man instead of the stereotypically violent aggressor, and Jack is not completely oblivious to the injustice of his situation despite his misunderstanding of the outside world. The movie gains gravitas from choosing to present moments that show this honesty, like shots of Jack listening to his mother’s interactions with Old Nick at night, instead of the more stylized sequences often favored by other dramas.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">One of the beautiful parts of the movie is that the director does not rely on dramatic music to make his points, and instead lets silence illustrate emotion. In one particular scene, as Joy contemplates the risk of her escape plan, her face, the rhythm of her breathing and her tightly clenched fists say it all.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Larson’s performance is outstanding. Her character radiates the fierce maternal love so crucial to Jack’s protection through the smallest glance or shift in tone. Her role encompasses nearly the entire range of human emotion in one film, and Larson meets each shift with underplayed intensity. From the very first opening shot, the audience is rooting for her, and though nothing like Joy’s sacrifices are experienced by Larson, Larson’s character remains stunningly believable throughout the film.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">In short, “Room” is a film about perspective. As Jack and Ma lean on each other through their extreme escape, they realize the power of love and hope. Their ability to find the humor and excitement in everything, and their experience of looking at the world with fresh eyes is a valuable lesson in enjoying the little moments in life. “Room” is a powerful, out of the box film about our ability to survive and adapt when all we have is love.<\/span>\r\n\r\n<b>“Room”<\/b>\r\n\r\n<b>1 hour, 58 minutes<\/b>\r\n\r\n<b>Release Date: 16 October 2015<\/b>\r\n\r\n<b>Rated: R for language<\/b>\r\n\r\n<b>Directed by Lenny Abrahamson<\/b>\r\n\r\n<b>Starring: Brie Larson, Jacob Tremblay, Sean Bridgers<\/b>","excerpt":"Instead of turning a tragedy into yet another emotionally draining drama, “Room” manages to find hope in the horrifying, creating a powerful film that carries the weight necessary to contend with the other great works in its Oscars category.","date":"2016-02-11 18:04:36","author":"Maya McNealis","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Room-2015-Lenny-Abrahamson-01-1024x614.jpg","categories":["Oscars 2016","Spotlight"],"tags":["best actress","brie larson","jacob tremblay","oscars","room"]},{"id":116185,"title":"Democrats to face off in debate","permalink":"http:\/\/palyvoice.com\/2016\/02\/11\/democrats-to-face-off-in-debate\/","content":"Join The Paly Voice as we liveblog the Democratic debate between former Secretary of State Hillary Clinton and Senator Bernie Sanders tonight at 6 p.m. on PBS.\r\n\r\n[liveblog]","excerpt":"Join The Paly Voice as we liveblog the Democratic debate between former Secretary of State Hillary Clinton and Senator Bernie Sanders tonight at 6 p.m.","date":"2016-02-11 17:39:13","author":"Sherwin Amsbaugh","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/demdebate.jpg","categories":["News","Uncategorized"],"tags":["Bernie","Bernie Sanders","Clinton","Deabte","democrats","Hillary","Hillary Clinton","liveblog","Presidential race","Sanders"]},{"id":116058,"title":"Wrestling to attend SCVAL tournament this weekend","permalink":"http:\/\/palyvoice.com\/2016\/02\/11\/wrestling-to-attend-scval-tournament-this-weekend\/","content":"<div class=\"gmail_default\">\n[caption width=\"614\" id=\"attachment_116136\" align=\"aligncenter\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Screen-Shot-2016-02-10-at-3.57.57-PM.png\"><img class=\"wp-image-116136\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Screen-Shot-2016-02-10-at-3.57.57-PM.png\" alt=\"Freshman Callum Day-Ham knocks down his opponent at the dual meet against Gunn on Thursday. Day-Ham, among many other varisty wrestlers will compete at the Silcon Valley League Chapmionships this weekend. Photo by Cooper Lou.\" width=\"614\" height=\"389\"><\/a> Freshman Callum Day-Ham takes&nbsp;down&nbsp;his opponent at the dual meet against Gunn High School earlier this month. Day-Ham, among many other varsity wrestlers, will compete at the Santa Clara Valley Athletic League Championships&nbsp;this weekend. Photo by Cooper Lou.[\/caption]\n<div class=\"gmail_default\">\n<div class=\"gmail_default\">\n\nAfter a disappointing loss, 27-50, to Gunn High School, the Palo Alto High School wrestling team&nbsp;(0-5) is gearing up to compete in the Santa Clara Valley Athletic League finals at Gunn this weekend.\n<div class=\"gmail_default\">\n<div class=\"gmail_default\">\n\n\"My impression about&nbsp;the dual against Gunn is that we need to do a better job of fighting off our back,\" Paly head coach Jonathan Kessler said. \"We are a very inexperienced team with only four returning wrestlers from last year.\"\n\nPaly's overall performance at SCVAL&nbsp;will determine whether the team stays in the more competitive De Anza division, or moves down to the El Camino division.\n\n\"This tournament is very&nbsp;important for the team,\" junior Sara Aguilar said. \"Our goal is to place top three so we can remain in the De Anza Division.\n\nAccording to&nbsp;Kessler, the team is training hard to prepare for SCVALs.\n\n\"The team won't be doing anything differently other then looking to outwork their opponents,\" Kessler said. \"That starts in the practice room by being the hardest workers and doing extra on their own, including lifting, running and push ups.\"\n<div class=\"gmail_default\">\n<div class=\"gmail_default\">\n<div class=\"gmail_default\">\n<div class=\"gmail_default\">\n\n<span style=\"line-height: 1.5;\">To advance to the second day of the&nbsp;tournament, wrestlers <\/span><span style=\"line-height: 1.5;\">must<\/span><span style=\"line-height: 1.5;\">&nbsp;win two matches in their respective weight class: two losses will knock them&nbsp;out of the tournament completely.<\/span>\n<div class=\"gmail_default\">\n\n\"If you don't take top seven in your weight class, you don't advance to Central Coast Section&nbsp;and your season is over,\" Kessler said. \"Our wrestlers are looking to battle for a spot at the CCS tournament.\"\n<div class=\"gmail_default\">\n<div class=\"gmail_default\">\n<div class=\"gmail_default\">\n<div class=\"gmail_default\">\n\nAccording to Kessler, wrestlers to look out for this weekend include freshmen Callum Day-Ham (106 pounds), Andrew Wang (113 pounds), Kevin Giffen (285 pounds), sophomore Calvin Grewel (120 pounds), juniors Seth Goyal (132 pounds) and Aguilar (160 pounds).\n<div class=\"gmail_default\">\n<div class=\"gmail_default\">\n\n\"The season has been tough so far,\" Kessler said. \"At this point we aren't concerned with our record, we are concerned with working hard and wrestling tough.\"\n\nThe team&nbsp;will participate in the first day&nbsp;of SCVAL&nbsp;on Friday at Gunn.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","excerpt":"After a disappointing loss, 27-50, to Gunn High School, the Palo Alto High School wrestling team (0-5) is gearing up to compete in the Santa Clara Valley Athletic League finals at Gunn this weekend.\r\n\r\n","date":"2016-02-11 17:39:08","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Screen-Shot-2016-02-10-at-3.57.57-PM.png","categories":["Sports"],"tags":["eth","goyals","jonathan","kessler","palo alto high school","paly","scvals","sports","wrestling"]},{"id":116035,"title":"Choir Pops Concert to highlight Bay Area tunes","permalink":"http:\/\/palyvoice.com\/2016\/02\/09\/choir-pops-concert-to-highlight-bay-area-tunes\/","content":"[caption id=\"attachment_116067\" align=\"alignnone\" width=\"646\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/pops-concert.jpg\"><img class=\"wp-image-116067\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/pops-concert.jpg\" alt=\"pops concert\" width=\"646\" height=\"364\" \/><\/a> Sophomore Brian Hwang performs a solo at the 2015 'Pops' Concert. This year's concert will focus on Bay Area artists. Photo: Melissa Baten Caswell.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto High School choirs are preparing for the annual Pops Concert at 7 p.m. Tuesday and Wednesday in the Haymarket Theatre.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">As a tradition that has lasted for over a decade, this year’s concert will focus on music from Bay Area musicians, including Green Day, Janis Joplin and Journey, according to junior Nadia Leinhos.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The Pops Concert is annual concert for pop music,” Leinhos said. “No Latin, no renowned composers from the Baroque era – just music from the past century that we as teens are more likely to know.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The concert will feature soloists and several songs from each choir ensemble including  the  a capella groups, Spectrum and Madrigals.<\/span>\r\n\r\nAccording to Leinhos, the choirs began preparing for the concert at the start of the semester. Choir students researched Bay Area artists of their choice and chose songs on them, rehearsing every class period for the past couple of weeks.\r\n\r\n<span style=\"font-weight: 400;\">Unlike a traditional concert, choir members focus solely on pop music and dress casually compared to the <a href=\"http:\/\/palyvoice.com\/2015\/12\/11\/madrigals-is-fit-for-royalty\/\">Madrigals<\/a>’ elaborate costumes and formal Spring Concert attire. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It’s really different from your typical choir concert,” junior Jenny Zhuge said. “We are in casual dress and the singers are on stage when we are waiting for our turn to perform.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Leinhos says she hopes for a large attendance at the event.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It [the concert] could sometimes be considered more energetic,” Leinhos said. “It's definitely going to be a lot of fun.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Tickets are $5 for students and $10 for adults and can be bought at the door.<\/span>","excerpt":"The Palo Alto High School choirs are preparing for the annual Pops Concert at 7 p.m. Tuesday and Wednesday in the Haymarket Theatre.","date":"2016-02-09 17:48:59","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/12474004_10154519770054622_4578201271277032247_o.jpg","categories":["Entertainment"],"tags":["area","bay","choir","concert","jenny","leinhos","madrigals","music","nadia","pop","song","spring","zhuge"]},{"id":115883,"title":"New club hopes to bring end to mental illness stigma","permalink":"http:\/\/palyvoice.com\/2016\/02\/09\/new-club-hopes-to-bring-end-to-mental-illness-stigma\/","content":"[caption id=\"attachment_115895\" align=\"alignnone\" width=\"548\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/bring-change-2-mind-candid.jpg\"><img class=\" wp-image-115895\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/bring-change-2-mind-candid.jpg\" alt=\"&quot;Bring Change 2 Mind&quot; hosts an event during Club Day 2, letting people share their opinion on how to end stigma. Photo by Sam Lee.\" width=\"548\" height=\"425\" \/><\/a> The \"Bring Change 2 Mind\" club hosted an event during Club Day Two to let people share their opinions on mental illness stigmas. Photo by Sam Lee.[\/caption]\r\n\r\nA new student club is hoping to bring an end to mental illness stigma at Palo Alto High School.\r\n\r\nThe club, called Bring Change 2 Mind, was founded by three Paly students, seniors Bryn Carlson and Joseph Kao and freshman Lia Salvatierra, with the goal of creating awareness on the subject.\r\n\r\n“We each, for our own reasons, felt that something needed to be done on our campus to address mental health,” Carlson said. “This club sprang up because we have a vision that mental health will be considered no different than physical health, that people will feel comfortable talking about mental health and will feel no hesitation in seeking help for themselves or a friend who is suffering.”\r\n\r\nAccording to Carlson, Bring Change 2 Mind is a national organization with the goal of ending the stigma.\r\n\r\nOn Friday during Club Day Two, the club hosted an activity in which students could write about why they want to end the stigma or how they hope mental health will be viewed in the near future. Carlson was very pleased with how the activity went.\r\n\r\n“The goal of this activity is the same as our club's overall goal: to get people talking about mental health and to create a space for people to open up about it in order to diminish the stigma,” Carlson said. “I am pretty pleased. We had a bigger turnout than I was expecting so that was exciting.”\r\n\r\nCarlson hopes that the club's message can reach more people through the events it plans to host in the near future.\r\n\r\n“We are going to be pretty active during March,” Carlson said. “We plan on doing some more activities out on the Quad, and then we are going to have some smaller campaigns that we are going to be launching. And then we are also very excited to go to a summit in April that is going to be basically like a conference other chapters of Bring Change 2 Mind from around the Bay Area. “","excerpt":"A new student club, “Bring Change 2 Mind,\" is hoping to bring an end to mental illness stigma at Palo Alto High School.","date":"2016-02-09 11:18:10","author":"Chirag Akella","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/bring-change-2-mind-candid.jpg","categories":["News"],"tags":["Bring Change 2 Mind","carlson","club","Kao","mental illness","salvatierra","stigma"]},{"id":115714,"title":"&#8216;Brooklyn&#8217; redefines the meaning of hope","permalink":"http:\/\/palyvoice.com\/2016\/02\/09\/brooklyn-redefines-the-meaning-of-hope\/","content":"[caption id=\"attachment_115722\" align=\"alignnone\" width=\"590\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Screen-Shot-2016-02-04-at-7.34.52-AM.png\"><img class=\"wp-image-115722\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Screen-Shot-2016-02-04-at-7.34.52-AM.png\" alt=\"Screen Shot 2016-02-04 at 7.34.52 AM\" width=\"590\" height=\"394\" \/><\/a> Saorise Ronan and Emory Cohen star in \"Brooklyn,\" a heartfelt story of a young Irish woman immigrating to New York. Their chemistry and passionate performances create a movie truly worth Best Actress, Best Picture and Best Adapted Screenplay. Photo: Fox Searchlight Pictures.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">A touching immigrant story that transports audiences into 1950s New York, “Brooklyn” is a romantic drama, filled with rich history and emotion.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The storyline, based on Colm Toibin’s 2009 novel “Brooklyn,” tells the tale of Ellis Lacey (Saoirse Ronan), a young Irish woman who immigrates to New York. There, she faces the same struggle as the millions of immigrants that traveled to the United States, which is the need to assimilate to an unfamiliar way of life and the melancholy yearning for a faraway home with no hopes of returning. Ellis begins to enjoy her life in New York more when she falls for a friendly Italian-American plumber, Tom (Emory Cohen). However, after Ellis visits her hometown, she is faced with temptations from a local, Jim Farrell (Domhnall Gleeson), and is torn between the two lovers. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Viewers easily connect with the protagonist and are engrossed by Lacey’s captivating journey to overcome alienation in a new, unfamiliar environment.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Director John Crowley takes the audience through the complexities of each character and lets the actors in the film shine. Every performance is full of emotion and evokes a sense of nostalgia. Ronan, Irish-born herself, delivers a stunning performance that quickly captures the heart of the audience. Ronan’s character Lacey begins her journey as someone shy and inexperienced in the real world, and we see her grow into her true self throughout the movie. However, this inner transformation is subtle, for Ronan’s character is not a fearless, larger than life heroine, but instead a very real woman struggling to find her place in the world. With quiet strength and determination, Ronan is able to captivate the audience and bring the story of Ellis Lacey to life. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The costumes are very well selected and do an exemplary job of enhancing the setting of the era. In particular, in the scene at Coney Island, Lacey and Tom both wear baggy, bright colored swimsuits authentic to the time period.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Although “Brooklyn” has a large number of outstanding elements, the character development is generally lacking in the supporting cast. There is little insight into the life of the other characters in the story. Even with the sincerity and kindness of  Cohen’s character, he remains largely two-dimensional despite being the main love interest. This is primarily due to Crowley’s intentions to illustrate small moments in the main character's life. However, there is little to no insight into the other characters in the story, although it clearly builds the potential for further development. <\/span>\r\n\r\n“Brooklyn” feels like the result of a grandchild’s inquiry into her ancestors. As a drama, it paints a gritty and touching look into one young woman’s journey. The film is not afraid to illustrate the loneliness of an immigrant alone in a new country, but does so in an intimate and refreshing manner.\r\n\r\n<span style=\"font-weight: 400;\">“Brooklyn” is up for three Academy Awards: Best Picture, Best Adapted Screenplay and Best Actress. Ronan’s outstanding performance as Lacey arguably deserves Best Actress and the film has a good shot at Best Picture and Best Adapted Screenplay.<\/span>\r\n\r\n<strong>“Brooklyn”<\/strong>\r\n\r\n<strong>1 hour, 51 minutes<\/strong>\r\n\r\n<strong>Rated: PG-13 for a scene of sexuality and brief strong language<\/strong>\r\n\r\n<strong>Directed by John Crowley<\/strong>\r\n\r\n<strong>Starring: Saoirse Ronan, Emory Cohen<\/strong>","excerpt":"A touching immigrant story that transports audiences into 1950s New York, “Brooklyn” is a romantic drama, filled with rich history and full of emotion, and deserves its Oscar Nominations of Best Picture, Best Adapted Screenplay and Best Actress. ","date":"2016-02-09 11:09:44","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Screen-Shot-2016-02-04-at-7.34.52-AM.png","categories":["A&amp;E Section Spotlight","Entertainment","Oscars 2016"],"tags":["brooklyn","cohen","ellis","emory","film","lacey","movie","new york","oscar","ronan","saorise"]},{"id":116014,"title":"Third annual Paly Student Film Festival is on Friday, Feb. 19","permalink":"http:\/\/palyvoice.com\/2016\/02\/08\/third-annual-paly-student-film-festival-is-on-friday-feb-19\/","content":"","excerpt":"","date":"2016-02-08 18:20:29","author":"Josh Yuen","categories":["Ticker"],"tags":[]}]