[{"id":121189,"title":"The speeches that didn’t make it, Class of 2016","permalink":"http:\/\/palyvoice.com\/2016\/06\/04\/the-speeches-that-didnt-make-it-class-of-2016\/","content":"[caption id=\"attachment_121203\" align=\"alignnone\" width=\"618\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/06\/13384856_1079492148789204_26339104_n.jpg\"><img class=\"wp-image-121203\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/06\/13384856_1079492148789204_26339104_n.jpg\" alt=\"13384856_1079492148789204_26339104_n\" width=\"618\" height=\"412\" \/><\/a> Palo Alto High School seniors wait to be called to the stage at the commencement ceremony. Photo by Emma van der Veen.[\/caption]\r\n\r\n<em>The Paly Voice<\/em> acquired the following speeches from their authors, with the authors’ consent to publish. The authors wrote the speeches with the intention of delivering them at graduation but were not selected by a panel of faculty members. The views stated in these speeches do not necessarily reflect the views of <em>The Paly Voice<\/em>, nor those of its staff.\r\n<ol>\r\n\t<li><a href=\"http:\/\/palyvoice.com\/?p=121169&amp;preview=true\">Esmé Ablaza<\/a><\/li>\r\n\t<li><a href=\"http:\/\/palyvoice.com\/?p=121171&amp;preview=true\" target=\"_blank\">Alexander Gouyet<\/a><\/li>\r\n\t<li><a href=\"http:\/\/palyvoice.com\/?p=121176&amp;preview=true\">Christina Le<\/a><\/li>\r\n\t<li><a href=\"http:\/\/palyvoice.com\/?p=121167&amp;preview=true\">Allison Zhang<\/a><\/li>\r\n\t<li><a href=\"http:\/\/palyvoice.com\/?p=121179&amp;preview=true\" target=\"_blank\">Anant Marur<\/a><\/li>\r\n<\/ol>\r\n&nbsp;","excerpt":"The Paly Voice acquired the following speeches from their authors, with the authors’ consent to publish. The authors wrote the speeches with the intention of delivering them at graduation but were not selected by a panel of faculty members. The views stated in these speeches do not necessarily reflect the views of The Paly Voice, nor those of its staff.\r\n","date":"2016-06-04 09:55:55","author":"Emilia Diaz-Magaloni","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/06\/13384856_1079492148789204_26339104_n.jpg","categories":["Features","Spotlight"],"tags":["2016","graduates","graduation 2016","graduation speeches","speeches"]},{"id":121179,"title":"The speeches that didn’t make it, Class of 2016: Part 5 &#8211; Anant Marur","permalink":"http:\/\/palyvoice.com\/2016\/06\/04\/the-speeches-that-didnt-make-it-class-of-2016-part-5-anant-marur\/","content":"<em>The Paly Voice acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of delivering them at graduation, but were not selected by a panel of staff members. The views stated in these speeches do not necessarily reflect the views of The Paly Voice, nor those of its staff.<\/em>\r\n\r\n<strong>Graduation Speech:<\/strong> Anant Marur\r\n\r\n<span style=\"font-weight: 400;\">Hello everybody, my name is Anant Marur.<\/span>\r\n\r\nPlease refrain from sticking out any arms, legs, or other appendages, because I’m about to take you on a ride.\r\n\r\nAn old, wise, albeit unknown man once said, “an object will remain at rest or in uniform motion in a straight line unless acted upon by an external force.” I’m pretty sure that’s from the Magna Carta, but it doesn’t really matter what song it’s from.\r\n\r\nJokes aside, you’re probably thinking, “Anant, you’re graduating. It’s a tad late to cram for that physics final.”\r\n\r\nTo that, I have two answers. First of all, it’s never too late to cram. If highschool has taught me anything at all, it’s that.\r\n\r\nSecond, and perhaps the more profound point I wish to make, is that Newton’s First Law extends far beyond the constraints of blocks resting on inclined planes.\r\n\r\nAllow me to elaborate.\r\n\r\nHigh school is an enigma. There’s an overabundance of analogies I could use to describe high school – I could call it a jungle, a football game, a small country, and I’m pretty sure there’s some conceivable relationship I could draw between high school and a pudding cup, but the truth is that none of them fully capture the complexities of high school.\r\n\r\nBetween learning everything from oxidation numbers to correct condom usage, meeting everybody from Shakespeare reincarnated to some interesting hybrid of a gorilla and an armored tank, and dealing with everything from asking that one girl out to asking that one teacher to round you up, it’s safe to say that high school is quite a beast.\r\n\r\nYet, we slayed it. We smote this beautiful, demented, son of a –, wait, there are kids here. My bad, let’s keep this PG.\r\n\r\nBeing the deep, transcendental thinker than I am, I sat on that safety hazard that we call a senior deck many a 5th period (sorry Ms. Angell) pondering this extraordinary feat. Hordes of freshman pour into this school, year after year, conquer these four years, and rise as unrivaled Vikings on the other side. What mysterious force could be behind this phenomenon?\r\n\r\nLove.\r\n\r\nJust kidding. That would be way too cheesy, even for a graduation speech.\r\n\r\nForgive me if my actual answer isn’t quite as enlightening or game-changing as I built it up to be, but the simple answer is “because we had to”. Whether it be our parents, our friends, or some esoteric notion that finishing high school yields some marginal benefit, every single one of my green-clad classmates over there had something holding them onto high school.\r\n\r\nThis reason, this driving force, leaves us with no option but to dive into the belly of the beast. I don’t know if I can speak for everyone, but I can confidently say anywhere inside the gastric system of any beast is far outside of my comfort zone. That venn diagram has zero overlap.\r\n\r\nThis brings me to the crux of what I wish to leave my classmates with – ditching the comfort zone. The microenvironment of high school constantly pushed us outside of our comfort zone, whether in the form of a difficult subject, a social encounter, or an idea we didn’t quite agree with.\r\n\r\nThis push is the ‘external force’ in Newton’s First Law that I mentioned before. Our minds aren’t designed to passively grow. Unfortunately, we can’t just leave our brains in a jar out in the sunlight for four years, and expect to undergo the transformation we have from our freshman to our senior year. In order to evolve as people, in the tremendous ways that we all have during the incredible journey of high school, we need to be pushed outside of our comfort zone – into the danger zone, if you will.\r\n\r\nAs we move on into the various walks of life, that external force will begin to fade. We will no longer be held captive in an environment in which our teachers and peers force us to grow. Complacency will tempt us and the comfort of habit, routine, and familiarity will draw us like moths to a flame. To everyone who finds themselves giving into this temptation, just note down this one mental picture:\r\n\r\nImagine yourself on the first day of freshman year, bubbling with enthusiasm and head chock full of clichéd notions of what lay ahead.\r\n\r\nDisgusting, right?\r\n\r\nNow imagine that same kid, sitting here in your cap and gown, graduating high school. Unchanged, unaltered, except maybe a bit taller (unless you’re me, and you stopped growing in 7th grade).\r\n\r\nScary, right? I think I just saw my entire class collectively cringe. I hope I don’t sound too Silicon Valley when I say this, but progress really is the only way forward.\r\n\r\nI’d actually like to make a small modification to Newton’s First Law. Everyone makes mistakes, after all, right Mr. Stern? Even good old Isaac. Here it is:\r\n\r\n“After an object graduates high school, it will remain at rest or in uniform motion in a straight line unless acted upon by an internal force.”\r\n\r\nBe your own internal force. Push yourself into new situations, explore new ideas, and learn new things about yourself. I’ve already started. I gave this speech.\r\n\r\n<span style=\"font-weight: 400;\">Go Vikes.<\/span>","excerpt":"The Paly Voice acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of delivering <a href=\"http:\/\/palyvoice.com\/2016\/06\/04\/the-speeches-that-didnt-make-it-class-of-2016-part-5-anant-marur\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2016-06-04 09:55:27","author":"Aisha Chabane","categories":["Uncategorized"],"tags":[]},{"id":121176,"title":"The speeches that didn&#8217;t make it, Class of 2016: Part 3 &#8211; Christina Le","permalink":"http:\/\/palyvoice.com\/2016\/06\/04\/the-speeches-that-didnt-make-it-class-of-2016-part-3-christina-le\/","content":"<em>The Paly Voice acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of delivering them at graduation, but were not selected by a panel of staff members. The views stated in these speeches do not necessarily reflect the views of The Paly Voice, nor those of its staff.<\/em>\r\n\r\n<strong>Graduation Speech: <\/strong>Christina Le\r\n\r\n<span style=\"font-weight: 400;\">Good evening everyone,<\/span>\r\n\r\n<span style=\"font-weight: 400;\">On behalf of the Class of 2016, I’d like to welcome all esteemed faculty, friends, and family to the 122nd graduation ceremony of Palo Alto High School. Well class, we started from the bottom, and now the whole team is here, ready to graduate high school. Today is the day to celebrate our journey and accomplishments as individuals and as a class. It seems like it was just yesterday that we experienced our freshman orientation,  first football game, first spirit week, and even the first streak week. Through our four year journey together, we have grown both physically and mentally. Our class has undeniably been one of the most successful graduating classes to walk through Palo Alto High School. This year, our athletic department has had 11 college athlete recruits, and has won many notable titles. Our various student organizations and clubs have flourished, and proudly represented our school, winning countless awards over the last four years. However, our years at Palo Alto High School were no walk in the park. Each and every one of us has experienced our fair share of disappointments and obstacles that we’ve had to overcome. Through our years together, there is no doubt in my mind that this class is resilient. We survived the streak week ban, mandatory tutorial check-ins, and no food in the library rules. But in all seriousness, our grade has risen above the obstacles, and has become one united class, win together, lose together, classmates. The fact that we stand here decorated with awards, accomplishments and knowledge is just a testament to our commitment to excellence and success. Graduates, you have all grown to be powerful and intellectual individuals who are destined for greatness. Street poet and philosopher Drake once said, “Look at where I landed, You would think I planned it, I’m just doing me, You could never understand it,”. Things might not always go the way you planned, but being a part of the class, I know that each and every one of you is capable of making life the best you can. After all, it is the journey that often teaches you about your destination. As we move forward from our days at Paly, I ask that you live life the way you want to, do what makes you proud, because “you only live once”. Graduates, strive to be the best version of yourself and remain fearless because you are viking. Right now, I’d like to take the time to give thanks to our amazing teachers, warm guidance department, my family, and most importantly, all of <\/span><b>you<\/b><span style=\"font-weight: 400;\"> in caps and gowns. In the words of one well-known hip-hop producer,“We da best.” Congratulations to the brave, the bold, and the beautiful class of 2016, let’s get it, let’s go. <\/span>","excerpt":"The Paly Voice acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of delivering <a href=\"http:\/\/palyvoice.com\/2016\/06\/04\/the-speeches-that-didnt-make-it-class-of-2016-part-3-christina-le\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2016-06-04 09:54:39","author":"Emilia Diaz-Magaloni","categories":["Uncategorized"],"tags":[]},{"id":121171,"title":"The speeches that didn’t make it, Class of 2016: Part 2 &#8211; Alexander Gouyet","permalink":"http:\/\/palyvoice.com\/2016\/06\/04\/the-speeches-that-didnt-make-it-class-of-2016-part-2-alexander-gouyet\/","content":"<em>The Paly Voice acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of delivering them at graduation, but were not selected by a panel of staff members. The views stated in these speeches do not necessarily reflect the views of The Paly Voice, nor those of its staff.<\/em>\r\n\r\n<strong>Graduation Speech:<\/strong> Alexander Gouyet\r\n<p class=\"p1\">Earlier this year, I was leaving soccer practice, when, completely on a whim, I said “why not?” and I signed myself up for a yoga class the next day at Ananda, a Buddhist Meditation Temple right here on El Camino. When I arrived at 9:30 the next morning, I uncomfortably noticed that I was the only male in the class and the only person under 60 in the entire building. During the next hour and a half, I received cramps in places I had never experienced. Even though I prided myself on having a diverse array of interests and being in shape, I was not expecting yoga to be so hard.<\/p>\r\n<p class=\"p2\">You may know me as the co-president of the Jewish Student Union, a rapper, or the French curly haired senior who shaved his head for no apparent reason. You may be wondering, what qualifies me to give you a speech? I have lived in prosperous Palo Alto my whole life, and I realize that I have had a truly blessed childhood. People are perplexed anytime I complain, saying that students like you and me don't recognize how fortunate we are to attend Paly. Well, I understand people in Syria are grateful just to be alive, and that we're sitting here complaining about having chromebooks instead of Macbooks. This does not mean that even in our positions, with everything handed to us, we can't feel pressured at times. With so many life choices ahead of us, it is normal to be overwhelmed. Well, here is where I can help you.<\/p>\r\n<p class=\"p2\">The reason I told you about my painful yoga experience is that if I invited all of you to come to a yoga class this weekend, I’m not sure how many of you would join me because the idea of attending a yoga class with 60 year old women may seem a bit odd and not worth your time. Well, you know what? After finishing the class, amid all the pain from that yoga, I felt renewed. I had explored something different, and that is an invaluable feeling. There are many activities during life for which you can say “Why would I try that”? Well, I say : “Why not?” During my four years at Paly, I have heard many students complain about the system, about how we are forced into schools with little freedom for exploration, and we are all coming out like robots. I have a solution. My antidote is why not? Try new things. We all have opportunities, but we usually avoid looking at them.<\/p>\r\n<p class=\"p2\">After adopting this attitude, you know what? I feel the most liberated I have. Ever!<\/p>\r\n<p class=\"p2\">Steve Jobs said “why not?” when he reinvented the computer. Elon Musk said “why not?” when he founded Tesla. So I challenge you.<\/p>\r\n<p class=\"p2\">Why not go to that yoga class? I will now be taking a gap year and spending three months at a Buddhist meditation temple.<\/p>\r\n<p class=\"p2\">Why not try out a new club that seems a bit different and maybe a bit scary? I joined the Jewish Student Union even though I am not Jewish, and this was one of the greatest decisions of my life.<\/p>\r\n<p class=\"p2\">I can tell you today that I am truly happy, and I am living my life to the fullest. We are all going on to bigger, better, things, but the one element that remains constant will be the options that we are given, and whether or not we choose to use them. Class of 2016, Paly has given us a springboard, and we have the privilege of using it. The next time that an opportunity outside your comfort zone arises, think twice.<\/p>\r\n<p class=\"p2\">I challenge you to say why not? And maybe I’ll see you at a yoga class one of these days. Thank you!<\/p>","excerpt":"The Paly Voice acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of <a href=\"http:\/\/palyvoice.com\/2016\/06\/04\/the-speeches-that-didnt-make-it-class-of-2016-part-2-alexander-gouyet\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2016-06-04 09:54:11","author":"Aisha Chabane","categories":["Uncategorized"],"tags":[]},{"id":121167,"title":"The speeches that didn&#8217;t make it, Class of 2016: Part 4 &#8211; Allison Zhang","permalink":"http:\/\/palyvoice.com\/2016\/06\/03\/the-speeches-that-didnt-make-it-class-of-2016-part-4-allison-zhang\/","content":"<em>The Paly Voice acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of delivering them at graduation, but were not selected by a panel of staff members. The views stated in these speeches do not necessarily reflect the views of The Paly Voice, nor those of its staff.<\/em>\r\n\r\n<strong>Graduation Speech: <\/strong>Allison Zhang\r\n\r\nGood evening, everyone.\r\n\r\nWe are here today to celebrate a special moment, one marking not only the transition of the Class of 2016 from high school to our life beyond but our advance from childhood towards adulthood. This is precisely why today I advocate for retaining the best qualities of childhood: curiosity, imagination, and living in the present.\r\n\r\nWhen we were children, our world was fascinating. We were captivated by clouds in the shape of dogs, trees, and planes, by static electricity that makes our hair stand on end, and by ants carrying bread crumbs nearly as big as themselves. To see what would happen, we may have committed mass murder by kicking in an anthill. Always eager for excitement, we dropped Mentos in a king-size Coke and then admired the foam shooting skyward. Such antics were not prompted in hopes of any specific reward; back then we weren’t college-resume-building. No, we were simply curious\r\n\r\nWe not only closely observed our environment, we also wanted to disturb it. Curiosity got Isaac Newton cogitating about the fallen apple and then deriving the law of gravity. Curiosity made Benjamin Franklin contemplate lightning, leading him to basic concepts about electricity. Recently, founders of Sushirrito Restaurant in Palo Alto must have pondered fusing Japanese sushi with Mexican burritos. Such triumphs suggest the benefits of retaining our curiosity and seeing where it leads us.\r\n\r\nAn essential guide is our imagination. The French scientist Louis Pasteur wanted to find the “invisible enemy” that causes rabies. People repeatedly told him that since it was invisible, he wouldn’t find it. Luckily for humanity, that didn’t stop Pasteur, who imagined that organisms could be so small as to be invisible to the eye and saved countless lives. According to Albert Einstein, “Imagination is more important than knowledge.” In fact, imagination often brings forth new knowledge and can catalyze change. Imagining that all people deserve rights and can contribute to society was essential for freeing slaves and giving the vote to women. Imagination led Nikola Tesla to combine telephony and computing, which has morphed into today’s smartphone industry. Now, in the palm of our hands, we can learn everything from the Pythagorean Theorem to how many jumping jacks are required to burn calories from a Big Mac. (Pretend to tap, hold up phone) That answer, by the way, is 375. In school, too, imagination is precious. Learning U.S. history, we deepen our understanding when we imagine what life at the height of the Great Depression felt like for 25% of the labor force who were unemployed. Inevitably, we also imagined Mr. Jack Bungarden’s disapproving expression as he read our scribbled responses to document-based questions. In AP Environmental Science, we envisioned the impact of rising sea levels and resource depletion on people and other life forms; we also recall Mr. Kenyon Scott’s seemingly endless optimism and positivity, his legacy to each of us. After we leave Paly, let’s take with us our imagination.\r\n\r\nAs children, we lived in the present. Remember telling us to save our Halloween candy? No way! As we grew up, we recognized we have a future, and we learned to plan ahead. In the fable “The Ant and the Grasshopper,” the ant worked all summer long to store food for winter. All summer long, the carefree grasshopper sang, and, as winter approached, found itself hungry. We are trained to be ants. As high school students, many of us planned for college. As college students, we will plan for careers. When we work, we should save for retirement. I certainly don’t praise procrastination, but sometimes we work so hard for and expect so much from what lies ahead that we miss our here and now. We should not make the mistake of living only for the future; after all, the time in which we truly live is the present, is now. As cartoonist Bil Keane put it, “Yesterday’s the past, tomorrow’s the future, but today is a gift. That’s why it’s called the present.” Let us always treasure the gift of today.\r\n\r\nChildhood is a time when we expanded our world, a time when we hadn’t closed ourselves off or given up on our dreams, a time when we were very much alive. My hope for each of us here, whether you are 8 or 18 or 80 or more, is that, as we venture forth, we are curious and imaginative and live in the present. Thank you.","excerpt":"The Paly Voice acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of delivering <a href=\"http:\/\/palyvoice.com\/2016\/06\/03\/the-speeches-that-didnt-make-it-class-of-2016-part-4-allison-zhang\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2016-06-03 21:01:14","author":"Emilia Diaz-Magaloni","categories":["Uncategorized"],"tags":[]},{"id":121169,"title":"The speeches that didn&#8217;t make it, Class of 2016: Part 1- Esmé Ablaza","permalink":"http:\/\/palyvoice.com\/2016\/06\/03\/the-speeches-that-didnt-make-it-class-of-2016-part-1-esme-ablaza\/","content":"<em>The Paly Voice acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of delivering them at graduation, but were not selected by a panel of staff members. The views stated in these speeches do not necessarily reflect the views of The Paly Voice, nor those of its staff.<\/em>\r\n\r\n<strong>Reyna and The Lucinda River:<\/strong> Esmé Ablaza\r\n\r\nIt was on a Friday night last year at the beginning of May that I met a 26-year-old woman named Reyna. A Verde story had taken a couple of other staffers and me to a coin wash on El Camino at 11 p.m. Two things struck me about my conversation with Reyna: the mistakes she had made in her life and the obvious love she had for her daughter, Eileen.\r\n\r\nReyna told me that in high school, she had gotten herself kicked out for fighting and was sent to Juvenile Hall. She was then incarcerated for a different offense as an adult several years later.\r\n\r\nAs she was telling me her story, I couldn’t help but dwell on how much she had messed up. Her mistakes seemed unforgivable, a deal-breaker when it came to her character. But something changed when Reyna started talking about her daughter.\r\n\r\nShe described her 6-year-old daughter, Eileen, as “pure, pure pink.” According to Reyna, Eileen prefers spending her time watching “Austin and Ally” on the Disney Channel instead of listening to rap music.\r\n\r\n“She wants the other life, the life we see on TV, you know?” Reyna said.\r\n\r\nAnd, as it turns out, Reyna is trying to give Eileen that life. She told me she’s getting her GED. She’s in the process of turning her life around because she knows she needs to get it together for her daughter.\r\n\r\nReyna owned up to making some irreversible mistakes. But despite the chaos of her past life, she was trying to do what was best for her daughter. She’s doing everything she can to help her daughter get what she wants. She may not be perfect, but she has Eileen’s best interests at heart.\r\n\r\nIt’s easy to get caught up in the excitement of finishing high school and, for some of us, moving away from home. But in these final weeks and months, as we transition to a different stage in our lives, I think it’s important for us to reflect on who our Reynas are. Think about that person who has always been there for you and who always wants what’s best for you. Maybe that person is just as flawed as, or even more flawed than Reyna. But what’s really important, in the end, is recognizing and thanking that person for helping you get to where you are today.\r\n\r\nEarlier this year in Ms. Bartlett’s English class, we read a short story by John Cheever called “The Swimmer.” In the story, a man decides to swim across all of the pools in the county, which he collectively names The Lucinda River. The problem is that he is self-centered and he believes his swim to be one of great historical importance. He spurns the hospitality of many friends and neighbors during his journey. He eventually swims home, only to discover that his house is abandoned and his garden is overgrown. His family is nowhere to be found. He can’t remember where they are. He becomes disillusioned with his great conquest of The Lucinda River and is full of regret and loneliness.\r\n\r\nSometimes, I worry about becoming the swimmer in the story. He spends so much time underwater, engrossed in his all-consuming illusions, that he forgets about what really matters: his family and the place he calls home. I worry about failing to swim with my head above water. I worry that, when I’m away from them, I will be too wrapped up in my own Lucinda River to pay my family and friends from home the attention and love they so greatly deserve.\r\n\r\nTo me, my conversation with Reyna and reading of “The Swimmer” serve as important reminders. A reminder that sometimes, the people who have always been there for you aren’t perfect, and that that’s okay. A reminder that, when things are busy and exciting and it seems like you could be headed somewhere, you should take the time to acknowledge and love the people who helped get you there in the first place. Thank you. — Esmé Ablaza","excerpt":"The Paly Voice acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of delivering <a href=\"http:\/\/palyvoice.com\/2016\/06\/03\/the-speeches-that-didnt-make-it-class-of-2016-part-1-esme-ablaza\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2016-06-03 20:42:28","author":"Emilia Diaz-Magaloni","categories":["Uncategorized"],"tags":[]},{"id":121100,"title":"PALY Robotics Team to offer summer camp for middle schoolers","permalink":"http:\/\/palyvoice.com\/2016\/05\/28\/paly-robotics-team-to-offer-summer-camp-for-middle-schoolers\/","content":"The Palo Alto High School Robotics team will be holding their second annual Paly Robotics Summer Camp this summer from July 18 to August 5 at Paly.\r\n\r\n<span style=\"font-weight: 400;\">The camp is offering three sessions, with each session split into two sections that focus on different aspects of robotics. Each session will be held on weekdays from 9 a.m. to 3 p.m. at <\/span><span style=\"font-weight: 400;\">the Paly Robotics Lab <\/span><span style=\"font-weight: 400;\">in Room 903. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The first session is from July 18 to July 22 and will allow students to choose between “Programming and 3D Animation” or “Robot Design and Hardware.” The second section is from July 25 to July 29 and will offer “Robot Design and Hardware” or “Entrepreneurship and Website Design.” The third session is from August 1 to August 5 and will be split into “Programming and 3D Animation” and “Entrepreneurship and Website Design,” according to the <a href=\"http:\/\/palyrobotics.com\/summercamp\">Paly Robotics website<\/a><\/span><span style=\"font-weight: 400;\">. <\/span>\r\n\r\n[caption id=\"attachment_121104\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/RoboticsSummerCamp.jpg\"><img class=\"size-full wp-image-121104\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/RoboticsSummerCamp.jpg\" alt=\"A camper at the 2015 Robotics Summer Camp working on his remote control car for the &quot;build and design&quot; section. Photo: PALY Robotics\" width=\"800\" height=\"600\" \/><\/a> A camper at the 2015 Robotics Summer Camp works on his remote control car for the \"build and design\" section of the camp. Photo: PALY Robotics[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">According to the creator and co-leader of the camp, sophomore Simran Pujji, the robotics team hopes the camp inspires young kids to pursue robotics.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The whole team is really excited to prepare for this summer camp because we had a great time running it last year,” Simran said. “Our mission is to inspire kids to pursue robotics in middle school and in high school.”<\/span>\r\n\r\nAccording to co-lead of the camp, sophomore Devin Ardeshna, the camp was a trial run last year.\r\n\r\n<span style=\"font-weight: 400;\">“Paly Robotics Summer Camp 2015 was a weeklong camp to expose students to STEAM (Science, Technology, Engineering, Art and Math),” Ardeshna said. <\/span><span style=\"font-weight: 400;\">“The camp was a huge success and proved that offering a summer camp was a great opportunity for Paly Robotics. This year, we are hoping that we will be able to introduce more kids to more aspects of STEAM on the paly robotics team. There are different sessions offered that cover subjects including robot design, robot hardware, Python programming, 3D animation with Autodesk Maya, website design, and business plan writing. The camp will also allow students to explore more about high school, FRC, and other opportunities for them outside of the camp.”  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">While most of the sessions are already filled, the waitlist is still open for “Entrepreneurship and Website Design” during the second and third sessions. Students interested in being added to the wait list must be rising 6th to 9th graders, and can register for the camp <a href=\"http:\/\/palyrobotics.com\/summercamp\">here<\/a><\/span><span style=\"font-weight: 400;\">. While there is no fee for attending the camp, participants are recommended to donate $350 per week. For more information, students can contact the summer camp staff <a href=\"http:\/\/summercamp@palyrobotics.com\">here<\/a> through email. <\/span>","excerpt":"The Palo Alto High School Robotics team will be holding their second annual Paly Robotics Summer Camp this summer from July 18 to August 5 at Paly.\r\n","date":"2016-05-28 10:39:33","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/RoboticsSummerCamp.jpg","categories":["News","Uncategorized"],"tags":[]},{"id":120999,"title":"Star players lead badminton team to successful season","permalink":"http:\/\/palyvoice.com\/2016\/05\/26\/star-players-lead-badminton-team-to-successful-season\/","content":"[caption id=\"attachment_121081\" align=\"alignnone\" width=\"537\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Flavia-and-michael.jpg\"><img class=\"wp-image-121081\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Flavia-and-michael.jpg\" alt=\"Flavia and michael\" width=\"537\" height=\"419\" \/><\/a> On the left, sophomore Michael Chau prepares to smash the birdie across the net in a match against Wilcox on March 31. On the right, junior Flavia Sitglich practices her return during training. Both players attended to California Interscholastic Federation Northern California Tournament last weekend. Photo: Julia Qiao[\/caption]\r\n\r\nAlthough they may not always train or play together, sophomore Michael Chau and junior Flavia Stiglich are connected by a deeper bond – their love for badminton.\r\n\r\nIn a short amount of time at Palo Alto High School, Stiglich and Chau have become close friends through their many discussions about their badminton experiences. Both are highly successful players: Chau is nationally ranked in the United States and Stiglich is a member of the Peruvian National Badminton Team.\r\n\r\nTogether, these newcomers have led Paly's badminton team to one of its best seasons in years, including successful showings at the California Interscholastic Federation Northern California Tournament over the weekend.\r\n\r\nChau and senior Eric Chiang placed third in the boys’ double division at CIF-Norcal in San Jose, according to Chau. Senior Priya Misner and junior Stiglich also made it into quarterfinals before falling to a team from Carlmont. Chau and Chiang were seeded third heading into Saturday’s tournament after placing second at Central Coast Section finals and first at Santa Clara Valley Athletic League, according to Chau.\r\n\r\n<strong>Michael Chau: Leader by example\r\n<\/strong>\r\n\r\nChau joined the Vikings this year and quickly helped lead the team to victory. Currently, he is ranked 32nd in the Under-19 age group for Boys' Singles. To be nationally ranked, players must compete in many USA Badminton tournaments. At his peak, Chau was ranked 19th in the nation is his age group playing Boys' Singles.\r\n\r\nChau's mother introduced him to the sport at the age of eight, hoping that he would play a sport that he could not get injured in. Having fallen in love with the sport, Chau has spent the last eight years practicing and honing his technique. He hopes to follow his passion and continue badminton far into the future.\r\n\r\n“My ultimate goal is to go to the Olympics, but I do not really know if that will happen,” Chau said. “It seems really far away, but you have to dream to keep going.”\r\n\r\nBeyond the national tournaments and Olympic dream, Chau has found his spot on Paly’s badminton team. According to assistant coach Arne Lim, he was able to carry the team’s spirit and boost its moral.\r\n\r\n“Michael did not win every single time, yet every time he played, everyone watched him,” Lim said. “We usually tried to set his match early in the tournament so it [his match] sets the tone for the team, because when he won, everyone said, ‘Okay, we can do this.’”\r\n\r\nChau’s talent is well known throughout the team and many members value his expertise.\r\n\r\n“He is kind of a team leader without a title,” Lim said. “He leads through example and skill. He is a nice guy and a very good team player as well.”\r\n\r\n<strong>Flavia Stiglich: Leader by teaching\r\n<\/strong>\r\n\r\nThe Vikings also saw the addition of member Flavia Stiglich, who moved from Peru in December 2015. Although she no longer practices with the Peruvian National Badminton Team, she still represents Peru in international competition, including the Pan American Junior Competition, which she has competed in since 2011, and the World Junior Championships, which she competed in since 2015. Stiglich also represents her country at many Southern American tournaments and has been doing so since 2011.\r\n\r\n“The best feeling is when I compete with other countries and compete for my country,” Stiglich said. “Because then, you are no longer playing for yourself, but also for your country. When you win something, you are serving something bigger than yourself, and that feeling is something I just cannot describe.”\r\n\r\nStiglich first started badminton at the age of 10, and after two years of practice, she decided to try out for the national badminton team in 2011. At first glance, it seems as though Stiglich’s path has been relatively smooth, reaching national success after two years. However, Stiglich has had to overcome many barriers, the biggest being herself.\r\n\r\n“Before the qualification for the World Junior Championships in 2015, I played a tournament to qualify to the 2015 South American Tournament and did not do as well as expected,” Stiglich said. “My mental game was off ... so my game was not the level it should have been. During the time between the South American and Worlds qualifications, I had a tough time thinking that I was not going to make it to Worlds and that I was not good enough.”\r\n\r\nStiglich admits that she thought about quitting badminton but ultimately decided to continue working towards her goal.\r\n\r\n“I learned to never give up on my dreams,” Stiglich said. “After working on my mental strength and confidence, I was able to overcome all the negative thoughts. When the World Junior Championship qualification tournament came around, I was ready to do my best and qualified to represent my country at the championships.”\r\n\r\nLike Chau, Stiglich found her place on the team and soon became a valuable leader on and off the court.\r\n\r\n“She is willing to teach others who are willing to listen,” Lim said. “She is willing to take some time to root them on, to be part of the team and really support the women who are on our team. People like her a lot and she has got a wonderful personality. She has a very strong charisma that is poised and confident while not overbearing. ... She leads by her knowledge and help.”\r\n\r\nWith Chau and Stiglich at the helm, the team will already have a strong start by the time the spring badminton season rolls around, despite assistant coach Arne Lim leaving.\r\n\r\n“We expect to have a great season next year,” Lim said. “Flavia is only a junior and Michael is only a sophomore, so they will be playing for us next year as well. We also have some people who are returning next year who took this year off, which will add to our team. It will be a season to watch out for.”","excerpt":"Although they may not always train or play together, sophomore Michael Chau and junior Flavia Stiglich are connected by a deeper bond – their love for badminton.","date":"2016-05-26 22:31:03","author":"Julia Qiao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Flavia-and-michael.jpg","categories":["A&amp;E Section Spotlight","Badminton","Features","Sports","Spotlight"],"tags":["#norcal","Arne Lim","badminton","CIF-Norcal","Flavia Stiglich","Michael Chau","paly","season recap","states"]},{"id":120671,"title":"School board representatives to obtain preferential vote","permalink":"http:\/\/palyvoice.com\/2016\/05\/26\/school-board-representatives-to-obtain-preferential-vote\/","content":"Pending approval at a meeting in June, Board of Education student representatives will cast preferential votes during Palo Alto Unified School District board meetings starting next school year.\r\n\r\nAccording to Supt. Max McGee, the policy will be approved at the final board meeting of the school year on June 22, and representatives will begin casting preferential votes in the first board meeting of the next school year. The vote will be in response to a successful student petition calling for preferential votes, which received the required 400 signatures.\r\n\r\nUnlike the votes that school board members cast, preferential votes are not included in the vote counts. However, the votes are recorded in the minutes and allow student representatives to take an official stance on issues.\r\n\r\nJunior Gunn High School school board representative Ankit Ranjan said the preferential votes will increase transparency and avoid any miscommunication between the board and the student body.\r\n\r\n\"[Junior school board representative] David [Tayeri] and I both care about increasing student involvement in district decision-making, and this is a great step toward that goal,\" Ranjan said. \"It allows us to take an unequivocal stance on issues and limit misinterpretation.\"\r\n\r\nTayeri and Ranjan created the petition calling for preferential votes, which the board is required to accept with support from over 10 percent of the high school population under <a href=\"http:\/\/www.leginfo.ca.gov\/cgi-bin\/displaycode?section=edc&amp;group=35001-36000&amp;file=35010-35012\" target=\"_blank\">California Education Code 35012<\/a>.\r\n\r\nAccording to Ranjan, the petition easily received support from students, as well as community members.\r\n\r\n\"It was just waiting to happen,\" Ranjan said. \"Students generally supported the idea of improved student voice, board members were not opposed and there is legal basis.\"\r\n\r\nMcGee said the change to allow preferential votes is a huge step to advance student voice, but sees the potential for more improvement.\r\n\r\n\"I think we can still do much more regarding student voice being heard,\" McGee said. \"I have some more plans that I will be sharing at our board retreat in June and announcing in August. One will be a student advisory board and one will be a variation on the policy commonly called 'Open Door' to an open outdoor one [office].\"\r\n\r\nTo ensure the preferential votes are representative of the entire student body, Tayeri said he plans to encourage student involvement and communication.\r\n\r\n\"I strongly encourage students to attend school board meetings,\" Tayeri said. \"When students become more informed about the nature of the meetings and the issues being discussed, they can better take part in the discussion about where my vote will go. I also encourage anyone with a question about a school board decision or upcoming ballot measure to contact me anytime.\"","excerpt":"Student school board representatives will cast preferential votes during board meetings starting next school year.","date":"2016-05-26 20:51:35","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/IMG_5454.jpg","categories":["Editor's Pick","News"],"tags":["McGee","preferential","School Board","school representative","student","vote"]},{"id":120718,"title":"Baseball season yields familiar results","permalink":"http:\/\/palyvoice.com\/2016\/05\/26\/baseball-season-yields-familiar-results\/","content":"[caption id=\"attachment_121096\" align=\"alignnone\" width=\"499\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/baseballlast.jpg\"><img class=\"size-full wp-image-121096\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/baseballlast.jpg\" alt=\"Senior Alec Olmsted throws a fastball to a Los Gatos hitter. Olmstead pitched four innings and gave up three earned runs during a regular season home game. Photo by Cooper Lou.\" width=\"499\" height=\"379\" \/><\/a> Senior Alec Olmsted throws a fastball to a Los Gatos hitter. Olmstead pitched four innings and gave up three earned runs during a regular season home game. Photo by Cooper Lou.[\/caption]\r\n\r\nThe Palo Alto High School baseball team's (23-6-1, 12-2) season came to a close after a, 2-0, loss to Valley Christian High School (16-15, 6-8) in the first round of the Central Coast Section playoff on Thursday, despite holding the No.1 seed.\r\n\r\nThe Vikings suffered a similar loss to Carlmont High School during the 2014-2015 season in the first round of CCS.\r\n\r\nAlthough the Vikings ended up in the same position as last year, the <a href=\"http:\/\/paly.io\/v\/120542\">Vikings captured the Santa Clara Athletic League title<\/a> which capped off another incredible season for the team.\r\n\r\nAccording to junior pitcher Ryan Chang, the team is happy with its success throughout the season, regardless of the loss in CCS.\r\n\r\n\"Anytime you win the league it's a satisfying feeling,\" Chang said. \"It was disappointing getting knocked out of CCS so early, but it doesn't take away from the success we had prior.\"\r\n\r\nSenior ace Justin Hull said he will miss playing for Paly and that the team will succeed with the absence of the graduating seniors.\r\n\r\n\"I'll miss everything about it [the team], but specifically will miss talking with all the guys during practice,\" Hull said. \"I think the team will do just fine next year. They've got plenty of players to replace the ones they're losing and have a number of good JV players who will get some time.\"\r\n\r\nRegarding the future season, sophomore division one baseball commit Max Jung-Goldberg said the Vikings will look to underclassmen to fill some of the roles of the graduating seniors.\r\n\r\n\"Next year we are going to be a young team,\" Jung-Goldberg said. \"But I think that a lot of the underclassmen will be able to step up and fill the roles that the seniors played this year.\"\r\n\r\nAccording to maxpreps.com, a high school sports website, individual highlights include Hull, who led the De Anza League in runs on offense and batters struck out, and second best earned run average on defense. Additionally, junior center fielder Ben Cleasby led the league in runs batted in.\r\n\r\nThe team will also greatly miss the production of six seniors: Hull, Riley Schoeben, Albert Han, Laurence Han, Owen Plambeck, and Alec Olmstead.","excerpt":"The Palo Alto High School baseball team's (23-6-1, 12-2) season came to a close after a loss to Valley Christian High School (16-15, 6-8) in the first round of the Central Coast Section playoff on Thursday, despite holding the number one seed. ","date":"2016-05-26 20:19:44","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/I9P85543.jpg","categories":["Baseball","Sports Recap","Uncategorized"],"tags":["Baseball","Chang","christian","ending","high school","Jung-Goldberg","paly","recap","seniors","valley","vikings"]}]