[{"id":126845,"title":"Mitchell Park Library to host annual Finals Cram Slams","permalink":"http:\/\/palyvoice.com\/2016\/12\/08\/mitchell-park-library-to-host-annual-finals-cram-slams\/","content":"[caption id=\"attachment_73573\" align=\"alignnone\" width=\"490\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_0793.jpg\"><img class=\" wp-image-73573\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_0793.jpg\" alt=\"The Mitchell Park Library is one of the three main libraries in Palo Alto Photos by William Zhou.\" width=\"490\" height=\"368\" \/><\/a> Breathtaking view of Mitchell Park Library's main building during the first year of its opening, illustrating the large capacity it can withstand. Photo: William Zhou.[\/caption]\r\n\r\nThe Mitchell Park Library will host several high school study sessions known as the 'Finals Cram Slams,' which are open to students who are looking for a place to study with their peers.\r\n\r\nThis will happen on Monday, Dec. 12 and Tuesday, Dec. 13. both from 6pm to 9pm,\r\n\r\nAccording to the City of Palo Alto <a href=\"http:\/\/www.cityofpaloalto.org\/news\/displaynews.asp?NewsID=3147&amp;TargetID=140\">website<\/a>, Mitchell Park Library personnel will, “provide snacks and activities to de-stress in between studying including visits from therapy dogs.”\r\n\r\nThe Palo Alto community suggests that the Mitchell Park Library aims to provide a welcoming place for students to study and help decrease stress during this anxious time of the year.\r\n\r\nPalo Alto High School junior Rahul Sankar expressed excitement towards this opportunity.\r\n\r\n\"I'm going to the Finals Cram Slam because a lot of my friends are going and it will be a great opportunity to ask them questions,\" Sankar said. \"It should be a good time.\"\r\n\r\nOther options to find a quiet place to study are the Downtown Palo Alto <a href=\"http:\/\/www.cityofpaloalto.org\/gov\/topics\/projects\/facilities\/library\/downtown.asp\">Library<\/a> and Rinconada <a href=\"http:\/\/www.cityofpaloalto.org\/gov\/depts\/lib\/branches\/rinconada.asp\">Library<\/a>. Described in both libraries websites, they will provide students with materials such as textbooks and note cards.\r\n\r\nAccording to the City of Palo Alto website, students wishing to participate in these activities must bring a valid high school ID.\r\n<ul>\r\n\t<li><strong>Mitchell Park Library<\/strong><\/li>\r\n<\/ul>\r\n<strong>3700 Middlefield Rd, Palo Alto, CA 94303<\/strong>\r\n<ul>\r\n\t<li><b>Downtown Palo Alto Library<\/b><\/li>\r\n<\/ul>\r\n<strong>270 Forest Ave, Palo Alto, CA 94301<\/strong>\r\n<ul>\r\n\t<li><strong>Rinconada Library <\/strong><\/li>\r\n<\/ul>\r\n<strong>1213 Newell Rd, Palo Alto, CA 94303<\/strong>","excerpt":"The Mitchell Park Library will host several high school studying sessions known as the 'Finals Cram Slams', which are open to students who are looking for a place to study with their peers. This will happen at 6 p.m. to 9 p.m., on Monday, Dec. 12 and Tuesday, Dec. 13.","date":"2016-12-08 22:52:06","author":"Bradley Smith","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_0793.jpg","categories":["News","Spotlight"],"tags":["finals","Food","friends","mitchell park","studying","therapy dogs"]},{"id":127134,"title":"Boys&#8217; soccer to face Burlingame in preseason game","permalink":"http:\/\/palyvoice.com\/2016\/12\/08\/boys-soccer-to-face-burlingame-in-preseason-game\/","content":"[caption id=\"attachment_127135\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/jackstoksikvsMA.jpg\"><img class=\"size-full wp-image-127135\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/jackstoksikvsMA.jpg\" alt=\"Senior center midfielder Charles Stoksik sprints to intercept a lofty pass during a preseason matchup against Menlo-Atherton on Dec. 6 at Paly.\" width=\"600\" height=\"533\" \/><\/a> Senior center midfielder Charles Stoksik sprints to intercept a lofty pass during a preseason matchup against Menlo-Atherton High School on Dec. 6 at Palo Alto High School. Paly won the match by a score of 1-0. Photo: Julia Qiao.[\/caption]\r\n\r\nSenior center back and captain Neil Verwillow embraced his joyous teammates in celebration with an undeniable grin after scoring the first goal against Menlo-Atherton High School on Tuesday. It had only been five minutes into the first half, but the Palo Alto High School boys’ soccer team (4-0, 0-0) was suddenly in charge of the game with a one-goal lead. The game would end without any additional goals from either team, but Verwillow’s early goal was enough to extend the Vikings’ perfect record to four wins.\r\n\r\n<span style=\"font-weight: 400;\">After the 1-0 victory against Menlo-Atherton, the Paly boys’ soccer team envisions continuing its undefeated preseason record against Burlingame High School at 6 p.m. today at home. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Verwillow, the Vikings feel ready for the upcoming match.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The game for today shouldn't be anything too challenging,” Verwillow said. “We are just coming off a win versus Menlo-Atherton, which is a CCS [Central Coast Section] caliber team every year. So while I can't say for certain how good Burlingame is, I'll be disappointed if we can't pull out a win.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior midfielder and captain Derek Schoenberger agreed with Verwillow’s expectations despite his lack of experience playing against Burlingame.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I'm looking forward to the game today,” Schoenberger said. “I've never played Burlingame before in all four years at Paly, so it's going to nice to see how well we can compete with a team we have no expectations for.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior midfielder Ethan Ho said he believes that a key aspect to the team's early success is warmly welcoming the underclassmen as part of the team.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“With the influx of new sophomores on the team, I think the chemistry in the team is surprisingly good, but this might be partially due to the fact that a lot of us all play on the same club team,” Ho said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior left midfielder Yahli Malchin also credited the team's sterling chemistry due to their comradery formed through outside club teams. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We have a lot of guys from the same club team so we're already really close from that and we play well together,” Malchin said. “Everyone has fun playing together and our chemistry is getting better each game.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Vikings prepared for this game the same way they have prepared for all their previous games, according to Schoenberger.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"We haven't prepared for this game any different than the previous games,” Schoenberger said. “Like every game, all players are expected to be ready to step onto the field and fight to the last minute for the win. This idea doesn't change depending on what team we're playing, so our approach to every game shouldn't change as well.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior center midfielder Charles Stoksik echoed Schoenberger on the tactics to approaching the game.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We haven't done anything too special to prepare,” Stoksik said. “We had a tough and very physical game the day before, so we took it easy in practice by working on the fundamentals and finishing.”<\/span>","excerpt":"After a 1-0 victory against Menlo-Atherton, the Paly boys’ soccer team envisions to continue its undefeated preseason record against Burlingame High School at 6 p.m. today at home.","date":"2016-12-08 17:29:28","author":"Sam Lee","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/jackstoksikvsMA.jpg","categories":["Sports"],"tags":["Boys","burlingame","captain","charles stoksik","derek schoenberger","ethan ho","neil verwillow","preseason","preview","Soccer","sports","yahli malchin"]},{"id":126841,"title":"Girls&#8217; soccer to play Gunn in preseason match","permalink":"http:\/\/palyvoice.com\/2016\/12\/08\/girls-soccer-to-play-gunn-in-preseason-match\/","content":"[caption id=\"attachment_127006\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/girls-soccer-pic-vs-gunn.jpg\"><img class=\"size-full wp-image-127006\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/girls-soccer-pic-vs-gunn.jpg\" alt=\"Sophomore forward Mia Zenger dribbles past Gunn defenders last Thursday during a preseason match at Gunn. Photo by Rachel Code.\" width=\"600\" height=\"554\" \/><\/a> Sophomore forward Mia Zenger dribbles past Gunn defenders last Thursday during a preseason match at Gunn. Photo by Rachel Code.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto High School girls’ soccer team (1-0, 0-0) will face off against the Gunn High School Titans (0-1, 0-0) for its second preseason match at 6 p.m. today at the Gunn soccer field.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">After a 3-0 victory against Woodside High School on Monday, Paly hopes to win its second consecutive game and continue a winning preseason record, according to senior midfielder Tess Preising. The Vikings played a strong match despite the loss of significant seniors from last year, including current UCLA freshman star, Jacey Pederson.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I think the team is going to focus on advancing our play throughout the season,” Preising said. “We lost a lot of key players but I think we came out really strong yesterday and I hope we can carry that out through the season.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Although today’s game is merely a preseason match, senior defender Lauola Amanoni anticipates a spirited competition due to the cross-town rivalry between the two teams.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Gunn and Paly is the best rivalry in Palo Alto, and it is always a fun game to watch and play,” Amanoni said. “So far though, Paly has gotten the best of Gunn in the recent years we have played them.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Junior midfielder Emily Tomz echoed the competition that comes with playing a rival.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I definitely think there will be a competitive spirit at the game this Thursday against Gunn,” Tomz said. “Although it is a preseason match and they are not in our league, every game counts, and there is a historical Gunn-Paly rivalry that will make this game intense and exciting. Also, the boys soccer team will be there cheering us on, so it's good to know we will have a lot of support from the stands this game.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to senior midfielder Talia Malchin, the Vikings will take this opportunity to display their newly developed talent during the match and to test the team chemistry. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We are really trying to figure out how to play as a team and I think the game versus Gunn will be a great opportunity to do so,” Malchin said. “We haven’t had very much time to practice in game situations, so the game will be a good time to get down chemistry. We know how Gunn plays because we’ve played them before, so I think our focus will be on team play. Organization and communication will be a priority.”<\/span>","excerpt":"The Palo Alto High School girls’ soccer team (1-0, 0-0) will face off against the Gunn High School Titans (0-1, 0-0) for its second preseason match at 6 p.m. today at the Gunn soccer field.","date":"2016-12-08 10:54:40","author":"Sam Lee","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/girls-soccer-pic-vs-gunn.jpg","categories":["Uncategorized"],"tags":["Boys and Girls","emily tomz","girls","gunn","Lauola Amonani","paly","preseason","Soccer","talia malchin","Tess Preising","titans","vikings"]},{"id":126863,"title":"Freshman stands out in girls&#8217; soccer victory against rivals","permalink":"http:\/\/palyvoice.com\/2016\/12\/08\/freshman-stands-out-in-girls-soccer-victory-against-rivals\/","content":"[caption id=\"attachment_127004\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/emily-tomz-2.jpg\"><img class=\"size-full wp-image-127004\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/emily-tomz-2.jpg\" alt=\"Junior midfielder gets ready to take a corner kick against Gunn last Thursday during the second half of an away preseason match. Senior Tess Preising converted the goal off Tomz' cross. Photo by Rachel Code.\" width=\"600\" height=\"520\" \/><\/a> Paly junior midfielder Emily Tomz gets ready to take a corner kick against Gunn last Thursday during the second half of an away preseason match. Senior Tess Preising converted the goal off Tomz' cross. Photo by Rachel Code.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Senior midfielder Tess Preising broke out in cold sweat as she sprinted down the middle of the pitch, her exhalation visible in the 48-degree weather on Thursday night. She dribbled deftly past multiple Gunn High School defenders, using her foot skills to advance towards the goal. Preising looked up just in time to see freshman Chloe Japic making a cut and passed a leading ball to her. Japic took a few small touches and wound up a shot at the goal. Needless to say, she took care of the rest.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Japic’s goal asserted the Palo Alto High School (4-0, 0-0)  girls’ soccer team’s dominance in the first half, giving the Vikings a 1-0 lead against the Titans (1-2-1, 0-0) at the Gunn field last Thursday night. Preising later scored a goal off a header from a corner kick by junior Emily Tomz in the second half, extending Paly’s lead to 2-0. Gunn made a late goal, but it was not enough to make a comeback, and the game ended with a score of 2-1.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Preising, playing against Gunn was an exciting matchup, despite the game being part of the preseason schedule.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Playing Gunn is always fun and it's always been a good experience,” Preising said. “I love playing them [Titans], and I am definitely glad to take part in this rivalry.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Paly girls' soccer coach Jon Seedman expressed his opinion on the competition between Paly and Gunn.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Gunn always gives us their best shot,” Seedman said. “I think if Gunn goes through its season and loses every game but beats Paly, that is a successful season for them. You can definitely see it in their [Gunn players’] eyes and with the way they played. They were extremely pumped up. If you looked at the faces of the winning team and losing team and didn’t know who won, you would've thought the opposite way. They were so happy that they had given us a battle. It's not that much of a rivalry for us as much as it is for them.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Preising said while playing the game, she observed what the team needs to work on for the future.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I thought we would score more goals because we kept possession in their attacking third quite often and we took a lot of shots,” Preising said. “The team dynamic isn’t as great as it needs to be but I think the team looks forward to improving that. We definitely need to work on shooting. We had multiple opportunities for easy shots but we chose to pass instead. We don’t have many players who like to shoot so that is something we need to work on as a team.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">However, Preising believes that the struggles will sort itself out through practice and as the season develops.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Seedman also commented that the team can work to build its chemistry with the younger players on the team.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“They are great socially but when we’re playing, we’ve got a long way to go,” Seedman said. “Chloe [Japic] really played well and scored our first goal. She made a lot of other good plays but she needs to figure out the way we play as a team, but that will come.”<\/span>","excerpt":"The Palo Alto High School girls' soccer team (4-0, 0-0) beat the Gunn High School Titans (0-2-1, 0-0) last Thursday night at Gunn by a score of 2-1.","date":"2016-12-08 09:31:55","author":"Sam Lee","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/emily-tomz-2.jpg","categories":["Sports"],"tags":["chloe japic","emily tomz","freshman","gunn","Jon Seedman","paly","preseason","recap","Tess Preising","titans","vikings","win"]},{"id":126955,"title":"Boys&#8217; soccer defeats Menlo-Atherton in tight match","permalink":"http:\/\/palyvoice.com\/2016\/12\/08\/boys-soccer-defeats-menlo-atherton-in-tight-match\/","content":"[caption id=\"attachment_127022\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/DSC_0170.jpg\"><img class=\"wp-image-127022\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/DSC_0170.jpg\" alt=\"DSC_0170\" width=\"600\" height=\"400\" \/><\/a> Palo Alto High School senior Charles Stoksik races against a Menlo-Atherton player, trying to keep the ball away from the Viking's goal on Tuesday at Paly. The Palo Alto High School boys' soccer team defended their early lead in a close match, winning the game 1-0. Photo: Annika Behal.[\/caption]\r\n\r\nFighting to defend an early lead, the Palo Alto High School boys’ soccer team (5-0-0, 0-0-0) triumphed in a close match, taking down Menlo-Atherton High School (1-1-1, 0-0-0) with a score of 1-0, yesterday at Paly in a preseason match.\r\n\r\nViking senior captain and center defender Neil Verwillow scored the only goal of the game within the first five minutes of play. He later injured his neck after colliding with a Menlo-Atherton player's shoulder. However, after sitting out for a while, he substituted in and made several key plays during the second half.\r\n\r\nHis teammate, sophomore outside midfielder Kenzo Morabia nearly scored another goal, but it was not counted as he was ruled offsides. Senior captain Derek Schoenberger also made an attempt to score during the second quarter, but was thwarted by Menlo-Atherton’s goal keeper. Despite an aggressive first half, the Vikings tapered off at the end of the first half of the game, working to preserve their lead.\r\n\r\n\"During the first half we were very aggressive offensively and we attacked hard, especially in the first 20 or so minutes when we got the goal,\" senior Yahli Malchin said. \"After that we kind of dropped back and tried to defend the lead, so the second half was more conservative than the first.\"\r\n\r\nDuring the second half, Schoenberger received a yellow card after tripping a Menlo-Atherton player and thus conceding a free kick. However, the Vikings easily blocked the strike, and the close match continued, with both sides continuously trading possession.\r\n\r\nIn the last two minutes of the game, senior Charles Stoksik also received a yellow card, but quickly returned to the game.\r\n\r\n\"Defensively we felt very solid despite a few close calls, and offensively we did definitely lack a bit,\" Verwillow said. \"We put [senior] Michel Ange Siaba, who usually plays forward for us, [as goal] keeper ... just to ensure we didn't make any mistakes back there, [since] he is a great keeper.\"\r\n\r\nSenior goal keeper Michel Ange Siaba made multiple saves during the game. He and the Vikings' defense worked hard to stave off any further attempts by Menlo-Atherton to score.\r\n\r\nDespite a scoreless second half, Siaba believes his team played well.\r\n\r\n“This was one of those games that tells us will happen at CCS [Central Coast Sectionals playoffs], because MA [Menlo-Atherton] is one of those teams that always makes it to CCS,” Siaba said. “There is a good chance that once we go to CCS, we would have to play them, and this was a good determinant of how it is going to be.”\r\n\r\nVerwillow agreed stating that winning this game was a taste of the competition during CCS.\r\n\r\n\"That was a tough team, ... so it [was] a good check to see how we will be able to compete come the end of the season,\" he said. \"I was satisfied with how we played, mostly just glad to get the win.\"\r\n\r\nThe team's next game will be at 6 p.m. tomorrow at Paly against Burlingame High School.","excerpt":"As the clock ticked down, players raced down the field, one trying to keep the ball, the other looking for a moment of weakness to steal it. Fighting to defend its early lead, the Palo Alto High School boys’ soccer team (5-0-0, 0-0-0) triumphed in a close match, taking down Menlo-Atherton High School (1-1-1, 0-0-0) with a score of 1-0 today at Paly in a preseason match.","date":"2016-12-08 08:21:09","author":"Julia Qiao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/DSC_00961.jpg","categories":["Sports","Uncategorized"],"tags":["boys soccer","charles stoksik","derek schoenberger","kenzo m","michel-ange siaba","neil","neil verwillow","paly","varsity soccer"]},{"id":126927,"title":"Thursday&#8217;s blood drive donation slots filled to capacity","permalink":"http:\/\/palyvoice.com\/2016\/12\/07\/thursdays-blood-drive-donation-slots-filled-to-capacity\/","content":"<span style=\"font-family: Georgia, Palatino;\">Organizers of <span style=\"color: #45494d;\">Palo Alto High School’s American Red Cross Club’s blood drive, taking place <span class=\"aBn\" tabindex=\"0\" data-term=\"goog_452565514\"><span class=\"aQJ\">this Thursday<\/span><\/span> in the Library Resource Center, are suggesting donors schedule visits to the Stanford Blood Center after slots at the Paly event filled up ahead of schedule.<\/span><\/span>\r\n\r\n<span style=\"font-family: Georgia, Palatino;\">According to club president senior Celia Willner, there are not enough Red Cross volunteers to accommodate all of the students that want to donate blood.<\/span>\r\n\r\n<span style=\"font-family: Georgia, Palatino;\">\"The American Red Cross Foundation only needed 35 units of blood, which is equal to approximately 50 student blood donations,\" Willner said. \"Unfortunately, that means that a lot of students interested in donating their blood will not get a chance to do so.\"<\/span>\r\n\r\n<span style=\"font-family: Georgia, Palatino;\">Senior Avanika Narayan expressed frustration at not being able to donate blood.<\/span>\r\n\r\n<span style=\"font-family: Georgia, Palatino;\">\"I was really disappointed when I found out that there were no more slots open for Thursday's blood drive because I’ve always wanted to donate blood,\" Narayan said. \"I decided to make an appointment at the <a href=\"http:\/\/bloodcenter.stanford.edu\/donate\/appointment.php\">Stanford Blood Center<\/a> to donate blood, and I encourage any other interested students to do the same.\"<\/span>\r\n\r\n<span style=\"font-family: Georgia, Palatino;\">Junior Annie Zhou, one of the few students who managed to secure a donation slot, looks forward to making her first blood donation.<\/span>\r\n\r\n<span style=\"font-family: Georgia, Palatino;\">“I signed up to donate blood because it is an easy way to help people in need,\" Zhou said. \"I would like to think that a little pain on my end can end up saving someone else's life.\"<\/span>\r\n\r\n<span style=\"font-family: Georgia, Palatino;\">Willner hopes to hold more blood drives in the future.<\/span>\r\n\r\n<span style=\"font-family: Georgia, Palatino;\">\"Knowing now just how many students are interested in participating in the blood drive, the Red Cross Club hopes to host another blood drive this Spring to give more students a chance to donate their blood,\" Wilner said.<\/span>\r\n\r\n<span style=\"font-family: Georgia, Palatino;\">According to Willner, students that signed up to donate blood should look at the American Red Cross Foundation's <a href=\"http:\/\/www.redcrossblood.org\/donating-blood\/tips-successful-donation\">website<\/a> for tips on how to make a successful donation.<\/span>\r\n\r\n<span style=\"font-family: Georgia, Palatino;\">For more information on donating blood call 1-800-RED-CROSS or visit Red Cross' <a href=\"http:\/\/www.redcrossblood.org\/\">website<\/a>.<\/span>","excerpt":"Palo Alto High School’s American Red Cross Club will host a blood drive on Thursday, Dec. 8, giving students an opportunity to donate blood.","date":"2016-12-07 20:27:25","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15416075_1293420087399164_261694906_n.jpg","categories":["News"],"tags":["blood drive","celia","donate","red cross","red cross club","wilner"]},{"id":126715,"title":"Little ones in the big leagues: Freshmen on winter varsity teams","permalink":"http:\/\/palyvoice.com\/2016\/12\/06\/little-ones-in-the-big-leagues-freshmen-on-winter-varsity-teams\/","content":"<span style=\"font-weight: 400;\">Palo Alto High School varsity sports are known for being competitive. Athletes who participate in varsity sports are often upperclassmen, though a few younger students are able to make the cut. Sometimes even freshmen get to compete at the varsity level. This winter, there are three.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Read more to find out who they are and what they do.<\/span>\r\n\r\n<b>Sofie Vogel<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Freshman Sofie Vogel is a forward on the Palo Alto High School girls’ soccer team. Girls’ soccer has won its first three preseason games.<\/span>\r\n\r\n[caption id=\"attachment_126742\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/DSC_00471.jpg\"><img class=\"size-full wp-image-126742\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/DSC_00471.jpg\" alt=\"Freshman Sofie Vogel is a first-year Varisty girls' soccer player. Photo: Emma van der Veen.\" width=\"600\" height=\"400\" \/><\/a> Freshman Sofie Vogel, a first-year varsity girls' soccer player. Photo: Emma van der Veen.[\/caption]\r\n\r\n<b>PV: How did you start playing soccer?<\/b>\r\n\r\nSV: I started on AYSO [American Youth Soccer Organization] like most people do. My parents put me in a lot of sports when I was younger, and I stuck to soccer because I liked it a lot more than the others.\r\n\r\n<b>PV: How is playing varsity similar or different to your past experiences?<\/b>\r\n\r\nSV: Varsity is similar to my club experiences because I already play up one year [with girls one year older]. I don't really see the girls on my club team outside of soccer, so it's different playing for a school team because you get to see the people on your team all the time.\r\n\r\n<b>PV: What’s the hardest thing about being a freshman on varsity?<\/b>\r\n\r\nSV: Since we're [Chloe and I are] the youngest, everyone [else] has already had experience and played together for a year, so it's hard being the newest.\r\n\r\n<b>PV: What’s your favorite thing to do outside of soccer?<\/b>\r\n\r\nSV: My favorite thing [outside of soccer] would be to either read or draw.\r\n\r\n<b>PV: What are your goals for this season? For the next four years?<\/b>\r\n\r\nSV: For this season, I want to just try my best. For the next four years, I want to improve and keep getting better.\r\n\r\n&nbsp;\r\n\r\n<b>Chloe Japić<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Freshman Chloe Japić is a midfielder on the Palo Alto High School girls’ soccer team.<\/span>\r\n\r\n[caption id=\"attachment_126743\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/DSC_0051.jpg\"><img class=\"wp-image-126743 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/DSC_0051.jpg\" alt=\"Freshman Chloe Japic is a first-year Varisty girls' soccer player. Photo: Emma van der Veen.\" width=\"600\" height=\"400\" \/><\/a> Freshman Chloe Japić, a first-year varsity girls' soccer player. Photo: Emma van der Veen.[\/caption]\r\n\r\n<b>PV: How did you start playing soccer?<\/b>\r\n\r\nCJ: I started with Kidz Love Soccer and then played AYSO. Right now I'm playing in NPL [National Premier League] on two different teams. I play one year up and I also play four years up.\r\n\r\n<b>PV: How is playing varsity similar or different to your past experiences?<\/b>\r\n\r\nCJ: Playing varsity is similar to my club team because I've played four years up before, so I'm used to being the youngest on the team. The environment is different because club is known for being a little more intense, so it's nice to come to Varsity and breathe a little bit.\r\n\r\n<b>PV: What’s the hardest thing about being a freshman on varsity?<\/b>\r\n\r\nCJ: The hardest thing is getting to know everyone socially and on the field, since we don't really know anybody yet.\r\n\r\n<b>PV: What are your goals for this season?<\/b>\r\n\r\nCJ: I want to score as much as possible and impact the team. I don't want to just be the standby freshman. My club is becoming an academy which means I won't be able to play after this year, so I have to pack the whole experience into one year.\r\n\r\n<b>PV: What are you most excited about for this season?<\/b>\r\n\r\nCJ: I am excited to do something I love with people who love it too.\r\n\r\n&nbsp;\r\n\r\n<b>Grace Thayer<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Freshman Grace Thayer is a center on the Palo Alto High School girls’ basketball team.<\/span>\r\n\r\n[caption id=\"attachment_126826\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/DSC_0035.jpg\"><img class=\"size-full wp-image-126826\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/DSC_0035.jpg\" alt=\"Freshman Grace Thayer ...... Photo: Emma van der Veen.\" width=\"600\" height=\"400\" \/><\/a> Freshman Grace Thayer, a first-year varsity girls' basketball player. Photo: Emma van der Veen.[\/caption]\r\n\r\n<b>PV: How long have you been playing basketball?<\/b>\r\n\r\nGT: Ever since I was really little I played, but I stopped in seventh grade because I had too many injuries. I am just starting again this year.\r\n\r\n<b>PV: How did you start playing basketball?<\/b>\r\n\r\nGT: My parents were always into making us [my siblings and me] play sports and making us go out there and be teammates. I started because my dad pushed me into it, and I just kept with it because I liked it.\r\n\r\n<b>PV: How is playing varsity similar or different to your past experiences?<\/b>\r\n\r\nGT: My past experiences have varied a lot. I've played on AAU [Amateur Athletic Union], with boys on AAU, in middle school with some interesting coaching. This year, there's a really great coach and group of girls who really support you and know what they're doing.\r\n\r\n<b>PV: What is your favorite thing about being on the team?<\/b>\r\n\r\nGT: The best thing is definitely being with the girls because they're so nice. It's really great playing with them because they're so much better than what I'm used to.\r\n\r\n<b>PV: What’s the hardest thing about being a freshman on varsity?<\/b>\r\n\r\nGT: There's a lot of jokes like \"We have a freshman now, she can carry the stuff in,\" but it's all funny.\r\n\r\n<b>PV: What’s your favorite thing to do outside of basketball?<\/b>\r\n\r\nGT: I'm really into volleyball because when I was injured I had to find another sport to play, so I went into volleyball. Right now I'm doing club [volleyball] and [Paly] basketball.\r\n\r\n<b>PV: What are your goals for this season? For the next four years?<\/b>\r\n\r\nGT: I know that last year we won CCS [Central Coast Section playoffs] and that a lot of seniors graduated, so I don't want to let down the team or anything like that. I want to help us go as far as we can. For the future, I want to stay playing basketball with these girls.","excerpt":"Palo Alto High School varsity sports are known for being competitive. Athletes who participate in varsity sports are often upperclassmen, though a few younger students are able to make the cut. Sometimes even freshmen get to compete at the varsity level. This winter, there are three.","date":"2016-12-06 23:27:09","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/DSC_0035.jpg","categories":["Features","Sports","Spotlight"],"tags":["athletics","basketball","chloe japic","freshman","freshmen","girls","girls basketball","girls soccer","grace thayer","japic","palo alto high school","paly","Soccer","sofie vogel","sports","thayer","varsity","vogel"]},{"id":126529,"title":"Season Preview: Boys&#8217; soccer hopes to recreate last year&#8217;s winning streak","permalink":"http:\/\/palyvoice.com\/2016\/12\/06\/season-preview-boys-soccer-hopes-to-recreate-last-years-winning-streak\/","content":"[caption id=\"attachment_126829\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15310449_1268811903190560_598719278_n.jpg\"><img class=\"size-full wp-image-126829\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15310449_1268811903190560_598719278_n.jpg\" alt=\"Sophomore Jason Shorin chases after the ball \" width=\"600\" height=\"400\" \/><\/a> Palo Alto High School sophomore Jason Shorin, an outside midfielder, chases after the ball in a preseason match against Carlmont High School on Nov. 30. The Vikings won the game with a score of 2-1. Photo: Emma van der Veen[\/caption]\r\n\r\nAfter an undefeated regular season that ended with a devastating loss in the quarterfinals of last season's Central Coast Section playoffs, the Palo Alto High School boys' soccer team hopes to repeat last year's success and advance to the final round of CCS.\r\n\r\nThe team is optimistic about its chances to do well in CCS this season, despite losing many graduated seniors. Last year, the Vikings remained undefeated until CCS quarterfinals, where they fell, 3-2, in overtime to <a href=\"http:\/\/palyvoice.com\/2016\/02\/28\/boys-soccer-falls-to-watsonville-in-ccs-quarterfinals-ends-season-with-first-loss\/\">Watsonville High School<\/a>.\r\n\r\n“Although we lost many great seniors last year, we gained a lot more [sophomores] this year,” senior captain Derek Schoenberger said. “I'm not worried about the loss of seniors. This year, we have a group of guys that have been playing together for years and a fresh new group of underclassmen.”\r\n\r\nOne of the departed seniors included the team's goalkeeper, Eli Friedlander, leaving a large hole in the Vikings' defensive roster.\r\n\r\n“With no clear starting goalie at this point, there are a couple a good options ... but we have yet to see them in games, and it's hard to replace someone like [last year’s goalie],” senior team captain Neil Verwillow said.\r\n\r\nHowever, the Vikings have gained many new seniors,  who were inspired to join as it dawned on them this was their last year to play for Paly, according to Verwillow. Four seniors as well as five juniors and sophomores will be joining this year's roster.\r\n\r\n<span class=\"_5yl5\">\"I had played for my club team the last three years during the winter, but I decided to play [high school] soccer with my friends in my last year,\" senior Nicholas Camarena said.<\/span>\r\n\r\n“The guys coming out are very good, so if anything, I believe we have the potential to be even more competitive than last year despite the loss,” Verwillow said.\r\n\r\nVerwillow is excited for another shot at the CCS championship, and encourages student to attend the games.\r\n\r\n“It's a blast when people come out to the games and it makes us all play that much harder,” Verwillow said. “I also can't wait for another chance at CCS, no matter what it takes to get there.”\r\n\r\nBeyond doing well in CCS, the team also has goals to develop stronger team bonds.\r\n\r\n“In past years we've had great groups of individual players, but never really a strong holistic team,” Schoenberger said. “This year one thing [that] seniors are trying to change is the attitude that is carried throughout the year of not only playing lights out during games, but during practices too.”\r\n\r\nThe Vikings played their first preseason game on Nov. 21 against Mountain View, winning 3-0.\r\n\r\n“I think we played pretty well ... there is definitely lots of room for improvement,” junior Xander Sherer said. “I think it was a good opportunity for some of the new players to get a feel for varsity game play.”\r\n\r\nThe team also recently went against Milpitas High School on Nov. 29, winning, 9-0, as well as defeating Carlmont High School, 2-1, on Nov. 30.\r\n\r\nThe team's next preseason game will be at 3:30 p.m. today at home against Menlo-Atherton High School. The regular season will start Jan. 5 at an away game against Los Altos High School.","excerpt":"After an undefeated regular season that ended with a devastating loss in the quarterfinals of last season's Central Coast Section playoffs, the Palo Alto High School boys' soccer team hopes to repeat last year's success and advance to the final round of CCS.","date":"2016-12-06 09:28:09","author":"Julia Qiao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/DSC_0060.jpg","categories":["Sports","Spotlight"],"tags":["Boys","boys soccer","derek schoenberger","neil verwillow","paly","Soccer","varsity","vikings","xander sherer"]},{"id":126675,"title":"Volleyball celebrates improvement, looks to future success","permalink":"http:\/\/palyvoice.com\/2016\/12\/04\/volleyball-celebrates-improvement-looks-to-future-success\/","content":"[caption id=\"attachment_126800\" align=\"alignnone\" width=\"597\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/VB-VS-Gunn.jpg\"><img class=\" wp-image-126800\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/VB-VS-Gunn.jpg\" alt=\"Caption Caption Caption\" width=\"597\" height=\"398\" \/><\/a> The Palo Alto High School volleyball team (23-11, 11-1) huddles during a time out in its match against the Gunn High School Titans (17-14, 10-2) on Oct. 14 at the Gunn gym. According to junior outside hitter Denise Ringwalt, the team had a great season, and improved much more over the span of the season than they had in the recent past. \"Last year everyone got along but we didn't improve as much together as we did this year,\" Ringwalt said.  Photo: William Sallomi.[\/caption]\r\n\r\nThe Palo Alto High School volleyball team is celebrating  an impressive overall record of 23-11 and a successful season, which ended after a loss to the Turlock High School Bull Dogs (28-12, 10-2) the night of Nov. 16 at the Turlock gym in the first round of the Northern California playoffs.\r\n\r\nThe Vikings had a tough preseason, facing off against top level competition like the St. Ignatius College Prepatory Wildcats (32-9, 4-1) and the Valley Christian High School Warriors (28-12, 1-4). These rigorous matches served as solid preparation for the season ahead and were ultimately crucial in helping the girls acclimate to the new roster.\r\n\r\nAccording to junior outside hitter Denise Ringwalt, once the season officially began, the girls began to better combine their talents and work together.\r\n\r\n\"I think the team this year was filled with extremely talented girls that worked together better and better as the season went on,\" Ringwalt said.\r\n\r\nOnly the Los Altos High School Eagles (22-15, 7-5), out of all of the teams in the De Anza League, were able to defeat the Vikings, who finished the league with a remarkable record of 11-1.\r\n\r\nThe season had several high points, including a nail-biting match against the Eagles in which the Vikings won each set 25-22, and shattered a three-year losing streak to the Eagles.\r\n\r\nDespite having an excellent season, Los Gatos High School Wildcats (20-16, 7-5) overpowered the Vikings in the Central Coast Section championship match. According to Ringwalt, the loss was unexpected and unfortunate for the hard working Vikings, and the injury of junior outside hitter Chelsea Fan was a key factor in the defeat.\r\n\r\n\"The CCS championships was a really difficult loss,\" Ringwalt said. \"The team worked really hard, but when Chelsea got hurt, everyone kinda fell apart.\"\r\n\r\nFan said despite not making it as far as she had hoped, she is proud of the team and what it accomplished this season.\r\n\r\n\"A couple injuries toward the end made it [the season] end a little sooner than it truly should have, but overall I'm happy with how far we went this year compared to previous seasons,\" Fan said.\r\n\r\nThe Vikings must say goodbye to many talented seniors, including setters Cassie Fong and Jessica Lee, and outside hitters Fiona Green and Katie Passarello. Fan said the seniors performed well throughout the year and will be tough to replace.\r\n\r\n\"The seniors were a huge part of our team this year and they contributed a lot on the court,\" Fan said. \"Next year we'll definitely have trouble filling their spots.\"\r\n\r\nThe team as a whole displayed excellent chemistry on and off the court, which was a significant strength and advantage. According to Fan, returning Paly players built upon chemistry that they formed during the previous year.\r\n\r\n\"A lot of girls who started this year played together last season so our on-court team chemistry was great,\" Fan said.\r\n\r\nThis chemistry will play a role in the strength of the Vikings next season, who will take their experience this year and continue to work to create another high-level team.","excerpt":"The Palo Alto High School volleyball team is celebrating  an impressive overall record of 23-11 and a successful season, which ended after a loss to the Turlock High School Bull Dogs (28-12, 10-2) in the first round of the States competition.","date":"2016-12-04 20:56:31","author":"William Sallomi","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/VB-VS-Gunn.jpg","categories":["Sports","Spotlight"],"tags":["CCS","Chelsea Fan","deedee ringwalt","season recap","sports","volleyball"]},{"id":126695,"title":"Verbatim: What&#8217;d you do over the Thanksgiving break?","permalink":"http:\/\/palyvoice.com\/2016\/12\/04\/verbatim-whatd-you-do-over-the-thanksgiving-break\/","content":"Last week, Palo Alto High School students and faculty enjoyed a break from school for the Thanksgiving holiday. The day they returned to school, The Paly Voice walked around campus to ask the Paly community what it did over the break.\r\n<img class=\"alwaysThinglink\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/860926233280512002\/1024\/10\/scaletowidth#tl-860926233280512002;1043138249'\" alt=\"\" \/><script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script>","excerpt":"Following the five day Thanksgiving break, The Paly Voice asked the students of Palo Alto High School about their Thanksgiving break.\r\n\r\n","date":"2016-12-04 20:29:04","author":"Kasra Orumchian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/tmp860926233280512002.jpg","categories":["Uncategorized"],"tags":["2016","palo alto","palo alto high school","paly","thanksgiving","thanksgiving break","verbatim","vikings"]}]