[{"id":119505,"title":"Fire alarms stall classes","permalink":"http:\/\/palyvoice.com\/2016\/04\/22\/fire-alarms-stall-classes\/","content":"[caption id=\"attachment_119526\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/Fire-alarm.jpg\"><img class=\"wp-image-119526\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/Fire-alarm.jpg\" alt=\"Fire alarm\" width=\"600\" height=\"450\" \/><\/a> Students converge on the football field during the start of first period. The fire alarm that went off this morning coincided with rain, causing students to seek shelter from the weather. \"I had an umbrella so it wasn't that bad, but a lot of other people didn't have anything so they were just freezing,\" freshman Sophie Relman said. \"I had band [first period] so we missed a lot of time that we could have spent practicing.\" Photo: Emily Hwang.[\/caption]Two fire alarms disturbed Palo Alto High School students and staff today during first and third period.\r\n\r\nA false fire alarm halted first period classes for over 15 minutes at 8:06 a.m., and a second alarm occurred at 11:02 a.m. before promptly turning off. According to Assistant Principal Jerry Berkson, construction workers in the Performing Arts Center accidentally triggered both alarms.\r\n\r\nThe first fire alarm went off before school started, forcing bewildered students to line up on the football field during the morning rain.\r\n\r\n“It was raining outside and the construction workers didn’t evacuate, so I was suspicious that a student pulled the alarm as a prank or to avoid their first period,” junior Annabelle Hu said. “I was pretty miserable in the rain. … It was a monumental waste of time.”\r\n\r\nJunior Gaby Pelayo was <span style=\"line-height: 1.5;\">recording a presentation in her third period Advanced Placement Spanish Language class when the fire alarm interrupted midway — ruining the recording. With the AP Spanish exam less than two weeks away, Pelayo says she feels the alarm was untimely.<\/span>\r\n\r\n\"We were in the middle of doing practice for AP Spanish test this coming May,\" Pelayo said. \"It was a bit annoying as it disrupted our time in class and our practice. All fire alarms are a hassle but considering the [AP] tests are around the corner, our classes need to be as productive as possible.\"\r\n\r\nWhile today’s alarms were accidental occurrences, Paly is not a new victim of false alarms. Approximately six fire alarms have disrupted classes this school year, according to Berkson.\r\n<div class=\"conversation\">\r\n<div data-reactroot=\"\">\r\n<div class=\"_4tdt\">\r\n<div class=\"_4tdv\">\r\n<div class=\"_5wd4 _1nc7 direction_ltr\">\r\n<div class=\"_5wd9\">\r\n<div class=\"_5wde _n4o\">\r\n<div class=\"_5w1r _3_om _5wdf\">\r\n<div class=\"_4gx_\">\r\n<div class=\"_d97\">\r\n\r\nBerkson says that since fire alarms have occurred frequently, some students might be caught off guard in the case of an actual fire in the future.\r\n\r\n“When it does happen, hopefully everyone is prepared and takes it seriously,” Berkson said.\r\n\r\nBerkson debunked suspicions that the first fire alarm had been caused by a cooking mishap in the Media Arts Center, stating that the administration’s switchboard showed that the alarm was triggered elsewhere.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","excerpt":"Two fire alarms disturbed Palo Alto High School students and staff today during first and third period.","date":"2016-04-22 23:21:06","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/Fire-alarm.jpg","categories":["News"],"tags":["1","3","alarm","Alto","annabelle","Berkson","fax machine","fire","gaby","hu","junior","Palo","paly","pelayo","period","spanish"]},{"id":119482,"title":"Verbatim: Harriet Tubman to be new face of $20","permalink":"http:\/\/palyvoice.com\/2016\/04\/21\/verbatim-harriet-tubman-to-be-new-face-of-20\/","content":"Harriet Tubman will <a href=\"http:\/\/www.nytimes.com\/2016\/04\/21\/us\/women-currency-treasury-harriet-tubman.html?rref=collection%2Ftimestopic%2FLew%2C%20Jacob%20J.&amp;action=click&amp;contentCollection=timestopics&amp;region=stream&amp;module=stream_unit&amp;version=latest&amp;contentPlacement=2&amp;pgtype=collection\" target=\"_blank\">replace Andrew Jackson<\/a> on the $20 bill, according to a statement made by Treasury Secretary Jacob J. Lew yesterday. Women and civil rights leaders, including Eleanor Roosevelt and Martin Luther King Jr., will also be <a href=\"http:\/\/www.nytimes.com\/2016\/04\/21\/us\/mlk-eleanor-roosevelt-susan-anthony.html?&amp;hp&amp;action=click&amp;pgtype=Homepage&amp;clickSource=story-heading&amp;module=photo-spot-region&amp;region=top-news&amp;WT.nav=top-news\">added to the back of $5 and $10 bills<\/a>.\r\n\r\nThe Paly Voice asked Palo Alto High School students and faculty about their views on this proposition.\r\n\r\n<img class=\"alwaysThinglink\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/779816619298783233\/1024\/10\/scaletowidth#tl-779816619298783233;1043138249'\" alt=\"\" \/><script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script>","excerpt":"The Paly Voice asked Palo Alto High School students and faculty about their views on Harriet Tubman replacing Andrew Jackson on the $20 bill. ","date":"2016-04-21 14:59:29","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_0661.jpg","categories":["Multimedia","Spotlight"],"tags":["20 dollar bill","harriet tubman","verbatim"]},{"id":119324,"title":"ASB treasurer, junior class vice president positions filled after special election","permalink":"http:\/\/palyvoice.com\/2016\/04\/20\/asb-treasurer-junior-class-vice-president-positions-filled-after-special-election\/","content":"The Palo Alto High School Associated Student Body has announced the winners of previously vacant student government positions, ASB treasurer and junior class vice president, after voting in the special election closed on Friday.\r\n\r\nSophomore Adeline Zhou will be the new ASB treasurer and sophomore Marissa Ludwig will be the junior class vice president for the 2016-17 school year.\r\n\r\nDue to a lack of candidates for these roles in the first election, ASB was forced to hold a special <a href=\"http:\/\/palyvoice.com\/2016\/03\/30\/asb-to-hold-special-elections-for-vacant-positions\/\">election<\/a>.\r\n\r\nAccording to Ludwig, her personal experiences at Paly inspired her to run.\r\n\r\n\"Basically, I have had a great couple years at Paly,\" Ludwig said. \"And I want to be able to help cultivate a better environment at Paly for everyone to be able to have the same experiences as I have had.\"\r\n\r\nLudwig plans to do this by encouraging more interactions among students.\r\n\r\n\"I want to encourage more class bonding, club attendance and dance attendance,\" Ludwig said. \"[I] also [want to] encourage a welcoming environment with days like disability, gender or environmental awareness.\"\r\n\r\nThe special election concludes voting for this year, as all elected positions have been filled for the 2016-17 school year. Appointed ASB positions have yet to be decided.","excerpt":"The Palo Alto High School Associated Student Body has announced the winners of previously vacant student government positions, ASB treasurer and junior class vice president, after voting in the special election closed on Friday.","date":"2016-04-20 20:01:12","author":"Jackson Doerr","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/0000\/00\/IMG_0850.jpg","categories":["ASB Election 2016","News","Spotlight"],"tags":["asb election","special election 2016","student government"]},{"id":119415,"title":"Admin pilots reflective windows as safety precaution","permalink":"http:\/\/palyvoice.com\/2016\/04\/20\/admin-pilots-reflective-windows-as-safety-precaution\/","content":"<span style=\"font-weight: 400;\">In an attempt to increase campus safety, the Palo Alto High School administration is soliciting feedback from teachers on tinted windows installed in the English and World Language departments over Spring Break.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Assistant Principal Jerry Berkson, the windows in the 200s and 300s buildings are now covered with a thin reflective film to test how to most effectively reduce visibility from the outside to the inside of the classroom in the case of a code red lockdown.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“This is really from a safety perspective in an active shooter situation,” Berkson said.<\/span>\r\n\r\nEver since a teachers' union representative reached out to the district after a group of teachers initially voiced their concerns, the district has examined possible safety precautions, according to Berkson.\r\n\r\n<span style=\"font-weight: 400;\">“There were multiple options that were explored at a district level, and this is a conversation that’s been on-going for much longer than this year,” Humanities teacher and union representative Mimi Park said. “It wasn’t a decision that was rushed into.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Administrators selected tinting, as opposed to blinds, because of its affordability, Berkson said.<\/span>\r\n\r\n[caption id=\"attachment_119417\" align=\"alignleft\" width=\"609\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/pizap.com14611064708221.jpg\"><img class=\"wp-image-119417\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/pizap.com14611064708221.jpg\" alt=\"pizap.com14611064708221\" width=\"609\" height=\"457\" \/><\/a> From left to right, the window of Room 401 is unprotected, making the classroom visible from the outside, while Room 404 is hidden by blinds and Room 204 is tinted with a thin film. Since Spring Break, Room 204 is one of the few classrooms with a reflective film that improves safety during a code red lockdown. According to Berkson, the idea to add a film has \"been an ongoing thing, and it’s taken a while, because they [district members] were looking for solutions.\" Photos by Adele Bloch.[\/caption]<span style=\"font-weight: 400;\">Despite generally positive feedback, administrators are facing backlash from certain teachers who are unhappy with the unintended consequences of the film installation, because “with any solution, there’s going to be downsides and upsides,” according to Park. Advanced Placement Literature teacher Sarah Bartlett feels that the windows reduce lighting in the classroom and also fail to prevent visibility at a close distance.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Some teachers permanently block off all their windows with posters, so for them, it [the film] doesn’t matter,” Bartlett said. “But some of us don’t want to do that.”<\/span>\r\n\r\nAccording to Park, who was involved in the discussion of the film’s installation because of her role as a Teacher's Union site representative for Paly, tinted windows are only meant to completely block visibility when the classroom lights are off.\r\n\r\n<span style=\"font-weight: 400;\">“The question has been: How do we cover up the windows and make sure that everyone in the room is safe so that a potential shooter, or someone who doesn’t have good intentions, can’t just peer into the room and see where people are?,” Park said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Park says she feels that the project marks an increasing emphasis on safety initiatives within the district.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I’m glad that the district and the school are taking steps to make our buildings a little bit safer, with the lockblocks [on classroom doors] a year ago, and now with the reflective covering,” Park said.<\/span>","excerpt":"In an attempt to increase campus safety, administrators are soliciting feedback from teachers on tinted windows installed in the English and language departments over Spring Break.","date":"2016-04-20 14:05:49","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/pizap.com14611064708221.jpg","categories":["News","Spotlight"],"tags":["afford","affordability","ap","Berkson","block","break","campus","english","feedback","film","install","installation","jerry berkson","language","lit","lockblock","mimi","mimi park","paly","park","representative","safety","Sarah","sarah bartlett","soliciting","spring break","tinted","Union","union representative","windows"]},{"id":119363,"title":"Boys&#8217; tennis seeks strong finish to regular season","permalink":"http:\/\/palyvoice.com\/2016\/04\/19\/boys-tennis-seeks-strong-finish-to-regular-season\/","content":"The Palo Alto High School boys' tennis team will battle tough competition this week, as it faces off against league opponents Sacred Heart Prep and Monta Vista High School on Wednesday and Thursday, respectively.\r\n\r\nDespite optimistic expectations heading into the season, the team has fallen out of Central Coast Section playoff competition after an inconsistent past few matches, according to senior captain Shiv Matta. However, the team does plan to compete in the Santa Clara Valley Athletic League playoffs, which will take place on April 26 and 27.\r\n\r\nAccording to junior Henry Badger, strong performances this week will help the team's case to remain in the same league, SCVAL, next year.\r\n\r\n\"We're looking to finish the season strong,\" Badger said. \"We hope we can get a win against Sacred Heart Prep and perform our best in SCVALs. We hope we can play our best and particularly stay in our league for next season.\"\r\n\r\nAccording to Matta, the match against Sacred Heart Prep is within the Vikings' reach, while Monta Vista poses a more difficult challenge for the Vikings.\r\n\r\n\"We're just looking to compete in these upcoming matches,\" Matta said. \"We should beat Sacred Heart, but Monta Vista is the best team in the league so it'll be tough.\"\r\n\r\nAlthough the season is winding down, Matta remains optimistic for an enjoyable finish, especially for himself and fellow seniors Drew Embersits and Carl Goodfriend.\r\n\r\n\"We are all just looking to finish strong and put a good finish on [our] high school careers,\" Matta said.\r\n\r\nBoth matches begin at 3:30 p.m. at the Paly tennis courts.\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School boys' tennis team will battle tough competition this week, as it faces off against league opponents Sacred Heart Prep and Monta Vista High School on Wednesday and Thursday, respectively. ","date":"2016-04-19 21:56:53","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/2016-03-31-05.10.29.jpg","categories":["Sports"],"tags":["badger","boys tennis","embersits","goodfriend","matta","monta vista","sacred heart prep","scval"]},{"id":119423,"title":"Paly junior to speak at California Senate","permalink":"http:\/\/palyvoice.com\/2016\/04\/19\/paly-junior-to-speak-at-california-senate\/","content":"<span style=\"font-weight: 400;\">Palo Alto High School junior Nadia Leinhos will speak at the California Senate tomorrow in Sacramento to defend a bill which would require theater and dance teachers to obtain teaching credentials in their respective subject areas.<\/span>\r\n\r\n<span style=\"font-weight: 400;\"><a href=\"http:\/\/sd26.senate.ca.gov\/news\/2016-01-27-senator-allen-introduces-theatre-and-dance-act\">Senate Bill 916<\/a>, sponsored by State Sen. Ben Allen, would establish single-subject teaching credentials for dance and theater. Currently, those who major in dance as an undergraduate can only teach dance after obtaining a credential in Physical Education, and a theater undergraduate major can only teach theater after receiving an English credential.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“If this bill passes, the quality of the teaching will go way up,” Leinhos said. <\/span>\r\n\r\n[caption id=\"attachment_119437\" align=\"alignright\" width=\"346\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/13059808_1696364980623529_1605777307_n.jpg\"><img class=\"wp-image-119437\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/13059808_1696364980623529_1605777307_n.jpg\" alt=\"13059808_1696364980623529_1605777307_n\" width=\"346\" height=\"462\" \/><\/a> Junior Nadia Leinhos, pictured above, will speak at the California Senate to promote a bill that Leinhos says will improve arts education. \"I get to be the student representative talking about just how important this [bill] is,\" Leinhos said. Photo by Adrienne Kwok.[\/caption]<span style=\"font-weight: 400;\">Leinhos received the chance to voice her opinion after entering an essay contest for California Youth in Theatre, a non-profit organization dedicated to promoting educational theater opportunities for students. After winning the contest, Leinhos received the opportunity to speak at both the annual CYIT Day and in front of the California Senate.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“As the essay winner, I’ve kind of become the student face and spokesperson of this whole endeavor,” Leinhos said.<\/span>\r\n\r\nWhile Leinhos says the bill will not directly affect Paly students as the current arts teachers have obtained arts teaching credentials, it could have large impacts on schools with less developed arts programs.\r\n\r\n“We’re lucky to have two very passionate arts teachers in the theater and dance departments, but in other parts of California, it may be that whichever teacher has a free period is going to teach theater,” Leinhos said. “If the teacher knows exactly what they are doing and is just as passionate as the students want to be, their [students’]  experience is going to be better and they’re going be able to do far more with their theater experience.”\r\n\r\nAllen says that the bill would help recognize the importance of dance and theater as vital elements of the arts curriculum.\r\n\r\n<span style=\"font-weight: 400;\">“California is the arts and entertainment capital of the world,” Allen said. “How is it possible that ours is one of only two states in the country that does not have specific credentials for dance or theater?” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Leinhos' speech will discuss both the bill and how theater affected her personally.<\/span>\r\n\r\n“I was really shy when I was younger and now I’m a lot more confident and have a lot more friends [after joining theater],” Leinhos said.\r\n\r\n<span style=\"font-weight: 400;\">Leinhos says she is looking forward to the experience.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I think it hasn’t settled in how huge this is, but I get to be a part of history,” Leinhos said. “It might not seem like that huge of a part of history to some, but this [the bill] will change kids’ lives if it goes through and that is so powerful. I’m so glad I get to be a part of it.”<\/span>","excerpt":"Palo Alto High School junior Nadia Leinhos will speak at the California Senate tomorrow to defend a bill which would require theater and dance teachers to obtain teaching credentials in their respective subject areas.","date":"2016-04-19 19:24:16","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/13059436_1696364990623528_1698417690_n.jpg","categories":["News","Spotlight"],"tags":["916","arts","bill","California","dance","leinhos","nadia","paly","pe","senate","theater"]},{"id":119306,"title":"Storify: Prom 2016","permalink":"http:\/\/palyvoice.com\/2016\/04\/19\/storify-prom-2016\/","content":"Look back at Palo Alto High School's Prom 2016 on Saturday at the San Francisco Design Center as seen through various social media posts using the hashtag #palyprom.\r\n<div class=\"storify\">\r\n\r\n<iframe src=\"\/\/storify.com\/thepalyvoice\/prom-2016\/embed?border=false\" width=\"100%\" height=\"750\" frameborder=\"no\"><\/iframe><script src=\"\/\/storify.com\/thepalyvoice\/prom-2016.js?border=false\"><\/script><noscript>[&amp;lt;a href=\"\/\/storify.com\/thepalyvoice\/prom-2016\" target=\"_blank\"&amp;gt;View the story \"Prom 2016\" on Storify&amp;lt;\/a&amp;gt;]<\/noscript>\r\n\r\n","excerpt":"Look back at Palo Alto High School's Prom 2016 on Saturday at the San Francisco Design Center as seen through various social media posts using the hashtag #palyprom.\r\n","date":"2016-04-19 18:57:08","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/13035444_1767273386836890_735391528_o.jpg","categories":["Multimedia","Spotlight"],"tags":["#palyprom","paly prom","prom","prom 2016","san francisco design center"]},{"id":119401,"title":"Advisory this week is for all freshman and juniors","permalink":"http:\/\/palyvoice.com\/2016\/04\/19\/advisory-this-week-is-for-all-freshman-and-juniors\/","content":"","excerpt":"","date":"2016-04-19 13:45:11","author":"Chirag Akella","categories":["Ticker"],"tags":[]},{"id":119322,"title":"Campus defaced with racist, pro-Trump graffiti","permalink":"http:\/\/palyvoice.com\/2016\/04\/18\/campus-defaced-with-racist-pro-trump-graffiti\/","content":"[caption id=\"attachment_119339\" align=\"alignright\" width=\"341\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/13046219_1718988074981178_1740350271_n1.jpg\"><img class=\"wp-image-119339\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/13046219_1718988074981178_1740350271_n1.jpg\" alt=\"13046219_1718988074981178_1740350271_n\" width=\"341\" height=\"255\" \/><\/a> The custodial staff discovered graffiti on a bench near the science building at Palo Alto High School this morning. Photo: Bianca Al-Shamari.[\/caption]\r\n\r\nThe Palo Alto High School administration is investigating racist and pro-Donald Trump graffiti messages discovered on campus this morning.\r\n\r\nPerpetrators scrawled \"Black Lives Suck\" and \"Trump 1237\" with black marker in at least three locations on campus, including the boys' bathroom door in the 800 building and the benches directly in front of the custodial offices.\r\n\r\n\"Trump 1237\" coincides with the number of delegates needed to capture the Republican nomination for the national presidential election, and \"Black Lives Suck\" is a perversion of the slogan \"Black Lives Matter,\" which became a rallying cry for civil rights activists following several police brutality incidents.\r\n\r\nPaly is the latest addition to the growing number of high schools and colleges across the nation that have been defaced with similar hateful, Trump-related messages.\r\n\r\nThe custodial staff discovered the majority of the graffiti this morning at 8:20 a.m., and the vandalism was concealed shortly afterward, according to Assistant Principal Jerry Berkson.\r\n\r\n\"We take pictures and get rid of it as soon as possible,\" Berkson said. \"Unless we have a lead, we are limited in action. We clean it up right away, so the person responsible doesn't get the attention they want.\"\r\n\r\nAccording to Berkson, the Palo Alto Police Department has been contacted to aid in the investigation.\r\n\r\nIn an email to The Paly Voice, Supt. Max McGee stated that he encourages students to stand against bigotry.\r\n\r\n\"Hate speech is a serious matter, and those who defaced our campus will suffer serious consequences,\" McGee said. \"We are immediately removing the graffiti, but more importantly, I trust that our Paly students will not tolerate any expression of racial, ethnic or gender disparagement and will take positive steps to assure that our campus is kind, safe and welcoming for every individual.\"\r\n\r\n[caption id=\"attachment_119340\" align=\"alignright\" width=\"254\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/13059324_1718987974981188_33468229_n1.jpg\"><img class=\"wp-image-119340\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/13059324_1718987974981188_33468229_n1.jpg\" alt=\"13059324_1718987974981188_33468229_n\" width=\"254\" height=\"339\" \/><\/a> The boys' restroom in the 800 building was one of several locations on campus vandalized with a pro-Trump message. Administration covered up \"Black Lives Suck\" underneath a piece of paper, according to secretary Carolyn Benfield. Photo: Bianca Al-Shamari.[\/caption]\r\n\r\nCampus Supervisor Carl Hubenthal said he felt upset after seeing the messages.\r\n\r\n\"I don't think this kind of hate has any place on this campus,\" Hubenthal said. \"This should be an inclusive space for everybody, and I think whoever did that needs to come forward and have some sensitivity training. The person who did it clearly doesn't understand the hate that they're projecting and what damage they can do.\"\r\n\r\nThe graffiti appeared just as Paly began its <a href=\"http:\/\/palyvoice.com\/2016\/04\/17\/change-in-our-schools-week-cultivating-a-positive-community\/\">first annual Change In Our Schools Week<\/a>, intended to celebrate student diversity and promote respect. Junior Cezanne Lane, an organizer of CIOS Week and Associated Student Body spirit commissioner, was also taken aback by the hateful comments.\r\n\r\n\"This is really shocking for a community that I thought was so progressive,\" Lane said. \"Hopefully the person who did it didn't mean it, but those words are harmful.\"\r\n\r\nSenior Dami Bolarinwa said he is disappointed by the graffiti. According to Bolarinwa, the Black Lives Matter movement carries an important message that people need to hear.\r\n\r\n\"That's truly heartbreaking to see that people have reverted to such disgrace of integrity,\" Bolarinwa said. \"Black lives and many minority lives are targeted, so it saddens me to know students at Paly feel that way and are continuing to target students on campus with vandalism as this.\"\r\n\r\nSenior Sergio Valente said he believes the messages do not represent the values of the Paly student body.\r\n\r\n“When I saw the graffiti I assumed that the people who created it were just doing so as a joke and thought it was funny,” Valente said. “I think there are many better ways to express juvenile fun and it’s sad that they chose to do so in a way that can be offensive. I also don’t think that it is something that needs to be blown out of proportion as it was the actions of presumably a few individuals and need not reflect on the school as a whole.”\r\n\r\nJunior Maya Lathi said she thinks that people have the right to express political opinions, but personal beliefs should be shared in ways other than graffiti.\r\n\r\n\"With regards to the 'Black Lives Suck' graffiti, I think it is sad to see that this is a view a fellow student has, but it shouldn't be considered representative of our tolerant student body,\" Lathi said. \"In regards to the 'Trump 1237' graffiti, while I disagree with the politics of Donald Trump, I respect each citizen's right to believe in whatever politics they'd like to. There are more respectful, less destructive, ways to express one's opinion than vandalism.\"\r\n\r\n<span style=\"font-weight: 400;\">Senior Reuben Kramer said he hopes people learn to value respect and tolerance.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"I think that it's embarrassing that someone would do a hate crime, especially on campus,\" Kramer said. \"I would encourage people to stand up to racism whenever they see it, because it has no place in this world.\"<\/span>\r\n\r\nTrump is scheduled to appear at the California Republican Party convention on Friday, April 29, in Burlingame. A protest to his speech is being <a href=\"https:\/\/www.facebook.com\/events\/1524102991231738\/\" target=\"_blank\">organized through Facebook<\/a>, encouraging people to \"show him [Trump] a real Bay Area welcome by peacefully protesting outside.\" Several Paly students marked that they are planning to attend the protest. The Trump campaign, when contacted by The Paly Voice, indicated it would respond to news of the graffiti but had not done so as of 9:45 p.m. Monday night.\r\n\r\nComparable graffiti has defaced other schools outside of Palo Alto, including <a href=\"http:\/\/www.latimes.com\/local\/education\/higher-ed\/la-me-ln-lmu-graffiti-20160406-story.html\">Loyola Marymount University<\/a>, <a href=\"http:\/\/www.mercurynews.com\/politics-government\/ci_29675931\/trump-graffiti-scares-emory-students-we-are-pain\">Emory University<\/a>, <a href=\"http:\/\/www.bostonherald.com\/news\/local_coverage\/2016\/03\/judge_s_son_charged_with_spray_painting_trump_and_racist_graffiti\">Northwestern University, <\/a><a href=\"http:\/\/www.dispatch.com\/content\/stories\/local\/2016\/04\/16\/pro-trump-message-on-wall-sparks-discourse-at-ou.html\" target=\"_blank\">Ohio University<\/a> and <a href=\"http:\/\/laist.com\/2016\/03\/14\/pacific_palisades_racist_graffiti.php\">Pacific Palisades Charter High School<\/a>.\r\n\r\n<em>Additional reporting and writing by Emily Hwang.<\/em>\r\n\r\n<em>Editor’s Note: For a few minutes, an extension on one of our editors' browser changed all mentions of “Trump” to “Drumpf.” We apologize for this brief departure from correct spelling.<\/em>","excerpt":"The Palo Alto High School administration is investigating racist and pro-Donald Trump graffiti messages discovered on campus this morning.","date":"2016-04-18 21:48:09","author":"Bianca Al-Shamari","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/trump-graffiti.jpg","categories":["News","Spotlight"],"tags":["graffiti","messages","racist","Trump","vandalism"]},{"id":118754,"title":"Library to provide finals studying for students","permalink":"http:\/\/palyvoice.com\/2016\/04\/18\/library-to-provide-finals-studying-for-students\/","content":"[caption id=\"attachment_73571\" align=\"aligncenter\" width=\"503\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_0783.jpg\"><img class=\"wp-image-73571\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_0783.jpg\" alt=\"People will have plenty of room to experience the Mitchell Park Library’s new features thanks to the building’s massive size. According to the library website(link), the facility will be approximately four times larger than its predecessor, with a collection nearly twice its previous size. Its children’s area alone is nearly as large as the Children’s Library on Harriet Street. http:\/\/www.cityofpaloalto.org\/gov\/depts\/csd\/my_mitchell.asp Photo by William Zhou.\" width=\"503\" height=\"377\" \/><\/a> The Mitchell Park Library and Community Center is a popular place for students to study for finals. This year, the library is hoping to help Palo Alto high school students study for finals by providing various new activities and resources for teens during its ‘Finals Cram Slam’ from May 25 to May 26. Photo by William Zhou.[\/caption]\r\n\r\nThe Mitchell Park Library and Community Center hopes to help Palo Alto high school students study for finals by providing various activities and resources for teens during its ‘Finals Cram Slam’ from May 25 to May 26.\r\n\r\nThe main purpose of the Finals Cram Slam is to provide students with study space, according to Teen Services Librarian Gina Martinez.\r\n\r\n“We want high school students to have a place to study for finals,” Martinez said. “ The Mitchell Park Library and Community Center has plenty of table space for students to finish a group project and collaborate with others. We’ll be open until 10 p.m. on May 25 and 26.”\r\n\r\nOne new feature the library will be offering this year is a special quiet study room, according to Martinez.\r\n\r\n“This year, we are planning to have the Adobe Room be an extra large designated quiet room for those who study best solo,” Martinez said.\r\n\r\nIn addition to study space, the Mitchell Park Library will be providing teens with other resources, according to Martinez.\r\n\r\n“We will also be offering snacks and free games during your breaks from studying,” Martinez said. “Students can take a break in the Teen Center to play on the WiiU, Xbox One, board games, air hockey and ping-pong tables. Therapy dogs will be visiting the library to de-stress, too.”\r\n\r\nBrining in therapy dogs have been successful in the past, according to Martinez.\r\n\r\n“I had a request from one teen back in December who told me she had been looking forward to Finals Cram Slam just so she could see and get a visit from our therapy dogs,” Martinez said. “From the moment she saw one of our pups she was smiling from ear to ear, and it is a good feeling to know we are helping students de-stress. The Mitchell Park Library and Community Center care a lot about our youth, and we are always striving to keep them happy, even while studying, when they are here.”\r\n\r\n[caption id=\"attachment_119329\" align=\"alignright\" width=\"387\"]<img class=\"wp-image-119329\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/photo.jpg\" alt=\"photo\" width=\"387\" height=\"290\" \/> This year, the library and its student leadership team, the Teen Library Advisory Board, are hoping to increase student wellness during finals through their 'Post-its for Positivity' project, according to Martinez. Submission boxes like these are located at Gunn and Palo Alto High School and at the city libraries. Photo by William Zhou.[\/caption]\r\n\r\nThis year, the library and its student leadership team, the Teen Library Advisory Board, are hoping to increase student wellness during finals through a new project, according to Martinez.\r\n\r\n“TLAB and Mitchell Park Library are starting a movement, called 'Post-its for Positivity' for students during finals week,” Martinez said. “We are asking all adults-teachers, parents, school librarians, and library patrons during the month of April and May to a write messages for high school students on post-it notes as encouragement for students during f\r\ninals week. My goal is to show teens that they are cared about and valued in their community.”\r\n\r\nPeople\u0010 who wish to write a Post-it of encouragement can stop by the Mitchell Park, Rinconada or Children’s Library locations to write a handwritten message on a post-it during the months of April and May or send your typed note to paloaltoTLAB@gmail.com.","excerpt":"The Mitchell Park Library and Community Center hopes to help Palo Alto high school students study for finals by providing various activities and resources for teens during its ‘Finals Cram Slam’ from May 25 to 26.   ","date":"2016-04-18 11:59:15","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/photo.jpg","categories":["News","Spotlight"],"tags":["dogs","finals cram","Gina","gunn high school","Library","mitchell park","palo alto high school","Stress","TLAB"]}]