[{"id":119931,"title":"Baseball seeks opening win in SCVAL playoffs against Los Altos","permalink":"http:\/\/palyvoice.com\/2016\/05\/02\/baseball-seeks-opening-win-in-scval-playoffs-against-los-altos\/","content":"[caption id=\"attachment_119953\" align=\"alignnone\" width=\"650\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/baseball-for-los-altos-story-1.jpg\"><img class=\"size-full wp-image-119953\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/baseball-for-los-altos-story-1.jpg\" alt=\"Junior shortstop Ethan Stern prepares to place a tag on an incoming Los Gatos runner. The Vikings lost to the Wildcats, 7-4, during a league game in April. Photo by Cooper Lou.\" width=\"650\" height=\"385\" \/><\/a> Junior shortstop Ethan Stern prepares to place a tag on an incoming Los Gatos base runner. The Vikings lost to the Wildcats, 7-4, during a league game in April. Photo by Cooper Lou.[\/caption]\r\n\r\nThe Palo Alto High School baseball team (19-4-1, 12-2) looks to defeat Los Altos High School (15-11, 8-6) in the Vikings' first Santa Clara Valley Athletic League playoff game at 4:30 p.m. Tuesday at Paly.\r\n\r\nJunior pitcher Ryan Chang said the team had a strong regular season and the Vikings are confident about their chances in the playoffs, despite knowing that the competition is strong.\r\n\r\n\"It was a really successful regular season,\" Chang said. \"We [Palo Alto] feel pretty confident going into playoffs, but we know there is a lot of good competition out there so we need to stay focused.\"\r\n\r\nThe Vikings finished in second place in the De Anza league during the regular season with just two league losses, and look to make a statement in the team's first playoff matchup with a full and healthy roster. The couple league losses that the Vikings recorded were decided by a couple of runs.\r\n\r\nPalo Alto defeated the Eagles both times during the regular season with by scores of 13-4 and 1-0.\r\n\r\nThe team will compete for a Central Coast Section playoff berth through multiple games, throughout the week, including Tuesday's game.\r\n\r\nThe starting pitcher for the Vikings will be senior Justin Hull. According to <a href=\"http:\/\/www.maxpreps.com\/league\/Yt6KsTT8gU-lm5tdmDkR7Q\/standings-de-anza.htm#stat_leaders\">Max Preps<\/a>, \"America's source for high school sports\", Hull leads the league in strikeouts (43) and is ranked second in the ERA (earned run average) category with an ERA of 0.89.\r\n\r\nSophomore pitcher Jeremy Akioka said the Vikings have a good chance at defeating the Eagles if the team sticks to its game plan.\r\n\r\n\"Los Altos is a good team but we should beat them if we come out swinging and throwing strikes,\" Akioka said.","excerpt":"The Palo Alto High School baseball team (19-4-1, 12-2) looks to defeat Los Altos High School (15-11, 8-6) in its first Santa Clara Valley Athletic League playoff game at 4 p.m. Tuesday at Paly. Palo Alto defeated the Eagles both times during the regular season with by scores of 13-4 and 1-0.\r\n","date":"2016-05-02 22:01:30","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/baseball-for-los-altos-story-.jpg\nPhoto by Cooper Lou.\" \/>","categories":["Uncategorized"],"tags":["Akioka","Baseball","Chang","de anza","los altos","palo alto","scval"]},{"id":119877,"title":"Slideshow: Girls&#8217; swimming takes SCVAL title, boys place second","permalink":"http:\/\/palyvoice.com\/2016\/05\/02\/slideshow-girls-swimming-takes-scval-title-boys-place-second\/","content":"The Palo Alto High School girls’ swim team placed first at the Santa Clara Valley Athletic League playoffs finals while the boys’ swim team placed second on Friday at Gunn High School.\r\n<div id=\"cp_widget_5dd7a7bb-3205-4269-ab88-19f0ab5097fb\">\r\n\r\n...<script type=\"text\/javascript\">\/\/ <![CDATA[\r\nvar cpo = []; cpo[\"_object\"] =\"cp_widget_5dd7a7bb-3205-4269-ab88-19f0ab5097fb\"; cpo[\"_fid\"] = \"AYIAvf9oe55F\";\r\nvar _cpmp = _cpmp || []; _cpmp.push(cpo);\r\n(function() { var cp = document.createElement(\"script\"); cp.type = \"text\/javascript\";\r\ncp.async = true; cp.src = \"\/\/www.cincopa.com\/media-platform\/runtime\/libasync.js\";\r\nvar c = document.getElementsByTagName(\"script\")[0];\r\nc.parentNode.insertBefore(cp, c); })(); \r\n\/\/ ]]><\/script><noscript>Powered by Cincopa <a href='http:\/\/www.cincopa.com\/video-hosting'>Video Hosting Platform<\/a> for Business solution.<\/noscript>\r\n\r\n","excerpt":"The Palo Alto High School girls’ swim team placed first at the Santa Clara Valley Athletic League playoffs finals while the boys’ swim team placed second on Friday at Gunn High School.","date":"2016-05-02 18:52:39","author":"Victor Carlsson","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/IMG_6358-copy.jpg","categories":["Sports","Spotlight"],"tags":["Boys","girls","sports","Swimming"]},{"id":119657,"title":"Band and orchestra score high at CMEA festival","permalink":"http:\/\/palyvoice.com\/2016\/05\/02\/band-and-orchestra-score-high-at-cmea-festival\/","content":"Palo Alto High School’s band and orchestra received high scores at the California Music Education Association Festival on Saturday at Gunn High School.\r\n\r\nAccording to sophomore orchestra member Charulata Das, both the Concert and Symphonic Bands received unanimous superiors. Das, who is the principal second violinist, says that the orchestra also received two superiors and one excellent.\r\n\r\nPaly’s band and orchestra played in front of three judges, each giving a score of 70 or more. A score in the 80s is an \"excellent\" ranking and a score in the 90s is a \"superior\" ranking. If every judge gives them a score of 90 or above, they earn a composite ranking of “unanimous superiors” and receive a plaque for their performance, according to band and orchestra teacher Jeff Willner.\r\n\r\nThe CMEA is an organization with members of high school music teachers from all around the state, and had school music programs from around the Bay Area competing, according to Willner.\r\n\r\nThe Concert Band played \"Liadov Fanfare\" and \"English Suite,\" the Symphonic Band performed \"Amazing Grace\" and \"On the Town\" and Orchestra played \"Holberg Suite,\" \"Pantomime\" and the Brandenburg Concerto No. 3. The symphonic band is composed of sophomores, juniors and seniors and the concert band is comprised of freshmen.\r\n\r\nAll three groups also participated in a sight-reading performance, or reading and performing music without preparation, according to sophomore tuba player August Soderberg.\r\n\r\n“We worked hard to fix every aspect of each piece,” Soderberg said.  “We actually sight read a piece from 'Star Wars: The Force Awakens' for sight reading practice.”\r\n\r\nSoderberg says that he is not surprised at how well the band performed.\r\n\r\n\"We have practiced in the Haymarket, so it was easy to get used to the Gunn [High School] stage,” Soderberg said. “From there, we just played our music like we did at rehearsals and it went very well.\"\r\n\r\nDas attributes the band and orchestra’s success to their hard work.\r\n\r\n“We worked really hard for this concert,” Das said. “We have been practicing for the last couple of months and we did pretty well, so all the work paid off. Also, Mr. Willner is an amazing director for orchestra.”\r\n\r\nDas says that the next step for band and orchestra is focusing on the upcoming concerts.\r\n\r\n“Our next concert is on May 12, and we want more people to come and be aware of how hard the music department works to put on these shows,” Das said.\r\n\r\nThe Symphonic and Concert Band’s last few performances include the May Fete Parade and a concert on May 12 in the Haymarket Theater. They will also be performing at graduation.","excerpt":"Palo Alto High School’s band and orchestra received high scores at the California Music Education Association Festival on Saturday at Gunn High School.","date":"2016-05-02 11:52:59","author":"Julia Qiao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/103.jpg","categories":["News","Spotlight"],"tags":["august soderberg","band","Charulata Das","CMEA","concert band","orchestra","r","symphonic band","willne"]},{"id":119855,"title":"Verbatim: Republican convention attendees discuss 2016 election","permalink":"http:\/\/palyvoice.com\/2016\/05\/01\/verbatim-republican-convention-attendees-discuss-2016-election\/","content":"Ohio governor and 2016 presidential candidate John Kasich spoke Friday evening at the Hyatt Regency San Francisco Airport in Burlingame, speaking on issues ranging from drug abuse to cutting taxes. As part of a multi-day Republican Convention, Kasich is one of three candidates who partook in the event, as presidential candidate Donald Trump spoke earlier on Friday and Ted Cruz spoke on Saturday.\r\n\r\nThe Paly Voice interviewed delegates and guests after the dinner banquet to learn more about what important political ideas they support, and how they view the three Republican candidates.\r\n\r\n<em>Videos by Adrienne Kwok.<\/em>\r\n\r\n<hr \/>\r\n\r\n<strong>Susan Vander Schaaf:<\/strong>\r\nSusan Vander Schaaf has been a San Joaquin County Republican Party chairman since 2014, and previously worked as a secretary for Escalon Republican Women Federated. Vander Schaaf says she likes Kasich, but supports Ted Cruz for president and had supported Marco Rubio until his campaign’s suspension. While she supports Cruz because he is a very conservative candidate, Vander Schaaf believes candidate Donald Trump is negatively affecting the Republican party and is hoping for a brokered republican convention.\r\n\r\nhttps:\/\/www.youtube.com\/watch?v=fcgzAISYBTE\r\n\r\n<strong>Peter Ohtaki:<\/strong>\r\nPeter Ohtaki is the former mayor and two-term city council member of Menlo Park, elected in 2010 and 2014. A current California State Assembly candidate, Ohtaki says he supports Kasich because he will most likely foster bipartisan support in the White House and views Trump and Cruz as dangerous politicians who can divide the Republican party. As a member of the Menlo Park city council, Ohtaki helped balance the city’s budget and oversee the local fire department.\r\n\r\nhttps:\/\/www.youtube.com\/watch?v=jog6fEE5P3Y\r\n\r\n<strong>Gordon Humphrey:<\/strong>\r\nGordon Humphrey is a former New Hampshire senator who confidently voiced his support of Kasich. Humphrey, who served as senator from 1979 until 1990, helped shape America’s policies on the Soviet Union’s invasion of Afghanistan as a member of a specialized task force. He later unsuccessfully ran for New Hampshire governor twice and was a supporter of Edward Snowden after Snowden leaked classified information.\r\n\r\nhttps:\/\/www.youtube.com\/watch?v=3wf01OWuK6Q\r\n\r\n<strong>Vanila Singh:<\/strong>\r\nA current delegate to San Mateo County and a doctor at Stanford University, Singh does not entirely support Kasich as a potential president, though she says she respects him as a person. According to Singh, the most important issue of this election is creating job opportunities, and that the Republican candidates are more competent than Sanders or Clinton in combating this problem.\r\n\r\nhttps:\/\/www.youtube.com\/watch?v=GEtPbw1vbJk\r\n\r\n<strong>Yesenia Ceja:<\/strong>\r\nYesenia Ceja is a caterer who believes Trump is dividing the U.S. As a woman of Hispanic descent, Ceja says some of Trump’s comments regarding immigration are racist and polarize the nation. While she is not necessarily opposed to immigration laws, she says she thinks Trump’s intended methods of doing so are offensive.\r\n\r\nhttps:\/\/www.youtube.com\/watch?v=CgFWQXfIABo","excerpt":"The Paly Voice interviewed delegates and guests at the California Republican Convention to learn more about what important political ideas they support, and how they view the three Republican candidates.","date":"2016-05-01 15:44:05","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Republican-convention-attendees-views-on-2016-election.png","categories":["Features","Spotlight"],"tags":["2016","ceja","convention","cruz","donald","election","gordon","humphrey","john","kasich","ohtaki","peter","Republican","schaaf","singh","susan","ted","Trump","vander","vanila","yesenia"]},{"id":119798,"title":"Recap: Kasich discusses political policies at Republican convention","permalink":"http:\/\/palyvoice.com\/2016\/05\/01\/recap-kasich-discusses-political-policies-at-republican-convention\/","content":"Republican presidential candidate John Kasich took the stage to discuss the current primary election and several key policies Friday night at the Republican Convention in Burlingame.\r\n\r\nKasich’s focus of the night was on drug policy, mental health and taxes, as he vowed to reform healthcare and the American drug system while simultaneously balancing the budget and reducing federal debt.\r\n\r\n“I don’t know how we developed a policy that if you get a job raise and you’re a single mom, you lose your childcare so you can’t get a better life,” Kasich said.\r\n\r\nWhile Kasich did not mention specific solutions to address such problems, he described his past experiences battling similar issues as governor of Ohio and as a United States congressman.\r\n\r\n“I spent 10 years of my life fighting to balance the budget,” Kasich said. “We have created economic growth [in Ohio]. We have diversified our economy. We are running surpluses.”\r\n\r\nAccording to Kasich, he was able to vastly improve Ohio’s economy by cutting taxes, balancing the budget and using common sense. He says he plans to use similar methods to alleviate America’s debt and increase prosperity.\r\n\r\nKasich also addressed his opponents’ policies, implying that Ted Cruz and Donald Trump are threatening to divide the nation. He also stated that the Democratic candidates’ economic promises are unrealistic.\r\n\r\n\"Here's what I tell young people: you can have all the free you want but at the end of the day with the nation $30 trillion in debt, you might go to a free college but you won't be able to get a job,\" Kasich said.\r\n\r\nKasich’s political viewpoints were woven into several anecdotes describing his early life growing up in a working class household in a Pittsburgh suburb and his encounters with prominent figures such as President Nixon and the president of his alma mater as a youth.\r\n\r\n“I don’t ever remember having met a Republican [in my hometown],” Kasich said. “I am a blue-collar son of a Democratic mailman. And thank goodness, because that has allowed me to be able to understand and relate to people at every level.”\r\n\r\nCalifornia Assembly Republican leader Chad Mayes and California State Senator Jean Fuller were among several politicians who attended the dinner to endorse Kasich.\r\n\r\n“Without question, John Kasich is the best candidate to have at the top of the Republican ballot,” Mayes said. “He can launch the conservative reform efforts needed to restore our nation. He can unite the party and win the White House. He is prepared to be commander in chief on day one and he has the track record to prove it.”\r\n\r\nFormer U.S. Senator Gordon Humphrey also attended the banquet to show his support for Kasich.\r\n\r\n“I like the fact that he is superbly qualified by virtue of experience and success as governor of Ohio.” Humphrey said. “He has a noble soul and a golden heart and is an extraordinary human being. I think he is well qualified for the office in terms of experience and also in terms of temperament. He is respectful towards others, unlike some of the other candidates who are most unpresidential.”\r\n\r\nKasich is currently in third place in the Republican presidential primary with 153 delegates. California will hold its Democratic and Republican primaries on June 7.\r\n\r\n<iframe src=\"https:\/\/www.youtube.com\/embed\/w7WHBbX1Hro\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n<em>Photos by Adrienne Kwok.<\/em>\r\n\r\n<iframe src=\"https:\/\/docs.google.com\/presentation\/d\/1cd_fLa8sPVWPHuXZJ7H6PFKd-AXQW_f6PRMUtl0yZkM\/embed?start=false&amp;loop=false&amp;delayms=3000\" width=\"600\" height=\"429\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n<div class=\"conversation\">","excerpt":"Republican presidential candidate John Kasich took the stage to discuss the election and several key policies Friday night at the California Republican Convention in Burlingame.","date":"2016-05-01 13:22:25","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_76261.jpg","categories":["News","Spotlight"],"tags":["2016","budget","burlingame","California","chad","convention","election","fuller","gordon","humphrey","jean","john","kasich","mayes","ohio","President","Republican","senator","Trump"]},{"id":119717,"title":"Sports Boosters to host auction tonight","permalink":"http:\/\/palyvoice.com\/2016\/04\/30\/sports-boosters-to-host-auction-tonight\/","content":"[caption id=\"attachment_119718\" align=\"aligncenter\" width=\"475\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_4691.jpeg\"><img class=\"wp-image-119718\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_4691.jpeg\" alt=\"IMG_4691\" width=\"475\" height=\"356\" \/><\/a> One of the items that will be available for bid tonight at the Palo Alto High School Sports Booster's auction is this painting of Hunter Pence from the Giant's. Photo by Melissa Anderson.[\/caption]\r\n\r\nEver want to own a piece of Palo Alto High School history or eat pasta with Principal Kim Diorio?\r\n\r\nIf so, then you may be interested in Paly Sports Boosters’ auction that is happening from 7 to 10 p.m. tonight at 1055 Forest Ave.\r\n\r\nThe auction is being held to support Paly Athletics, according to Sports Boosters co-president Melissa Anderson.\r\n\r\n“The district currently funds coaches stipends and facilities, and Sports Boosters raises the money to pay for everything else,” Anderson said. “At Paly, more than half the student body competes in at least one sport annually. Our student athletes learn lifelong skills, but with very limited financial support for Athletics from the school district. Paly Sports Boosters is charged with raising the necessary funds to ensure Paly’s competitiveness on the field. Paly Sports Boosters currently funds the vast majority of Paly’s Athletics budget including for more than 45 teams in a variety of sports.”\r\n\r\nSeveral items will be for bid this weekend, Anderson explains.\r\n\r\n“There will be lots of great stuff,” Anderson said. “Sports memorabilia, once in a lifetime experiences, sports, camps for younger kids, spa treatments, workout passes, and more.”\r\n\r\nThe full auction catalog can be seen <a href=\"https:\/\/docs.google.com\/document\/d\/1mNsfPwbFplGNOq2U9eISEfQb-Tb_MC4Bsa2OsTu4cdQ\/edit?usp=sharing\" target=\"_blank\">here. <\/a>\r\n\r\nThe event will include various forms of auction, according to Anderson.\r\n\r\n“Most of the items will be part of the ‘Silent’ auction,” Anderson said. “Meaning we’ll have bid sheets on tables and people will go around and write down their bid on the items they want. Whoever is the highest bidder at the end of the night, buys that item for that price. We will also do a live auction for five or six really special things like the Klay Thompson signed basketball and the golf outing with the new football coach.”\r\n\r\nAttendees can expect not only an auction, but also a social gathering  with other Paly parents, according to Anderson.\r\n\r\n“It’s a big, fun party in a beautiful back yard with lots of great things to bid on and fun fellow Paly parents to hang out with,” Anderson said. “It’s a nice way to wrap up the Athletic year!”\r\n\r\nThe auctions have been successful in the past and this year, sports boosters feels optimistic towards raising even more money.\r\n\r\n“There was a Sports Boosters auction in 2013 which raised $20K,” Anderson said. “ In 2015 it raised $30K and now in 2016 we’re hoping to raise $50K.”\r\n\r\nInterested community members can sign up <a href=\"https:\/\/www.eventbrite.com\/e\/this-saturday-the-paly-sports-boosters-silent-auction-cocktail-party-fundraiser-tickets-22591245022?aff=ehomecard\" target=\"_blank\">online here.<\/a> Tickets are $50 each and are available online or at the door.","excerpt":"Ever want to own a piece of Palo Alto High School history or eat pasta with Principal Kim Diorio? If so, then you may be interested in Paly Sports Boosters’ auction that is happening from 7 to 10 p.m. tonight at 1055 Forest Ave.","date":"2016-04-30 13:29:18","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_4691.jpeg","categories":["News"],"tags":["athletics","auction","bowers","palo alto high","paly","pe","sports boosters"]},{"id":119792,"title":"Anti-Trump protesters gather at California GOP convention","permalink":"http:\/\/palyvoice.com\/2016\/04\/30\/anti-trump-protesters-gather-at-california-gop-convention\/","content":"<span style=\"font-weight: 400;\">Hundreds of protesters including several Palo Alto High School students chanted messages and waved political banners to demonstrate against Republican presidential candidate Donald Trump at the California Republican Convention yesterday in Burlingame.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Demonstrators gathered at 11 a.m. outside the Hyatt Regency San Francisco Airport to express anger at Trump's views, which some protesters say are anti-immigrant and anti-women. While the protest generally remained peaceful, several brawls broke out between pro-Trump and anti-Trump attendees, and metal barriers surrounding the hotel were removed by protesters hoping to interrupt Trump’s speech inside the hotel.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Dozens of police officers were dispatched to the scene after crowds attempted multiple times to enter the building, first through the front entrance and side doors and later by crossing an overpass linked to the car garage.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">In addition, protesters carried signs with angry messages including “Mr. Hate leave my state,” “Trump is a rapist and conman” and “Dump Trump.” Others played musical instruments or form barriers by linking arms.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Christine Veria, one of hundreds of protesters, says she attended the demonstration to show her children the importance of being civically involved.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It’s so easy right now to sit back behind your phone screen or to be on social media being upset about things, but to actually take action is important,” Veria said.  “We want to lead by example. We feel very strongly that these are not the values we want our children to grow up on and that they [Trump’s values] are dangerous for the type of world we trying to build together.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Other protesters cited Trump’s alleged sexism or racism as reasons for protesting.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I hate Trump,” said Sheila, who declined to disclose her last name. “I hate that he’s fascist. I hate that he hates women. I am Muslim, he says all Muslims are terrorists. Do I look like a terrorist?”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Many protesters were eager to express their anger. Attendees carried Trump pi<\/span><span style=\"font-weight: 400;\">ñatas and threw eggs at Trump cardboard cutouts, while others threw eggs at the hotel windows and shouted expletives at police officers for committing “police brutality” after several protesters were shoved and arrested by officers for attempting to enter the building. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Some of Trump's supporters bore signs condemning the protesters, resulting in some hostile confrontations.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Palo Alto High School junior Andy Chang attended part of the protest and says that Trump remains popular because he can connect with conservative voters’ deeper fears. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I agree with many Republican values, however, I do not support any Republican candidates. Ted Cruz and Donald Trump are just disgusting human beings,” Chang said. “The media said that people vote for Trump is because he is ‘tapping into the fears’ of the people, a ‘successful’ businessman having confidence of not being politically correct, and so on. Most of their reasons are accurate. I remember the first time the media criticized Trump because he said many illegal immigrants are criminals, drug dealers and rapists, and the US should build a wall for them. This speech is indeed very extreme. But the general idea of strictly protecting the U.S. border is not extreme.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The protest largely dispersed by 2:30 p.m., when the shrinking crowds were told to leave by police because of unruly behavior. However, protesters say their ideas were loud and clear, as they hope to send a message that they will not tolerate hate in California.<\/span>\r\n\r\n<em>Photos by Aidan Maese-Czeropski.<\/em>\r\n<div id=\"cp_widget_200fe1a5-9848-416d-b12d-7346d9195816\">\r\n\r\n...\r\n<div id=\"cp_widget_aaef29d4-589b-4c16-b143-6380aa755a6a\">\r\n\r\n...<script type=\"text\/javascript\">\/\/ <![CDATA[\r\nvar cpo = []; cpo[\"_object\"] =\"cp_widget_aaef29d4-589b-4c16-b143-6380aa755a6a\"; cpo[\"_fid\"] = \"AcNAxf9oWZUK\"; var _cpmp = _cpmp || []; _cpmp.push(cpo); (function() { var cp = document.createElement(\"script\"); cp.type = \"text\/javascript\"; cp.async = true; cp.src = \"\/\/www.cincopa.com\/media-platform\/runtime\/libasync.js\"; var c = document.getElementsByTagName(\"script\")[0]; c.parentNode.insertBefore(cp, c); })();\r\n\/\/ ]]><\/script><noscript>Powered by Cincopa <a href='http:\/\/www.cincopa.com\/video-hosting'>Video Hosting Platform<\/a> for Business solution.<\/noscript>\r\n\r\n\r\n","excerpt":"Hundreds of protesters including several Palo Alto High School students chanted messages and waved political banners to demonstrate against Republican presidential candidate Donald Trump at the California Republican Convention yesterday in Burlingame.","date":"2016-04-30 12:09:27","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_7076.jpg","categories":["News","Spotlight"],"tags":["2016","burlingame","donald","election","hyatt","presidentiale","protest","Republican","Trump"]},{"id":119645,"title":"Annual Team Math competition to be held Tuesday","permalink":"http:\/\/palyvoice.com\/2016\/04\/29\/annual-team-math-competition-to-be-held-tuesday\/","content":"The Annual Team Math competition, run by Palo Alto High School’s Math Club, will be held this Tuesday from 3:15 p.m. to 5:30 p.m. in the math building.\r\n\r\n<span style=\"font-weight: 400;\">Students will compete in teams of three to solve math problems and are encouraged to find group members that are in a range of different math classes. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"We want teams to match up people from a diverse range of math classes in order to give everyone an opportunity to compete, so we designed a point system based on the highest math class a participant has taken,\" said junior Jerry Hong, co-president of the Math Club.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Hong, groups must have between 8-10 points in order to compete, with the point distribution working as follows:<\/span>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/ATM_Pts.png\"><img class=\"alignnone size-full wp-image-119650\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/ATM_Pts.png\" alt=\"ATM_Pts\" width=\"600\" height=\"700\" \/><\/a>\r\n\r\n<span style=\"font-weight: 400;\">According to Hong, the ATM competition features three rounds: an individual competition, a team round, and a \"guts\" round, where the teams solve problem sets and get graded in real time.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to senior Lilia Tang, co-president of the Paly Math Club, the club added new features to the competition this year.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“[The math club] had a lot of fun writing the contest this year,\" Tang said. \"We even added a new round called 'guts,' where participants can see their results updated live, and part of it includes estimation questions where you get partial credit depending on how close you get to the answer.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Participating students will get free pizza and receive extra credit from their math teachers. The three highest scoring teams will win Amazon gift cards ranging from $10 to $25 per individual.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior Kelsey Wang, vice-president of the Math Club, says she believes that students can gain a lot from the experience of competing in the competition.<\/span>\r\n\r\n“I think the ATM is a great way for students of all levels of math to come together in teams and work on interesting problems together,\" Wang said. \"It is a unique contest that many people can enjoy because it allows participants to collaborate on math problems together, which isn't often seen in other contests and many math classes. I think there's something for everyone to contribute to their team and learn from the contest.”\r\n\r\n<span style=\"font-weight: 400;\">Students interested in signing up with a group can sign up <a href=\"https:\/\/liliatangxy.typeform.com\/to\/HEZ6dP\">here<\/a><\/span><span style=\"font-weight: 400;\">, and for those who want to participate but don’t have a group, and would like to be matched with one, can sign up <a href=\"http:\/\/paly.io\/atm-reg-indiv\">here<\/a>.<\/span><span style=\"font-weight: 400;\"> Students have until the end of the day on May 1 to <\/span><span style=\"font-weight: 400;\">sign up and\/or change their team’s information by replying to the confirmation email.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">For more information about the event, students can visit the <a href=\"http:\/\/paly.io\/atm-fb\">Facebook event<\/a>, or <a href=\"http:\/\/palymathclub@gmail.com\">email<\/a> the Math Club.\r\n<\/span>","excerpt":"The Annual Team Math competition, run by Palo Alto High School’s Math Club, will be held this Tuesday from 3:15 - 5:30 p.m. in the math building.","date":"2016-04-29 21:06:27","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/ATM_Feature_Pic_final.jpg","categories":["News","Spotlight"],"tags":["amazon gift cards","Annual Team Math competition","atm","competition","extra credit","gift cards","jerry hong","kelsey wang","Lilia Tang","math","math building","math competition","palo alto high school","paly","Paly Math Club","prizes","teamwork"]},{"id":119738,"title":"Liveblog: John Kasich speaks at Republican Convention","permalink":"http:\/\/palyvoice.com\/2016\/04\/29\/liveblog-john-kasich-speaks-at-republican-convention\/","content":"[caption id=\"attachment_119779\" align=\"alignnone\" width=\"620\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_7617.jpg\"><img class=\"wp-image-119779\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_7617.jpg\" alt=\"kasich convention\" width=\"620\" height=\"413\" \/><\/a> Delegates and guests file into a room at the Hyatt Regency in Burlingame. The California Republican Convention kicked off this weekend's event with a speech by presidential candidate Donald Trump earlier in the day. John Kasich, also a candidate, speaks tonight at a dinner banquet. Photo: Adrienne Kwok[\/caption]\r\n\r\nRepublican presidential candidate and Ohio governor John Kasich will be speaking at the Hyatt Regency tonight in Burlingame, Calif. during dinner banquet.\r\n\r\nCheck back at 7:30 p.m. to receive live updates on his speech.\r\n\r\n<hr \/>\r\n\r\n<strong>8:55 p.m. — <\/strong>Kasich finishes delivering his speech, wrapping up tonight's Republican dinner banquet.\r\n\r\n<strong>8:55 —<\/strong> \"We can provide hope. We can win.\"\r\n\r\n<strong>8:53 p.m. —<\/strong> Kasich says we need to recapture our former confidence and spirit to drive our nation forward.\r\n\r\n<strong>8:46 p.m. —<\/strong> \"I'm worried about a divided, polarized country, but it does not have to be that way.\"\r\n\r\n<strong>8:44 p.m. —<\/strong> \"I've been endorsed by over 70 newspapers. As if it mattered.\" Seems like he doesn't have much self-confidence in winning this election.\r\n\r\n<strong>8:42 p.m. —<\/strong> Kasich shifts the discussion to mental health, stating that proper medical treatment and improvement is needed to combat this problem.\r\n\r\n<strong>8:36 p.m. —<\/strong> \"Here's what I tell young people: you can have all the free you want but at the end of the day with the nation $30 trillion in debt, you might go to a free college but you won't be able to get a job,\" says Kasich, in reference to positions taken by Democratic presidential candidate Bernie Sanders.\r\n\r\n<strong>8:33 p.m. —<\/strong> \"I have been a Republican all my life,\" Kasich said. What happened to growing up in a Democratic family?\r\n\r\n<strong>8:29 p.m. —<\/strong> Kasich's grandparents arrived from Czechoslovakia and Yugoslavia, and barely spoke English, he says.\r\n\r\n<strong>8:25 p.m. —<\/strong> Kasich introduces himself. Having grown up in a blue-collar, Democratic family, he had never met a Republican in his youth.\r\n\r\n<strong>8:22 p.m. —<\/strong> Seated to our left is Peter Ohtaki, former Menlo Park mayor and a current delegate.\r\n\r\n<strong>8:20 p.m. —<\/strong> \"He is prepared to be Commander In Chief on day one and he has the track record to prove it.\"\r\n\r\n<strong>8:16 p.m. —<\/strong> As the dinner comes to an end, Kasich is introduced as \"the only adult in the room.\"\r\n\r\n<strong>8:14 p.m. —<\/strong> Currently we are sitting in the audience as people finish up their meals. Speakers should (hopefully) begin speeches shortly.\r\n\r\n<strong>8:04 p.m. —<\/strong> Currently sitting next to Ron Unz, who is running for Senate in the upcoming election. His campaign posters say \"Keep English Vote Ron Unz!\"\r\n\r\n[caption id=\"attachment_119780\" align=\"alignright\" width=\"294\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_7613.jpg\"><img class=\"wp-image-119780\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_7613.jpg\" alt=\"kasich food\" width=\"294\" height=\"196\" \/><\/a> The banquet food consisted of a three course meal: a spinach salad with ginger and apple; a main course of broccoli, steak and potatoes; and a raspberry dessert. Photo: Adrienne Kwok.[\/caption]\r\n\r\n<strong>7:45 p.m. —<\/strong> The wifi password here is \"hillarycantbetrusted.\"\r\n\r\n<strong>7:41 p.m. —<\/strong> Group prayer finished, speaker moves on to the\r\nPledge of Allegiance.\r\n\r\n<strong>7:39 p.m. —<\/strong> Republican leaders, including Chad\r\nMayes and Jean Fuller enter.\r\n\r\n<strong>7:35 p.m. —<\/strong> Dinner consists of a salad, warm bread rolls and a colorful yet mysterious dessert. This is a very elegant meal.","excerpt":"Republican presidential candidate John Kasich will be speaking at the Hyatt Regency tonight in Burlingame, Calif.","date":"2016-04-29 18:46:49","author":"Nika Woodfill","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/image.jpeg","categories":["News","Spotlight"],"tags":["2016","banquet","burlingame","convention","election","Food","john","kasich","President","Republican","Ron","Trump","unz"]},{"id":119686,"title":"Choir to perform &#8216;From The Ground Up&#8217; spring concert","permalink":"http:\/\/palyvoice.com\/2016\/04\/29\/choir-to-perform-from-the-ground-up-spring-concert\/","content":"[caption id=\"attachment_119714\" align=\"aligncenter\" width=\"316\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_78971.jpg\"><img class=\" wp-image-119714\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_78971.jpg\" alt=\"Photo by Morgan Keller.\" width=\"316\" height=\"421\" \/><\/a> Paly choir members prepare for the upcoming concert before class.  Photo by Morgan Keller.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\"><a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_7897.jpg\">\r\n<\/a>Palo Alto High School's spring choir concert will take place at 7:30 p.m. Friday at Grace Lutheran Church.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The concert, titled \"From the Ground Up,\" will feature arrangements by Mozart and Schubert, and include performances from not only the Concert Choir but also by Madrigal Singers, Beginning Choir, Spectrum Singers and Men's Chorus.<\/span>\r\n\r\n\"I'm very excited because we are performing the entire 'Schubert Mass' in G with the orchestra,\" junior choir member Georgina Wu said. \"The most exciting part I think is we get to work with them and we sound really good together.\"\r\n\r\nWhile the Concert Choir is performing the 'Schubert Mass' and folk songs at the beginning of the concert, English love songs, pop songs and Jewish songs will be performed by the Beginning Choir, Spectrum Singers and Men's Chorus afterwards. There will also be multiple soloists throughout the concert, according to Wu.\r\n\r\nJunior choir member Anisha Patwardhan says that the choir has been working very hard to prepare for the concert.\r\n\r\n<span style=\"font-weight: 400;\">“<\/span><span style=\"font-weight: 400;\">The spring concert is always a performance that displays our hard work and dedication throughout the year, so I am looking forward to showing off our best efforts,” Patwardhan said.  “Concert Choir has been working really hard to make sure that all of the pieces have the right dynamics, phrasing and energy.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Tickets cost $10 for adults, $5 for seniors and students and children ages 12 and under are free. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to choir teacher Michael Najar, the concert “<\/span><span style=\"font-weight: 400;\">looks to the earth and sky for its inspiration.\"<\/span>","excerpt":"The Palo Alto High School Spring choir concert, “From The Ground Up” will take place on Friday at Grace Lutheran Church at 7:30 p.m.","date":"2016-04-29 17:04:18","author":"Annika Behal","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/0000\/00\/IMG_0300_0.jpg","categories":["News","Spotlight"],"tags":["choir","concert","from the ground up","paly","preview"]}]