[{"id":123350,"title":"Advisory this week is for select freshmen (A-K)","permalink":"http:\/\/palyvoice.com\/2016\/09\/28\/advisory-this-week-is-for-select-freshmen-a-k\/","content":"","excerpt":"","date":"2016-09-28 20:22:09","author":"Chirag Akella","categories":["Ticker"],"tags":[]},{"id":123275,"title":"Admin calls for safety reform after bike accident","permalink":"http:\/\/palyvoice.com\/2016\/09\/27\/admin-calls-for-safety-reform-after-bike-accident\/","content":"[caption id=\"attachment_123296\" align=\"alignnone\" width=\"541\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/14453944_510840355707995_1799465017_o.jpg\"><img class=\" wp-image-123296\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/14453944_510840355707995_1799465017_o.jpg\" alt=\"Police block the intersection of Churchill Ave and Castillejah Ave where a car struck a Paly student this morning. &quot;I would love to say that it [the accident] would be the last time but until we get more measures in place, who knows,&quot; Diorio said.\" width=\"541\" height=\"407\" \/><\/a> Police block the intersection of Churchill Ave. and Castilleja Ave. where a car struck a Palo Alto High School student this morning. According to Principal Kim Diorio, further accidents may occur unless safety precautions are added to the dangerous intersection. \"I would love to say that it [the accident] would be the last time but until we get more measures in place, who knows,\" Diorio said. Photo: Rachel Code.[\/caption]Principal Kim Diorio is renewing her call for safety improvements at a key intersection after a driver struck a Palo Alto High School student while she biked to school at the intersection of Churchill Ave. and Castilleja Ave. this morning.\r\n\r\nAccording to Principal Kim Diorio, the student did not suffer any severe injuries, but EMTs took her to the hospital and she is expected to make a swift recovery.\r\n\r\n\"She was then transported to the hospital, and it sounds like she is going to be ok,\" Diorio said. \"The EMTs said that they wanted to transport her to the hospital just to make sure that everything was ok.\"\r\n\r\nDiorio said the driver remained with the student until paramedics and police arrived.\r\n\r\n\"The driver of the vehicle stayed on scene and police and paramedics were called,\" Diorio said. \"Police helped block Churchill while the Emergency Medical Technicians responded to the student.\"\r\n\r\nAccording to Diorio, she has always deemed the intersection unsafe.\r\n\r\n\"I often feel like it's [the intersection] just an accident waiting to happen given the number of bikes crossing and the people in a rush,\" Diorio said.\r\n\r\nTo increase the safety of students at the Churchill crossing, Diorio said the placement of a crossing guard next to the intersection will help keep drivers alert and prevent further accidents.\r\n\r\n\"I feel really strongly that we should have a crossing guard at the Churchill and Castilleja intersection,\" Diorio said. \"I've asked for the district to help provide the funding for that.\"\r\n\r\nDespite the frequent request from Diorio, the city has not yet come to a decision.\r\n\r\nDiorio said that the city is working on making the intersection safer.\r\n\r\n\"I know the city has done more signage and they're looking at the bike lane and that light, but a crossing guard would be my hope,\" Diorio said.\r\n\r\n&nbsp;","excerpt":"Principal Kim Diorio is renewing her call for safety improvements at a key intersection after a driver struck a Palo Alto High School student while she biked to school at the intersection of Churchill Ave. and Castilleja Ave. this morning.","date":"2016-09-27 17:29:46","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/14453944_510840355707995_1799465017_o.jpg","categories":["News","Spotlight","Uncategorized"],"tags":["accident","administration","bike","car","Car Crash","diorio","Kim Diorio","news","principal","student"]},{"id":122696,"title":"Featured Athlete: Runner Kent Slaney","permalink":"http:\/\/palyvoice.com\/2016\/09\/26\/featured-athlete-runner-kent-slaney\/","content":"Imagine: A six-year-old Kent Slaney dashes through the Escondido Elementary School playground, leaving his playmates in the dust. Breezing through the dreaded mile runs in P.E., and finishing just in time for a nap and his favorite Jamba Juice. Flash to today, Slaney is a key member of both the Palo Alto High School cross country and track and field teams, amazing his community and consistently breaks personal and course records.\r\n\r\nAccording to Senior Kent Slaney, he discovered running at a very young age, but credits his original involvement in the sport to Jamba Juice gift cards.\r\n\r\n\"I started running with Escondido jogging club,\" Slaney said. \"They were giving out Jamba Juice gifts cards, so I wanted one of those. I then started my first race, and things kept going from there.\"\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/Kent-2.jpg\"><img class=\"wp-image-122888 alignright\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/Kent-2.jpg\" alt=\"Senior Kent Slaney, Cross Country and Track runner, discusses his beginnings as an athlete.\" width=\"471\" height=\"628\" \/><\/a>\r\n\r\nAccording to Slaney, no one in his family had ever been runner, and his sudden growing interest in running gave his parents the idea of signing him up for his first race. He hasn't looked back since.\r\n\r\n\"My parents did that first race with me, but after that I was on my own and just enjoyed running.\" Slaney said. \"I did it whenever I could.\"\r\n\r\nAs a freshman, Kent Slaney broke three season records, landing him in the top 50 running times. As a sophomore, he broke two, and another in junior year at the Lowell invitational. If one were to look at his stats, they would see consistent broken personal records at nearly every cross country meet.\r\n\r\nCross country has a unique point system. The five fastest runners from each team to cross the finish line receive the points that correspond to their place. The first place runner receives one point, the second place runner two, and so on. The team receiving the lowest score wins, according to <a href=\"http:\/\/www.cougarsxc.com\/Info\/how_to_score_xc.html\">Capo Valley's Cross Country guide.<\/a>\r\n\r\nKent recounts the latest invitational and remarks on the teams performance as a whole.\r\n\r\n\"So far it's been pretty spectacular, both as a team and individually,\" Slaney said. \"At [the] Lowell [Invitational] we did great as a team. We got 41 points, and the next best team got 91. Also, in our first scrimmage with Gunn [High School], I broke a course record by 11 seconds. Looks like it's going to be a really great season,\" Slaney said.\r\n\r\nEach meet has its own set of records from past competitors. Slaney broke a course record for a meet against Gunn, with a time of 10:13 on a 2.2 mile course. Most recently, he has bested his past miles times with his new personal record of 4 minutes and 16.63 seconds, according to his <a href=\"http:\/\/www.athletic.net\/CrossCountry\/Athlete.aspx?AID=6003909#\/L0\">CA Cross Country Profile.<\/a>\r\n\r\nBut Slaney is more than just a cross country star; he aspires to pursue a career in STEM.\r\n\r\n\"I want to major in computer science or electrical engineering,\" Slaney said. \"I enjoy programming a lot, I'd enjoy going into that field. I'm also looking into recruitment options, and have been balancing running with academics.\"\r\n\r\nKent encourages everyone to give running a try.\r\n\r\n\"Running is something that when you put your effort into it, you enjoy it so much. You go out with all the problems in the world, and come back and none of them will matter.\"","excerpt":"Imagine: A six-year-old Kent Slaney dashes through the Escondido Elementary School playground, leaving his playmates in the dust. Flash to today, Slaney is a key member of both the Palo Alto High School cross country and track and field teams. He amazes his community and consistently breaks personal and course records.","date":"2016-09-26 22:13:20","author":"Bianca Al-Shamari","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/Kent-21.jpg","categories":["Features","Sports","Spotlight"],"tags":["Boys","cross country","featured athlete","gunn","kent slaney","lowell","palo alto","palo alto high school","paly","sports","track and field","vikings"]},{"id":123155,"title":"Liveblog: First Presidential debate","permalink":"http:\/\/palyvoice.com\/2016\/09\/26\/liveblog-first-presidential-debate\/","content":"Presidential candidates Hillary Clinton and Donald Trump will face off in the 2016 election's first debate tonight at Hofstra University.\r\n\r\nTune in at 6 p.m. for The Paly Voice's liveblog of the debate.\r\n\r\n<hr \/>\r\n\r\n<strong>7:42 p.m.<\/strong>\r\n\r\nThanks for tuning in to The Paly Voice's liveblog of this debate!\r\n\r\n<strong>7:41 p.m.<\/strong>\r\n\r\nThe debate is coming to a conclusion. The candidates' comments on security, racial tensions and international affairs were certainly illuminating — and entertaining.\r\n\r\n<strong>7:40 p.m.<\/strong>\r\n\r\n\"This was not a normal political event,\" says an NBC political commenter.\r\n\r\n<strong>7:39 p.m.<\/strong>\r\n\r\nHolt's last question to the candidates is whether they will accept the outcome of the election, whoever wins.\r\n\r\n\"I support our democracy,\" Clinton says.\r\n\r\n\"I want to make America great again,\" Trump says. He discusses illegal immigration problems in America.\r\n\r\n<strong>7:37 p.m.<\/strong>\r\n\r\n\"She's [Clinton's] spent hundreds of millions of dollars on negative ads on me, and many of them are untrue,\" Trump says.\r\n\r\n<strong>7:35 p.m.<\/strong>\r\n\r\nClinton cites her travels to 112 countries and her many actions as Secretary of State to prove her \"stamina.\"\r\n\r\n<strong>7:33 p.m.<\/strong>\r\n\r\nClinton laughs noiselessly at Trump as he states she does not have the stamina to be president.\r\n\r\n<strong>7:32 p.m.<\/strong>\r\n\r\n\"We can not be the policeman of the world,\" Trump says.\r\n\r\n<strong>7:32 p.m.<\/strong>\r\n\r\nAccording to Politifact, Trump overstated how much control inaina has over North Korea.\r\n\r\n<strong>7:31 p.m.<\/strong>\r\n\r\nClinton implies she will continue to support countries such as Germany and Japan--Even if they refuse to repay the US.\r\n\r\n<strong>7:29 p.m.<\/strong>\r\n\r\n\"We are not keeping up with other countries,\" Trump says on America's military tools. Trump says the Iran Deal was one of the worst deals he has ever seen.\r\n\r\n<strong>7:27 p.m.<\/strong>\r\n\r\nAccording to Politifact, Clinton is correct that the Iran Nuclear Deal put the lid on Iran’s nuclear program without violence.\r\n\r\n<strong>7:24 p.m.<\/strong>\r\n\r\nClinton says she spent a year forming a coalition with countries including China and Russia to put tough sanctions on Iran.\r\n\r\n<strong>7:23 p.m.<\/strong>\r\n\r\n\"I have much better judgment and temperament than she [Clinton] does,\" Trump says.\r\n\r\n<strong>7:21 p.m.<\/strong>\r\n\r\nClinton appears to be having a real hoot listening to Trump's claims on the Iraq War.\r\n\r\n<strong>7:20 p.m.<\/strong>\r\n\r\nHolt and Trump disagree over whether Trump originally supported the Iraq War.\r\n\r\n<strong>7:19 p.m.<\/strong>\r\n\r\nMany of the 28 North Atlantic Treaty Organization countries do not spend enough of their GDP on military purposes, Trump says. However, he says he supports NATO overall.\r\n\r\n<strong>7:17 p.m.<\/strong>\r\n\r\nClinton, instead of directly answering Holt's question, praises New York for its response to 9\/11.\r\n\r\n<strong>7:15 p.m.<\/strong>\r\n\r\nHolt questions the candidates on how they would prevent terrorist attacks in America.\r\n\r\nTrump blames the rise of ISIS on Obama's poor withdrawel from the Middle East. While this helped lead to the rise of ISIS, the group formed in 1999 and began growing more rapidly at the start of the Iraq War in 2003.\r\n\r\n<strong>7:13 p.m.<\/strong>\r\n\r\nClinton elaborates on her plan to defeat the Islamic State in Iraq and Syria.\r\n\r\n\"I will do everything possible to take out their leadership,\" Clinton said.\r\n\r\n<strong>7:11 p.m.<\/strong>\r\n\r\nTrump moves the conversation to the DNC \"scandal,\" as former DNC chairwoman Debbie Wasserman Schultz's emails were released.\r\n\r\n\"We need to get very tough on cyber-warfare,\" Trump said.\r\n\r\n<strong>7:09 p.m.<\/strong>\r\n\r\nTrump shakes his head as Clinton accuses him of inviting Russian President Putin to hack \"America.\"\r\n\r\n<strong>7:08 p.m.<\/strong>\r\n\r\n\"We're facing two different types of adversaries,\" Clinton says. \"There are hacker groups ... but increasingly we are seeing cyber attacks coming from states, or organs of states.\"\r\n\r\nClinton uses Russia as an example, stating how they hacked the Democratic National Committee's emails.\r\n\r\n<strong>7:04 p.m.<\/strong>\r\n\r\n\"He [Trump] has really started his political activities based on this racist lie that our first black president was not an American citizen,\" Clinton says. \"There was absolutely no evidence for it, but he persisted it year after year.\"\r\n\r\nClinton said Trump was sued by the Justice Department in the 1970s for refusing to rent out homes to African Americans.\r\n\r\n<strong>6:59 p.m.<\/strong>\r\n\r\nThe discussion moves to President Obama's birth information.\r\n\r\n<strong>6:57 p.m.<\/strong>\r\n\r\nTrump to Hillary: \"No, you're wrong, you're wrong.\"\r\n\r\nClinton and Trump are arguing over whether crime has dropped in New York City under the current mayor.\r\n\r\n<strong>6:55 p.m.<\/strong>\r\n\r\nTrump proudly states he has the endorsement of the National Rifle Association.\r\n\r\n<strong>6:53 p.m.<\/strong>\r\n\r\nClinton champions comprehensive background checks and more gun control, especially for those on the terrorist watch list.\r\n\r\n<strong>6:49 p.m.<\/strong>\r\n\r\n\"No, you're wrong,\" says Trump to Holt on the constitutionality of the stop and risk rule. Trump says he believes in increasing the presence of law and order to reduce violence.\r\n\r\n<strong>6:47 p.m.<\/strong>\r\n\r\n\"We have endorsements from nearly every police group,\" Trump says on his campaign. He says cities like Chicago are extremely dangerous and have had thousands of shootings since early 2016.\r\n\r\n<strong>6:46 p.m.<\/strong>\r\n\r\nClinton discusses her criminal justice reform ideas. \"We have to restore trust between communities and the police. We have to work to make sure our police have the best training. Everyone should respect the law and everyone should be respected by the law.\"\r\n\r\n<strong>6:44 p.m.<\/strong>\r\n\r\nTrump discusses the success in his business ventures. What about all the bankruptcies?\r\n\r\n<strong>6:41 p.m.<\/strong>\r\n\r\nAccording to Politifact, Trump was wrong about financial disclosures being better than tax returns.\r\n\r\n<strong>6:38 p.m.<\/strong>\r\n\r\nTrump: \"Our airports are like from a third world country. ... We are 20 trillion in debt and our country's a mess.\"\r\n\r\n<strong>6:37 p.m.<\/strong>\r\n\r\nClinton's monotonous speech makes it appear as if she has memorized her lines.\r\n\r\n<strong>6:36 p.m.<\/strong>\r\n\r\nClinton formulates several theories as to why Trump won't release his tax returns: he is not as charitable as he wants you to believe, he is not as rich as he says he is, he owes 350 million dollars to foreign banks and Wall Street or he pays nothing in taxes.\r\n\r\n<strong>6:34 p.m.<\/strong>\r\n\r\nThe crowd cheers as Trump says he will release his tax returns when Clinton releases her 33,000 deleted emails. Holt has to remind the crowd to remain silent.\r\n\r\n<strong>6:33 p.m.<\/strong>\r\n\r\nTrump promises to eventually release his tax returns.\r\n\r\n\"When we have a country thats doing so badly, thats getting ripped off by every other country...\" Trump tends to not finish his sentences.\r\n\r\n<strong>6:31 p.m.<\/strong>\r\n\r\n\"We are in a big, fat, ugly bubble,\" Trump says. He really loves his adjectives!\r\n\r\n<strong>6:30 p.m.<\/strong>\r\n\r\nClinton champions making college debt-free and eradicating advantages of the top 1 percent.\r\n\r\n<strong>6:29 p.m.<\/strong>\r\n\r\n\"I have a feeling that by the end of this debate, I'll be blamed for everything,\" Clinton says.\r\n\r\nTrump interrupts Clinton's two minutes, deriding her job proposals.\r\n\r\n<strong>6:27 p.m.<\/strong>\r\n\r\n\"I'm calling for new jobs. ... The wealthy will create tremendous jobs [with tax cuts],\" Trump says.\r\n\r\n<strong>6:25 p.m.<\/strong>\r\n\r\nAccording to Politifact, Trump is correct in saying that Clinton flip-flopped on her support of the Trans-Pacific Partnership.\r\n\r\n<strong>6:23 p.m.<\/strong>\r\n\r\nClinton employs shameless self-promotion of her own book.\r\n\r\n<strong>6:23 p.m.<\/strong>\r\n\r\n\"Donald, I know you live in your own reality,\" Clinton says. Ouch.\r\n\r\n<strong>6:22 p.m.<\/strong>\r\n\r\n\"NAFTA [North American Free Trade Agreement] was one of the worst things to ever happen to the manufacturing industry,\" Trump says on the agreement Bill Clinton supported.\r\n\r\n<strong>6:20 p.m.<\/strong>\r\n\r\nHillary Clinton commends the job and manufacturing growth during her husband's presidency.\r\n\r\n<strong>6:19 p.m.<\/strong>\r\n\r\n\"I'm a great believer in all forms of energy ... but our energy policies are a disaster. Our country is losing so much in terms of energy and paying off its debt,\" Trump says on his energy policy. According to Trump, President Barack Obama has doubled America's level of debt.\r\n\r\n<strong>6:17 p.m.<\/strong>\r\n\r\n\"We would lose three and a half million jobs and maybe have another recession\" if Trump's economic plans are passed, according to Clinton.\r\n\r\n<strong>6:15 p.m.<\/strong>\r\n\r\nAccording to Politifact, Trump's tax-alleviating plan would benefit the top 0.1% more than the bottom 60%.\r\n\r\n<strong>6:14 p.m.<\/strong>\r\n\r\n\"I want you [Clinton] to be happy. It's very important to me,\" says Trump.\r\n\r\nTrump is spending a lot of time complaining about foreign countries.\r\n\r\n<strong>6:12 p.m.<\/strong>\r\n\r\nHillary Clinton says that Trump believes helping wealthy people will benefit all, but she disagrees. Clinton also highlights her goal of reducing income inequality, rewarding work rather than transactions and investing in the middle class.\r\n\r\n<strong>6:11 p.m.<\/strong>\r\n\r\n\"Our jobs are fleeing the country. They are going to Mexico, they are going to other countries. ... They are using our country as a piggy bank to rebuilt China and many other countries are doing the same thing. we are losing out good jobs. ... Ford is leaving, this small car division. Thousands of jobs leaving Michigan, Ohio, they're all leaving and we can't allow it to happen anymore. We have to stop our jobs from being stolen from us.\"\r\n\r\nHe plans on reducing taxes from 35 percent to 15 percent for corporations.\r\n\r\n<strong>6:08 p.m.<\/strong>\r\n\r\n\"The central question in this election is really what kind of country we want to be and what kind of future we want to built together,\" Clinton says.\r\n\r\nTrump continues to scowl as Clinton speaks.\r\n\r\n<strong>6:04 p.m.<\/strong>\r\n\r\nThe two candidates are entering the stage.\r\n\r\n<strong>6:04 p.m.<\/strong>\r\n\r\nAchieving prosperity, America's direction, and securing America will be the three topics discussed tonight.\r\n\r\n<strong>6:03 p.m.<\/strong>\r\n\r\n\"Her [Hillary Clinton's] need is to relate to people, especially those millennial voters,\" says a reporter.\r\n\r\n<strong>6:01 p.m.<\/strong>\r\n\r\nLester Holt, a registered Republican, will be moderating this debate.\r\n\r\n<strong>5:57 p.m.<\/strong>\r\n\r\nNational Broadcasting Company states that to Trump's podium is 10 inches taller than Clinton's to make up for the height difference.","excerpt":"Presidential candidates Hillary Clinton and Donald Trump will face off in the 2016 election&#8217;s first debate tonight at Hofstra University. Tune in at 6 p.m. for The <a href=\"http:\/\/palyvoice.com\/2016\/09\/26\/liveblog-first-presidential-debate\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2016-09-26 13:20:34","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/hillary-clinton-Donalt-Trump-800x600.jpg","categories":["Election 2016","Entertainment","Spotlight"],"tags":["Clinton","debate","donald","Hillary","Trump"]},{"id":123014,"title":"Madrono staff to hold free senior portrait sessions","permalink":"http:\/\/palyvoice.com\/2016\/09\/25\/madrono-staff-to-hold-free-senior-portrait-sessions\/","content":"The Madrono staff is holding several photo-taking sessions for all seniors seeking free portraits. The photo sessions will take place on the Quad next week during Tutorial, Advisory and sixth period.\r\n\r\nSeniors are also permitted to hire professional photographers or take their own portraits. Previously, students were only allowed to choose from several professional photographers if they chose not to attend a free portrait-taking session.\r\n\r\n<span style=\"font-weight: 400;\">“Anyone can take senior portraits — students, professional photographers [and] siblings,” Madrono Editor-in-Chief senior Jacqueline Moore said. “As long as you have a relatively good camera, you can take your own portrait.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Portrait guidelines will remain unchanged from last year. Seniors must be the main focus of the photo, wear appropriate clothing and have an unobscured face.<\/span>\r\n\r\n“It [the photo session] is a great thing, especially for those who don’t want to go out of their way to find a photographer,” senior Isaac Satz said. “It provides a service that is necessary, because everyone should have a yearbook portrait, so I’m really happy that the school has this program and I’m definitely going to make use of it.”\r\n\r\nPortraits are due to Madrono adviser Brian Wilson on a flash drive. They must be turned into Media Arts Center room 104 by Oct. 13.\r\n\r\n<span style=\"font-weight: 400;\">Both senior quotes and portraits are due on Oct. 13 and a baby ad workshop will take place Oct. 6 in MAC 104 from 12:30 to 5 p.m. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">More information about dates and photo restrictions can be found on the Madrono <\/span><a href=\"http:\/\/palymadrono.com\"><span style=\"font-weight: 400;\">website<\/span><\/a><span style=\"font-weight: 400;\"> or <\/span><a href=\"http:\/\/facebook.com\/TheMadrono\"><span style=\"font-weight: 400;\">Facebook page<\/span><\/a><span style=\"font-weight: 400;\">.<\/span>\r\n\r\n&nbsp;","excerpt":"The Madrono staff is holding several photo-taking sessions for all seniors seeking free portraits. The photo sessions will take place on the Quad next week during Tutorial, Advisory and sixth period.","date":"2016-09-25 15:32:29","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/IMG_94471.jpg","categories":["News","Spotlight"],"tags":["jacqueline","Madrono","moore","portraits","senior","yearbook"]},{"id":122987,"title":"Vikings conquer Santa Clara despite injuries","permalink":"http:\/\/palyvoice.com\/2016\/09\/25\/vikings-conquer-santa-clara-despite-injuries\/","content":"[caption id=\"attachment_123105\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/PJIII-Photo.jpg\"><img class=\"size-full wp-image-123105\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/PJIII-Photo.jpg\" alt=\" Junior running back Paul Jackson III breaks through the Santa Clara High School defense Friday night during a home football game at the Palo Alto High School stadium. The Vikings defeated the Bruins 44-31 and displayed a dominant offensive performance. According to junior running back Paul Jackson III despite making multiple errors the team was able to recover quickly which ultimately allowed them to defeat the Bruins. &quot;We had a lot of mistakes though I think we bounced back and adjusted well,&quot; Jackson said.\" width=\"600\" height=\"400\" \/><\/a> Junior running back Paul Jackson III breaks through the Santa Clara High School defense Friday night during a home football game at the Palo Alto High School stadium.  According to Jackson, the team's quick recovery from mistakes was a key factor in their victory. \"We had a lot of mistakes though I think we bounced back and adjusted well,\" Jackson said.  Photo: Adee Newman[\/caption]\r\n\r\nA solid running game combined with fierce offensive pressure allowed the Palo Alto High School football team (2-3, 1-0) to make up for the absence of key players and to defeat the Santa Clara High School Bruins (2-3, 0-1), 44-31, Friday night at the Viking Stadium.\r\n\r\nThe Vikings played a great game, and they put up 44 points despite losing multiple scoring opportunities by turning the ball over.\r\n\r\nMany important players were out due to injuries. Among them were high performing members of the team, such as senior quarterback Jordan Schilling.\r\n\r\nJunior running backs Paul Jackson III and Sione Latu were crucial for Paly's success, each scoring two touchdowns and providing consistent offensive pressure throughout the game.\r\n\r\nJackson III said that the Vikings' hard-working offensive line propelled the team to victory.\r\n\r\n\"I had so much confidence in them [the offensive line] today,\" Jackson said. \"They've been working hard all week and I may not always play the best but they definitely are the stars.\"\r\n\r\nViking assistant coach Jack Schweitzer said the team would be focusing on executing the fundamentals and on avoiding costly errors.\r\n\r\n\"To be honest we wanted to play a really clean game,\" Schweitzer said. \"We wanted to play mistake free and for us it was executing what our base offense was and just getting back to some of what we like to do.\"\r\n\r\nAccording to Schweitzer, although many excellent Vikings were injured, getting some of the less-experienced players out on the field will only benefit the team overall.\r\n\r\n\"It's kind of cliché, but it's like next man up,\" Schweitzer said. \"It's unfortunate that we have some guys injured, but the nice thing is that a lot of these guys that are injured we expect to have back so getting some other guys playing time should only help us in the long run.\"\r\n\r\nDespite a strong offensive showing, the Vikings struggled to keep possession of the football, accumulating six turnovers over the course of the game.\r\n\r\n\"At times we were successful, but obviously we turned the ball over six times, we didn't do exactly what we wanted all the time,\" Schweitzer said.\r\n\r\nAccording to Schweitzer, the team will avoid possession mistakes by adjusting their mental game.\r\n\r\n\"A lot of the turnovers are just a mindset problem,\" Schweitzer said. \"It's just putting it [keeping possession] in these guys' [the offense's] heads and emphasizing it every day.\"\r\n\r\nThe Vikings look to take home another victory in two weeks against Saratoga High School at Paly.","excerpt":"A solid running game combined with fierce offensive pressure allowed the Palo Alto High School football team (2-3, 1-0) to make up for the absence of key players and to defeat the Santa Clara High School Bruins (2-3, 0-1), 44-31, Friday night at the Viking Stadium.","date":"2016-09-25 12:22:41","author":"William Sallomi","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/PJIII-Photo.jpg","categories":["Football","Sports","Sports Recap","Spotlight"],"tags":["football","paul","paul jackson","paul jackson iii","recap","sports"]},{"id":122730,"title":"Online homework becomes an official part of math curriculums","permalink":"http:\/\/palyvoice.com\/2016\/09\/24\/online-homework-becomes-an-official-part-of-math-curriculums\/","content":"<span style=\"font-weight: 400;\">Algebra 2 and Intro to Analysis and Calculus teachers are <\/span><span style=\"font-weight: 400;\">making <a href=\"https:\/\/www.mathxlforschool.com\/home_school.htm\">MathXL for school<\/a>, an online math homework program, an official part of their curriculum for the 2016-17 school year.<\/span>\r\n\r\nAfter running MathXL as a pilot program last year, math teacher Sharla May advocated for the program to replace normal homework.\r\n\r\n[caption id=\"attachment_122765\" align=\"alignright\" width=\"429\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/IMG_6460-1.jpg\"><img class=\" wp-image-122765\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/IMG_6460-1.jpg\" alt=\"Junior Claire Lin completes her math homework on MathXLForSchool during flex. Photo by: Daniella Maydan\" width=\"429\" height=\"572\" \/><\/a> Junior Claire Lin completes her math homework on MathXLForSchool during flex. Photo by: Daniella Maydan[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">“Last fall, I asked if I could pilot the use of MathXL in my Algebra 2, and by second semester, math teacher Natalie Docktor and I were both interested in expanding the pilot to our IAC classes,” May said. “MathXL for School is now the official homework platform for all Algebra 2 and IAC classes this year. Ideally, students work the problems on paper, as they would if they copied the problems from the book. The difference is that they submit their answers online to check, rather than turn in the paper.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Docktor, students are given three tries to get a problem correct. There is also the option to use up one of their three tries to view the correct way to solve a problem. After each incorrect try, the program shows step-by-step instructions on how the student should have solved the problem.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">While students must complete all of the assigned problems, they only have to get 80 percent of the questions correct for them to receive full credit for the assignment. Additionally,  If students receive less than 80 percent, they can choose to do additional problems until their percent accuracy rises to 80 percent, meaning that it is always possible for students to receive full credit on their homework assignments, according to May.<\/span>\r\n\r\nAccording to May, a big advantage to completing homework through MathXL is that the program provides instant feedback.\r\n\r\n<span style=\"font-weight: 400;\">“Traditional homework is scored based on completeness and the accuracy of two problems, and the turnaround for feedback was about two class periods, on average,” May said. “Unlike traditionally scored homework assignments, each problem in MathXL is scored as it is submitted and feedback about errors is also given. Another pro is that it is directly correlated to the textbook, and since it is produced by the textbook’s publisher, the problems mirror the exercises in the book.”<\/span>\r\n\r\nJunior Alexander Juncosa appreciates the convenience of using MathXL instead of paper homework.\r\n\r\n<span style=\"font-weight: 400;\">“I like this a lot more because it is convenient that you can access your homework at any time or place, just as long as you have a computer,\" Juncosa said. \"This way, you can never lose your homework or forget it at home.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">While junior Claire Lin prefers the on-paper homework to online homework, she appreciates the fact that MathXL provides students with example problems.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“If I am stuck on a problem the program has similar example problems and they give you step-by-step instructions on how to solve them,” Lin said. “The program’s example problems are super helpful, especially if you aren’t super strong on solving a particular type of problem.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Despite its upsides, May and many of the students favor certain aspects of the paper homework. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to May, the largest downside to MathXL is that there may be certain types of problems that are not given through MathXL. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Not every question in the textbook has an accompanying problem in the MathXL system, so some problems I may want to assign aren’t available—such problems would be used as warm-ups or in-class practice,” May said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Junior Kelsey Lu finds that it is harder to learn when completing math problems online.<\/span>\r\n\r\n“When you are writing on paper, it enforces organization,\" Lu said. \"It really helps when you want to take a step back. So if you don’t understand what you are doing wrong, writing your homework on paper allows you to go back and look at all of your steps to figure out where you went wrong. I also prefer it when a teacher checks over my work, because on MathXLForSchool you can do something wrong but still get the correct answer and then you will never find out that you didn’t understand the concept.”\r\n\r\n<span style=\"font-weight: 400;\">Despite being made an official part of the Algebra 2 and IAC curriculums, May says that the program’s effect on student performance is not yet clear. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Looking at data from some chapter tests, there did not seem to be a significant difference in test scores for students who used the textbook versus those who used MathXL in the IAC classes,” May said. “However, I did see a significant difference in my Algebra 2 students’ test scores.  However, another variable in that Algebra 2 difference was whether the students did homework, or not. We will be able to make comparisons of last year versus this year’s test scores from Ch. 2 on up.”<\/span>","excerpt":"Algebra 2 and Intro to Analysis and Calculus are officially introducing MathXLForSchool, an online math homework program, into their curriculum. After running MathXL as a pilot program last year, math teacher Sharla May advocated for the program to replace normal homework. ","date":"2016-09-24 16:22:10","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/IMG_6460-11.jpg","categories":["Features","Spotlight"],"tags":["Alg2","classes","homework","IAC","math","mathxl","paly"]},{"id":122933,"title":"Recap: Girls&#8217; volleyball snaps three-year losing streak against Los Altos","permalink":"http:\/\/palyvoice.com\/2016\/09\/23\/recap-girls-volleyball-snaps-three-year-losing-streak-against-los-altos\/","content":"[caption id=\"attachment_122996\" align=\"alignnone\" width=\"586\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/Volleyball-Vs-Los-Altos.jpg\"><img class=\" wp-image-122996\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/Volleyball-Vs-Los-Altos.jpg\" alt=\"!!!!!\" width=\"586\" height=\"388\" \/><\/a> The Palo Alto High School girls' varsity team huddles up during a time out last night in the Gunn High School gym. The Vikings triumphed over the Los Altos High School Eagles in three sets to continue their undefeated season. According to senior outside hitter Fiona Green, the Vikings' solid start indicates lots of potential for a great year.  \"So far the season has been going really well,\" Green said. \"We've won all our games and that just shows that we have a lot of potential for the rest of the year.\" Photo: Tanner Newell.[\/caption]\r\n\r\nShattering a three-year losing streak against a nearby rival, the Palo Alto High School girls' volleyball team (8-4, 4-0) defeated the Los Altos Eagles (6-6, 1-2), last night at the Gunn High School gym in three close sets.\r\n\r\nThe girls played a great match, taking each set with the same score: 25-22.\r\n\r\nViking coach Jekara Wilson said she is celebrating the win as a solid performance from all members of the team as well as the long-awaited end of a three-year losing streak to the Eagles.\r\n\r\n\"I think all the girls played extremely well and it was a great match,\" Wilson said. \"We haven't beaten Los Altos in three years so it was a huge win for us.\"\r\n\r\nAccording to senior outside hitter Fiona Green, the Vikings' rigorous preseason schedule helped prepare them for a successful season.\r\n\r\n\"We played some really tough teams in the preseason, and even though we lost they really helped us get ready for future games,\" Green said.\r\n\r\nAccording to senior setter Jessica Lee, the team had a solid performance despite making a few mistakes.\r\n\r\n\"We played pretty consistently and our energy was good throughout the game,\" Lee said. \"We definitely made a few error runs but overall we did a good job.\"\r\n\r\nAccording to Lee, the team will look to improve by reducing avoidable mistakes.\r\n\r\n\"We need to not make as many errors in a row so that the other team doesn't go on many runs,\" Lee said.\r\n\r\nJunior outside hitter Chelsea Fan said that believes the team is off to a great start, and will continue to perform at a high level.\r\n\r\n\"I think the season's been going pretty well,\" Fan said. \"We've won all of our league games, and we've beat Los Gatos and Los Altos and those are pretty big rivals [for Paly].\"\r\n\r\nThe Vikings look to continue their winning streak on Tuesday against Homestead High School.","excerpt":"The Palo Alto High School girls' volleyball team (8-4, 4-0) defeated the Los Altos Eagles (6-6, 1-2) for the first time in three years at the Gunn High School gym in three close sets.\r\n\r\n","date":"2016-09-23 20:58:46","author":"William Sallomi","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/Volleyball-Vs-Los-Altos.jpg","categories":["Sports","Spotlight","Volleyball"],"tags":["los altos","los altos high school","recap","sports","volleyball"]},{"id":122976,"title":"Liveblog: Football takes on Santa Clara","permalink":"http:\/\/palyvoice.com\/2016\/09\/23\/liveblog-football-takes-on-santa-clara\/","content":"<p style=\"text-align: left;\">Welcome to the Paly Voice liveblog! Tonight, Santa Clara takes on our Paly Vikings at home. [liveblog]<\/p>","excerpt":"Welcome to the Paly Voice liveblog! Tonight, Santa Clara takes on our Paly Vikings at home. ","date":"2016-09-23 19:08:05","author":"Kasra Orumchian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/A6F1852.jpg","categories":["Sports"],"tags":[]},{"id":122686,"title":"The problem with our theme selection process","permalink":"http:\/\/palyvoice.com\/2016\/09\/23\/the-problem-with-our-theme-selection-process\/","content":"<span style=\"font-weight: 400;\">Spirit Week at Palo Alto High School certainly brings out plenty of passion and enthusiasm in many of its stress-ridden students. Some sacrifice their voices to scream cheers at lunchtime rallies, others spend countless hours in the auto shop perfecting their floats, and others wake up early every morning to make sure their outfit and face paint will secure their grade that day’s best-dressed points. Students with a vast variety of interests and talents all come together during this one week of the school year and unite under one common goal: to prove their class is superior.<\/span>\r\n\r\n<span style=\"line-height: 1.5;\">The motto of Spirit Week is always to “go all out,” but is there such a thing as going too far? Last weekend’s eruption on the Paly class of 2018 Facebook page surely proves so.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The current junior class was filled with anticipation for this upcoming spirit week, following a narrow, yet disappointing, third place loss in 2015. Despite the placement, the class of 2018 gave an outstanding performance given their underclassman status, and look back on it positively.<\/span>\r\n\r\n[caption id=\"attachment_110599\" align=\"alignright\" width=\"506\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/I9P5883.jpeg\"><img class=\" wp-image-110599\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/I9P5883.jpeg\" alt=\"The class of 2018 shows off their float at the final rally of spirit week 2015. Photo by Cooper Lou.\" width=\"506\" height=\"337\" \/><\/a> The Class of 2018 shows off its float at the final rally of Spirit Week 2015. Photo by Cooper Lou.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Many credited the theme, \"lifeguards,\" for the grade’s success last year. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Our theme played a huge role in our success last year,” junior Chloe Iglehart said. “Monday’s [theme day] dress up was very consistent and you could tell what our theme was by looking at anyone in our grade. It really unified our class and brought a lot of enthusiasm to the rallies, dance, and float building.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">As one can imagine, when it came time to vote for the theme that could unify the grade yet again, many felt that it was a make-or-break decision for their chance at redemption during Spirit Week 2016. However, when the results of the final vote were posted, the outcome was anything but unification. Not only was the entire class divided, but many personally attacked other students, accused the Associated Student Body of rigging the vote, and put the success of the class on the line by threatening to withdraw their participation. Supporters of the selected theme, the \"70s,\" were quick to reply with equally irrational responses. Within minutes, the class Facebook page exploded into chaos, intense battles in the comment sections, passive-aggressive posts, and innumerable notifications piling up on the lock screens of the junior class. In the end, ASB junior officers succumbed to the pressure and held a re-vote, which resulted in a change in the final theme from \"70s\" to \"boxing.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The results of the original vote out of 138 students were 43% 70s, 34% boxing and 23% rockstars, according to Junior Class Vice President Marissa Ludwig. While no theme won by a landslide, it was not particularly close either. Issues were raised over how ASB officers publicized the votes, despite being announced on Facebook, Instagram, and Schoology, as well as in each theme meeting. Boxing won by a landslide in the second vote, which was out of 201 students, but many \"70s\" supporters were forced to surrender their opinions to settle the conflict. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The actions taken by many students on both sides of the argument, myself included, were shameful. It was unfortunate to watch how such a passion for Spirit Week could transform into something so vicious, so quickly. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">It is obvious that none of the participating students intended for this to get out of hand as it did. Many acted out of character, driven only by their competitive spirit and their passion for the Paly tradition. However, no matter what the reason is, a vote is a vote. The majority selected a theme, and the class should have unified behind it.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The purpose of a democratic vote is to find and follow the decision of the majority, whether an individual agrees with it or not. For an event o<\/span><span style=\"font-weight: 400;\">n the idea of coming together, threatening to ruin that unity over something as minute as a theme is unfair to the remainder of the class. Especially when that remainder is the majority. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The vast number of those speaking out on Facebook demanded a re-vote, but a silent majority voted for the winning theme. Both sides had representatives who were frustrated, angry and unafraid to speak their minds. I myself was conflicted on the solution. Should we undercut the significance of a democratic vote, to ensure that our grade be unified to maximize our shot at redemption? After sleeping on it, I feel the results from the original vote should have been upheld.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Let me make this clear, I did not come to this conclusion based on the fact that the theme of my choice won the original vote. My decision is based on the fact that I feel, through a re-vote, a majority of our class lost their voices. Simply because one is not outspoken, or willing to battle it out on social media to prove their point of view, should not make their opinion any less valuable than those who are. By allowing a re-vote after a decision had already been made, it sends a message that the loud and outgoing are valued over the quiet and shy, a common misconception in today's society. No matter the class officers’ intentions, sadly, this is the result. Spirit Week is a week dominated by the outgoing extroverts, and one of the few ways that those who aren’t comfortable dressing up crazy and screaming their lungs out can get involved is by voting for what the focus of their week will be. Unfortunately, now that has been taken away too. <\/span>\r\n\r\nClass unity is by far the most important aspect of Spirit Week, and it is impossible for a class to be unified if the precedent is that half of the students do not matter. In the end, we all understand that what makes a grade truly successful during Spirit Week is not a theme, but coming together. Fortunately, I have complete faith in the Class of 2018. We are a class full of passion, energy, and competitive spirit. While we are off to a bumpy start, our divided grade will soon put our disagreements behind us and join together once again. But what will happen for years to come?\r\n\r\nThis is certainly not the first time a class has experienced such disorder surrounding a Spirit Week theme. The current senior class suffered a similar fate during Spirit Week 2014, after their preferred theme, USA, was shot down by administration. They quickly made the decision to adopt a new theme, \"red card,\" which frustrated many. The Class of 2018's recent outburst may not simply have been due to a lack of maturity, but representative of a greater issue with Paly's entire theme-selection process.\r\n\r\n[caption id=\"attachment_77275\" align=\"alignleft\" width=\"470\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/soph1.jpg\"><img class=\"wp-image-77275\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/soph1.jpg\" alt=\"The class of 2017 dons soccer uniforms in honor of their theme &quot;red card&quot; during spirit week 2014. The theme was also a result of a re-vote after controversy over their first theme. Photo by Adele Bloch.\" width=\"470\" height=\"313\" \/><\/a> The class of 2017 dons soccer uniforms in honor of their theme \"red card\" during Spirit Week 2014, after much controversy over its selection. Photo by Adele Bloch.[\/caption]\r\n\r\nIt is only fair that the Spirit Week theme be decided by the students through a democratic vote to ensure that every student has an equal say in determining their theme. No one will be happy if administration is forced to make these critical decisions for us, but if this method of Athenian Democracy continues to fall, we may have no other choice.\r\n\r\nOur final option is to, rather than throw our entire system out, simply reform it. Currently, much of selection process is left up to class officers to organize, publicize, and enforce, independent of other grades. This freedom, while it may seem more convenient, complicates the process and creates confusion and disorder among the students. Instead of allowing the continuation of this free-for-all in future years, we need to standardize our theme selection process for all grades. Each year, freshmen, sophomores, juniors and seniors all need to hold individual in-person meetings to discuss ideas during the same week. This should be directly followed by an online poll, that will always take place the following day, and left up for 24 hours. This will minimize confusion about when the poll is up, and give everyone enough time to process the information and make a thoughtful decision. This poll can then be followed up by a final vote of the same structure between only the top themes, and once the results are in, the decision is final.\r\n\r\nResults of the final vote also need to be publicized. This will squash ridiculous assumptions that the vote was somehow rigged, and allow students to get a sense of where the majority of their class truly lies, instead of being overpowered by the stronger voices.\r\n\r\nFinally, the administration needs to be more vigilant about managing the reaction of students after the final vote. It is not okay to react in such a destructive, hostile way, especially surrounding something meant to strengthen class unity and cooperation. With more management by administration on this controversial issue, students will be forced to communicate in a much more appropriate and construction manner. Administration should also be more clear with regards to which themes meet their qualifications, which will avoid last minute chaos and further controversy.\r\n\r\nThese adjustments do not demand any major change. They simply require a little more thought than we are currently putting into the process. We can stop this cycle before the Classes of 2019 and 2020 suffer similar fates to those of 2017 and 2018. Spirit Week is without a doubt one of the most positive high school experiences Paly has to offer, so let's stop marring it with controversy and disharmony, and make it just that much better.","excerpt":"The Class of 2018's recent outburst may not simply have been due to a lack of maturity, but representative of a greater issue with Paly's entire theme selection process.\r\n","date":"2016-09-23 17:38:15","author":"Maya Reuven","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/I9P5883.jpeg","categories":["Opinion","Spotlight"],"tags":["2018","70s","ASB","boxing","disco","Facebook","juniors","lifegaurds","rockstar","spirit week 2016","unity"]}]