[{"id":122933,"title":"Recap: Girls&#8217; volleyball snaps three-year losing streak against Los Altos","permalink":"http:\/\/palyvoice.com\/2016\/09\/23\/recap-girls-volleyball-snaps-three-year-losing-streak-against-los-altos\/","content":"[caption id=\"attachment_122996\" align=\"alignnone\" width=\"586\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/Volleyball-Vs-Los-Altos.jpg\"><img class=\" wp-image-122996\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/Volleyball-Vs-Los-Altos.jpg\" alt=\"!!!!!\" width=\"586\" height=\"388\" \/><\/a> The Palo Alto High School girls' varsity team huddles up during a time out last night in the Gunn High School gym. The Vikings triumphed over the Los Altos High School Eagles in three sets to continue their undefeated season. According to senior outside hitter Fiona Green, the Vikings' solid start indicates lots of potential for a great year.  \"So far the season has been going really well,\" Green said. \"We've won all our games and that just shows that we have a lot of potential for the rest of the year.\" Photo: Tanner Newell.[\/caption]\r\n\r\nShattering a three-year losing streak against a nearby rival, the Palo Alto High School girls' volleyball team (8-4, 4-0) defeated the Los Altos Eagles (6-6, 1-2), last night at the Gunn High School gym in three close sets.\r\n\r\nThe girls played a great match, taking each set with the same score: 25-22.\r\n\r\nViking coach Jekara Wilson said she is celebrating the win as a solid performance from all members of the team as well as the long-awaited end of a three-year losing streak to the Eagles.\r\n\r\n\"I think all the girls played extremely well and it was a great match,\" Wilson said. \"We haven't beaten Los Altos in three years so it was a huge win for us.\"\r\n\r\nAccording to senior outside hitter Fiona Green, the Vikings' rigorous preseason schedule helped prepare them for a successful season.\r\n\r\n\"We played some really tough teams in the preseason, and even though we lost they really helped us get ready for future games,\" Green said.\r\n\r\nAccording to senior setter Jessica Lee, the team had a solid performance despite making a few mistakes.\r\n\r\n\"We played pretty consistently and our energy was good throughout the game,\" Lee said. \"We definitely made a few error runs but overall we did a good job.\"\r\n\r\nAccording to Lee, the team will look to improve by reducing avoidable mistakes.\r\n\r\n\"We need to not make as many errors in a row so that the other team doesn't go on many runs,\" Lee said.\r\n\r\nJunior outside hitter Chelsea Fan said that believes the team is off to a great start, and will continue to perform at a high level.\r\n\r\n\"I think the season's been going pretty well,\" Fan said. \"We've won all of our league games, and we've beat Los Gatos and Los Altos and those are pretty big rivals [for Paly].\"\r\n\r\nThe Vikings look to continue their winning streak on Tuesday against Homestead High School.","excerpt":"The Palo Alto High School girls' volleyball team (8-4, 4-0) defeated the Los Altos Eagles (6-6, 1-2) for the first time in three years at the Gunn High School gym in three close sets.\r\n\r\n","date":"2016-09-23 20:58:46","author":"William Sallomi","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/Volleyball-Vs-Los-Altos.jpg","categories":["Sports","Spotlight","Volleyball"],"tags":["los altos","los altos high school","recap","sports","volleyball"]},{"id":122976,"title":"Liveblog: Football takes on Santa Clara","permalink":"http:\/\/palyvoice.com\/2016\/09\/23\/liveblog-football-takes-on-santa-clara\/","content":"<p style=\"text-align: left;\">Welcome to the Paly Voice liveblog! Tonight, Santa Clara takes on our Paly Vikings at home. [liveblog]<\/p>","excerpt":"Welcome to the Paly Voice liveblog! Tonight, Santa Clara takes on our Paly Vikings at home.","date":"2016-09-23 19:08:05","author":"Sherwin Amsbaugh","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/A6F1852.jpg","categories":["Sports"],"tags":[]},{"id":122686,"title":"The problem with our theme selection process","permalink":"http:\/\/palyvoice.com\/2016\/09\/23\/the-problem-with-our-theme-selection-process\/","content":"<span style=\"font-weight: 400;\">Spirit Week at Palo Alto High School certainly brings out plenty of passion and enthusiasm in many of its stress-ridden students. Some sacrifice their voices to scream cheers at lunchtime rallies, others spend countless hours in the auto shop perfecting their floats, and others wake up early every morning to make sure their outfit and face paint will secure their grade that day’s best-dressed points. Students with a vast variety of interests and talents all come together during this one week of the school year and unite under one common goal: to prove their class is superior.<\/span>\r\n\r\n<span style=\"line-height: 1.5;\">The motto of Spirit Week is always to “go all out,” but is there such a thing as going too far? Last weekend’s eruption on the Paly class of 2018 Facebook page surely proves so.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The current junior class was filled with anticipation for this upcoming spirit week, following a narrow, yet disappointing, third place loss in 2015. Despite the placement, the class of 2018 gave an outstanding performance given their underclassman status, and look back on it positively.<\/span>\r\n\r\n[caption id=\"attachment_110599\" align=\"alignright\" width=\"506\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/I9P5883.jpeg\"><img class=\" wp-image-110599\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/I9P5883.jpeg\" alt=\"The class of 2018 shows off their float at the final rally of spirit week 2015. Photo by Cooper Lou.\" width=\"506\" height=\"337\" \/><\/a> The Class of 2018 shows off its float at the final rally of Spirit Week 2015. Photo by Cooper Lou.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Many credited the theme, \"lifeguards,\" for the grade’s success last year. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Our theme played a huge role in our success last year,” junior Chloe Iglehart said. “Monday’s [theme day] dress up was very consistent and you could tell what our theme was by looking at anyone in our grade. It really unified our class and brought a lot of enthusiasm to the rallies, dance, and float building.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">As one can imagine, when it came time to vote for the theme that could unify the grade yet again, many felt that it was a make-or-break decision for their chance at redemption during Spirit Week 2016. However, when the results of the final vote were posted, the outcome was anything but unification. Not only was the entire class divided, but many personally attacked other students, accused the Associated Student Body of rigging the vote, and put the success of the class on the line by threatening to withdraw their participation. Supporters of the selected theme, the \"70s,\" were quick to reply with equally irrational responses. Within minutes, the class Facebook page exploded into chaos, intense battles in the comment sections, passive-aggressive posts, and innumerable notifications piling up on the lock screens of the junior class. In the end, ASB junior officers succumbed to the pressure and held a re-vote, which resulted in a change in the final theme from \"70s\" to \"boxing.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The results of the original vote out of 138 students were 43% 70s, 34% boxing and 23% rockstars, according to Junior Class Vice President Marissa Ludwig. While no theme won by a landslide, it was not particularly close either. Issues were raised over how ASB officers publicized the votes, despite being announced on Facebook, Instagram, and Schoology, as well as in each theme meeting. Boxing won by a landslide in the second vote, which was out of 201 students, but many \"70s\" supporters were forced to surrender their opinions to settle the conflict. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The actions taken by many students on both sides of the argument, myself included, were shameful. It was unfortunate to watch how such a passion for Spirit Week could transform into something so vicious, so quickly. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">It is obvious that none of the participating students intended for this to get out of hand as it did. Many acted out of character, driven only by their competitive spirit and their passion for the Paly tradition. However, no matter what the reason is, a vote is a vote. The majority selected a theme, and the class should have unified behind it.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The purpose of a democratic vote is to find and follow the decision of the majority, whether an individual agrees with it or not. For an event o<\/span><span style=\"font-weight: 400;\">n the idea of coming together, threatening to ruin that unity over something as minute as a theme is unfair to the remainder of the class. Especially when that remainder is the majority. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The vast number of those speaking out on Facebook demanded a re-vote, but a silent majority voted for the winning theme. Both sides had representatives who were frustrated, angry and unafraid to speak their minds. I myself was conflicted on the solution. Should we undercut the significance of a democratic vote, to ensure that our grade be unified to maximize our shot at redemption? After sleeping on it, I feel the results from the original vote should have been upheld.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Let me make this clear, I did not come to this conclusion based on the fact that the theme of my choice won the original vote. My decision is based on the fact that I feel, through a re-vote, a majority of our class lost their voices. Simply because one is not outspoken, or willing to battle it out on social media to prove their point of view, should not make their opinion any less valuable than those who are. By allowing a re-vote after a decision had already been made, it sends a message that the loud and outgoing are valued over the quiet and shy, a common misconception in today's society. No matter the class officers’ intentions, sadly, this is the result. Spirit Week is a week dominated by the outgoing extroverts, and one of the few ways that those who aren’t comfortable dressing up crazy and screaming their lungs out can get involved is by voting for what the focus of their week will be. Unfortunately, now that has been taken away too. <\/span>\r\n\r\nClass unity is by far the most important aspect of Spirit Week, and it is impossible for a class to be unified if the precedent is that half of the students do not matter. In the end, we all understand that what makes a grade truly successful during Spirit Week is not a theme, but coming together. Fortunately, I have complete faith in the Class of 2018. We are a class full of passion, energy, and competitive spirit. While we are off to a bumpy start, our divided grade will soon put our disagreements behind us and join together once again. But what will happen for years to come?\r\n\r\nThis is certainly not the first time a class has experienced such disorder surrounding a Spirit Week theme. The current senior class suffered a similar fate during Spirit Week 2014, after their preferred theme, USA, was shot down by administration. They quickly made the decision to adopt a new theme, \"red card,\" which frustrated many. The Class of 2018's recent outburst may not simply have been due to a lack of maturity, but representative of a greater issue with Paly's entire theme-selection process.\r\n\r\n[caption id=\"attachment_77275\" align=\"alignleft\" width=\"470\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/soph1.jpg\"><img class=\"wp-image-77275\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/soph1.jpg\" alt=\"The class of 2017 dons soccer uniforms in honor of their theme &quot;red card&quot; during spirit week 2014. The theme was also a result of a re-vote after controversy over their first theme. Photo by Adele Bloch.\" width=\"470\" height=\"313\" \/><\/a> The class of 2017 dons soccer uniforms in honor of their theme \"red card\" during Spirit Week 2014, after much controversy over its selection. Photo by Adele Bloch.[\/caption]\r\n\r\nIt is only fair that the Spirit Week theme be decided by the students through a democratic vote to ensure that every student has an equal say in determining their theme. No one will be happy if administration is forced to make these critical decisions for us, but if this method of Athenian Democracy continues to fall, we may have no other choice.\r\n\r\nOur final option is to, rather than throw our entire system out, simply reform it. Currently, much of selection process is left up to class officers to organize, publicize, and enforce, independent of other grades. This freedom, while it may seem more convenient, complicates the process and creates confusion and disorder among the students. Instead of allowing the continuation of this free-for-all in future years, we need to standardize our theme selection process for all grades. Each year, freshmen, sophomores, juniors and seniors all need to hold individual in-person meetings to discuss ideas during the same week. This should be directly followed by an online poll, that will always take place the following day, and left up for 24 hours. This will minimize confusion about when the poll is up, and give everyone enough time to process the information and make a thoughtful decision. This poll can then be followed up by a final vote of the same structure between only the top themes, and once the results are in, the decision is final.\r\n\r\nResults of the final vote also need to be publicized. This will squash ridiculous assumptions that the vote was somehow rigged, and allow students to get a sense of where the majority of their class truly lies, instead of being overpowered by the stronger voices.\r\n\r\nFinally, the administration needs to be more vigilant about managing the reaction of students after the final vote. It is not okay to react in such a destructive, hostile way, especially surrounding something meant to strengthen class unity and cooperation. With more management by administration on this controversial issue, students will be forced to communicate in a much more appropriate and construction manner. Administration should also be more clear with regards to which themes meet their qualifications, which will avoid last minute chaos and further controversy.\r\n\r\nThese adjustments do not demand any major change. They simply require a little more thought than we are currently putting into the process. We can stop this cycle before the Classes of 2019 and 2020 suffer similar fates to those of 2017 and 2018. Spirit Week is without a doubt one of the most positive high school experiences Paly has to offer, so let's stop marring it with controversy and disharmony, and make it just that much better.","excerpt":"The Class of 2018's recent outburst may not simply have been due to a lack of maturity, but representative of a greater issue with Paly's entire theme selection process.\r\n","date":"2016-09-23 17:38:15","author":"Maya Reuven","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/I9P5883.jpeg","categories":["Opinion","Spotlight"],"tags":["2018","70s","ASB","boxing","disco","Facebook","juniors","lifegaurds","rockstar","spirit week 2016","unity"]},{"id":122949,"title":"ASB announces joint Gunn-Paly homecoming dance","permalink":"http:\/\/palyvoice.com\/2016\/09\/23\/asb-announces-joint-gunn-paly-homecoming-dance\/","content":"In a surprise announcement, the Palo Alto High School Associated Student Body announced that the school's annual fall homecoming dance will be conjoined with the homecoming dance of Gunn High School.\r\n\r\nThe announcement came after much speculation and gossip about the potential lack of a venue for this year's homecoming dance, an issue closely resembling one that occurred <a href=\"http:\/\/palyvoice.com\/2015\/09\/27\/asb-announces-homecoming-details-2\/\">last year<\/a> after both Paly gyms were torn down.\r\n\r\n\"The idea came about one day when [Student Activities Director] Matt Hall and his wife, [Gunn Student Activities Director] Lisa Hall, were talking about the dilemma Paly was having with trying to find a venue for Paly to rent out for homecoming,\" senior Social Commissioner Isabel Black said. \"Nothing was working out and they got talking and suddenly had the idea.\"\r\n\r\nExcess funds will be redirected toward asking prizes and other amenities rather than bussing and a venue, according to the statement.\r\n\r\n\"Given that ASB will not be spending around $30,000 on bussing and an expensive venue, we are excited to use our budget more appropriately to find the best DJ, decorations, dance setup and include an extraordinary asking prize,\" the statement said.\r\n\r\nSenior Christian Rider is excited for the joint dance due to the fact he will get to reconnect with old friends.\r\n\r\n\"I'm excited for the dance because I went to JLS [Middle School], so a lot of my old friends ended up going to Gunn,\" Rider said. \"It will be nice to reconnect with all of my old classmates.\"\r\n\r\nASB made sure to highlight all the innovative ideas that they're brainstorming to make this homecoming unique and worth remembering.\r\n\r\n\"<span style=\"font-weight: 400;\">We will be using both of Gunn’s two gyms, where you are free to go between the two as you wish,\" an ASB press release said. \"In addition to food and dancing, there will also be a space for games and non-dancing activities as we hope to cater to every student.\" <\/span>\r\n\r\nSenior Ethan Teo is looking forward for the opportunity to build community between the two schools.\r\n\r\n\"I think it definitely will be interesting,\" Teo said. \"I don't know a lot of Gunn people, so it will be cool to get to know them better. It's a good push for district unity, which will help build an even stronger Palo Alto community.\"\r\n\r\nAccording to Black, the dance will take place on Saturday, Oct. 22, with more details to be released soon.","excerpt":"In a surprise announcement, the Palo Alto High School Associated Student Body announced that the school's annual fall homecoming dance will be conjoined with the homecoming dance of Gunn High School.\r\n","date":"2016-09-23 14:18:02","author":"Sherwin Amsbaugh","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/IMAG0097.jpg","categories":["News","Spotlight"],"tags":["ASB","gunn","homecoming","Isabel Black","paly"]},{"id":122633,"title":"School Board members on the issues","permalink":"http:\/\/palyvoice.com\/2016\/09\/22\/school-board-members-on-the-issues\/","content":"[caption id=\"attachment_122677\" align=\"alignright\" width=\"420\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/Screenshot-2016-09-19-at-8.47.28-PM.png\"><img class=\"wp-image-122677\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/Screenshot-2016-09-19-at-8.47.28-PM.png\" alt=\"Screenshot 2016-09-19 at 8.47.28 PM\" width=\"420\" height=\"282\" \/><\/a> Melissa Baten Caswell (far left) and Heidi Emberling (second from right) are running for re-election for the PAUSD school board. Photo: The Paly Voice.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Paly Voice sat down with Palo Alto Unified School District Board of Education members Heidi Emberling and Melissa Baten Caswell separately to discuss their priorities if re-elected to the board and their views on significant community issues. Stay tuned for coverage of non-incumbents candidates of the 2016 school board race. <\/span>\r\n\r\n<strong>The Paly Voice<\/strong>: <span style=\"font-weight: 400;\">If you are re-elected to school board, what will your main priorities be?<\/span>\r\n\r\n<strong>Heidi Emberling<\/strong>: <span style=\"font-weight: 400;\">Main priorities are high quality teaching and learning, investing in our teachers, who are the most important resource in the classroom and managing our resources for enrollment and everything else we want to spend money on at PAUSD.<\/span>\r\n\r\n<strong>Melissa Baten Caswell<\/strong>: My first priority is making sure that we have ways for every student to be engaged, actively challenged and learning. In order to do that, we need to have many different types of programs, not just sitting in the classroom and listening but we need to have internship programs and pathway programs. We need to invest in more flipped classrooms and blended classes. We’ve invested in some classes that seem kooky almost but they have engaged a lot of students.\r\n\r\n<span style=\"font-weight: 400;\">Second, I want to make sure that, with the teacher shortage, that we’re investing different ways to keep our teachers, train them and develop them. We need to look regionally at how we’re going to support our teachers and other service people that live in the community. We need to make sure that PAUSD is a great place to work. The teachers have really the biggest impact on learning but we need to make sure that those teachers want to stay in PAUSD and if somebody offers them a job in a place where they can get cheaper housing or maybe get paid a little more it’s not going to be the thing that pulls them away.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The third thing is, there’s no point in doing all this investment if our students aren’t ready to learn. We need to make sure that we’re investing in the whole student and that means that their social, emotional and physical selves need to be strong and healthy. We need to realize that you don’t just learn in the classroom, you learn on the playing field, you learn in the theater, you learn during internships, you learn during community service. I’m a huge proponent in investing in the wellness centers that are in our high schools and I’d like to see the wellness centers put in at the middle schools as well. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The other thing is doing more innovative things in the classroom. We’re going to have to give teachers more time to develop these innovative things. Ms. [Lucinda] Filppu couldn’t have come up with Comedy Literature if we hadn’t given her time to develop that class. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">And then this is not the most interesting thing, but we’ve had a lot of people retire who knew how to do their jobs and they never documented it anywhere, and that’s really a problem so I’d like for us to invest in our system so that things are done a little more systematically. When I talk about that, I mean things like payroll, attendance, evaluation systems and maybe food services. So all these things, if we were able to make them more systemized, I think we could be more efficient, I think we could make everyone’s jobs easier.<\/span>\r\n\r\n<hr \/>\r\n\r\n&nbsp;\r\n\r\n<strong>TPV<\/strong>: What are your goals for continuing to address mental health problems that students may face?\r\n\r\n<strong>HE<\/strong>: W<span style=\"font-weight: 400;\">e opened a new wellness center which I’m very happy about and we’ve had a mental health specialist and we’ve expanded services for teens around health and well-being. We’ve added yoga and mindfulness and other ideas like that. It is of primary importance to me to provide educational experiences that meet the needs of students, focusing not only on academic achievement, but also on building skills that develop a balanced, healthy life. <\/span>\r\n\r\n<strong>MBC<\/strong>: <span style=\"font-weight: 400;\">One, we can’t look at the school in a vacuum. We’re part of a community and we have to be working with community resources as well. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The other, we need to make sure that we have good services at school for students who need them. I call that a “painkiller,” when we have a problem, we have services that are appropriate. We also need to work on what I call “vitamins,” and that is to give full and opportunities for students to work around stress and work with you know you make a mistake something went wrong what do you do in those types of situations. We have to make school a safe space to make mistakes because you’re going to get out into the real world and you’re going to make mistakes and there’s gonna be repercussions and if you’ve never had that happen to you, that could be a very traumatic thing. I want to make sure that we’re investing in both sides, on the “painkiller” side and on the other side as well where we’re trying to create resiliency. <\/span>\r\n\r\n<hr \/>\r\n\r\n&nbsp;\r\n\r\n<strong>TPV<\/strong>: Studies show students aren’t getting enough sleep and starting school later may be beneficial. What is your opinion on starting school later?\r\n\r\n<strong>HE<\/strong>: I was in support of  eliminating zero period [classes] although I know some students were not happy with that decision for this very reason. I think sleep is very important for healthy brain development and that we should start school at the right time for teens, which may not be as early as it is now.\r\n\r\n<strong>MBC<\/strong>: <span style=\"font-weight: 400;\">I think if we didn’t have to worry about things like sports and extracurricular activities and after school jobs, I’d say ‘Yeah, let’s do that.’ But we have a system that we have to work within, so what I would instead suggest is that we have different options that you can choose from. For example, you can take a blended learning class and some of these classes would be in the late afternoon or evening so you could take a prep in the morning. We have to offer some more flexible options and we have to allow students to choose what works with their lives.<\/span>\r\n\r\n<hr \/>\r\n\r\n&nbsp;\r\n\r\n<strong>TPV<\/strong>: How do you believe PAUSD can change policies on student-teacher interactions after allegations of misconduct against teachers in the district?\r\n\r\n<strong>HE<\/strong>: We have put in place sexual harassment mandatory training for all of our teachers and we've also started to think about student training. We want to make sure that students know when to report when they're feeling uncomfortable around a teacher or another adult authority figure and who they can go to. We really want to work with the Student Council and ASB to see how better we can involve students in raising awareness for this. It is of paramount importance that our schools are safe for everyone.\r\n\r\n<strong>MBC<\/strong>: <span style=\"font-weight: 400;\">I think we can do a better job of documenting what’s proper behavior and what’s not proper behavior. We need to be careful when we do that though, because we do want teachers to be treating their students as if they’re people. We do want to have some connectedness between the teachers and students—just not inappropriate connectedness. I remember a few years ago there were some questions among the club teams who were playing sports in town about inappropriate behavior that happened when coaches were driving an athlete home and what came back was really that a coach shouldn’t be alone with a player. And once that was documented and people were trained on that, then it just stopped.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">A teacher shouldn’t be in a classroom with a closed door and no windows even if they’re giving special help to a student. I think we need to be careful though; we could whiplash ourselves into a situation where we have been so constricted with the rule that we can’t have a good environment for interaction either. There are students who don’t have adults in their lives that they can talk to and they have serious issues and sometimes a teacher is that person who you can talk to, and I’d hate for that to go away. I would hate to have a teacher be afraid to talk to a student about a problem, for example.<\/span>\r\n\r\n<hr \/>\r\n\r\n&nbsp;\r\n\r\n<strong>TPV<\/strong>: Many PAUSD teachers must drive hours each day to teach in Palo Alto. How do you believe the Board can help with addressing this issue?\r\n\r\n<strong>HE<\/strong>: Unfortunately the School District hasn't considered housing. What we can do is partner with the City of Palo Alto and confer with our regional partners to work on housing, housing affordability and availability. Mountain View is doing some interesting things with teacher housing and and we'd really like to partner with them around this issue.\r\n\r\n<strong>MBC<\/strong>: <span style=\"font-weight: 400;\">I think that this is a problem that is regional, by the way. It’s not Palo Alto by itself; all the towns around it have the same problem, and I don’t think the school district could do anything really meaningful by itself. So my suggestion is that we figure out how to get the city and the school district talking regionally, with other school districts and cities in the area, and talk about some regional solutions. One thing the superintendent was suggesting is that we have Google buses coming in from the East Bay. Maybe that’s a short term solution, but that’s not a long term solution for a lot of different reasons. If people aren’t living in the community, then they’re not a part of the community. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">It helps for the school district to encourage programs for lower income housing. One of the things I asked assembly member Rich Gordon was ‘Is there a way for anybody to create housing that is only for a certain group of people, like only for government employees, for example? Can you do it by law?’ I don’t know. These are the things we need to better understand so we can have some good solutions. It needs to be solved as a regional solution and this is also a longer term issue. Palo Alto has been getting more and more expensive for teachers and service people to live here and it’s not just teachers, it’s also policemen and firemen and other service workers as well. So I don’t think we can look at it as teachers in isolation, I think we have to look at it all together.<\/span>","excerpt":"The Paly Voice sat down with Palo Alto Unified School District Board of Education members Heidi Emberling and Melissa Baten Caswell to discuss their priorities if re-elected to the Board and their views on significant community issues.","date":"2016-09-22 21:26:47","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/Screenshot-2016-09-19-at-8.47.28-PM.png","categories":["Election 2016","Features","Spotlight"],"tags":["2016","Board of Education","election","heidi emberling","issues","melissa baten-caswell","palo alto","PAUSD","School Board"]},{"id":122584,"title":"Verbatim: Should marijuana be legalized in California?","permalink":"http:\/\/palyvoice.com\/2016\/09\/21\/verbatim-should-marijuana-be-legalized-in-california\/","content":"This November, <a href=\"https:\/\/ballotpedia.org\/California_Proposition_64,_Marijuana_Legalization_(2016)\" target=\"_blank\">Proposition 64<\/a> is going to be on the California ballot. If passed, marijuana would become legalized in California, like Washington and Colorado.\r\n\r\nThe Paly Voice asked Paly students what they thought about marijuana possibly becoming legal in California.\r\n\r\n&nbsp;\r\n\r\n<img class=\"alwaysThinglink\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/833747043003400192\/1024\/10\/scaletowidth#tl-833747043003400192;1043138249'\" alt=\"\" \/><script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script>","excerpt":"This November, Proposition 64 is going to be on the California ballot. If passed, marijuana would become legalized in California, like Washington and Colorado.\r\n\r\n\r\n","date":"2016-09-21 19:55:49","author":"Kasra Orumchian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/FeaturedImageProp64.jpg","categories":["Features","Uncategorized","Verbatims"],"tags":["Ballot","California","Marijuana","Proposition","verbatim"]},{"id":122735,"title":"Club Day offers spirited fun, wide variety of options","permalink":"http:\/\/palyvoice.com\/2016\/09\/20\/club-day-offers-spirited-fun-wide-variety-of-options\/","content":"Following the first Club Day of the 2016-17 academic year, Palo Alto High School students are set to start participating in various clubs. Click on the link to view highlights from yesterday’s event.\r\n\r\n<iframe style=\"border: none;\" src=\"https:\/\/social.shorthand.com\/thepalyvoice\/embed\/nyDAN8UGue\" width=\"100%\" height=\"500px\"><\/iframe>","excerpt":"Following the first Club Day of the 2016-17 academic year, Palo Alto High School students are set to start participating in various clubs. Click on the link to view highlights from yesterday’s event.","date":"2016-09-20 22:00:07","author":"Aisha Chabane","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/Screen-Shot-2016-09-20-at-9.41.04-PM.png","categories":["Features","Spotlight"],"tags":["2016","club day","clubs","edom","FBLA","magical bridge club","model united nations","mun","paly","quad","ukulele club"]},{"id":122636,"title":"Trial date set for PAUSD teacher accused of sexual assault","permalink":"http:\/\/palyvoice.com\/2016\/09\/20\/trial-date-set-for-pausd-teacher-accused-of-sexual-assault\/","content":"[caption id=\"attachment_122637\" align=\"aligncenter\" width=\"260\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/48131_main.jpg\"><img class=\"wp-image-122637 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/48131_main.jpg\" alt=\"\" width=\"260\" height=\"325\" \/><\/a> Former Ohlone Elementary school teacher Michael Airo faces four felony charges related to the alleged sexual abuse of an 11-year-old girl. His trial will start on Oct. 18. Photo: Palo Alto Police Department.[\/caption]\r\n\r\nA former Ohlone Elementary School teacher, who was arrested in December on charges that he sexually abused a child, has had his trial date set for 9 a.m. Oct. 18 at the Santa Clara County Superior Court in Palo Alto.\r\n\r\nJudge Vincent J. Chiarello handed down this date during a five-minute information and arraignment session for Michael Airo on Monday.\r\n\r\nThe prosecutor charged Airo with four felonies, including one count of continuous sexual abuse of a minor under the age of 14, and three counts of lewd and lascivious acts with the use of force, violence, duress, menace, or fear of immediate and unlawful bodily injury on the victim or another person, according to the San Jose Mercury News.\r\n\r\n<span style=\"font-weight: 400;\">Airo pled not guilty to all charges on July 12. <\/span>\r\n\r\nThe victim (Jane Doe), now 24, was 11 when Airo allegedly started abusing her, according to Palo Alto Online, which added that Doe eventually came out about the abuse 10 years later to her psychologist, who then told the police. According to Doe, Airo continually tried to adopt her even after him and her mom broke ties. He turned himself in on Jan. 13.\r\n\r\nAfter the arraignment, Airo walked out free as he had paid out a $500,000 bail when he first turned himself in, according to Palo Alto Online.\r\n\r\nA <a href=\"https:\/\/www.generosity.com\/fundraising\/fair-trial-for-mike\">crowd-sourced fund<\/a> on Indiegogo named, “Fair trial for Mike” is raising money to help with Airo's legal fees. It currently has accumulated $10,915. In the fund description, the organizers, \"Ari and Lily,\" wrote that they felt Airo was being unfairly treated by the media, ruining his previously well-reputed name among the teacher-parent community.\r\n\r\n“Mike has supported the emotional and academic growth of many of our children over many years, making math-lovers out of kids who felt they were bad at it. ... Mike has already been tried in the media and has lost his livelihood before any legal proceedings begin,” the description stated.\r\n\r\nIn January, the school board voted unanimously (5-0) to start dismissal proceedings after hearing the allegations against him.\r\n\r\nAnother high profile sexual abuse trial affecting the Palo Alto community will be for Ronnie Farrell, former Palo Alto High School science teacher, who is expected to enter a plea Wednesday.","excerpt":"A former Ohlone Elementary School teacher, who was arrested in December on charges that he sexually abused a child, has had his trial date set for 9 a.m. Oct. 18 at the Santa Clara County Superior Court in Palo Alto.","date":"2016-09-20 14:40:12","author":"Siddarth Sharma","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/IMG_4152.jpg","categories":["News","Spotlight"],"tags":["arraignment","michael airo","october 19","PAUSD","sexual abuse","trial"]},{"id":122641,"title":"Verbatim: Students on joining clubs","permalink":"http:\/\/palyvoice.com\/2016\/09\/19\/verbatim-students-on-joining-clubs\/","content":"Palo Alto High School's first Club Day of the school year took place on the Quad today. As Paly students flooded the Quad, eager to sign up for one of the 70 clubs to choose from, The Paly Voice asked students which clubs they signed up for and why.\r\n\r\n<img class=\"alwaysThinglink\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/834582613971697665\/1024\/10\/scaletowidth#tl-834582613971697665;1043138249'\" alt=\"\" \/><script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script>","excerpt":"Palo Alto High School&#8217;s first Club Day of the school year took place on the Quad today. As Paly students flooded the Quad, eager to <a href=\"http:\/\/palyvoice.com\/2016\/09\/19\/verbatim-students-on-joining-clubs\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2016-09-19 21:48:26","author":"Kasra Orumchian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/14409035_507137639411600_2010490158_n.jpg","categories":["ASB","Club Day","Entertainment","Spotlight","Uncategorized","Verbatims"],"tags":["ASB","club day","palo alto","palo alto high school","paly","verbatim"]},{"id":122244,"title":"Verbatim: Freshmen on adjusting to high school","permalink":"http:\/\/palyvoice.com\/2016\/09\/18\/verbatim-freshman-on-adjusting-to-high-school\/","content":"As the first month of the 2016-17 school year comes to a close, The Paly Voice asks members of the Palo Alto High School freshman class how they are adjusting to life at Paly.\r\n\r\n<img class=\"alwaysThinglink aligncenter\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/833506206571036674\/1024\/10\/scaletowidth#tl-833506206571036674;1043138249'\" alt=\"\" \/><script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script><script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script><script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script>","excerpt":"As the first month of the 2016-17 school year comes to an close, The Paly Voice asks members of the Palo Alto High School freshman class how they are adjusting to life at Paly.","date":"2016-09-18 22:19:51","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/14302693_319083241770148_1755896219_n.jpg","categories":["Multimedia","Verbatims"],"tags":["2020","freshman","freshmen","high school","new","School","verbatim"]}]