[{"id":118527,"title":"Service Day inspires volunteer spirit","permalink":"http:\/\/palyvoice.com\/2016\/03\/27\/service-day-inspires-volunteer-spirit\/","content":"Organizers are calling the annual Service Day a success after facilitating a variety of both on and off-campus volunteer activities on Thursday.\r\n\r\nFirst implemented 10 years ago, Palo Alto High School Service Day allows students to showcase their commitment to volunteering and giving back to the community, according to Get Involved Project Manager and junior Candace Wang.\r\n\r\nOver 300 students <a href=\"http:\/\/palyvoice.com\/2016\/03\/17\/service-day-offers-students-wide-range-of-volunteering-opportunities\" target=\"_blank\">travelled to off-campus<\/a> locations to volunteer, ranging from distributing food at the Second Harvest Food Bank to pulling weeds at the Palo Alto Baylands Nature Preserve, according to Wang. In addition, over 500 students participated in on-campus activities on the Quad during lunch.\r\n\r\nGet Involved Palo Alto coordinated the on-campus events while Paly Youth Community Service Club organized the off-campus events, contacted service sites and streamlined student participation, according to YCS Co-President junior Ibby Day.\r\n\r\nService Day featured 20 on-campus booths aimed at promoting volunteerism through small actions, including crafting bookmarks and picking up litter on campus to provide a range of opportunities for those who were unable to travel off campus. As part of the main on-campus service projects, students sewed and tie-dyed bags for The Little Red Shoes Program.\r\n\r\n“Volunteerism is the type of thing that is missing in a lot of students' lives,” Wang said. “People become really busy and forget about giving back, but that's what Service Day is all about. It's about reminding people of all the good that we do.”\r\n\r\n<em>Photos by Adrienne Kwok.<\/em>\r\n<div id=\"cp_widget_cbcebe21-c07e-4dfb-a97c-d01c155db91a\">\r\n\r\n...<script type=\"text\/javascript\">\/\/ <![CDATA[\r\nvar cpo = []; cpo[\"_object\"] =\"cp_widget_cbcebe21-c07e-4dfb-a97c-d01c155db91a\"; cpo[\"_fid\"] = \"AQCAAUdV_H8T\"; var _cpmp = _cpmp || []; _cpmp.push(cpo); (function() { var cp = document.createElement(\"script\"); cp.type = \"text\/javascript\"; cp.async = true; cp.src = \"\/\/www.cincopa.com\/media-platform\/runtime\/libasync.js\"; var c = document.getElementsByTagName(\"script\")[0]; c.parentNode.insertBefore(cp, c); })();\r\n\/\/ ]]><\/script><noscript>Powered by Cincopa <a href='http:\/\/www.cincopa.com\/video-hosting'>Video Hosting<\/a> for Business solution.<span>Service Day 2016<\/span><span>Sophomore Vivian Nguyen concentrates on sewing a bag for The Little Red Shoes Program as part of this year’s sole on-campus service-learning activity. Nguyen, along with all other Social Justice Pathway students, agreed as a class to participate in Service Day.<\/span><span>flash<\/span><span> 16<\/span><span>cameramake<\/span><span> NIKON CORPORATION<\/span><span>height<\/span><span> 4000<\/span><span>orientation<\/span><span> 1<\/span><span>camerasoftware<\/span><span> Ver.1.00 <\/span><span>originaldate<\/span><span> 3\/24\/2016 4:54:34 AM<\/span><span>width<\/span><span> 6000<\/span><span>cameramodel<\/span><span> NIKON D3300<\/span><span>Sophomore Eli Al-Shamari and junior Ibby Day distribute pizza to students who completed service-learning activities during lunch. “Service day was a success from what I hear,” YCS Co-President Ibby Day said. “Most of the new sites were super fun this year.”<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 3456<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 3\/24\/2016 4:56:31 PM<\/span><span>width<\/span><span> 5184<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T4i<\/span><span>Students collaborate on constructing bags, an activity that lasted throughout the day. “I think that it is important to, every once in awhile, take time out of your day and do something good for others, whether it is simply picking up a piece of trash or sewing bags and making cards for younger kids,” sophomore Darrow Hornik said.<\/span><span>flash<\/span><span> 16<\/span><span>cameramake<\/span><span> NIKON CORPORATION<\/span><span>height<\/span><span> 4000<\/span><span>orientation<\/span><span> 1<\/span><span>camerasoftware<\/span><span> Ver.1.00 <\/span><span>originaldate<\/span><span> 3\/24\/2016 4:56:44 AM<\/span><span>width<\/span><span> 6000<\/span><span>cameramodel<\/span><span> NIKON D3300<\/span><span>Sophomore Nicholas Zhao and juniors Serina Nguyen, Kirsten Kwan and Lindsay Chen (left to right) collect student suggestions on what they would like to see changed about Paly. “I am definitely inspired by those who volunteer because they take time out of their day to give back to their community,” Nguyen said.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 3456<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 3\/24\/2016 4:57:30 PM<\/span><span>width<\/span><span> 5184<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T4i<\/span><span>Students listen intently to an organization representative at one of 20 unique booths, each of which provided a unique project centered on a specific mission, such as writing cards for children.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 3456<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 3\/24\/2016 4:58:09 PM<\/span><span>width<\/span><span> 5184<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T4i<\/span><span>Students interact with a representative from Canopy, an organization dedicated to planting and caring for trees in the Palo Alto community. In addition to completing service projects, students were able to sign up for future volunteer opportunities with individual organizations.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 3456<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 3\/24\/2016 5:01:28 PM<\/span><span>width<\/span><span> 5184<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T4i<\/span><span>Get Involved Project Manager and junior Candace Wang distributes lunches to organization representatives. “It was great to see hundreds of students giving part of their day to something, no matter how small, to give back to the community,” Wang said.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 3456<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 3\/24\/2016 5:14:59 PM<\/span><span>width<\/span><span> 5184<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T4i<\/span><span>Students enjoy slices of pizza after completing two service events during lunch. In addition to providing 1000 slices of pizza, Get Involved Palo Alto organized purchasing breakfast for over 200 students partaking in off-campus field trips.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 3456<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 3\/24\/2016 4:56:21 PM<\/span><span>width<\/span><span> 5184<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T4i<\/span><\/noscript>\r\n\r\n","excerpt":"Organizers are calling the annual Service Day a success after facilitating a variety of both on and off-campus volunteer activities on Thursday.","date":"2016-03-27 10:43:43","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/IMG_9982.jpg","categories":["News"],"tags":["adrienne","Alto","booth","candace","christina","Community","day","get","ibby","involved","kwok","owen","Palo","quad","Service","volunteer","Wang","YCS","youth"]},{"id":116761,"title":"Opinion: Jordan Middle School name change is unnecessary","permalink":"http:\/\/palyvoice.com\/2016\/03\/24\/jordan-middle-school-name-change-is-unnecessary\/","content":"<span style=\"font-weight: 400;\">The Palo Alto Unified School District Board of Education is investigating whether to alter the name of David Starr Jordan Middle School after a parent’s petition urged such a change and Social Justice Pathway students discussed the name at a <a href=\"http:\/\/palyvoice.com\/2016\/01\/23\/plan-to-rename-jordan-takes-next-step-forward\/\">board meeting <\/a>on Feb. 9. David Starr Jordan, a vocal eugenicist, or a person who supports improving the genetic population of humans through inhumane methods, was also Stanford University’s first president, a peace activist and ichthyologist. While some may claim that changing the school’s name promotes a more welcoming environment, the school board should not do so as this would not properly address contemporary racism. In addition, eugenics was considered acceptable in much of the 19th and 20th centuries despite being discredited today, and a name change would cause confusion among community members and waste District funds.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">First of all, a name change would not make the middle school a more welcoming environment for students as it would not properly address racism in our schools and in general. As the son of a Polish father and Mexican mother, I know my ancestors have faced racism and anti-religious sentiment firsthand. David Starr Jordan himself wrote that Poles were \"controlled by ... animal instincts\" and Mexicans \"ignorant and \"superstitious.\" <\/span><span style=\"font-weight: 400;\">But although my ancestors and ethnic groups have been victimized in the past, even through ethnic cleansing and other means, I do not believe changing Jordan's name is the proper way to address contemporary racism. Altering Jordan’s name would not have made any difference in my three-year experience as a Jordan student, nor did it make me feel marginalized or persecuted in any way.<\/span>\r\n\r\n[caption id=\"attachment_118411\" align=\"alignright\" width=\"392\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/IMAG0421.jpg\"><img class=\"wp-image-118411\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/IMAG0421.jpg\" alt=\"IMAG0421\" width=\"392\" height=\"294\" \/><\/a> Jordan Middle School, pictured above, would most likely undergo campus changes such as new paint and a new logo if the name is changed. Photo by Sherwin Amsbaugh.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">If the district wishes to address modern racism, it should not focus on Jordan Middle School’s name, but rather acknowledge social injustice and discrimination in America in social studies classes or through cultural clubs. After all, Jordan's views of eugenics have been mostly discredited and bear little significance in the modern world. Changing the school’s name would not address injustice; it would simply put a bandage on a deep cut. The change will not suddenly transform the district into an open-minded community. Teachers and staff should encourage cultural clubs to provide an in-depth look into social justice rather than bring attention to a name that many are unaware about if they wish to make schools more welcoming. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">One may say that the district can both change the name and acknowledge social injustice in schools. While this is true, there are other and more effective ways to make students feel welcome rather than changing Jordan's name. Administration can use funds that may otherwise go to repainting the school to crack down on bullying and fund cultural programs, both of which are more likely to successfully promote tolerance and unity. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">While it is terrible that David Starr Jordan fostered racist ideologies, he should not just be recognized as a eugenicist when he also promoted pacifism and contributed to the field of science. America’s fourth president, Thomas Jefferson, is revered as a hero despite owning over 600 slaves. Similarly, Jordan should not be edited out of our history due to some of his views which while inhumane, were standard in the late 19th century. It must be noted that at its peak, eugenics was supported by W.E.B Dubois, Theodore Roosevelt and Winston Churchill, all of whom are considered heroes in today's society. This does not mean that Jordan should be excused for his views, as they promoted racism in the 20th century. Rather, we should look at his views in context and acknowledge that what is considered racist today was seen as standard 80 years ago.<\/span>\r\n\r\nAccording to American historian and biographer Garland E. Allen, David Starr Jordan’s views were considered common in his time.\r\n\r\n“Eugenics ... was a widespread and popular movement in the United States and Europe between 1910 and 1940,” Garland wrote. “Eugenics gained much support from progressive reform thinkers, who sought to plan social development using expert knowledge in both the social and natural sciences.”\r\n\r\n<span style=\"font-weight: 400;\">Changing a school’s name because some find it offensive may also set a dangerous precedent. Basically every influential figure has been subject to some form of controversy, regardless of the nobility of their deeds. If we wished to avoid offending all Palo Altans, we would need to rename schools to streets, plants or locations.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">A name change would foster additional consequences. Administration would most likely paint over all Jordan Middle School logos and alter all paperwork referring to the school as “Jordan,” costing the district an unknown amount of money which could be better spent on new textbooks or educational facilities. The change could also cause confusion among citizens who are unaware of the name replacement.<\/span>\r\n\r\nDespite the name change's potential negative effects, some students continue to advocate for such a modification. Social Justice Pathway student and junior Layla Solatan says she believes it would help create a more welcoming environment.\r\n\r\n\"Now that people have shown such passion for changing the name, to ignore their pleas would do harm to the image, values and environment of the district,\" Solatan said.\r\n\r\nHowever, a majority of students do not believe the name has a significant impact on them. The Voice visited random Paly English classrooms and posted a survey in the class Facebook groups to see how students felt about such a change. Of the 219 netted responses, only 28.8 percent of students believe the current name creates an unhealthy environment for students, and 40.6 percent support an actual name change. 68.5 percent of those who responded attended Jordan Middle School. These results demonstrate how, despite a vehement minority of students urging for a name change, these students do not represent their peers' views as a whole.\r\n\r\nSchool board member Melissa Baten Caswell says that while changing the name could set a positive example of upstanding, it also could cause multiple community problems.\r\n\r\n\"There will be expenses involved with changing the name,\" Caswell said. \"Some members of the community are attached to the existing name.\"\r\n\r\nWhen the school board's advisory committee reaches a conclusion on the name's effects later this year, we should definitely listen and take into account their research and advice. However, at this point in time, a Jordan name change is completely unnecessary. Further discussions about promoting tolerance in Palo Alto schools are important and will help to create a healthier, more open-minded community—but a Jordan name change is not the solution.","excerpt":"A Jordan Middle School name change is unnecessary due to potential costs and confusion as well as the fact that eugenics, while an atrocious practice, was universally accepted in the early 20th century.","date":"2016-03-24 21:09:40","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/unnamed.jpg","categories":["Opinion","Spotlight"],"tags":["Alto","David","Eugenics","garland allen","jordan","middle","name","Palo","paly","racism","scandal","School","starr"]},{"id":117907,"title":"Paly and Gunn to face off at upcoming night rally","permalink":"http:\/\/palyvoice.com\/2016\/03\/23\/paly-and-gunn-to-face-off-at-upcoming-night-rally\/","content":"The Palo Alto High School Associated Student Body and Gunn High School Student Executive Council are hosting an inter-school night rally at 7 p.m. tomorrow at the Gunn gym.\r\n\r\nASB and SEC created a <a href=\"https:\/\/www.youtube.com\/watch?v=iA8JEM2QC-M&amp;feature=youtu.be\">promotional video<\/a> to advertise the rally for students, which will feature a relay race, a staff-student volleyball game and performances from both the Gunn and Paly dance and cheer teams.\r\n\r\nSenior Class President Eli Friedlander explained the relay race in further detail.\r\n\r\n[caption id=\"attachment_118386\" align=\"aligncenter\" width=\"500\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/FullSizeRender-1.jpg\"><img class=\"wp-image-118386\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/FullSizeRender-1.jpg\" alt=\"Juniors Kaitlyn Vi and Nora Danie stand in front of the promotional poster for the upcoming night rally.\" width=\"500\" height=\"333\" \/><\/a> Juniors Kaitlyn Vi and Nora Danie stand before the promotional poster for the upcoming night rally. Photo by Bianca Al-Shamari.[\/caption]\r\n\r\n\"The first race will be a relay race between Paly upperclassmen versus Gunn upperclassmen,\" Friedlander said. \"Then Paly underclassmen versus Gunn underclassmen, finishing with a Paly and Gunn versus a combined staff volleyball game.\"\r\n\r\nFriedlander said that the rally will be a friendly competition between cross-town rivals.\r\n\r\n\"It should be a lot of fun-- a friendly competition with our cross town rivals and competition against the staff,\" Friedlander said. \"I'm hoping that Paly kids come out so we can prove exactly how loud we are.\"\r\n\r\nBoth Paly and Gunn cheer and dance teams will be having a joint performance, featured at the end of the volleyball game.\r\n\r\n\"Cheer and dance from both schools will be performing in a joint performance,\" senior Spirit Commissioner Reid Walters said. \"It'll be a special performance made just for the rally.\"\r\n\r\nGunn senior Human Relations Commissioner Misty Hong explains why Paly ASB and Gunn SEC collaborated on this event.\r\n\r\n[caption id=\"attachment_118383\" align=\"alignright\" width=\"407\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/IMG_3953.jpg\"><img class=\"wp-image-118383\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/IMG_3953.jpg\" alt=\"T-Shirts will be sold on campus $10 for Short Sleeve and $15 for Baseball Sleeves.\" width=\"407\" height=\"305\" \/><\/a> T-Shirts will be sold on campus $10 for Short Sleeve and $15 for Baseball Sleeves. Photo by Bianca Al-Shamari.[\/caption]\r\n\r\n\"We wanted to plan an event that included both schools,\" Hong said. \"Especially because Cupertino schools have IDC rallies—we wanted to do something based off of that to see if we could create a more positive bond between both schools.\"\r\n\r\nT-shirts for the rally are being sold on the Quad at brunch and lunch. Walter encourages students to purchase shirts to show their support during the rally.\r\n\r\n\"We're selling t-shirts on campus $10 for Short Sleeve and $15 for Baseball Sleeves,\" Walter said. Let's show up rocking our spirit, so come out and get your t-shirt soon, Paly.\"","excerpt":"Paly ASB and Gunn SEC are collaborating to bring an inter-school spirit rally to the student body, feaaturing relay races, a volleyball game, and preformances by both Gunn and Paly cheer and dance teams.","date":"2016-03-23 14:49:57","author":"Bianca Al-Shamari","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/FullSizeRender.jpg","categories":["News","Spotlight"],"tags":["eli friedlander","gunn","Gunn SEC","misty hong","paly","paly asb","rally","reid walters"]},{"id":118124,"title":"Get to know your ASB candidates","permalink":"http:\/\/palyvoice.com\/2016\/03\/22\/get-to-know-your-asb-candidates\/","content":"Palo Alto High School Associated Student Body elections for the 2016-17 school year will take place <a href=\"https:\/\/www.tallyspace.com\/vote\/pahs\" target=\"_blank\">online<\/a> and on the Quad from3:30 p.m. today to 3:30 p.m. Friday. The ASB Presidential and Vice Presidential debates are today during Tutorial in the Media Arts Center.\r\n\r\nCandidate <a href=\"https:\/\/drive.google.com\/file\/d\/0B4B-U12Lu_SYNTlHRlh1ZU9XY3c\/view\" target=\"_blank\">statements<\/a> and <a href=\"https:\/\/www.youtube.com\/playlist?list=PL7wMuSsIastA_nlzWJdOSdt4MKfCgJtXC\" target=\"_blank\">speeches<\/a> were released by ASB last week. Since there are currently no candidates for Junior Class Vice President and ASB Treasurer, elections for those positions will occur at a later time.\r\n\r\nThe Paly Voice spoke with this year's student body candidates to learn more about them.\r\n\r\n[caption id=\"attachment_118280\" align=\"alignright\" width=\"260\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/IMG_36031.jpg\"><img class=\"wp-image-118280\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/IMG_36031.jpg\" alt=\"IMG_3603\" width=\"260\" height=\"346\" \/><\/a> Junior Anmol Nagar, currently Associated Student Body Vice President, is running for ASB President. Nagar plans to make communication with the school board and administration a central part of her campaign. Photo by Emily Hwang.[\/caption]\r\n\r\n<strong>ASB President: Junior Anmol Nagar<\/strong>\r\n\r\nWhat she'd like to change at Paly:<span style=\"font-weight: 400;\"> \"We should focus a lot more on communication between the administration, the school board and the student body because I think there are a lot of policies that students don’t know about and often see the effects of, but don’t know the reasoning behind it.\"<\/span>\r\n\r\nFavorite restaurant: Ephesus\r\n\r\nTop 3 traits of a leader: Open-minded, good communicator, flexible\r\n\r\nFavorite school subject: Communications\r\n\r\nFavorite activity in Bay Area: Horseback riding\r\n\r\nFavorite font: Comic Sans\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n[caption id=\"attachment_118282\" align=\"alignright\" width=\"272\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/IMG_3591.jpg\"><img class=\"wp-image-118282\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/IMG_3591.jpg\" alt=\"IMG_3591\" width=\"272\" height=\"363\" \/><\/a> Junior Brain Tracy is running for ASB President and is looking to change how phones are used on campus. Photo by Emily Hwang.[\/caption]\r\n\r\n<strong>ASB President: Junior Brian Tracy<\/strong>\r\n\r\nWhat he'd like to change at Paly: <span style=\"font-weight: 400;\">\"I’d really like to see changes implemented around how phones are used in and out of the classroom because I understand that you can’t take phones away from people, but when I see kids using their phones at brunch it kind of pains me to see them not talking with their friends and building stronger relationships with other people.\"<\/span>\r\n\r\nPerfect pizza: Plain cheese\r\n\r\nFavorite school subject: Physics\r\n\r\nFavorite activity in Bay Area: Walking and running the Dish\r\n\r\nFavorite font: Helvetica\r\n\r\nTop 3 traits of a friend: Trustworthy, honest, athletic\r\n\r\nFavorite song: \"Echoes\" by Pink Floyd\r\n\r\n<strong>\r\nASB Vice President:<\/strong> <strong>Sophomore Noga Hurwitz<\/strong>\r\n\r\n[caption id=\"attachment_118333\" align=\"alignright\" width=\"268\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/12887456_1708102679403051_1240793949_o.jpg\"><img class=\"wp-image-118333\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/12887456_1708102679403051_1240793949_o.jpg\" alt=\"Noga Hurwitz\" width=\"268\" height=\"357\" \/><\/a> Sophomore Noga Hurwitz is running for ASB Vice President. According to Hurwitz's candidate statement, her experience in clubs and as Sophomore Class Vice President makes her a good candidate. Photo by Bianca Alshamary.[\/caption]\r\n\r\nWhat she'd like to change at Paly: <span style=\"font-weight: 400;\">“I think that something that sets me apart as a candidate is that I had the experience of being in ASB, and I understand the limitations that are set in the class. Next year, if elected ASB Vice President, I want to push those limitations and see things at school we never possibly thought of achieving.\"<\/span>\r\n\r\nPerfect pizza: <span style=\"font-weight: 400;\">“I like Pizza Studio because you can literally put anything on your pizza. I have recently gone into pineapple on pizza — it's good.”<\/span>\r\n\r\nFavorite restaurant: <span style=\"font-weight: 400;\">Falafel Stop<\/span>\r\n\r\nFavorite school subject: \"<span style=\"font-weight: 400;\">Aside from ASB, United States Government.\"<\/span>\r\n\r\nFavorite activity in Bay Area: <span style=\"font-weight: 400;\">Late-night mini golf or roller skating<\/span>\r\n\r\nTop 3 traits for a friend: <span style=\"font-weight: 400;\">Funny, compassionate, kind <\/span>\r\n\r\nTheme Song: <span style=\"font-weight: 400;\">“I'm A Believer” by Smash Mouth <\/span>\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n[caption id=\"attachment_118281\" align=\"alignright\" width=\"257\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/IMG_3593.jpg\"><img class=\"wp-image-118281\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/IMG_3593.jpg\" alt=\"IMG_3593\" width=\"257\" height=\"343\" \/><\/a> Junior Maya Lathi is running for ASB Vice President. Lathi, if elected, wants to increase bonds between each grade. Photo by Emily Hwang.[\/caption]\r\n\r\n<strong>ASB Vice President: Junior Maya Lathi<\/strong>\r\n\r\nWhat she'd like to change at Paly: \"<span style=\"font-weight: 400;\">I want to increase the bonds between each grade. I feel like there’s a lot of tension during Spirit Week. … I’d like to see more of a spread the love type of vibe.\"<\/span>\r\n\r\nPerfect pizza: <span style=\"font-weight: 400;\">Hawaiian with bacon and garlic<\/span>\r\n\r\nFavorite restaurant in Palo Alto: Gott's Roadside\r\n\r\nFavorite school subject: Math\r\n\r\nFavorite font: Cambria\r\n\r\nTop 3 traits of a friend: Positive, outgoing, compassionate\r\n\r\nFavorite song: \"Year 3000\" by Jonas Brothers\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n[caption id=\"attachment_101514\" align=\"alignright\" width=\"260\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/Screen-Shot-2015-03-25-at-6.20.44-PM.png\"><img class=\"wp-image-101514\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/03\/Screen-Shot-2015-03-25-at-6.20.44-PM.png\" alt=\"Candace Wang has been on the Student Site Council for the past two years as both a secretary and a student representative. &quot;I'm running because I've always been interested in making a change at school,&quot; Wang said. Photo by Adele Bloch.\" width=\"260\" height=\"345\" \/><\/a> Junior Candace Wang is running for ASB Vice President and believes we should try to include more diverse voices in ASB decisions. Photo by Adele Bloch.[\/caption]\r\n\r\n<strong>ASB Vice President: Junior Candace Wang<\/strong>\r\n\r\nWhat she'd like to change at Paly: \"<span style=\"font-weight: 400;\">I think more voices need to be heard in regards to what Paly should be like. I think it is important to reach out to those people constantly, and not just once or twice. We should listen to all voices, rather than ones who are the loudest.\"<\/span>\r\n\r\nFavorite restaurant in Palo Alto: Osteria\r\n\r\nFavorite four-legged creature: \"<span style=\"font-weight: 400;\">Dogs. I would have said cheetahs, if I actually met one and didn't change my mind.\"<\/span>\r\n\r\nPerson she'd most like to meet: <span style=\"font-weight: 400;\">Hsi Kai Ching, a Chinese female pirate<\/span>\r\n\r\nFavorite font: Bookman's Old Style\r\n\r\nTheme song for life: \"Wild Things\" by Alessia Cara\r\n\r\n&nbsp;\r\n\r\n[caption id=\"attachment_118308\" align=\"alignright\" width=\"251\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/12499606_1707739159439403_185384596_o.jpg\"><img class=\"wp-image-118308\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/12499606_1707739159439403_185384596_o.jpg\" alt=\"12499606_1707739159439403_185384596_o\" width=\"251\" height=\"335\" \/><\/a> Junior Kevin Chen is running for ASB Secretary and says he hopes to be more involved in the school. Photo by Bianca Alshamary.[\/caption]\r\n\r\n<strong>ASB Secretary: Kevin Chen<\/strong>\r\n\r\nWhat he'd like to change at Paly: <span style=\"font-weight: 400;\">“Since this is my first year as ASB, I've decided to just be an observer and listen to good ideas. Maybe there will be some good ideas I agree with and I can put my two cents into the conversation. Other than that I don't have an agenda, just going with the flow.”<\/span>\r\n\r\nPerfect pizza: <span style=\"line-height: 1.5;\"> \"My perfect pizza would have cheese, some sausage, lemon, some cilantro, pepperoni. I like hotdogs in the crust.\"<\/span>\r\n\r\nFavorite restaurant in Palo Alto: Chipotle\r\n\r\nFavorite school subject: English\r\n\r\nFavorite activity in Bay Area: Hiking at Mission Peak\r\n\r\nTop 3 traits for in a friend: <span style=\"font-weight: 400;\">Honesty, compassion, responsibility<\/span>\r\n\r\nTheme song: <span style=\"font-weight: 400;\">“All Star” by Smash Mouth<\/span>\r\n\r\n&nbsp;","excerpt":"The Paly Voice spoke with this year's student body candidates to learn more about them. ","date":"2016-03-22 11:48:01","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/Screen-Shot-2016-03-22-at-11.39.21-AM.png","categories":["ASB Election 2016","News","Spotlight"],"tags":["candidate","election"]},{"id":118324,"title":"ASB to host election candidate debates","permalink":"http:\/\/palyvoice.com\/2016\/03\/21\/asb-to-host-election-candidate-debates\/","content":"Palo Alto High School Associated Student Body will host its annual presidential and vice presidential candidate debates, starting at 1:50 p.m. tomorrow in the Media Arts Center.\r\n\r\nASB vice president candidates (juniors Candace Wang, Maya Lathi and sophomore Noga Hurwitz) will go first, with their debate kicking off at 1:50 p.m., followed by the ASB presidential candidates (juniors Anmol Nagar and Brian Tracy) at 2:10 p.m.\r\n\r\nAccording to current Senior Class President Eli Friedlander, the main purpose of the debate is to provide additional information about the candidates and their viewpoints.\r\n\r\n\"Debates offer a great way for students to learn more about the candidates and their stances,\" Friedlander said. \"Elections give students a chance to have a direct impact on who their class officers are.\"\r\n\r\nVoting starts at 3:30 p.m. Tuesday at this <a href=\"https:\/\/www.tallyspace.com\/vote\/pahs\">site<\/a> and will close at 3:30 p.m. Friday.","excerpt":"Palo Alto High School Associated Student Body will host its annual presidential and vice presidential candidate debates, starting at 1:50 p.m. tomorrow in the Media Arts Center.","date":"2016-03-21 21:26:59","author":"Jackson Doerr","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/Screenshot-3.png","categories":["ASB Election 2016","News"],"tags":["ASB","asb debates","asb elections 2015-2016","asb president and vice president debates"]},{"id":118173,"title":"Community College Week aims to educate and combat college stigmas","permalink":"http:\/\/palyvoice.com\/2016\/03\/21\/community-college-week-aims-to-educate-and-combat-college-stigmas\/","content":"&nbsp;\r\n\r\n[caption id=\"attachment_118175\" align=\"aligncenter\" width=\"489\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/rsz_image_3-1.jpg\"><img class=\"wp-image-118175\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/rsz_image_3-1.jpg\" alt=\"Parents and students visit the Palo Alto Unified School District annual College Fair at Palo Alto High School to receive information on various schools. Photo by Ethan Kao.\" width=\"489\" height=\"329\" \/><\/a> In October, parents and students visited Palo Alto Unified School District's annual College Fair at Palo Alto High School to receive information on various schools. Though many community colleges were featured at the fair, Paly hopes to continue educating students about community colleges through its first Community College Week which starts today. Photo by Ethan Kao.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Palo Alto High School hopes to educate students about community colleges through guest speakers, tours and workshops during its inaugural Community College Week which started today during lunch. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The purpose of the week is to provide students with information regarding community college, <\/span><span style=\"font-weight: 400;\">according to Outreach Specialist and Community College and Career Adviser Crystal Laguna.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The week will center around what the options and benefits [of community colleges] are,” Laguna said. “Every year I feel like many students say they don’t get enough information on community college so we’ll be teaching students everything about community colleges, from how to transfer to vocationals and exploring interests.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Each day of the week will provide students with various informational sources, including professionals who started at the community college level and have found success in their careers, according to Laguna. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">One of the featured events is the Community College Forum that will happen on Wednesday during lunch in the library, Laguna said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“During the forum we’ll be covering the entire breakdown of community college,\" Laguna said. \"When to apply, what to do and when, where you can get help,” Laguna said. <\/span>\r\n\r\n<strong>The schedule for the week is as follows:  <\/strong>\r\n\r\n[caption id=\"attachment_118185\" align=\"aligncenter\" width=\"788\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/ccc.jpg\"><img class=\" wp-image-118185\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/ccc.jpg\" alt=\"Chart by William Zhou.\" width=\"788\" height=\"248\" \/><\/a> Chart by William Zhou.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\"><em>The full version of this schedule can be found <a href=\"http:\/\/paly.net\/news\/community-college-week-march-21-25\" target=\"_blank\">on the event page.<\/a><\/em> <\/span><span style=\"font-weight: 400;\">\r\n<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Laguna hopes that the week will not only educate students, but also <a href=\"http:\/\/palyvoice.com\/2015\/01\/29\/opinion-destigmatize-community-college\/\" target=\"_blank\">reduce the negative connotation some students feel around towards community colleges<\/a>.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I think there’s a negative stigma around community college because of the brand of schools,” Laguna said. “I think everyone wants to be accepted to a known university.  Not too many people want to say that they are going to community college. It [the stigma] could be because we’re right across from Stanford and are a high-achieving school. Currently around 12 to 15 percent of seniors go to a community college, but I want to make sure everyone knows what options are out there.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Laguna believes that community colleges offer several benefits, some of which she personally experienced. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“There have been plenty of Paly alumni who have been eligible to attend a four-year college but chose to go to community college for numerous reasons,\" Laguna said. \"Whether if it’s they aren’t ready yet, don’t know what they want to major or that community college is cheaper. I personally was not strong in math but was able to really take my time and get better at math so that once I transferred to a four year, I had not only completed math but mastered the subject.”<\/span>","excerpt":"Palo Alto High School hopes to educate students about community colleges through guest speakers, tours and workshops during its inaugural Community College Week which starts on Monday.","date":"2016-03-21 12:02:38","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/rsz_image_3-1.jpg","categories":["News","Spotlight"],"tags":["college","community center","community college","community college week","ivy league","laguna","palo alto high","stanford","stigma"]},{"id":118112,"title":"Admin cautions prospective senior pranksters","permalink":"http:\/\/palyvoice.com\/2016\/03\/19\/admin-cautions-prospective-senior-pranksters\/","content":"[caption id=\"attachment_118116\" align=\"aligncenter\" width=\"499\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/photo.jpg\"><img class=\"wp-image-118116\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/photo.jpg\" alt=\"Senior pranks have always been apart of Palo Alto High School according to assistant Principal of operations, Jerry Berkson. Pranks can range in variety. Berkson told The Paly Voice that he heard stories of one prankster bringing a cow up to the top of the tower building. Photo by William Zhou. \" width=\"499\" height=\"374\" \/><\/a> Senior pranks have always been a part of Palo Alto High School, according to Assistant Principal Jerry Berkson. In an interview, Berkson told The Paly Voice that pranks can range in variety, and he even heard stories of one prankster bringing a cow up to the top of the Tower Building. Photo by William Zhou.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Palo Alto High School’s administration is cautioning seniors who may be planning to participate in one of Paly’s most notorious traditions: the senior prank. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Consequences for pranks can range in severity, according to Assistant Principal Jerry Berkson.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“There could be repercussions or arrests made in certain situations,” Berkson said. “Money could also come out the senior class's bank account.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">In the past, senior pranksters have been arrested, according to Berkson. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We had an arrest in the past for students who flipped a car on the deck and did damage to the deck,” Berkson said. “The person who admitted to doing it was 18 so that changed things a lot. Fortunately it worked out because it wasn’t a felony, but it could have very well been a felony which is a big issue.”  <\/span>\r\n\r\nBerkson emphasizes the fact that intent doesn’t always match the consequences.\r\n\r\n<span style=\"font-weight: 400;\">“Just because someone has the intent of doing an innocent prank, it doesn't mean that it will always turn out the way it was planned,” Berkson said. “If you have a group of 20 kids who want to do a prank, but two of them have malicious intent, now everyone is bunched in with the other two.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">To avoid unintended repercussions, Berkson advises that prospective pranksters check in with administration beforehand.<\/span><span style=\"font-weight: 400;\">\r\n<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“You’ve got a bunch of kids who work hard for four years and you’d hate for them to blow it and ruin their potential coming out of high school, so it’s not a bad idea to check with us,” Berkson said. “We’ve had kids check in with us first and being that our [administration's] life experience is a little more extensive, we can steer them in the right the direction. Be smart about it.” <\/span>\r\n\r\n[caption id=\"attachment_118272\" align=\"alignright\" width=\"412\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/Senior-Prank.jpg\"><img class=\"wp-image-118272\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/Senior-Prank.jpg\" alt=\"Senior Prank\" width=\"412\" height=\"309\" \/><\/a> Last year's senior prank involved lots of camping equipment and red solo cups, according to Voice alumna and graduate of the Class of 2015, Emma Chiu. \"On the last day of school we [the Class of 2015] decided to have an extension of the senior camp out and we put tents on the quad.\" Photo by Emma Chiu.[\/caption] <span style=\"font-weight: 400;\">Emma Chiu, Voice alumna and graduate of the Class of 2015 echoed Berkson’s notion of having fun in a safe way. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I loved our senior prank last year,\" Chiu said. \"It was so much fun. On the last day of school we [the Class of 2015] decided to have an extension of the senior camp out and we put tents on the quad. There were red solo cups thrown around, but we made sure they were cleaned up. It had the aesthetic of partying, without necessarily doing that on campus. It was better than other ones that have been unsafe and expensive.”<\/span>\r\n\r\nAccording to Berkson, senior pranks have been a part of Paly for a long time.\r\n\r\n<span style=\"font-weight: 400;\">“I’ve heard stories that there was a cow at the top of the Tower Building,” Berkson said. “I also heard that someone put three pigs the library and labeled them one, two and four so people would look for the non-existent third pig. I don’t know if those stories are folklore since it was before my time.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Overall the administration seems to support the tradition as long as it is safe and harmless. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It’s tough because you want the kids to have fun and be spirited, but where do you draw the line?” Berkson said. “We’re not fans [of the senior prank], but as long as there are no safety or health issues or damage to the facility, we can live with it. It’s bothersome when pranks force the custodial staff to do a lot of cleaning.”<\/span>","excerpt":"Palo Alto High School’s administration is cautioning seniors who are planning to participate in one of Paly’s most notorious traditions, the senior prank.","date":"2016-03-19 14:17:32","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/Senior-Prank.jpg","categories":["News","Spotlight"],"tags":["2015","2016","admin","camping","caution","cow","cups","funny","palo alto high school","pig","prank","senior prank","seniors","solo","tower building"]},{"id":118165,"title":"Boys&#8217; tennis splits matches against Cupertino","permalink":"http:\/\/palyvoice.com\/2016\/03\/19\/boys-tennis-splits-matches-against-cupertino\/","content":"[caption id=\"attachment_118211\" align=\"alignnone\" width=\"615\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/Adriancandid1.jpg\"><img class=\" wp-image-118211\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/Adriancandid1.jpg\" alt=\"Junior Adrian Smith swings back his racket to return the ball in a doubles match against Cupertino on Thursday at Paly. Photo by Sam Lee.\" width=\"615\" height=\"410\" \/><\/a> Junior Adrian Smith returns the ball in a doubles match against Cupertino High School on Thursday at Palo Alto High School. Paly split its matches with Cupertino. Photo by Sam Lee.[\/caption]\r\n\r\nThe Palo Alto High School boys' tennis team split its two matches against Cupertino High School on Thursday at Palo Alto High School.\r\n\r\nAccording to head coach Andy Harader, the team played two matches to make up for one that had been rained out earlier in the season. Instead of playing the two matches on separate days, both teams decided to play both matches on the same day in a compressed version.\r\n\r\n“Normally, our league rules say you have to play two out of three sets,” Harader said. “But because we were rained out and more rain is expected next week, we thought in order to expedite the matter we decided to try and fit them in one day. In order to do that, we played pro sets which allowed us to finish both matches in a day.”\r\n\r\nAccording to Harader, pro sets involve playing one set in which the winner gets to eight games, instead of the traditional best out of three sets where the winner of each set is the first to six games.\r\n\r\nJunior Henry Badger said that despite the difficulty of playing the pro set style as opposed to the traditional three-set match, it was beneficial for the team's circumstances.\r\n\r\n“The pro set format is very tough, because unless you start off well, it is hard to win matches,” Badger said. “I prefer the best out of three set matches because it shows consistency and is better for the player mentally. However, I think the pro set format worked well in this circumstance.”\r\n\r\nIn the first match, the Vikings beat the Pioneers four matches to three. Despite senior Shiv Matta retiring due to fatigue, the Vikings were lifted by victories from senior Carl Goodfriend and junior Adrian Smith, among others.\r\n\r\nSmith was able to use his consistent groundstrokes to force his opponents into making unforced errors.\r\n\r\n“I was able to stay consistent and keep my opponent on the run, which ended up being the deciding factor of the match,” Smith said. “My opponent had trouble staying motivated when on the run so I decided to wait for him to miss instead of me.”\r\n\r\nHarader also praised one of his team’s double teams, made up of Badger and sophomore Hunter North, who were able to win both of their matches on the day. Badger attributed his success to his effective forehand.\r\n\r\n“I was able to win my match by staying consistent and managing to keep my serve in and effective,” Badger said. “I tried focusing on my forehand during the second match and tried to stay more consistent in that area.”\r\n\r\nThe Vikings were unable to carry their momentum into the second match and ended up dropping it five matches to two.\r\n\r\nAfter witnessing a match that involved vomiting by multiple players due to fatigue and possible heat exhaustion, Harader believes that conditions played a role in the Vikings’ loss.\r\n\r\n“Unfortunately, in both matches we had sickness,” Harader said. “This is the first hot day and we played two matches in hot conditions. We probably need to condition more so that we are in better shape when we go into this kind of depth in a match situation.”\r\n\r\nAfter the loss, junior Jerry Hong said that the goal for the rest of the year is to make it to the postseason.\r\n\r\n“We're hoping that we can get the 50 percent win rate we need for us to qualify to CCS [Central Coast Section],” Hong said. “We'll just need to keep working hard and playing our best.\"\r\n\r\nThe Vikings' next match is against Monta Vista High School at 3:30 p.m. next Tuesday at Monta Vista High School.\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School boys' tennis team split its two matches against Cupertino High School on Thursday at Palo Alto High School. ","date":"2016-03-19 11:40:21","author":"Chirag Akella","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/Adriancandid1.jpg","categories":["Sports"],"tags":["Adrian Smith","andy harader","cupertino","henry badger","jerry hong","palo alto high school","paly","pioneers","set","sports","tennis","vikings"]},{"id":118217,"title":"Boys&#8217; lacrosse routs rival Los Gatos, 12-6","permalink":"http:\/\/palyvoice.com\/2016\/03\/19\/boys-lacrosse-routs-rival-los-gatos-12-6\/","content":"&nbsp;\r\n\r\n[caption id=\"attachment_118220\" align=\"alignnone\" width=\"599\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/patmacthelaxrat.jpg\"><img class=\" wp-image-118220\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/patmacthelaxrat.jpg\" alt=\"Freshman attacker Patrick McIntosh drives down the right side of the field while surveying the field for open teammates. McIntosh finished the game with one goal and two assists. Photo by Sam Lee.\" width=\"599\" height=\"421\" \/><\/a> Freshman attacker Patrick McIntosh drives down the right side of the field while surveying the field for open teammates. McIntosh finished the game with one goal and two assists. Photo by Sam Lee.[\/caption]\r\n\r\nThe Palo Alto High School boys' lacrosse team (5-2, 0-0) snatched a win, 12-6, against rival Los Gatos High School (1-3, 0-0) on Thursday at the Palo Alto High School field.\r\n\r\nThe Vikings displayed a strong performance in the second half despite a sluggish start. Both teams were tied, 4-4, after the first quarter.\r\n\r\nAccording to head coach DJ Shelton, the team was able to pick up the pace after the first quarter.\r\n\r\n\"We came out really flat in the first quarter energy wise, missing ground balls,\" Shelton said. \"I think we got only open field ground ball, but then we answered in the last three quarters of the game.\"\r\n\r\nThe Vikings outscored the Wildcats 8-2 in the last three quarters.\r\n\r\nFreshman attacker Patrick McIntosh, who scored one goal and fed two assists, said the team felt compelled to take charge.\r\n\r\n\"We decided as a team we were done getting pushed around by the other team, and we wanted to come out and win this game,\" McIntosh said.\r\n\r\nMultiple players exhibited solid performances, including McIntosh, senior attacker Matthew Seligson with three goals and five assists and junior midfielder Hayden Libbey with two goals, as well as others.\r\n\r\n\"[Senior] Charles Stephenson did really great on the faceoffs, [senior] Q Valenti was amazing between the pipes and our studs on the attack and midfield,\" Shelton said. \"Hayden played well; we had guys all over the field.\"\r\n\r\nNevertheless, the win was a joint effort, according to Shelton.\r\n\r\n\"The game ball was a team win,\" Shelton said. \"It wasn't one player, and everyone had a part. There wasn't one guy that just stepped out. It was a very well balanced game. For a coach, to have a team win is the best thing ever.\"\r\n\r\nThe Vikings worked on several aspects of their game and made amends to their tactics in preparation for the game after losing their last game to University High School, 12-10, according to Shelton.\r\n\r\n\"We just focused a lot on groundballs, because that is kind of what lost us the game against University,\" Shelton said. \"We also need some personnel changes, we need to be a little more dynamic from the midfield, so we moved some of our better ball handlers up there and we just moved guys around to exploit matchups. We stopped being one dimensional and mixed things up to see what it would do for us, and it clearly worked.\"\r\n\r\nAccording to Libbey, the win left a satisfactory taste for the team.\r\n\r\n\"It feels great to come back and win against the team we beat in the championship last season,\" Libbey said.\r\n\r\nShelton also expressed his enthusiasm on the win against the Wildcats.\r\n\r\n\"There's nothing better than beating the team that you beat in the championship last year,\" Shelton said. \"We answered the challenge.\"\r\n\r\nThe Vikings play their next game against Sacred Heart Preparatory School (1-1) at 10 a.m. on Saturday at Sacred Heart.\r\n\r\nAccording to Libbey, the team is confident going into the matchup.\r\n\r\n\"We're playing SHP next game, so it's going to be a challenge, but we if we play our game and stick to our fundamentals, we are going to win,\" Libbey said. \"We lost to them in the preseason game, but we are better now than we were at that point of the season.\"\r\n\r\nShelton says if the team plays the way it did against the Wildcats, Paly has a good chance of beating Sacred Heart.\r\n\r\n\"We have Sacred Heart on Saturday morning, and we're really looking to doing what we did tonight,\" Shelton said. \"They are a similar team, athletic, fast, well coached. I don't think we need to change anything. If we stick to the game plan, we'll see where we can get the matchups.\"","excerpt":"The Palo Alto High School boys' lacrosse team (5-2, 0-0) snatched a win against rival Los Gatos High School (1-3, 0-0) on Thursday at the Palo Alto High School field. ","date":"2016-03-19 10:56:10","author":"Sam Lee","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/patmacthelaxrat.jpg","categories":["lacrosse","Sports","Spotlight"],"tags":["DJ Shelton","ea","hayden libbey","Lacrosse","lax","los gatos high school","paly","Pat Mac","Patrick McIntosh","rival","sports","team","vikings"]},{"id":118100,"title":"Track and field triumphs over Homestead","permalink":"http:\/\/palyvoice.com\/2016\/03\/18\/track-and-field-triumphs-over-homestead\/","content":"[caption id=\"attachment_118195\" align=\"alignnone\" width=\"595\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/I9P6915.jpg\"><img class=\" wp-image-118195\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/I9P6915.jpg\" alt=\"Sophomore Darby Felter competes in the 110 meter hurdles. Felter would go on to win this event as well as the 300-meter hurdles. The vikings' relied on Felter and other underclassmen to fill the shoes of runners who had left due to a band trip. Photo by Cooper Lou\" width=\"595\" height=\"397\" \/><\/a> Sophomore Darby Felter competes in the 110-meter hurdles during a meet against Homestead on Thursday at home. Felter went on to win this event as well as the 300 meter hurdles. The Vikings' relied on Felter and other underclassmen to fill the shoes of runners who were not present due to a band trip. Photo by Cooper Lou.[\/caption]\r\n\r\nThe Palo Alto High School track and field team continues to dominate, defeating Homestead High School on Thursday at home.\r\n\r\nDespite missing several senior athletes due to a band trip, both the girls' and the boys' teams were successful. The girls' team won 10 out of 15 events and the boys' team took 13 out of 15.\r\n\r\n\"I think the team did wonderfully,\" freshman Henry Saul said. \"We had a band trip so we lost a lot of our varsity, but I think a lot of frosh-soph runners really picked it up.\"\r\n\r\nStandouts included junior Kent Slaney, who placed first in the 1600- and 3200-meter races while also competing in the 4x400-meter relay and sophomore Darby Felter who placed first in both the 110-meter hurdles and 300-meter hurdles.\r\n\r\nAccording to junior Titi Bolarinwa, the weather and the early lead over Homestead in addition to the absence of a significant portion of runners allowed the team to experiment with different events.\r\n\r\n\"It's really warm out so it's way different from last meet which was pouring rain,\" Bolarinwa said. \"It's a lot of firsts for a lot of people, because it's against Homestead so we could experiment a lot with this meet.\"\r\n\r\nThese conditions gave younger runners the opportunity to step up and prove themselves to the team, and allowed older runners to try out events they normally wouldn't run.\r\n\r\nThe teams' next meet is against Milpitas High School at 3:15 p.m. next Thursday at Milpitas High School.\r\n\r\n[caption id=\"attachment_118194\" align=\"alignnone\" width=\"748\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/I9P7145.jpg\"><img class=\"size-full wp-image-118194\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/I9P7145.jpg\" alt=\"Senior Eli Givens bursts to the front during the 100-meters against Homestead at home on Thursday. Givens would claim first place, and the team would go on to win the meet. Photo by Cooper Lou\" width=\"748\" height=\"499\" \/><\/a> Senior Eli Givens bursts to the front during the 100-meters against Homestead on Thursday at home. Givens would claim first place, and the team would go on to win the meet. Photo by Cooper Lou.[\/caption]","excerpt":"The Palo Alto High School track and field team continues to dominate after defeating Homestead High School on Thursday at home.","date":"2016-03-18 18:47:21","author":"Jackson Doerr","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/I9P7145.jpg","categories":["Sports","Track and Field"],"tags":["homestead","paly","track and field 2016"]}]