[{"id":126517,"title":"&#8216;Loving&#8217;: What&#8217;s not to love?","permalink":"http:\/\/palyvoice.com\/2016\/12\/01\/loving-whats-not-to-love\/","content":"[caption id=\"attachment_126666\" align=\"alignnone\" width=\"430\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/1475626768_focusfeatures_loving_jeffnichols_joeledgerton_ruthnegga_voteloving_instagram1.jpg\"><img class=\" wp-image-126666\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/1475626768_focusfeatures_loving_jeffnichols_joeledgerton_ruthnegga_voteloving_instagram1.jpg\" alt=\"Ruth Negga and Joel Edgerton star in the latest historical film 'Loving'. Photo: Focus Features\" width=\"430\" height=\"430\" \/><\/a> Ruth Negga and Joel Edgerton star in the latest historical film 'Loving'. Photo: Focus Features[\/caption]\r\n\r\nDid you know that interracial marriage wasn’t always legal in the United States? In the non-fiction, historical-drama film , 'Loving,' directed by Jeff Nichols, the audience follows two main characters — a black woman, Mildred, and a white man, Richard — who fall in love and want to get married despite obstacles; however, it’s not that simple.\r\n\r\n<span style=\"font-weight: 400;\">Both lived most of their lives in the small town of Central Point, Virginia, which takes place in the late 1960's, where interracial marriage was illegal at the time, and one was only allowed to marry someone of his or her own race. The movie is told through Mildred and Richard’s eyes. While they were living in Virginia, police arrested them in their own home, in the middle of the night, for breaking the anti-miscegenation laws of their state. They moved to the nation’s capital, Washington, D.C., to get married and to raise their three children. Little did they know that during this time, with the rise of the Civil Rights Movement, their experience with the law would be a gateway to make a change for equality.<\/span>\r\n\r\nBoth Joel Edgarton and Ruth Negga do a satisfying job in their roles as Richard and Mildred. They have good chemistry on emotional scenes, such as, powerful expressions on their faces so the audience would figure out what they were feeling. Bernie Cohen, played by Nick Kroll, is the lawer who picks up this case. This character plays as comic relief because he is an ackward person as a result of the words he uses and his posture on scene, which is what Nichols is going for. His partner Phill Bass, played by Jon Bass, is the more serious lawer that keeps him in check. Both of these characters do a good job of creating suspense in the film.\r\n\r\n<span style=\"font-weight: 400;\">As the story unfolds, the audience can't help but side with and cheer on the couple because of the connection they have and everything they have been through. Some people at the time got harassed for being in a multi-racial relationship; they were judged by peers and loved ones. The love that Mildred and Richard share for each other and the conflicted emotions that others have toward them make it clear that this story is going to pull at some heartstrings. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Movie's cinematographer Adam Stone, portrays police in the movie as villains who will do anything to get the protagonists in jail. Stone uses dark lighting and body language well with these characters, highlighting the use of their aggressive nature and atmosphere that is apparent.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">However, throughout the movie it was hard to understand the dialogue between characters because of their accents and soft voices, which some could argue made the movie more realistic, but at times made the conversations harder to understand.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">As the movie continues, you feel the injustice of these laws. The government is dictating who people are allowed to love and marry. Mildred and Richard are everyday people who weren’t looking for fame or publicity but rather just wanted what most of us desire, a person to love and be with forever and a chance at happiness. This movie is a must see for those looking for good character development, an authentic snapshot of that time and an emotionally uplifting story that will put you in the shoes of the people who fought against the law.<\/span>\r\n\r\n<strong>Loving<\/strong>\r\n\r\n<strong>Rating: PG-13<\/strong>\r\n\r\n<strong>Run time: 123 minutes <\/strong>\r\n\r\n<strong>Director: Jeff Nichols<\/strong>\r\n\r\n<b>Actors\/Actresses: Joel Edgerton as Richard, Ruth Negga as Mildred,  Michael Shannon as Grey Villet, Nick Kroll as Bernie Cohen, Marton Csokas as Sheriff Brooks, Alano Miller as Raymond Green, and Jon Bass as Phil Bass<\/b>","excerpt":"Did you know that interracial marriage wasn’t always legal in the United States? In the non-fiction, historical-drama film , 'Loving,' directed by Jeff Nichols, the audience follows two main characters — a black woman, Mildred, and a white man, Richard — who fall in love and want to get married despite obstacles; however, it’s not that simple.","date":"2016-12-01 19:15:53","author":"Bradley Smith","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/1475626768_focusfeatures_loving_jeffnichols_joeledgerton_ruthnegga_voteloving_instagram.jpg","categories":["Entertainment"],"tags":["history","Loving","movie review"]},{"id":126680,"title":"Sculpture program to hold second glass sale of the year","permalink":"http:\/\/palyvoice.com\/2016\/12\/01\/sculpture-program-to-hold-second-glass-sale-of-the-year\/","content":"<span style=\"font-weight: 400;\">Palo Alto High School’s glass blowing program is hosting a holiday glass sale on Friday, Dec. 2, and Saturday, Dec. 3, in the Tower Building. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The sale will be open tomorrow from 3 to 6 p.m., and will continue on Saturday from 11 a.m. to 4 p.m.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to glass blowing instructor Steve Ferrera, this is the program’s second and, traditionally, the biggest sale of the year.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We have a whole bunch of glass for sale,” Ferrera said. “Holiday items, cups, vases, goblets, elephants, cats, hearts, seashells, snails. It’s a huge assortment of glass items [at] all different prices.”<\/span>\r\n\r\n[caption id=\"attachment_126684\" align=\"alignright\" width=\"498\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15310588_361267514218387_1663107699_n.jpg\"><img class=\"wp-image-126684\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15310588_361267514218387_1663107699_n.jpg\" alt=\"15310588_361267514218387_1663107699_n\" width=\"498\" height=\"351\" \/><\/a> Trees and Christmas ornaments are among the items that will be sold on Friday and Saturday. Photo by Maya Reuven.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Work from a variety of artists will be available for purchase, the majority of which are created by glass blowing teachers.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“<\/span><span style=\"font-weight: 400;\">The work is not student work, but students can sell their own work, and they can keep all the money from that,” Ferrera said.<\/span> <span style=\"font-weight: 400;\">“Most of it [the glass] is blown by the instructors, Peter and Dana, our TAs, myself, and a few other professional glass blowers.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">While student artists get to keep their profits, the rest of the proceeds will go towards funding Paly’s sculpture program.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Our program is mostly self-funded, so we really rely on these sales to keep the program going,” Ferrera said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The sculpture program is beloved by many students, including Paly junior and advanced ceramics and sculpture student Julia Doubson, making the funding a critical issue.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Paly's sculpture program enables students to create many forms of art,” Doubson said. “Having the opportunity to blow glass at school is a very unique experience that we're lucky to have.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">If the artwork itself is not incentive enough to stop in, complementary snacks and beverages will also be provided.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We have cookies and hot apple cider,” Ferrera said.<\/span>","excerpt":"Palo Alto High School’s glass blowing program is hosting a holiday glass sale on Friday, Dec. 2, and Saturday, Dec. 3, in the Tower Building.","date":"2016-12-01 18:45:13","author":"Maya Akkaraju","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15310588_361267514218387_1663107699_n.jpg","categories":["News","Spotlight"],"tags":["art","artists","fundraiser","glass","glass blowing","holiday","sale","sculpture"]},{"id":126686,"title":"Boys&#8217; soccer defeats Carlmont","permalink":"http:\/\/palyvoice.com\/2016\/12\/01\/boys-soccer-defeats-carlmont\/","content":"[caption id=\"attachment_126689\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/DSC_0052.jpg\"><img class=\"size-full wp-image-126689\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/DSC_0052.jpg\" alt=\"Sophomore outside midfielder Jason Shorin dribbles up the sideline. Shorin is a first-year Varisty player on the boys' soccer team. Photo: Emma van der Veen.\" width=\"600\" height=\"400\" \/><\/a> Sophomore outside midfielder Jason Shorin dribbles up the sideline. Shorin is a first-year varsity player on the boys' soccer team. Photo: Emma van der Veen.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto High School boys’ soccer team (2-0-0, 0-0-0) triumphed over the Carlmont High School Scots (1-0-1, 0-0-0) 2-1 yesterday at Paly in a preseason match.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">In the first half, Paly sophomore outside midfielder Kenzo Morabia scored the first goal by finishing a cross from senior center midfielder Jack Stoksik. Stoksik dribbled down the left sideline and around multiple defenders, then passed center to Morabia. Soon after, a Carlmont forward chipped the ball over Paly junior goalkeeper Kiran Misner as he ran out to try to stop the attack. After some more attacks on goal and strong defensive play from both sides, the Vikings took the lead again. Sophomore outside midfielder Marco Tan crossed the ball to Morabia for another goal. The first half ended with a score of 2-1.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“At the beginning, we were moving the ball around really well and using the field,” head coach Don Briggs said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The second half was much less eventful, with no goals scored. Although both teams had chances on goal, neither were able to put the ball in the net. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We definitely had a better first half,” Briggs said. “We had a lot of opportunities [in the second half], we just didn’t quite put it [the ball] away. We had chances in the second half where, if we put it away, the game would’ve been over.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Vikings had matches on both Tuesday and Wednesday, which Briggs suspects caused the team to fatigue later on in the game.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Yesterday’s game took a little bit of a toll on us,” Briggs said. “We seemed a little tired and weren’t moving quite as well. We had guys cramping up, which usually means more conditioning [is needed]. That made the second half tougher.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Morabia, Paly’s effort showed through its consistent contact throughout the match.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We had a lot of passion and determination toward the end of the game,” Morabia said. “I think that’s what won us the game.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior center defender and captain Neil Verwillow says that the lack of attack in the second half was executed in an effort to preserve Paly’s lead.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We didn’t have much offensive thrust in the second half,” Verwillow said. “After half time, we wanted to preserve the lead rather than extending it.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Next up, the Vikings will face Lincoln High School at 11 a.m. on Saturday at Homestead High School Stadium.<\/span>","excerpt":"The Palo Alto High School boys’ soccer team (2-0-0, 0-0-0) triumphed over the Carlmont High School Scots (1-0-1, 0-0-0) 2-1 yesterday at Paly in a preseason match.","date":"2016-12-01 17:55:45","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/DSC_0060.jpg","categories":["Sports","Spotlight"],"tags":["atheltics","boys soccer","briggs","carlmont","carlmont high school","jack stoksik","jason shorin","kenzo morabia","kiran misner","marco tan","misner","morabia","neil verwillow","palo alto high school","paly athletics","preseason","shorin","Soccer","sports","stoksik","tan","verwillow","vikings"]},{"id":126331,"title":"Season Preview: Wrestling team hopes to thrive in lower division","permalink":"http:\/\/palyvoice.com\/2016\/12\/01\/season-preview-wrestling-team-hopes-to-thrive-in-lower-division\/","content":"[caption id=\"attachment_116559\" align=\"alignnone\" width=\"617\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Screenshot-2016-02-18-at-8.50.58-AM.png\"><img class=\" wp-image-116559\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Screenshot-2016-02-18-at-8.50.58-AM.png\" alt=\"Members of the Palo Alto wrestling team pose for a picture after competing at the Santa Clara Valley Athletic League Championships last weekend. \" width=\"617\" height=\"422\" \/><\/a> Members of the Palo Alto wrestling team pose for a picture after competing at the Santa Clara Valley Athletic League Championships last season. Photo: Jonathan Kessler.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto High School wrestling team looks to thrive this season after being moving down from the De Anza division to the El Camino division of the Santa Clara Valley Athletic League.\r\n<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We were placed in the lower division this season and one of our team goals is to win the division,” coach Jonathan Kessler said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\"> <\/span><span style=\"font-weight: 400;\">Last year, the 0-6 season ended with six of the team's wrestlers competing at the Central Coast Section championships. The team finished with a combined record of 14-9 during the two days at the competition, according to Kessler. <\/span>\r\n\r\nWith nearly 2o returning team members and<span style=\"font-weight: 400;\"> fresh talent, this year the team is optimistic, according to Kessler.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We return 18 wrestlers from last year, so that's huge after the way we started last season,\" Kessler said. \"Currently we have 40 wrestlers on the roster.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The wrestling program hopes that with this surge of new members on the team, the team can start to improve its record from last year and dominate in a lower league.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“As a team, we hope to return to the De Anza division and for my<\/span>self, I expect to win CCS and place at the state tournament,” senior Sara Aguilar said.\r\n\r\n<span style=\"font-weight: 400;\">Some athletes to look out for this season include Aguilar, senior Seth Goyal, junior Calvin Grewel, sophomores Callum Day Ham, Andrew Wang and Aidan Gans. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Vikings' first league competition will be on Saturday at the Peninsula Invitational at Half Moon Bay High School.<\/span>","excerpt":"The Palo Alto High School wrestling team looks to thrive this season after being moving down from the De Anza division to the El Camino division of the Santa Clara Valley Athletic League.","date":"2016-12-01 15:40:38","author":"Katie Cox","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/Screen-Shot-2016-11-22-at-9.41.25-AM.png","categories":["Spotlight","Wrestling"],"tags":["CCS","Jonathan Kessler","paly","preview","season","vikings","wrestling"]},{"id":126580,"title":"Girls&#8217; water polo season comes to a halt in CCS second round","permalink":"http:\/\/palyvoice.com\/2016\/11\/29\/girls-water-polo-season-comes-to-a-halt-in-ccs-second-round\/","content":"[caption id=\"attachment_122551\" align=\"alignnone\" width=\"648\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/IMG_4533.jpg\"><img class=\" wp-image-122551\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/IMG_4533.jpg\" alt=\"Junior Hollie Chiao passes the ball late in the third quarter during a season game at Gunn High School. The Vikings ended their season after being eliminated from the second round of the CCS tournament against Leland High School on Nov. 5. Photo by Sam Lee. \" width=\"648\" height=\"442\" \/><\/a> Junior Hollie Chiao passes the ball late in the third quarter during a season game at Gunn High School. The Vikings ended their season after being eliminated from the second round of the Central Coast Section tournament against Leland High School on Nov. 5. Photo: Sam Lee.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto High School girls’ water polo team (14-16, 4-8) concluded its season with a loss to Leland High School in the second round of the Central Coast Section (CCS) playoffs on Nov. 5 at a neutral location. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">After edging out Menlo-Atherton in the first round of the CCS tournament by a score of 9-6, the Vikings fell to the Leland Chargers by a score of 15-8 in the following round. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">However, according to senior field player Haley Chalmers, the Vikings are reflective of their season and have taken the time to appreciate the highlights of their year.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We grew a lot as a team and ended up doing better than we all anticipated,” Chalmers said. “It was definitely a growing experience, but we all came together well by the end of the season. I would have to say that the highlight of the season was beating Menlo-Atherton at the beginning of the CCS tournament because it was a super close game, and we lost to them at the beginning of our season.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior goalkeeper Joanna Falla was in accordance with Chalmers’ thoughts.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It was definitely a growing year for the team and I'm incredibly excited to see how the team does next year,” Falla said. “This season has been an incredible experience, and it was amazing to see the team chemistry build throughout the games and practices.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Junior field player Talia Stanley also voiced her gratitude for the seniors on the team. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Although we had some losses here and there, the season was incredibly fun and I took it as an opportunity to learn and develop my game,” Stanley said. “The seniors on the team are great because they were vocal in telling us what to do or to not do, and because of that, the team communication really improved.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Falla said she is bittersweet about leaving the team next year and she gave her departing thoughts on the team.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I'm pretty sentimental about leaving the team,” Falla said. “I had never played water polo before high school, so leaving definitely is hard. The team is full of amazing, hilarious girls, and that's probably what I'll miss most. I have complete faith that the team will do just as well, if not better, next season. Next season, I'm expecting [junior field player] Sabrina Hall, [freshman field player] Chesnie Cheung and Talia Stanley to make some great plays; but I truly think that everyone will be integral to the team.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Chalmers expressed similar sentiments as Falla, and praised newcomer freshman Chesnie Cheung.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I am pretty sad about leaving this team – we really grew this season and I know they are going to do really well next year,” Chalmers said. “I think that the juniors will be great leaders next year, and we have a pretty young team so there's a lot of potential there. I think one of our younger players, Cheung, really stood out this year. It was her first year ever playing water polo, and ended up being one of the starters and our strongest players.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The girls’ water polo team hopes to return with a vengeance next autumn, according to Stanley.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We will continue to practice and improve, and next year, we hope to make it farther in the postseason to win the CCS championship,” Stanley said.<\/span>\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School girls’ water polo team (14-16, 4-8) concluded its season with a loss to Leland High School in the second round of the Central Coast Section (CCS) playoffs on Nov. 5 at a neutral location.","date":"2016-11-29 09:05:05","author":"Sam Lee","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/IMG_4533.jpg","categories":["Sports","water polo"],"tags":["CCS","haley chalmers","joanna falla","leland high school","paly","season recap","talia stanley","tournament","vikings","water polo"]},{"id":126598,"title":"New journalism app to feature Paly publications","permalink":"http:\/\/palyvoice.com\/2016\/11\/28\/new-journalism-app-to-feature-paly-publications\/","content":"Students will soon be able to download a new Palo Alto High School journalism iOS application called \"Paly Journalism\". The app was developed by Stanford University's Transformative Learning Technologies Lab in conjunction with the Paly journalism program.\r\n\r\nAccording to a press release from study leader Chris Proctor, the app will allow students to contribute to a student-only online forum where articles from The Paly Voice, Verde Magazine, Viking Magazine and The Campanile can be discussed.\r\n\r\nProctor, a former Paly English teacher and current PhD student in education at Stanford, says that the app will be part of a field study, and that the app will be donated to the Paly journalism program if it is found successful.\r\n\r\n\"The field trial will run through winter break; during this time we hope to gain a large base of users reading Paly journalism content on the app and discussing the stories through comments,\" Proctor said.\r\n\r\nProctor worked on developing the app with Paly seniors Daniel Li and Adrienne Kwok and juniors Norman Karr, Saurin Holdheim, Julia Qiao and Stephanie Lee. Journalism advisers Paul Kandell and Esther Wojcicki provided additional support.\r\n\r\n\"I chose to get involved because I was interested in helping to develop a real app,\" Karr said. \"It was pretty cool as it brought together all the Paly Publications [that gave permission] into one place.\"\r\n\r\nThe development of the app was fueled by a Stanford research study on schools' relations to their \"digital campuses,\" according to the press release. The release statement adds that while these spaces are important for learning and allowing students to express their own opinions, they are often discouraged by schools as they are feared as distractions from learning in the classroom.\r\n\r\n\"My hypothesis is that supporting powerful student identities in those spaces will be one way schools can structure them as safe and effective spaces for learning,\" Proctor said. \"I see Paly's student journalism program as potentially an excellent example of this dynamic; the app is designed to increase the impact of Paly's student journalism on the school community by increasing readership and reader engagement.\"\r\n\r\n<em>Editor's note: Previously, this article stated that the app had already been released on the App Store, which is incorrect.<\/em>","excerpt":"Students will soon be able to download a new Palo Alto High School journalism iOS application called \"Paly Journalism\". The app was developed by Stanford University's Transformative Learning Technologies Lab in conjunction with the Paly journalism program.","date":"2016-11-28 22:14:14","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/DSC_0006.jpg","categories":["Uncategorized"],"tags":["app","campanile","cmag","forum","journalism","paly","proctor","stanford","study","verde","viking","voice"]},{"id":126505,"title":"Verbatim: What are you thankful for?","permalink":"http:\/\/palyvoice.com\/2016\/11\/25\/verbatim-what-are-you-thankful-for\/","content":"Palo Alto High School students and staff are celebrating Thanksgiving break during these few days off. The Paly Voice asked various students and staff what they have come to appreciate most this year.\r\n<img class=\"alwaysThinglink\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/857670744019042306\/1024\/10\/scaletowidth#tl-857670744019042306;1043138249'\" alt=\"\" width=\"667\" height=\"667\" \/>\r\n\r\n<script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script>","excerpt":"Palo Alto High School students and staff are celebrating Thanksgiving break during these days off. The Paly Voice asked various students and staff what they have come to appreciate most this year.\r\n","date":"2016-11-25 16:16:40","author":"Zahra Muzaffar","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/15146685_10210235704545753_1042279418_o.jpg","categories":["Multimedia","Spotlight","Uncategorized","Verbatims"],"tags":["2016","give thanks","paly","Staff","students","thanful","thanksgiving","turkey","verbatim"]},{"id":126437,"title":"Boys&#8217; basketball seeks improvement with familiar faces","permalink":"http:\/\/palyvoice.com\/2016\/11\/23\/boys-basketball-seeks-improvement-with-familiar-faces\/","content":"[caption id=\"attachment_115475\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_58031-1.jpg\"><img class=\"size-full wp-image-115475\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_58031-1.jpg\" alt=\"Senior guard Miles Tention rises up to take a outside three in the third quarter against Gunn High School at Gunn during the 2015-2016 season. The Vikings went on to win 74-56. Photo by Jack Stoksik.\" width=\"800\" height=\"533\" \/><\/a> Senior guard Miles Tention rises up to take a outside three in the third quarter against Gunn High School at Gunn. The Vikings went on to win 74-56. Photo by Jack Stoksik.[\/caption]\r\n\r\nThe Palo Alto High School boys' varsity basketball team expects to bounce back from a disappointing Central Coast Section (CCS) playoff quarterfinal exit during the 2015-16 season.\r\n\r\nSeniors Miles Tention and Jack Simison are returning to the starting lineup along with juniors Max Dorward and William Schlemmer. Replacing last year's sole senior, Justin Hull, is junior guard Jared Wulbrun.\r\n\r\nExperienced head coach Peter Diepenbrock says the team will thrive off of its returning core players.\r\n\r\n\"The nucleus of the team is largely the same from last year,\" Diepenbrock said. \"But we are one year more experienced.\"\r\n\r\nAfter an unexpected, 54-50, loss to Cupertino High School in the quarter finals of CCS last year, junior guard and three year veteran Max Dorward is fired up to make a deep CCS playoff run.\r\n\r\n\"Last year was disappointing when we lost to Cupertino because they were a very beatable team,\" Doward said. \"We knew we were the better team and knew we had a chance to win it all. I'm very excited to be playing with almost all the same guys this year and to make a deep playoff run.\"\r\n\r\nDorward said the team has gelled over the years, and is ready to leave it all on the court.\r\n\r\n\"We've definitely improved on the aspect of playing with each other,\" Dorward said. \"We've played together for a while now so things seem to be clicking on the court.\"\r\n\r\nSimison said he is pumped for his final year of Paly basketball, and believes that the team's depth will give the Vikings a better shot at the league title and beyond.\r\n\r\n\"I'm excited for the entire season, every single game,\" Simison said. \"We have more players this year that give us a deeper bench and more rest for our starters. This year we plan to win league and get into the open division for CCS.\"\r\n\r\nSchlemmer said he wants to see the stands filled, as this year's team is guaranteed to impress.\r\n\r\n\"Everyone should come watch the games this year because I think this is the best Paly basketball team there has been in a long time,\" Schlemmer said.\r\n\r\nWith one of the top point guards in the De Anza League in Tention, an experienced lineup and the leadership of Diepenbrock, the Vikings are primed to kick off their league season on Jan. 3 against Milpitas High School at Gunn High Schoo","excerpt":"The Palo Alto High School boys' varsity basketball team looks to bounce back from a disappointing Central Coast Section (CCS) playoff quarterfinal exit during the 2015-16 season.","date":"2016-11-23 22:48:53","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_58031-1.jpg","categories":["Basketball","Sports","Spotlight","Uncategorized"],"tags":["basketball","cupertino","diepenbrock","dorward","palo alto","preview","schlemmer","season","simison","tention","vikings"]},{"id":126329,"title":"Season Recap: Football&#8217;s future looks bright with young talent","permalink":"http:\/\/palyvoice.com\/2016\/11\/21\/season-recap-footballs-future-looks-bright-with-young-talent\/","content":"<span style=\"font-weight: 400;\">The Palo Alto High School Football team wrapped up its season with a 4-7 overall record and 3-3 league record after a loss to the Los Gatos High School Wildcats (8-3, 6-0) in the first round of the Central Coast Section playoffs.<\/span>\r\n\r\nThe Vikings were carried throughout the season by junior running back Paul Jackson III who accumulated 1266 rushing yards on 222 carries, along with a team leading 12 rushing touchdowns.\r\n\r\nThe season looked promising for the Vikings, who who started off with a 25-12, victory over Patterson High School in the first game of the year.\r\n\r\nSophomore quarterback Jackson Chryst took over at the head of the offense following a concussion to senior starting quarterback Jordan Schilling in the Vikings' week two loss to San Benito High School.\r\n\r\nAccording to head coach Danny Sullivan, the future of the team was set forth from this years' graduating seniors.\r\n\r\n\"We are going to miss some key senior talent and leadership,\" Sullivan said. \"The examples that this year's senior class set is something that I will remember forever. They had to deal with change and they bought into what we are trying to accomplish.\"\r\n\r\nA highlight of the season included defeating the Wilcox Chargers (5-6, 4-2) during a regular season league matchup. The Chargers went on to finish second in the De Anza League.\r\n\r\n\"They were the No. 1 team in the league at the time and we won,\" Schilling said. \"That was one of the best games in my playing career.\"\r\n\r\nThe Vikings' finished fourth in the De Anza League, which secured them a spot in CCS playoffs.\r\n\r\nDespite the early CCS loss, Vikings' first year head coach Danny Sullivan looks forward to next season.\r\n\r\n\"In my first year at Paly, there were some definite challenges by being a new face to the area,\" Sullivan said. \"I am thankful that the school and the players that stuck it out through the season welcomed me to be a part of the program. There were some lows, along with some very big highs for our team this season. Definitely some things that the kids coming up through the ranks can build on for next season.\"\r\n\r\nThe Vikings look to make a mark next year by starting preparation for the 2017 season soon.\r\n\r\n\"Workouts in the weight room to build strength and conditioning are going to begin in late January,\" Sullivan said. \"We have a goal to show people how much we can improve from one season to the next. In talking with many other coaches around the area, the word is out about how we do things here at Paly. They all know that if the work gets put in, we are a team to be reckoned with in 2017.\"\r\n\r\nAccording the Schilling, the future of Paly football looks promising.\r\n\r\n\"I really think the team as whole improved week to week,\" Schilling said. \"This year was tough because we had to learn a whole new offense and adjust to a new system.\"\r\n\r\nThe team will depend on the talents of sophomore quarterback Jackson Chryst, junior running back Paul Jackson III and junior lineman Bryant Jefferson for leadership in the coming season.\r\n\r\n\"Our program can take drastic strides next season if junior Bryant Jefferson can continue to improve and if sophomore Jackson Chryst can grow as a player on the field,\" Sullivan said. \"If those two have a successful offseason, the rest of the team will follow their lead.\"","excerpt":"The Palo Alto High School Football team wrapped up its season with a 4-7 overall record and 3-3 league record after a loss to the Los Gatos High School Wildcats (8-3, 6-0) in the first round of the Central Coast Section playoffs.","date":"2016-11-21 21:27:46","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/los-altos-v-pa.jpg","categories":["Football","Sports"],"tags":["CCS","danny sullivan","football","jackson chryst","jordan schilling","palo alto","Paly football","recap","season","Sullivan","vikings"]},{"id":126113,"title":"Season Preview: Girls basketball seeks to avenge last season&#8217;s early NorCal exit","permalink":"http:\/\/palyvoice.com\/2016\/11\/21\/season-preview-girls-basketball-seeks-to-avenge-last-seasons-early-norcal-exit\/","content":"[caption id=\"attachment_115295\" align=\"alignright\" width=\"386\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/julie-jumpman.jpg\"><img class=\" wp-image-115295\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/julie-jumpman.jpg\" alt=\"Junior forward Julie Chandler leaps in the air as she goes up for an acrobatic layup against Gunn late in the fourth quarter on Friday at Gunn. The Vikings beat the Titans, 40-28. Photo by Sam Lee.\" width=\"386\" height=\"352\" \/><\/a> Senior forward Julie Chandler leaps in the air as she goes up for an acrobatic layup against Gunn late in the fourth quarter last year at Gunn. The Vikings beat the Titans, 40-28, on January 29th, 2016. Photo by Sam Lee.[\/caption]\r\n\r\nAfter a 1st place finish in the CCS playoffs and a first round NorCal loss, the Palo Alto High School girls' basketball team hopes to return to CCS finals.\r\n\r\nThe girls' team dominated leagues last year, posting an overall record of 19-8, en route to winning CCS. The girls team fell to Dublin High School Gaels, 55-49, in the first round of NorCals.\r\n\r\nSenior and fourth year guard Lauren Koyama hopes to put last year's early NorCal exit behind her, and is ready to start the season this winter.\r\n\r\n\"Getting eliminated early definitely hurt last year, but right now we are focused on getting through preseason and league.\" Koyama said. \"We want to peak in February, and we just have to take it one game at a time.\"\r\n\r\nLed by seniors Koyama and Skylar Burris, the team is looking to fill the gaps left by last year's seniors: Maddy Atwater, Alexis Harris, and Courtney Lovely.\r\n\r\n\"We lost three starters last year, one of them being our main source of height on the court. In order to adapt we need to work hard for every rebound and bring the energy that our seniors last year brought [to] every game,\" Burris said.\r\n\r\nThe loss of Harris will have the largest impact on the team, as she led the team in both scoring and rebounding last year, according to Maxpreps.\r\n\r\n\"We have a lot of guards who are capable of making threes, which can make up for the loss of our post scoring.\" junior guard Carly Leong said. \"We need to be more physical when it comes to rebounding, because we are a smaller team, and physicality will make up for it.\"\r\n\r\nDespite the loss, the girls team  maintain their dominance, having eight of the eleven players returning to the team.\r\n\r\n\"<span style=\"font-weight: 400;\">The only major change to the program is how many new players we're bringing in. The past couple years we've been playing with basically the same team, and I think bringing some players up from JV and new underclassmen trying out will give us a new dynamic.\" Leong said. \"So far, every practice has been so much fun, and I can't wait for season to start.\"<\/span>\r\n\r\nThe season starts at 7 p.m tonight, with the Vikings traveling to St. Ignatius.","excerpt":"After a 1st place finish in the Central Coast Section (CCS) playoffs and a first round NorCal loss, the Palo Alto High School girls' basketball team looks to return to CCS finals.","date":"2016-11-21 17:20:28","author":"Kasra Orumchian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/julie-jumpman.jpg","categories":["Basketball","Sports","Spotlight"],"tags":["2016","basketball","girls","girls basketball","gunn","palo alto","palo alto high school","paly","season preview","sports","vikings"]}]