[{"id":124632,"title":"Spirit Week Day Three results","permalink":"http:\/\/palyvoice.com\/2016\/10\/19\/spirit-week-day-three-results-3\/","content":"Freshmen, sophomores and juniors worked to level the scoreboards on the <a href=\"http:\/\/palyvoice.com\/2016\/10\/19\/recap-night-rally-lights-up-sprit-week-day-three\/\" target=\"_blank\">third day<\/a> of Spirit Week at the Night Rally, though seniors remain ahead.\r\n\r\nStudents dressed according to their class colors and participated in a relay race and a hamster ball race. Juniors dominated the Best Dressed competition and cheers, though seniors outcompeted the other classes in the relay race. Freshmen remain in last place while seniors maintain a comfortable lead, followed by juniors and sophomores.\r\n\r\nTonight is the first time that seniors scored less than freshmen, sophomores and juniors in the daily score.\r\n\r\nCheck back tomorrow as The Paly Voice covers <a href=\"http:\/\/palyvoice.com\/2016\/10\/19\/preview-generation-day-to-pit-young-against-old\/\">Generation Day<\/a>.\r\n\r\n<iframe style=\"overflow-y: hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/17305295-spirit-week-2016-day-3\" width=\"700\" height=\"1669\" frameborder=\"0\" scrolling=\"no\"><\/iframe>","excerpt":"Freshmen, sophomores and juniors worked to level the scoreboards on the third day of Spirit Week at the Night Rally, though seniors remain ahead.","date":"2016-10-19 23:29:31","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Spirit-Week-2016-Featured-Images.png","categories":["Multimedia","Spirit Week 2016"],"tags":["2016","ball","day","hamster","night","rally","results","scores","spirit","three","week"]},{"id":124601,"title":"Students, parents clash with admin on weighted GPA issue","permalink":"http:\/\/palyvoice.com\/2016\/10\/19\/students-parents-clash-with-admin-on-weighted-gpa-issue\/","content":"<span style=\"font-weight: 400;\">Emotions ran high at the Palo Alto Unified School District Board of Education meeting yesterday evening at the district office, where students, parents, school administrators and board trustees heatedly discussed the merits and disadvantages of including students’ weighted grade-point-averages on transcripts for college applications.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Palo Alto High School’s current practice is to report only the unweighted GPA on students’ transcripts and to not make a weighted GPA available in the Common App except on special request for scholarship consideration. Gunn High School gives its students the option to report either their weighted or unweighted GPAs to Common Application colleges, although not on transcripts. The Paly administration recently released a <a href=\"https:\/\/docs.google.com\/document\/d\/1dgRurvVuzDXtwWqByW2LQgKYiFhHWuQ84r_lCxhSteY\/edit\">statement<\/a> reaffirming its current practice, stating that reporting weighted GPAs is not conducive to fostering a healthy school climate. <\/span>\r\n\r\nAmid concerns from students and parents that this practice disadvantages students currently in the college and merit scholarship application process, the Board decided to take up the issue for discussion earlier than the originally scheduled date in January.\r\n\r\n<span style=\"font-weight: 400;\">PAUSD Supt. Max McGee presented his Two Point Plan for aligning the two high schools’ grade reporting process, which stipulates that both schools would report only students’ unweighted GPA on transcripts. In cases where colleges use weighted GPA as the criteria for merit scholarships, PAUSD would generate an official letter to the institution.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">When asked by a Board trustee what the high schools would do in a situation in which a college would not accept a letter vouching for a student’s weighted GPA, McGee responded by insisting that he would directly call the admissions department, eliciting an audible hiss from the audience.<\/span>\r\n\r\nOver 20 community members voiced their opinions on the issue during the Open Forum session, the overwhelming majority of whom argued in favor of reporting weighted GPAs. Paly senior Maya Katz, who pointed out to the Board at its meeting two weeks ago that not reporting weighted GPAs would disadvantage students for merit scholarships at certain colleges, most notably the University of Oregon, urged the trustees to actively seek community input.\r\n\r\n<span style=\"font-weight: 400;\">“We need your [the Board’s] support to get student voice and student opinion on the topic,” Katz said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Other student speakers echoed Katz’s sentiments, emphasizing the need for administrators to listen to the student body. Gunn senior Asaf Katzir spoke in defense of reporting weighted GPAs, explaining that he was depending on merit scholarships that consider weighted GPAs to help finance his college education. Parents underscored similar points in their addresses to the Board, with many saying that eliminating the option of reporting weighted GPAs constitutes a restriction on student freedom.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Can we just add a column with weighted GPAs [on the transcript]?” Gunn parent David Hong implored the Board, drawing a rousing round of applause.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Just four speakers, all of whom were Paly administrators, advocated for reporting only unweighted GPAs. Paly principal Kim Diorio said she was surprised to see that no one from the Gunn administration attended the meeting to defend McGee’s Two Point Plan, and that so many speakers decried eliminating weighted GPAs. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I see this [standardized grade reporting practices] as an opportunity, but it sounds like it hasn’t been framed that way with the Gunn students and parents,” Diorio said. “I hear a lot of fear and worry.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Following the Open Forum session, Board member Camille Townsend argued forcefully in favor of reporting weighted GPAs, saying that it was “terrible” that students had to bring this issue to the board in the first place and that the district should not “gerrymander the APs [Advanced Placement courses],” by failing to reflect weighted classes in students' GPAs.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">While neither of them explicitly said no to reporting weighted GPAs, trustees Ken Dauber and Terry Godfrey stressed the need to listen to professional educators in making the decision. Fellow Board member Melissa Baten Caswell expressed support for re-evaluating the grade reporting process such that weighted GPAs are included on student transcripts, but emphasized that the district must find a short-term solution for seniors who will be applying to colleges in the coming months.<\/span>","excerpt":"Emotions ran high at the Palo Alto Unified School District Board of Education meeting yesterday evening at the district office, where students, parents, school administrators and board trustees heatedly discussed the merits and disadvantages of including students’ weighted grade-point-averages on transcripts for college applications.","date":"2016-10-19 23:15:25","author":"Dhara Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0979.jpg","categories":["News","Spotlight"],"tags":["college applications","gpa","gunn","paly","PAUSD","scholarships","School Board","unweighted","weighted"]},{"id":124630,"title":"Recap: Night Rally lights up Sprit Week Day Three","permalink":"http:\/\/palyvoice.com\/2016\/10\/19\/recap-night-rally-lights-up-sprit-week-day-three\/","content":"Crowds were roaring as Spirit Week continued with the second annual Night Rally, which featured a neon color theme, with a Best Dressed competition, an intense six-station Relay Race and the Human-Sized Hamster Ball Race.\r\n\r\nTraditionally, the Wednesday of Spirit Week has been Color Day. However, due to the Practice Standardized Aptitude Test administered to the juniors this morning, there was no daytime Spirit Week rally. Instead, the Associated Student Body launched the Night Rally, where students wore neon class colors, with seniors wearing green, while juniors wore yellow, sophomores dressed in red and freshmen decked out in orange.\r\n\r\nThe first event of the night was the highly contentious Relay Race. With 1,500 points on the line, the seniors pulled ahead at the last minute to win the event. The race was made up of six stations: the ball hop, army crawl, skin the snake, balloon pop, tarp carry and the exciting puzzle station, where the seniors defeated the freshmen in the final round.\r\n\r\nBy a random hat draw, the seniors and freshmen were chosen to compete first, with the seniors taking an early lead and quickly defeating the freshmen. In a tight race, the sophomores beat the juniors, sending the juniors to the consolation round, where the freshmen were victorious.\r\n\r\n“I think we did pretty [well], because we had a lot of spirit, and we tried our best,” freshman Naomi Jecker said. “[Beating the juniors] was pretty epic, and we are very proud.\"\r\n\r\nPaly’s cheer and dance team both performed between the two activities.\r\n\r\nThis year, ASB made some changes to the Human Sized Hamster Ball Race. Unlike last year’s giant hamster ball, which only featured one person per class, this year’s race included a handoff between two players after the first person reached the end zone.\r\n\r\nWith the juniors and seniors first up to race, the juniors pulled ahead at the last minute, while the freshmen barely edged out the sophomores in the last five yards. Despite falling out of the hamster ball, the senior class narrowly defeated the sophomores in the third round, but were unfortunately disqualified due to having two males compete rather than the required male and female.\r\n\r\nAfter getting last place in the Relay Race, the juniors redeemed themselves with a first place victory in the Hamster Ball.\r\n\r\n“Tonight was probably the best night that the Class of 2018 has ever had, we didn’t start strong and it was easy to get discouraged, but we were still chanting and cheering louder than all the other grades,” Junior Class President Jaiveer Sandhu said. “The pressure was on and [the hamster ball participants] got first place and they came up big for the grade when we needed it the most.”\r\n\r\nTotal points will be posted on the ASB website later tonight. Spirit Week will continue tomorrow with <a href=\"http:\/\/palyvoice.com\/2016\/10\/19\/preview-generation-day-to-pit-young-against-old\/\">Generation Day<\/a>. Check The Paly Voice for more updates on Spirit Week 2016.\r\n<iframe src=\"https:\/\/docs.google.com\/presentation\/d\/1W-eYzvGt-xQ1LnGdsydkq6g3xaAEf6wOyVNt7aPcNz0\/embed?start=true&amp;loop=true&amp;delayms=10000\" width=\"720\" height=\"434\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"Crowds were roaring as Spirit Week continued with the second annual Night Rally, which featured a neon color theme, with a Best Dressed competition, an intense six-station Relay Race and the Human-Sized Hamster Ball Race.\r\n","date":"2016-10-19 23:14:28","author":"Julia Qiao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/14803338_556050907915200_344070140_o.jpg","categories":["News","Spirit Week 2016","Spotlight"],"tags":["ASB","color day","hamster ball","juniors","night rally","relay race","seniors","Spirit Week"]},{"id":124597,"title":"Preview: Generation Day to pit young against old","permalink":"http:\/\/palyvoice.com\/2016\/10\/19\/preview-generation-day-to-pit-young-against-old\/","content":"[caption id=\"attachment_42917\" align=\"alignnone\" width=\"583\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2012\/10\/IMG_0907.jpg\"><img class=\" wp-image-42917\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2012\/10\/IMG_0907.jpg\" alt=\"The seniors, dressed as grandparents, cheer for their class. Tomorrow they will be wearing camouflage gear while the rest of the school sports Paly's colors, green and white. \" width=\"583\" height=\"435\" \/><\/a> Seniors show their \"senior citizen\" spirit during Generation Day. Photo: The Paly Voice.[\/caption]\r\n\r\nThe Spirit Week battle of classes will continue tomorrow, as Palo Alto High School students get their bibs, leather jackets, suits and ties and wheelchairs ready for Generation Day.\r\n\r\nOld and wise or young and wild? For this day, each class's theme relates to a different generation. The freshman theme is \"Babies,\" sophomores are \"Teeny Boppers,\" juniors will be \"Sophisticates\" and seniors will dress as \"Senior Citizens.\"\r\n\r\nAs of Wednesday afternoon, the seniors are in the lead followed by the juniors and sophomores. Despite a third place finish in tug of war, the freshman class remains in last place. However, it is still anyone's game.\r\n\r\nThe two activities at the lunch rally tomorrow will be \"Pool Rings\" and \"Name that Tune.\"\r\n\r\nIn \"Pool Rings\" two members of each class, attempt to throw a pool ring around each others' necks. The point only counts if the ring stays around their neck. The two partners switch off, throwing the ring back and forth.\r\n\r\nNext will be \"Name that Tune.\" This competition requires four people from each grade to work together to name an unknown song played on the speakers. They will write down their guess and run it to the center of the football field to the judges. The class that shows the correct answer first wins a point.\r\n\r\nMake sure to tag all of your Spirit Week social media posts with #palyspirit for a chance to be featured on The Paly Voice website.","excerpt":"The Spirit Week battle of classes will continue tomorrow, as Palo Alto High School students get their bibs, leather jackets, suits and ties and wheelchairs ready for Generation Day.","date":"2016-10-19 21:31:05","author":"Bradley Smith","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/imageedit_2_7310383558.jpg","categories":["News","Spirit Week 2016","Spotlight"],"tags":["#spiritweek","generation day","preview"]},{"id":124529,"title":"Video: Caesar dressing tops the salad on Day Two","permalink":"http:\/\/palyvoice.com\/2016\/10\/18\/video-caesar-dressing-tops-the-salad-on-day-two\/","content":"The Paly Voice documented the <a href=\"http:\/\/palyvoice.com\/2016\/10\/18\/recap-seniors-maintain-their-reign-on-day-two\/\" target=\"_blank\">second day<\/a> of Palo Alto High School's Spirit Week 2016 which featured a thrilling tug of war tournament during the lunch rally.\r\n\r\nMake to sure to check Associated Student Body’s <a href=\"https:\/\/sites.google.com\/site\/pahsasb\/sw2016\">master schedule<\/a> for information on daily events as well as <a href=\"http:\/\/palyvoice.com\/2016\/10\/18\/spirit-week-day-two-results-3\/\" target=\"_blank\">scoring<\/a>. Check the Paly Voice for more updates on Spirit Week 2016 under the new <a href=\"http:\/\/paly.io\/spiritweek16\" target=\"_blank\">Spirit Week tab<\/a>.\r\n\r\n<iframe src=\"https:\/\/www.youtube.com\/embed\/MuE34Q5n-cM\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Paly Voice documented the second day of Palo Alto High School&#8217;s Spirit Week 2016 which featured a thrilling tug of war tournament during the lunch rally. <a href=\"http:\/\/palyvoice.com\/2016\/10\/18\/video-caesar-dressing-tops-the-salad-on-day-two\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2016-10-18 22:08:17","author":"Kasra Orumchian","categories":["Spirit Week 2016"],"tags":["2016","freshmen","juniors","paly","salad dressing","seniors","Sophomores","Spirit Week","tug of war","video","voice"]},{"id":124562,"title":"Spirit Week Day Two results","permalink":"http:\/\/palyvoice.com\/2016\/10\/18\/spirit-week-day-two-results-3\/","content":"<span style=\"font-weight: 400;\">Spirit Day Two results are in, and seniors remain in the lead with 4900 <\/span>points with 750 ahead of the juniors. Despite the freshman upset in tug of war, freshmen still remain in last place.\r\n\r\n<span style=\"font-weight: 400;\">Check back tomorrow as The Paly Voice recaps Day Three of Spirit Week, where students will participate in the Night Rally dressed in their neon class colors.<\/span>\r\n\r\n<iframe width=\"800\" height=\"1896\" frameborder=\"0\" scrolling=\"no\" style=\"overflow-y:hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/17214602-spirit-week-2016-day-1\"><\/iframe>","excerpt":"Spirit Day Two results are in, and seniors remain in the lead with 4900 points with 750 ahead of the juniors.  Despite the freshman upset in tug of war, freshmen still remain in last place.","date":"2016-10-18 21:55:58","author":"Morgan Keller","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Screen-Shot-2016-10-18-at-9.44.12-PM.png","categories":["News","Spirit Week 2016","Spotlight"],"tags":["2016","paly","scores","Spirit Week","stats"]},{"id":124173,"title":"Preview: ASB launches second annual Night Rally","permalink":"http:\/\/palyvoice.com\/2016\/10\/18\/preview-asb-launches-second-annual-night-rally\/","content":"[caption id=\"attachment_110477\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/I9P4076.jpg\"><img class=\"wp-image-110477 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/I9P4076.jpg\" alt=\"\" width=\"800\" height=\"533\" \/><\/a> Paly students, decked out in neon clothing, cheer for their separate classes during a relay race during the 2015 spirit night rally. Photo by Cooper Lou.[\/caption]\r\n\r\nDay three of Spirit Week will kick off with a night rally from 7 p.m. to 9 p.m. tomorrow at the Palo Alto High School football field. There will be no school for students tomorrow, except for juniors taking the PSAT at 8 a.m.\r\n\r\nWith the absence of a lunch rally due to junior PSAT testing, the night rally will include \"Best Dressed\" and cheers. All activities will count in the Spirit Week scoring, according to Spirit Commissioner junior Michaela Fogarty.\r\n\r\nThis will be the second consecutive year in which Spirit Week will include a night rally.  According to Spirit Commissioner junior Claire Billman, students should be decked out in their class colors, and suggests that students \"strive for neon\" as the majority of the rally will happen after sundown.\r\n\r\n[embed]https:\/\/youtu.be\/4s1R8Hr3GNk[\/embed]\r\n\r\n“The night rally is going to be filled with a lot of fun activities,\" Fogarty said. \"We hope to have a large turn out like we did last year.”","excerpt":"Day three of Spirit Week will kick off with a night rally from 7 p.m. to 9 p.m. tomorrow at the Palo Alto High School football field. There will be no school for students tomorrow, except for juniors taking the PSAT at 8 a.m.","date":"2016-10-18 21:32:54","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/imageedit_4_3212801292.jpg","categories":["Spirit Week 2016","Spotlight"],"tags":["2016","Billman","Fogarty","night","night rally","palo alto high school","rally","spirit","Spirit Week","week"]},{"id":124540,"title":"Recap: Seniors maintain their reign on Day Two","permalink":"http:\/\/palyvoice.com\/2016\/10\/18\/recap-seniors-maintain-their-reign-on-day-two\/","content":"The competition heats up as seniors performed strongly in today’s lunchtime rally, fueling the rivalry between the upperclassmen.\r\n\r\nAs part of today’s salad dressing theme, the seniors dressed up in togas, juniors in Hawaiian gear, sophomores in cowboy attire and freshmen in athletic apparel. The lunchtime rally featured a tug-of-war contest, as well as the usual cheers and a best dressed competition.\r\n\r\nFor the first time, Palo Alto High School's Associated Student Body strayed from tradition and allowed judges to randomly pull the order in which grades would participate in the tug of war from a hat.\r\n\r\nThe seniors quickly defeated the freshmen in the first round of tug of war, while the juniors were victorious over the sophomores. In the consolation round, the freshmen pulled an upset victory over the sophomores.\r\n\r\n“I was impressed and surprised by the fact that the freshmen took third place in tug of war and beat the sophomores,” freshman Griffin Kemp said.\r\n\r\nAfter a hard-fought battle in the championship round, the seniors prevailed over the juniors to claim the win.\r\n\r\n“Our whole team was really pumped because we [the Class of 2017] have never made it to the championship round before,” tug-of-war participant senior Lauren Koyama said. “We all knew we had to redeem ourselves for the past years.”\r\n\r\nLast year, the Class of 2018 claimed victory while facing the Class of 2017 in the first round. Its win forced the Class of 2017 to compete for third place, rather than the anticipated junior versus senior tug-of-war championship round.\r\n\r\nDespite the loss, the juniors are still optimistic about their Spirit Week chances.\r\n\r\n“Although we lost to the seniors this year, I think our class has a lot of spirit and we can definitely can make a comeback in the next couple days,” junior Xander Sherer said.\r\n\r\nTotal points will be posted at the end of float building on the ASB website at 9:30 p.m. Spirit Week will continue tomorrow with the Night Rally from 7 to 9 p.m. Check The Paly Voice for more updates on Spirit Week 2016 under the new <a href=\"http:\/\/paly.io\/spiritweek16\" target=\"_blank\">Spirit Week tab<\/a>.\r\n\r\n<iframe src=\"https:\/\/docs.google.com\/presentation\/d\/1Qf8Ne0o_uW_nyTNSZOXEJSvSB0ChMy8mXl11kOWuAGo\/embed?start=true&amp;loop=false&amp;delayms=3000\" width=\"700\" height=\"495\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The competition heats up as seniors performed strongly in today’s lunchtime rally, fueling the feud amongst the upperclassmen.\r\n","date":"2016-10-18 18:24:58","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/DSC_0238.jpg","categories":["News","Spirit Week 2016","Spotlight"],"tags":["day 2","griffin","griffin kemp","hawaiian","healthy choice","kemp","koyama","lauren","palo alto high school","paly","ranch","recap","sherer","spirit","Spirit Week","toga","tug of war","victory","week","xander"]},{"id":124433,"title":"Spirit Week Day One results","permalink":"http:\/\/palyvoice.com\/2016\/10\/17\/spirit-week-day-one-results-3\/","content":"<a href=\"http:\/\/palyvoice.com\/2016\/10\/17\/recap-spirit-week-day-one\/\" target=\"_blank\">Spirit Week Day One<\/a> results are in, and the seniors are <a href=\"http:\/\/palyvoice.com\/2016\/10\/17\/video-paly-launches-spirit-week-2016\/\" target=\"_blank\">narrowly in the lead<\/a> with 100 points ahead of the second-place sophomores. The freshmen remain in last place by a large margin of 1050 points behind the juniors.\r\n\r\nCheck back tomorrow as The Paly Voice summarizes Day Two of Spirit Week, where students and staff will dress up for the Salad Dressing theme.\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/spirit-week-201_17214602_df8fcc92aad2b37d3bc758aa59833a41ceae560c.png\"><img class=\"alignnone wp-image-124520\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/spirit-week-201_17214602_df8fcc92aad2b37d3bc758aa59833a41ceae560c.png\" alt=\"spirit-week-201_17214602_df8fcc92aad2b37d3bc758aa59833a41ceae560c\" width=\"621\" height=\"1472\" \/><\/a>\r\n\r\n&nbsp;","excerpt":"Spirit Week Day One results are in, and seniors take the lead with 2200 points with sophomores close behind. Stay tuned this week as The Paly Voice summarizes this year's Spirit Week scores.","date":"2016-10-17 23:10:45","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Spirit-Week-2016-Featured-Images-2.png","categories":["Multimedia","Spirit Week 2016"],"tags":["2016","classes","Fall","freshmen","juniors","piktochart","results","seniors","Sophomores","spirit","statistics","stats","week","win"]},{"id":124429,"title":"Recap: Spirit Week Day One","permalink":"http:\/\/palyvoice.com\/2016\/10\/17\/recap-spirit-week-day-one\/","content":"The first day of Spirit Week saw the debut of several new activities in addition to some old classics, creating a level playing field for both veteran and rookie competitors.\r\n\r\nAs usual, Spirit Week started off with “Theme Day,” where each class (except for seniors) dressed up for its respective themes. The freshman theme is \"Eye of the Tiger,\"  the sophomores, \"Firefighters,\" and the juniors, \"Boxing.\"  As per tradition, the senior class dressed up in 90’s attire instead of its theme, “Game Over.”\r\n\r\nClear skies and temperate weather enabled a large student turnout to watch the lunchtime activities.\r\n\r\nThe sophomores managed to take first place in “Knee Trembler” after barely edging out the seniors, while the junior class won “Pass the Water.”\r\n\r\nDespite losing both of the new events, the senior class was able to get a win in the “Banana Bump” activity.\r\n\r\nAccording to senior Jackson Dahl, who won the event, the trick was to get some momentum going.\r\n\r\nDahl came from behind to get the win for the senior class.\r\n\r\n“Well, I was practicing last night and I knew that it was hard to get started,” Dahl said. “But once I got going, I knew I was unstoppable.”\r\n\r\nDespite not winning an event, members of the freshman class still had a good time.\r\n\r\n“We weren't exactly experienced, but it was fun nevertheless and I like dressing up,” freshman Lanie Germain said. “The seniors helped us out a bit.”\r\n\r\nThere was a minor disruption during a break between activities when several junior boys ran out onto the field holding a sign containing profanity targeted at the senior class. According to senior Vice President Natalie Maloney, the junior class as a whole will lose sportsmanship points.\r\n\r\nTotal points will be posted at the end of float building on the <a href=\"https:\/\/sites.google.com\/site\/pahsasb\/\">ASB website<\/a>. Spirit Week continues tomorrow with <a href=\"http:\/\/palyvoice.com\/2016\/10\/17\/preview-spirit-week-excitement-to-continue-with-salad-dressing-day\/\" target=\"_blank\">Salad Dressing Day<\/a>. Continue to check the Paly Voice for more updates on Spirit Week 2016.\r\n\r\n<iframe src=\"https:\/\/docs.google.com\/presentation\/d\/1gF2wRG8TPC9ATMY_CrQos30CQENyswcRouy8RXtJKrY\/embed?start=false&amp;loop=false&amp;delayms=3000\" width=\"620\" height=\"620\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The first day of Spirit Week saw the debut of several new activities in addition to some old classics, creating a level playing field for both veteran and rookie competitors. ","date":"2016-10-17 22:07:31","author":"Jackson Doerr","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/DSC_00272.jpg","categories":["News","Spirit Week 2016"],"tags":["90s","boxing","day 1","day one","eye of the tiger","firefighters","spirit week 2016","theme day"]}]