[{"id":124013,"title":"Spirit Week: Dress up guide","permalink":"http:\/\/palyvoice.com\/2016\/10\/11\/spirit-week-dress-up-overview\/","content":"[caption id=\"attachment_43149\" align=\"alignleft\" width=\"398\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2012\/10\/DSC_0177.jpg\"><img class=\" wp-image-43149\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2012\/10\/DSC_0177.jpg\" alt=\"The Class of 2015 cheers on their peers during the sophomore spirit dance. [Photo: Cathy Rong]\" width=\"398\" height=\"264\" \/><\/a> The Class of 2015 cheers on their peers during the sophomore spirit dance. Photo: Cathy Rong[\/caption]&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\nSpirit Week is by far the best week of the year at Palo Alto High School. However, dressing up for Spirit Week can be expensive and hard to do. If you need some wardrobe advice for Spirit Week, check out The Paly Voice's dress up guide for all of the classes using the links below!\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2016\/10\/11\/spirit-week-dress-up-preview-freshmen\/\" target=\"_blank\">Freshmen<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2016\/10\/11\/spirit-week-dress-up-preview-sophomores\/\" target=\"_blank\">Sophomores<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2016\/10\/11\/spirit-week-dress-up-preview-juniors\/\" target=\"_blank\">Juniors<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2016\/10\/11\/spirit-week-dress-up-preview-seniors\/\" target=\"_blank\">Seniors<\/a>\r\n\r\n&nbsp;","excerpt":"If you need some wardrobe advice for Spirit Week, check out The Paly Voice's dress up guide for all of the classes!","date":"2016-10-11 17:09:23","author":"Kasra Orumchian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/imageedit_4_32128012921.jpg","categories":["ASB","Spirit Week 2016","Spotlight","Uncategorized"],"tags":["#palyspirit","2016","ASB","Best dressed","dress up","palo alto","palo alto high school","paly","review","seniors","Spirit Week","student","vikings"]},{"id":123936,"title":"Spirit week dress up preview: Seniors","permalink":"http:\/\/palyvoice.com\/2016\/10\/11\/spirit-week-dress-up-preview-seniors\/","content":"<em><span style=\"font-weight: 400;\">Dear Seniors,<\/span><\/em>\r\n\r\n<em>It’s time for one last go-around of the best week of the year. We’re confident in your ability to perform and end up on top this year. You are the top dogs for the first time, and expectations for the Class of 2017 have never been higher. Go ALL out and make the most of your last high school Spirit Week!<\/em>\r\n\r\nMonday: 90s day\r\n\r\n<span style=\"font-weight: 400;\">It’s time to break out those razor scooters and roller blades. If you aren’t confident enough rollerblading around campus, we recommend you stick to a scooter. Make sure to blast those 90s jams all day around campus, preferably with an oversized boombox. If thats not your style, you can also sport a pair of headphones around your neck. We expect to hear NSYNC, Backstreet Boys and Britney Spears all day long. Don't forget to break out it’s also time to break out your colorful windbreakers, scrunchies, chokers, denim overalls and good ol' Chuck Taylor's. <\/span>\r\n\r\nTuesday: Dressing day - Caesar\r\n\r\n<span style=\"font-weight: 400;\">One word: Togas. Grab a white bed sheet and create your very own Toga by following these <a href=\"http:\/\/www.al.com\/living\/index.ssf\/2014\/09\/how_to_tie_a_toga_photos_video.html\" target=\"_blank\">simple steps<\/a>. Accessorize your toga with all the gold and purple jewelry you can find and some gladiator sandals.<\/span>\r\n\r\nWednesday: Night rally - Green\r\n\r\n<span style=\"font-weight: 400;\">For your final Spirit Week, you’ll be representing your class color at the night rally at 7 p.m. on Oct. 19. Grab all the neon green glow sticks you can along with lime green tights. From head to toe, rep that bright green for the class of 2017.<\/span>\r\n\r\n&nbsp;\r\n\r\n[caption id=\"attachment_124078\" align=\"alignleft\" width=\"210\"]<img class=\"wp-image-124078\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_93011.jpg\" alt=\"\" width=\"210\" height=\"323\" \/> Staff Writer Isabella Marcus and Managing Editor Sherwin Amsbaugh wear their camo and Paly gear for \"Paly\" Day.[\/caption]\r\n\r\nThursday: Generations day - Senior Citizens\r\n\r\nYou're finally at the top of the food chain. Senior citizens day is by far the most anticipated theme of generations day. It's time to dress up as that 70-year-old grandma and grandpa you've been waiting to be since freshmen year. Grab a cane, walker or wheelchair and make sure to dye your hair a nice wispy grey. We expect to see tons of pillows attached to your rear end and lipstick smudged all over your face. Make sure to go all out on one of your final spirit week days.\r\n\r\nFriday: Camo\r\n\r\n<span style=\"font-weight: 400;\">It’s year four, <\/span><span style=\"font-weight: 400;\">you should know what to do by now. Make sure to finish your high school Spirit Week career on a high note and make memories that will last a lifetime<\/span>.","excerpt":"Spirit Week is by far the best week of the year at Palo Alto High School. Check out The Paly Voice's dress up guide for the   senior class!","date":"2016-10-11 16:36:51","author":"Isabella Marcus","categories":["Uncategorized"],"tags":["#palyspirit","2016","dance","palo alto","palo alto high school","paly","seniors","Spirit Week","vikings"]},{"id":123934,"title":"Spirit Week dress up preview: Juniors","permalink":"http:\/\/palyvoice.com\/2016\/10\/11\/spirit-week-dress-up-preview-juniors\/","content":"<em>Dear Juniors,<\/em>\r\n\r\n<em>Last year, you fought a great fight, but unfortunately came up short of the upset. You faltered on the float and dance, which ultimately was the reason you came in third place. However, you killed it during the rallies. If you  are able to improve on your float and dance from last year and replicate your success at the rallies, the Class of 2018 could be a large threat to the seniors.<\/em>\r\n\r\n&nbsp;\r\n\r\n<span style=\"font-weight: 400;\">Monday: Theme day - Boxers<\/span>\r\n\r\n<span style=\"font-weight: 400;\">It’s time for the Class of 2018 to enter the Spirit Week ring for the third time. Following last year's Spirit Week, this year’s juniors are expected to impress. Grab your white undershirts, robes, boxing gloves and title belts, and knock this week out. Along with this, girls can sport those boxing braids you’ve been dying to wear. Boxing gloves can be expensive, but are available on Amazon and eBay. You can also wrap your hands with athletic tape or pre-wrap as a less expensive substitute to the gloves.<\/span>\r\n\r\n[caption id=\"attachment_123988\" align=\"alignleft\" width=\"351\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9249.jpg\"><img class=\" wp-image-123988\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9249.jpg\" alt=\"Staff Writers Kasra Orumchian and Isabella Marcus wear their tropical clothing for the Junior spirit day &quot;Thousand Island&quot;.\" width=\"351\" height=\"234\" \/><\/a> Staff Writers Kasra Orumchian and Isabella Marcus wear their tropical clothing for the Junior spirit day \"Thousand Island\". Photo by Sherwin Amsbaugh[\/caption]\r\n\r\nTuesday: Dressing day - Thousand Island\r\n\r\n<span style=\"font-weight: 400;\">It’s time for the juniors to run this beach one more time. Go all out with leis, coconut bras, hula skirts, bathing suits  and Tommy Bahama shirts. Amazon, Target, Goodwill, Dollar Stores and Walmart should be able to provide you with those key outfits you are looking so dearly for. This day is the perfect opportunity to bring an assortment of pool floaties to the quad. You should be able to reuse some of that lifeguard material, and must bring that hawaiian spirit. <\/span>\r\n\r\nWednesday: Night rally - Yellow\r\n\r\n<span style=\"font-weight: 400;\">For the night rally, this is the easiest and by far the most vibrant color to wear for a night time event. Yellow hats, class t-shirts, yellow socks and shorts and whatever yellow you can find will look great next to the green and red classes around you. Amazon should be able to provide all forms of yellow attire, and any glow sticks or neon you seek. Target, Goodwill and Walmart may also have good options for you if you need to find anything else yellow.<\/span>\r\n\r\nThursday: Generations day - Sophisticates\r\n\r\n<span style=\"font-weight: 400;\">Ladies and gentlemen, it’s time to dress for success. Ladies, grab those pencil skirts, white blouses, blazers and heels if you’re feeling daring. Gentlemen make sure to rock those suits and ties. The perfect accessories for everyone and anyone includes briefcases, a bluetooth earpiece, a coffee mug and glasses. You can borrow your suits and various sophisticate items from your parents, or can buy your own off Amazon. <\/span>\r\n\r\nFriday: Paly - Green and White\r\n\r\n<span style=\"font-weight: 400;\">Juniors, it's your last time wearing your Paly gear on the last day of spirit week. Make it a memorable final run-through grab your Paly T-shirts, sweatshirts, hats, socks, underwear, gloves, pants and any other Paly gear you have. Viking Helmets, and green and white face paint never disappoint, and there’s no excuse why you should disappoint either. Hit the field after school to watch the official unveiling of your float and Spirit Dance to the rest of the classes, as Spirit Week comes to a close.<\/span>","excerpt":"Spirit Week is by far the best week of the year at Palo Alto High School. Check out The Paly Voice's dress up guide for the junior class!","date":"2016-10-11 16:36:21","author":"Isabella Marcus","categories":["Uncategorized"],"tags":["#palyspirit","2018","ASB","boxing","juniors","palo alto high school","paly","paly spirit week","sophisticates","Spirit Week","thousand island"]},{"id":123887,"title":"Spirit Week dress up preview: Sophomores","permalink":"http:\/\/palyvoice.com\/2016\/10\/11\/spirit-week-dress-up-preview-sophomores\/","content":"Dear Sophomores,\r\n\r\n<em><span style=\"font-weight: 400;\">It’s time for round two. You guys left your mark on the other classes last year, as one of the best freshman classes we’ve ever seen at Paly. Although you fell to last place, expectations are high for you to perform this year.<\/span><\/em>\r\n\r\nMonday: Theme day - Firefighters\r\n\r\n<span style=\"font-weight: 400;\">When things get L17 , it’s time for the firefighters to come and extinguish those flames. Bring your A-game and rock those firefighter hats, boots, jackets and suspenders. For a more affordable option, throw on a plain white shirt and some black bottoms paired with red suspenders and firefighter hat.<\/span>\r\n\r\n[caption id=\"attachment_123971\" align=\"alignleft\" width=\"347\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9184.jpg\"><img class=\" wp-image-123971\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9184.jpg\" alt=\"Staff Writers Kasra Orumchian and Isabella Marcus wear their flannels in preparation to &quot;Ranch&quot; day.\" width=\"347\" height=\"231\" \/><\/a> Staff Writers Kasra Orumchian and Isabella Marcus rock their flannels in to demostrate what to wear for \"Ranch\" day. Photo by Sherwin Amsbaugh[\/caption]\r\n\r\nTuesday: Dressing day - Ranch\r\n\r\n<span style=\"font-weight: 400;\">Hay is for horses, but is also appropriate as a Quad decoration. Grab your flannels, cowboy hats, and ride the rodeo. Carrots may go well with ranch dressing, but on this day, put on a bandanna or any other assorted cowboy apparel. Bandannas should be rather accessible to anyone; you can borrow them from a friend, or go out and buy them from most retail stores. Almost everything for this day can be found on Amazon, Target and Walmart and should supply you with what you need.<\/span>\r\n\r\nWednesday: Night rally - Red\r\n\r\n<span style=\"font-weight: 400;\">It’s time for the night rally. The class of 2019 impressed at every rally last year and is expected to do the same this year. Sophomores, grab your red and take to the bleachers for the second ever night rally in Paly history. Red might be a hard color to light the night with, but we’re confident that you can do it. Try getting some red neon glow sticks and wear them as necklaces or bracelets. Amazon has a wide and reliable variety of neon material that you can get for a moderately low price.<\/span>\r\n\r\nThursday: Generations day - Teenyboppers\r\n\r\n<span style=\"font-weight: 400;\">Teenybopper day is commonly known as “greasers day,” so grab your bluetooth speakers and jam out to the soundtrack of “Grease\". If you want to leave a lasting impression on the other classes, earn the hand jive to show your greaser spirit. Stay golden, Ponyboy. For boys, you want to embody the greaser spirit, so slick back your hair, grab your leather jackets and show off that teenage angst. Girls, it’s time to live out your life goals of being Sandy from “Grease.” Grab a traditional poodle skirt and pair it with a “pink ladies” jacket or take the alternate approach and rock those pin-up curls, red lipstick and leather jackets. <\/span>\r\n\r\nFriday: Paly - Green and White\r\n\r\n<span style=\"font-weight: 400;\">Sophomores, you've done this before, and should know how to do it again. Grab your Paly T-shirts, sweatshirts, hats, socks, underwear, gloves, pants and any other Paly gear you have. Viking Helmets and green and white face paint never disappoint, so there’s no excuse why you should disappoint either. Hit the field after school to watch the official unveiling of the floats and Spirit Dances to the rest of the classes as spirit week comes to a close.<\/span>","excerpt":"Spirit Week is by far the best week of the year at Palo Alto High School. Check out The Paly Voice's dress up guide for the sophomore class!","date":"2016-10-11 16:35:48","author":"Isabella Marcus","categories":["Uncategorized"],"tags":["#palyspirit","2016","ASB","freshman","juniors","palo alto","palo alto high school","paly","preview","seniors","Sophomores","Spirit Week","SpiritWeek16","student","vikings"]},{"id":123885,"title":"Spirit Week dress up preview: Freshmen","permalink":"http:\/\/palyvoice.com\/2016\/10\/11\/spirit-week-dress-up-preview-freshmen\/","content":"<em><span style=\"font-weight: 400;\">Dear Freshmen,<\/span><\/em>\r\n\r\n<em>Welcome to the big leagues! Spirit and dress-up days from your past have prepared you for this week, and have probably failed you. You might have seen that one kid going all out on “color day” and stared at him like he was from another planet. If you do not dress up for Spirit Week here at Paly, you will be stared at like that one kid who went all out for “color day.” As upperclassmen, we don’t want you to be stared at like that. So please, please, dress up and go ALL out. You will not look “weird,” and you will enjoy the best week of the year here at Paly.<\/em>\r\n\r\nMonday: Theme day - Eye Of the Tiger\r\n\r\n<span style=\"font-weight: 400;\">To dress for Eye of the Tiger, unleash your inner animal. Animal print, face paint and any other jungle related items will be very beneficial to your success in dressing up for your class theme day. Take a trip to any arts and crafts store to find face paint and be that tiger you’ve aspired to be since the 1st grade. Play to the strength of your class color by painting on orange stripes, or coloring your whole face orange. If you don’t already have animal print, hit up your local Goodwill, Target or Walmart, to find the gear that will help you rule the jungle.<\/span>\r\n\r\n[caption id=\"attachment_124066\" align=\"alignleft\" width=\"332\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Freshman.jpg\"><img class=\" wp-image-124066\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Freshman.jpg\" alt=\"Staff Writers Kasra Orumchian and Isabella Marcus wear their favorite sports gear for the freshman spirit day &quot;Healthy Choice&quot;. Photo by Sherwin Amsbaugh\" width=\"332\" height=\"217\" \/><\/a> Staff Writers Kasra Orumchian and Isabella Marcus wear their favorite sports gear for the freshman spirit day \"Healthy Choice.\" Photo by Sherwin Amsbaugh[\/caption]\r\n\r\nTuesday: Dressing day - Healthy Choice\r\n\r\n<span style=\"font-weight: 400;\">Health is no joke, and we hope you take it as serious as we do. Grab your various sports gear, eye black, and take to the field. Sport those Stephen Curry jerseys, your San Francisco Giants baseball hats, your compression shorts and whatever else sports related apparel you can find. If you can’t find any then go to Amazon.com or any local Sports retailer and pick some up. For those who like to think outside the box and take an alternate approach to “healthy choice,” the possibilities are endless. Dress up as your favorite fruit or vegetable and claim that “best dressed” prize. It’s a pretty simple day to dress up for, so don’t disappoint your Paly peers.<\/span>\r\n\r\nWednesday: Night rally - Orange\r\n\r\n<span style=\"font-weight: 400;\">Once again, go to Walmart, Target, and Goodwill, and grab whatever orange you can find. This year, you will wear your class color at the highly anticipated night rally, which is one of the best Spirit Week events we have at Paly. It’s something you don’t want to miss, and (trust us) you want to be as bright as you can with your orange in those bleachers come Oct. 19. There is no school that day so spend all afternoon preparing. Dye your hair, get all-orange everything and make a statement at the night rally. <\/span>\r\n\r\nThursday: Generation Day - Babies\r\n\r\n<span style=\"font-weight: 400;\">Just when you guys thought you were at the top of the food chain as eighth graders in middle school, you’re back on the bottom. Generation Day is where you want to prove your worth to your new Paly community, and you should be able to do so with your onesies and pacifiers. As babies, you guys have youth, opportunity and cuteness on your side, use it.  Impress the other classes on the quad, at brunch and in the bleachers at lunch that Thursday to show that small doesn't always equal weak.<\/span>\r\n\r\nFriday: Paly - Green and White\r\n\r\n<span style=\"font-weight: 400;\">Freshmen, this is by far the easiest day for you to dress up for, so make sure to grab your Paly T-shirts, sweatshirts, hats, socks, underwear, gloves, pants and any other Paly gear you have. Viking helmets, and green and white face paint never disappoint, and there’s no excuse why you should disappoint either. Hit the field right after school to watch the official unveiling of your float and spirit dance to the rest of the classes, as spirit week comes to a close.<\/span>","excerpt":"Spirit Week is by far the best week of the year at Palo Alto High School. Check out The Paly Voice's dress up guide for the freshmen class!","date":"2016-10-11 16:35:22","author":"Isabella Marcus","categories":["Uncategorized"],"tags":["#palyspirit","2016","babies","eye of the tiger","freshmen","healthy choice","Orange","palo alto","palo alto high school","paly","paly spirit week","spirit","Spirit Week"]},{"id":123860,"title":"Opinion: Should these state propositions pass?","permalink":"http:\/\/palyvoice.com\/2016\/10\/11\/opinion-should-these-state-propositions-pass\/","content":"In an election dominated by presidential candidates Donald Trump and Hillary Clinton, many have turned to the general election stage and away from the equally important local elections and propositions. California's state propositions detail controversial issues such as marijuana legalization, gun control and the death penalty, which may have a larger impact on Californians than the contentious presidential election.\r\n\r\nNews Editors Aidan Maese-Czeropski and Adrienne Kwok offer their views on the <a href=\"https:\/\/ballotpedia.org\/California_2016_ballot_propositions\">2016 California state propositions<\/a>.\r\n<div class=\"_h8t\">\r\n<div id=\"js_3s\" class=\"_5wd9\" data-tooltip-content=\"2:50pm\" data-hover=\"tooltip\" data-tooltip-position=\"right\">\r\n<div class=\"_5wde _n4o\">\r\n<div class=\"_5w1r _3_om _5wdf\">\r\n<div class=\"_4gx_\">\r\n<div class=\"_d97\">\r\n\r\n<b>\u0003Prop 51: California issues $9 billion in bonds to fund improvement and construction of school facilities for K-12 schools and community colleges.<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Aidan: NO. This would add <a href=\"http:\/\/www.mercurynews.com\/2016\/07\/27\/mercury-news-editorial-proposition-51-school-bond-deserves-a-rare-no-vote\/\">$500 million<\/a> to California’s debt payments every year and construction companies would gain an uneven profit.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Adrienne: YES. Money raised would be used to improve public school and community college facilities. Local communities and taxpayers decide how that money gets spent.<\/span>\r\n\r\n<b>Prop 52: <\/b><b>Stipulates that legislators cannot divert funds away from Medi-Cal, thus ensuring that Medi-Cal and hospitals receive all financial resources they are entitled to.<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Aidan: YES. This prop makes no drastic changes to our current functioning system of Medi-Cal.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Adrienne: YES. This prop will simply extend an already-existing law that raises money to fund health care costs for children, the elderly and low-income households.<\/span><span style=\"font-weight: 400;\">\r\n<\/span>\r\n\r\n<b>Prop 53: Requires state infrastructure projects over $2 billion to be voter approved.<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Aidan: YES. This only applies to major projects and taxpayers should not be arbitrarily forced to finance projects that may fail.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Adrienne: NO. Requiring a vote may delay or halt important infrastructure projects.<\/span>\r\n\r\n<b>Prop 54: Requires that before voting, bills be put on the internet for three days.<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Aidan: NO. This will complicate an already slow legislative process.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Adrienne: YES. This will allow the public to have easier access to information about important bills.<\/span><span style=\"font-weight: 400;\">\r\n<\/span>\r\n\r\n<b>Prop 55: Renews an income tax for high-income earners for education and healthcare.<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Aidan: YES. While California’s high tax rates are troublesome, this prop does not increase taxes but rather renews an old tax. Prop 55 would also only affect a small portion of California’s population.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Adrienne: YES. Keeping the same level of taxes on the wealthiest Californians will continue to allow funds to be used to improve public schools, community colleges and healthcare.<\/span>\r\n\r\n<b>Prop 56:  Increases tax on cigarettes and e-cigarettes by $2 per pack.<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Aidan: NO. This proposition is appropriate in theory, but in practice over 80 percent of the revenue will be diverted to insurance companies, with only 13 percent used for tobacco use prevention, according to the <a href=\"http:\/\/voterguide.sos.ca.gov\/en\/quick-reference-guide\/56.htm\">California voter guide<\/a>.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Adrienne: YES. Increasing the cost of cigarettes and e-cigarettes will deter minors from engaging in underage, illegal smoking. Money acquired from the tax will primarily be used on healthcare for low-income Californians.<\/span><span style=\"font-weight: 400;\">\r\n<\/span>\r\n\r\n<b>Prop 57: Makes it easier for nonviolent offenders to get parole.<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Aidan: NO. Many seemingly violent criminals are considered <a href=\"http:\/\/www.sacbee.com\/news\/politics-government\/politics-columns-blogs\/dan-walters\/article79420247.html\">“nonviolent” under California law<\/a>, including some human traffickers and rapists. Prop 57 may allow such people to be released early.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Adrienne: YES. This will alleviate pressure from prisons and will focus energy on rehabilitation, education and good behavior. It is also predicted to save millions of dollars each year.<\/span>\r\n\r\n<b>Prop 58: Gives local control on how to teach English-learners.<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Aidan: NO. This would override Prop 227, which mandated that most California classes would be taught in English, and resulted in much higher test scores for non-English speakers.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Adrienne: YES. This prop will allow school districts to decide how to teach English and have more control over immersion programs. The English proficiency standard requirement will remain in public schools.<\/span>\r\n\r\n<b>Prop 59: Tells the state government that Californians oppose Citizens United. <\/b>\r\n\r\n<span style=\"font-weight: 400;\">Aidan: NO. Regardless of Citizens United’s results, the eventual goal of this campaign is to pass a constitutional amendment overriding the Supreme Court’s ruling in the Citizens United case. This overturn would be a radical and unnecessary action. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Adrienne: YES. If this prop passes, it will encourage state officials to overturn the Citizens United v. Federal Election commission case, which decreed that large political contributions from corporations were protected as free speech.<\/span>\r\n\r\n<b>Prop 60: Requires pornographic stars to wear condoms during sex.<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Aidan: NO. Pornographic film studios already have strict testing for sexually transmitted diseases.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Adrienne: YES. This prop will create stricter guidelines to ensure better safety for the people creating the films.<\/span>\r\n\r\n<b>Prop 61: Regulates drug prices by requiring state agencies to pay the same prices that the U.S. Department of Veterans Affairs pays for prescription drugs.<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Aidan: NO. This might not lower prices, as pharmaceutical companies could end up raising prices for everyone.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Adrienne: NO. Paying the same price that the U.S. Department of Veterans Affairs pays could end up raising prescription drug prices for everyone, hurting veterans.<\/span>\r\n\r\n<b>Prop 62: Repeals the death penalty.<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Aidan: NO. The death penalty is an important part of our criminal justice system. While it has historically been costly, Prop 66 will curb costs by speeding up the appeals process.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Adrienne: YES. The death penalty is an ineffective process where those convicted often spend years waiting. Additionally, the death penalty is costly.<\/span>\r\n\r\n<b>Prop 63: Prohibits the possession of large-capacity ammunition magazines and requires certain individuals to pass a background check in order to purchase ammunition.<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Aidan: YES. This will improve safety and is not equivalent to taking away citizens’ guns. Who needs large cartridges of ammunition for hunting, defense or recreation?<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Adrienne: YES. Prop 63 includes new background check requirements, which will improve safety by restricting access to guns and ammunition.<\/span>\r\n\r\n<b>Prop 64: Legalizes marijuana for recreational use for those above age 21.<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Aidan: NO. Marijuana, when not used for medical purposes, has numerous negative side effects including paranoia, increased heart rate (which may cause heart attacks) and lung damage.\r\n<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Adrienne: NO. Legalizing marijuana will make it easier for minors to access marijuana, even if it's still illegal. This prop will also legalize ads to promote smoking marijuana. Even with a \"no\" vote, the use of medical marijuana will remain legal.<\/span>\r\n\r\n<b>Prop 65: Store revenue gained from the sale of plastic bags will go to environmental programs (If Prop 65 receives more votes than Prop 67, Prop 67 will be negated).<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Aidan: YES. While Prop 67 is preferable, Prop 65 would push stores to stop using plastic bags as they would no longer profit from its sale.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Adrienne: YES. This prop will provide an incentive for customers to use their own bags and may reduce environmental impacts caused by plastic bags. However, Prop 67 should be passed to solve the actual source of the problem.<\/span>\r\n\r\n<b>Prop 66: Keeps the death penalty, but speeds up the appeals process.<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Aidan: YES. Prop 66 is the best of both worlds: It continues the death penalty while decreasing costs and altering the current slow, painful appeals procedure.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Adrienne: YES. The death penalty is an ineffective, slow and expensive process that may kill an innocent person. However, this proposition will allow for much-needed changes to this process and has the potential to save millions of dollars each year.<\/span>\r\n\r\n<b>Prop 67: Bans single-use plastic carry-out bags.<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Aidan: YES. Worldwide, over one trillion plastic bags are used and discarded each year, creating major environmental problems. Prop 67 would lessen our negative impacts on the earth.<\/span><span style=\"font-weight: 400;\">\r\n<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Adrienne: YES. Single-use plastic bags are a waste of materials, and their improper disposal can harm wildlife, litter neighborhoods and more. Recyclable and reusable bags may come at a higher cost, but this is outweighed by the benefits it will provide for the environment.<\/span>\r\n\r\n\r\n\r\n\r\n\r\n\r\n","excerpt":"News Editors Aidan Maese-Czeropski and Adrienne Kwok share their opinions on the 2016 California state propositions.","date":"2016-10-11 16:23:38","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Screenshot-2016-10-09-at-2.13.16-PM.png","categories":["Election 2016","Opinion","Spotlight"],"tags":["2016","California","death penalty","education","election","government","infrastructure","Marijuana","Proposition"]},{"id":123791,"title":"News in Review: August &#038; September 2016","permalink":"http:\/\/palyvoice.com\/2016\/10\/11\/news-in-review-august-september-2016\/","content":"This installment of the News in Review series summarizes the most important news stories and events from the months of August and September in a timeline.\r\n\r\n<iframe src=\"https:\/\/cdn.knightlab.com\/libs\/timeline3\/latest\/embed\/index.html?source=1vtcizLawVLBD5S3vLWcpwxxr8TeYE8PY2rVQjXNGQrE&amp;font=Default&amp;lang=en&amp;initial_zoom=2&amp;height=650\" width=\"100%\" height=\"650\" frameborder=\"0\"><\/iframe>","excerpt":"This installment of the News in Review series summarizes the most important news stories and events from the months of August and September in a timeline format.","date":"2016-10-11 09:35:58","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/new-piktochart_459_08f8535aafa8e9eed070f4ab230764caf348dabb.png","categories":["News"],"tags":["august","carrot","cilantro","eggplant","interactive","kumquat","lettuce","news","pear","pomegranite","review","rhubarb","september","timeline","tomato"]},{"id":123802,"title":"Girls&#8217; tennis trounces Milpitas to stay undefeated","permalink":"http:\/\/palyvoice.com\/2016\/10\/10\/girls-tennis-trounces-milpitas-to-stay-undefeated\/","content":"[caption id=\"attachment_123803\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9422.jpg\"><img class=\"wp-image-123803\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9422.jpg\" alt=\"IMG_9422\" width=\"600\" height=\"400\" \/><\/a> Paly Varsity captain Meredith Cummings prepares for a volley  during a tough doubles match with senior partner Brin Elliott on Thursday against Milpitas High School. The girls' tennis team went on to win the game, 7-0. Photo: Sid Sharma[\/caption]\r\n\r\nThe Palo Alto High School girls’ tennis team (7-0) routed Milpitas High School, 7-0, in an El Camino League match on Thursday at home.\r\n\r\nThe team’s second blowout win of the season against Milpitas helped Paly maintain its undefeated record and stay No. 1 in the league, despite the absence of a top singles player, senior Avanika Narayan, who was out due to a shoulder injury.\r\n\r\nThe Vikings expressed varying opinions on what they need to do to improve going forward.\r\n\r\n“As the season progresses, we’re trying to play smarter and think more about shot placement and technique,” doubles player Alice Zhang said.\r\n\r\nSenior Captain Meredith Cummings added some slightly differing views on what the team should improve on.\r\n\r\n“I think we need to work on making sure each player has a safety serve to ensure an opportunity to play out the point, instead of giving the team easy points,” Cummings said. “We also need to be more confident and aggressive at the net.”\r\n\r\nGirls' tennis has continued to find success in its mental dominance.\r\n\r\n“We succeed in our matches because we keep a positive mindset intact for most of the game and focus on smart shots,” Cummings said.\r\n\r\nDespite the blowout result, the games did not come without difficulty. Both Brin Elliott and Cummings (doubles) and Mailinh Truong, who stepped in for Narayan, faced lengthy and close matches, according to Zhang.\r\n\r\nThe streak of wins gives legitimacy to early season sentiments of Coach Andy Harader, who stated that he is confident that the girls can win the league championship.\r\n\r\n“The only thing keeping us from winning the championship will be ourselves this season,” Harader said in September — a day before the season started.\r\n\r\nIf the team continues on to win in the El Camino League, the girls will move back up to the De Anza League next year. The team's poor record in that same league last year forced the Vikings to move down this year.\r\n\r\n<span style=\"font-weight: 400;\">The next game will be Tuesday at Mountain View High School, which Paly beat, 5-2, in their last match.<\/span>","excerpt":"The team’s second blowout win against Milpitas helped the team maintain its undefeated record and stay No. 1 in the league, despite the absence of a top singles player, senior Avanika Narayan, who was out due to a shoulder injury.","date":"2016-10-10 09:43:40","author":"Siddarth Sharma","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_94221.jpg","categories":["Sports"],"tags":["andy harader","Avanika Narayan","Brin Elliott","el camino","girls tennis","meredith cummings","milpitas","undefeated"]},{"id":123437,"title":"Verbatim: Has Colin Kaepernick drawn a flag with his protest?","permalink":"http:\/\/palyvoice.com\/2016\/10\/08\/verbatim-has-colin-kaepernick-drawn-a-flag-with-his-protest\/","content":"Before the final game of the preseason of the National Football League in San Diego on September 1st, San Fransisco 49er quarterback Colin Kaepernick knelt during the national anthem to protest police brutality against African-Americans in the United States.\r\n\r\nKaepernick's protest angered many people throughout the country, who said felt Kaepernick was disrespecting America's military by kneeling during the anthem.\r\n\r\nNow entering Week 4 in the NFL, Kaepernick's protest has been mirrored by teammates, other fellow NFL players, members of the US women's national soccer team and the players from the Woman National Basketball Association who have either taken a knee, raised a fist, or sat during the national anthem.\r\n\r\nKaepernick's protest has been followed, spread over social media and has accumulated an enormous amount of attention.The Paly Voice asked other Palo Alto High School students what they thought about Kaepernick's actions.\r\n\r\n<iframe src=\"https:\/\/docs.google.com\/presentation\/d\/1EhpIQJZ0jZJgWnxP5kRIWWN1UeK5G-M4e79ibGkgupI\/embed?start=true&amp;loop=true&amp;delayms=10000\" width=\"960\" height=\"569\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"Before the final game of the preseason of the National Football League in San Diego on September 1st, San Fransisco 49er quarterback Colin Kaepernick knelt during the national anthem to protest police brutality against African-Americans in the United States.\r\n\r\n","date":"2016-10-08 11:52:35","author":"Kasra Orumchian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Kaep600x800.png","categories":["Features","Uncategorized","Verbatims"],"tags":["2016","49ers","football","Kaepernick","nfl","palo alto","palo alto high school","paly","San Francisco","slideshow","sports","vikings"]},{"id":123748,"title":"Spider sets off fire alarm","permalink":"http:\/\/palyvoice.com\/2016\/10\/06\/spider-sets-off-fire-alarm\/","content":"&nbsp;\r\n\r\n[caption id=\"attachment_123750\" align=\"alignnone\" width=\"531\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9313.jpg\"><img class=\" wp-image-123750\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9313.jpg\" alt=\"Students find their classes on the football field after the fire alarm went off this morning during second period. Photo: Sherwin Amsbaugh\" width=\"531\" height=\"354\" \/><\/a> Palo Alto High School students find their fourth period teachers on the football field after the fire alarm went off this morning during second period. Photo: Sherwin Amsbaugh.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Crowds of confused Palo Alto High School students meandered around the football field after a fire alarm went off today during second period due to what administrators said was a spider that set off a smoke alarm. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The triggered smoke detector was in the 700s building, which is currently used for Physical Education locker rooms and the athletic offices, according to Assistant Principal Jerry Berkson. When maintenance investigated the cause of the fire alarm, they found the culprit responsible for the school-wide disturbance. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“There was a faulty smoke alarm, and the district maintenance crew went and checked it out and it ended up being a spider crawling into the smoke alarm,” Berkson said.\r\n<\/span>\r\n\r\n<span style=\"font-weight: 400;\">As practiced during previous fire alarms, students left their classrooms and headed for the football field to find their fourth period teachers. Because this was the freshman class’ first fire alarm, there was added chaos and many of them did not know where they were supposed to go.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It was confusing because we didn’t know where to go on the football field,” freshman Sarah Salinas said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Many classes were interrupted in the middle of tests, lessons and other activities.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It was kind of surprising because we were [taking] a test, so when we came back we really didn’t have that much time,” Salinas said.<\/span>\r\n\r\nStudents and teachers will have to work together to reorganize lessons and manage changed work schedules to make up for time lost during the disturbance.","excerpt":"The fire alarm went off at Palo Alto High School went off this morning during second period.","date":"2016-10-06 22:42:03","author":"Maya Akkaraju","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_9313.jpg","categories":["News","Spotlight"],"tags":["administration","fire alarm","spider"]}]