[{"id":126675,"title":"Volleyball celebrates improvement, looks to future success","permalink":"http:\/\/palyvoice.com\/2016\/12\/04\/volleyball-celebrates-improvement-looks-to-future-success\/","content":"[caption id=\"attachment_126800\" align=\"alignnone\" width=\"597\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/VB-VS-Gunn.jpg\"><img class=\" wp-image-126800\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/VB-VS-Gunn.jpg\" alt=\"Caption Caption Caption\" width=\"597\" height=\"398\" \/><\/a> The Palo Alto High School volleyball team (23-11, 11-1) huddles during a time out in its match against the Gunn High School Titans (17-14, 10-2) on Oct. 14 at the Gunn gym. According to junior outside hitter Denise Ringwalt, the team had a great season, and improved much more over the span of the season than they had in the recent past. \"Last year everyone got along but we didn't improve as much together as we did this year,\" Ringwalt said.  Photo: William Sallomi.[\/caption]\r\n\r\nThe Palo Alto High School volleyball team is celebrating  an impressive overall record of 23-11 and a successful season, which ended after a loss to the Turlock High School Bull Dogs (28-12, 10-2) the night of Nov. 16 at the Turlock gym in the first round of the Northern California playoffs.\r\n\r\nThe Vikings had a tough preseason, facing off against top level competition like the St. Ignatius College Prepatory Wildcats (32-9, 4-1) and the Valley Christian High School Warriors (28-12, 1-4). These rigorous matches served as solid preparation for the season ahead and were ultimately crucial in helping the girls acclimate to the new roster.\r\n\r\nAccording to junior outside hitter Denise Ringwalt, once the season officially began, the girls began to better combine their talents and work together.\r\n\r\n\"I think the team this year was filled with extremely talented girls that worked together better and better as the season went on,\" Ringwalt said.\r\n\r\nOnly the Los Altos High School Eagles (22-15, 7-5), out of all of the teams in the De Anza League, were able to defeat the Vikings, who finished the league with a remarkable record of 11-1.\r\n\r\nThe season had several high points, including a nail-biting match against the Eagles in which the Vikings won each set 25-22, and shattered a three-year losing streak to the Eagles.\r\n\r\nDespite having an excellent season, Los Gatos High School Wildcats (20-16, 7-5) overpowered the Vikings in the Central Coast Section championship match. According to Ringwalt, the loss was unexpected and unfortunate for the hard working Vikings, and the injury of junior outside hitter Chelsea Fan was a key factor in the defeat.\r\n\r\n\"The CCS championships was a really difficult loss,\" Ringwalt said. \"The team worked really hard, but when Chelsea got hurt, everyone kinda fell apart.\"\r\n\r\nFan said despite not making it as far as she had hoped, she is proud of the team and what it accomplished this season.\r\n\r\n\"A couple injuries toward the end made it [the season] end a little sooner than it truly should have, but overall I'm happy with how far we went this year compared to previous seasons,\" Fan said.\r\n\r\nThe Vikings must say goodbye to many talented seniors, including setters Cassie Fong and Jessica Lee, and outside hitters Fiona Green and Katie Passarello. Fan said the seniors performed well throughout the year and will be tough to replace.\r\n\r\n\"The seniors were a huge part of our team this year and they contributed a lot on the court,\" Fan said. \"Next year we'll definitely have trouble filling their spots.\"\r\n\r\nThe team as a whole displayed excellent chemistry on and off the court, which was a significant strength and advantage. According to Fan, returning Paly players built upon chemistry that they formed during the previous year.\r\n\r\n\"A lot of girls who started this year played together last season so our on-court team chemistry was great,\" Fan said.\r\n\r\nThis chemistry will play a role in the strength of the Vikings next season, who will take their experience this year and continue to work to create another high-level team.","excerpt":"The Palo Alto High School volleyball team is celebrating  an impressive overall record of 23-11 and a successful season, which ended after a loss to the Turlock High School Bull Dogs (28-12, 10-2) in the first round of the States competition.","date":"2016-12-04 20:56:31","author":"William Sallomi","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/VB-VS-Gunn.jpg","categories":["Sports","Spotlight"],"tags":["CCS","Chelsea Fan","deedee ringwalt","season recap","sports","volleyball"]},{"id":126695,"title":"Verbatim: What&#8217;d you do over the Thanksgiving break?","permalink":"http:\/\/palyvoice.com\/2016\/12\/04\/verbatim-whatd-you-do-over-the-thanksgiving-break\/","content":"Last week, Palo Alto High School students and faculty enjoyed a break from school for the Thanksgiving holiday. The day they returned to school, The Paly Voice walked around campus to ask the Paly community what it did over the break.\r\n<img class=\"alwaysThinglink\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/860926233280512002\/1024\/10\/scaletowidth#tl-860926233280512002;1043138249'\" alt=\"\" \/><script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script>","excerpt":"Following the five day Thanksgiving break, The Paly Voice asked the students of Palo Alto High School about their Thanksgiving break.\r\n\r\n","date":"2016-12-04 20:29:04","author":"Kasra Orumchian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/tmp860926233280512002.jpg","categories":["Uncategorized"],"tags":["2016","palo alto","palo alto high school","paly","thanksgiving","thanksgiving break","verbatim","vikings"]},{"id":126777,"title":"Madrigal Feaste to take place in Performing Arts Center","permalink":"http:\/\/palyvoice.com\/2016\/12\/03\/madrigal-feaste-to-take-place-in-performing-arts-center\/","content":"&nbsp;\r\n\r\n[caption id=\"attachment_126786\" align=\"alignnone\" width=\"617\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15326583_878173125651771_4109063694938312295_n.jpg\"><img class=\" wp-image-126786\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15326583_878173125651771_4109063694938312295_n.jpg\" alt=\"The Madrigal cast in their costumes. Photo: Cas Caswell.\" width=\"617\" height=\"347\" \/><\/a> The Madrigal cast in their costumes. Photo: Michael Najar.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto High School Choir program will host its 50th annual Madrigal Feaste this Saturday and Sunday at 2 p.m. in the Performing Arts Center, otherwise known as Westminster Hall.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to choir member and senior Georgia Wood, the Feaste, which revolves around King Henry VII, will consist of a concert, play and dinner and will last two hours.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The Madrigal Feaste is our annual Christmas performance,” Wood said. “It includes not only songs from the various choral groups such as Concert Choir, Spectrum, Madrigals or the Acapella groups, but also a storyline surrounding King Henry the VIII and his court, and food served to the audience by freshman choir members.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to choir member and senior Alissa Bernstein, Paly alumna and current New York University student Grace Barry wrote this year's script. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The script, written by Grace Barry, is hysterical,\" Bernstein said. \"If you listen close enough, the dialogue references a lot of political figures and events, making the script a bit more engaging for the audience.\" <\/span>\r\n\r\nChoir member and senior Georgina Wu encourages everyone to attend.\r\n\r\n<span style=\"font-weight: 400;\">“The script is very cleverly written and super hilarious,” Wu said. “It’s probably the best one of all my four years at Paly, so everyone should come watch the show.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The price of admission ranges from $35 to $100, depending on how close the table is to the stage. Tickets are sold <\/span><a href=\"http:\/\/palychoirs.com\/2016\/11\/14\/14th-annual-madrigal-feaste\/\"><span style=\"font-weight: 400;\">here<\/span><\/a><span style=\"font-weight: 400;\">.<\/span>","excerpt":"The Palo Alto High School Choir program will host its 50th annual Madrigal Feast this Saturday and Sunday at 2 p.m. in the Performing Arts Center, otherwise known as Westminster Hall.","date":"2016-12-03 11:32:14","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/Madrigal-Poster-web-2016.jpg","categories":["News","Spotlight"],"tags":["alissa bernstein","choir","georgia wood","georgina wu","grace barry","madrigral feaste","performing arts center","wetminster hall"]},{"id":126255,"title":"Cross country impresses at States","permalink":"http:\/\/palyvoice.com\/2016\/12\/02\/cross-country-impresses-at-states\/","content":"This season, both the Palo Alto High School boys' and girls' cross country teams reached the Central Coast Section championship meet and advanced runners to the California Interscholastic Federation State championship meet in Fresno.\r\n\r\nThe boys' team finished second overall at CCS and 13th at the state meet, while the girls' team sent freshman Miranda Jimenez to the state meet, where she finished 135th.\r\n\r\nIndividually, senior Naveen Pai led the charge for the boys' team at the state meet, posting a time of 16:07.4 and finishing 48th overall.\r\n\r\n\"I was hurting after the climb but I knew I had to go for it to finish cross country strong,\" Pai said. \"I finished on a 5:07 so I'm proud of the effort I was able to give.\"\r\n\r\nSophomore Henry Saul capped off his breakout season, finishing second among the Paly boys at states.\r\n\r\n\"<span style=\"font-weight: 400;\">I think I was able to improve so much because I put in a lot of work in during the off season, I took off only two weeks after track before I started training hard again,\" Saul said. \"I think with a coach that made me run a lot more really helped me improve as a runner.\"<\/span>\r\n\r\nJimenez was the only member of the girls' team to advance to the state meet, where she posted a time of 20:10.1, finishing 135th overall.\r\n\r\n\"I'm so proud of Miranda's overall performance at States,\" co-head coach Michael Granville said.\r\n\r\nGranville is already looking forward to prepping the team for another strong season next year.\r\n\r\n<span style=\"font-weight: 400;\">\"Next season I look forward to coaching the student-athletes to practice daily,\" Granville said. \"Not just running but, teaching the importance of stretching, abdominal work and team unity.\"<\/span>\r\n\r\nThe loss of seniors Pai, Kent Slaney, Spencer Morganfeld and Ben Beaudry will hurt, but the core of Saul, juniors Sam Craig and Reed Foster will look to step up and fill the holes left by the seniors next year, according to Saul.\r\n\r\n\"I'll try to include a lot of the younger runners, and try not to overwork them,\" Saul said. \"I'm already pumped for next season.\"","excerpt":"This season, both the Palo Alto High School boys' and girls' cross country teams reached the Central Coast Section championship meet and advanced runners to the California Interscholastic Federation State championship meet in Fresno.","date":"2016-12-02 16:50:23","author":"Kasra Orumchian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/Screen-Shot-2015-11-27-at-6.38.22-PM.png","categories":["Cross Country","Sports","Spotlight"],"tags":["2016","boys cross country","CCS","cross country","girls cross country","kent slaney","palo alto","palo alto high school","paly","recap","season recap","sports","student","vikings"]},{"id":126670,"title":"Season Preview: CCS finals loss motivates girls&#8217; soccer","permalink":"http:\/\/palyvoice.com\/2016\/12\/02\/season-preview-ccs-finals-loss-motivates-girls-soccer\/","content":"[caption id=\"attachment_115393\" align=\"aligncenter\" width=\"659\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/GIRLS-SOCCER-Season-recap.png\"><img class=\" wp-image-115393\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/GIRLS-SOCCER-Season-recap.png\" alt=\"Paly class of 2016 alumnus Alison Lu dribbles the ball in a league match against Homestead High School. Lu, who now plays collegiate soccer at Williams College, was an essential piece to last years success. Photo by Ethan Kao.\" width=\"659\" height=\"494\" \/><\/a> Paly class of 2016 alumnus Alison Lu dribbles the ball in a league match against Homestead High School. Lu, who now plays collegiate soccer at Williams College, was an essential piece to last years success. Photo by Ethan Kao.[\/caption]\r\n\r\nAfter a riveting 3-2  loss to Mountain View High School in the Central Coast Section championship match last season, the Palo Alto High School girls’ soccer team hopes to make another playoff run despite the loss of key seniors.\r\n\r\nPaly has turned the, 3-2, loss to Mountain View into a source of motivation, according to senior forward Tess Preising.\r\n\r\n“The outcome of the game wasn’t the result we wanted but we definitely learned a lot throughout the season,” Preising said. “It was a game we had a very good chance of winning but I think the team got stronger and even more motivated because of the experience. We are definitely looking to win [CCS] this year.”\r\n\r\nAccording to senior defender Lauola Amanoni, the loss of last year’s seniors Jacey Pederson, Heidi Moeser and Allison Lu will greatly affect the leadership of the team, but this year’s returning upperclassmen are prepared to fill those roles.\r\n\r\n“They [Pederson, Moeser, and Lu] were a huge part of our success last year and we’ll definitely miss them but we have many players such as Tess [Preising], Talia [Malchin], and Emily [Tomz] who are ready to take over with leadership,”Amanoni said.\r\n\r\nIn addition, the team will be just as competitive as last season due to the addition of talented underclassmen, according to Preising.\r\n\r\n“We lost some good talent but we have many new players that can fill their spots,” Preising said. “[freshman forward] Chloe Japić is someone to definitely watch for.”\r\n\r\nPreising said the team's biggest weakness is its lack of chemistry due to new players.\r\n\r\n“I think the weakness right now is that we are all not very comfortable with each other on the field and don’t know each other's strengths or weaknesses yet,” Preising said. “Hopefully through more practice, we will get better and more cohesive in our play.”\r\n\r\nThe Vikings will take on rivals, Menlo-Atherton High School, at 2:30 p.m. on Saturday at Paly.","excerpt":"After a riveting, 3-2, loss to Mountain View High School in the Central Coast Section championship match last season, the Palo Alto High School girls’ soccer team hopes to make another playoff run despite the loss of key seniors.","date":"2016-12-02 09:42:54","author":"Ethan Kao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/GIRLS-SOCCER-Season-recap.png","categories":["Sports","Spotlight","Uncategorized"],"tags":["almost","amazing","but","cccs","CCS","finals","football","girls","great","jacey pederson","mountain view","no","Soccer","tess","won"]},{"id":126517,"title":"&#8216;Loving&#8217;: What&#8217;s not to love?","permalink":"http:\/\/palyvoice.com\/2016\/12\/01\/loving-whats-not-to-love\/","content":"[caption id=\"attachment_126666\" align=\"alignnone\" width=\"430\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/1475626768_focusfeatures_loving_jeffnichols_joeledgerton_ruthnegga_voteloving_instagram1.jpg\"><img class=\" wp-image-126666\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/1475626768_focusfeatures_loving_jeffnichols_joeledgerton_ruthnegga_voteloving_instagram1.jpg\" alt=\"Ruth Negga and Joel Edgerton star in the latest historical film 'Loving'. Photo: Focus Features\" width=\"430\" height=\"430\" \/><\/a> Ruth Negga and Joel Edgerton star in the latest historical film 'Loving'. Photo: Focus Features[\/caption]\r\n\r\nDid you know that interracial marriage wasn’t always legal in the United States? In the non-fiction, historical-drama film , 'Loving,' directed by Jeff Nichols, the audience follows two main characters — a black woman, Mildred, and a white man, Richard — who fall in love and want to get married despite obstacles; however, it’s not that simple.\r\n\r\n<span style=\"font-weight: 400;\">Both lived most of their lives in the small town of Central Point, Virginia, which takes place in the late 1960's, where interracial marriage was illegal at the time, and one was only allowed to marry someone of his or her own race. The movie is told through Mildred and Richard’s eyes. While they are living in Virginia, police arrest them in their own home, in the middle of the night, for breaking the anti-miscegenation laws of their state. They move to the nation’s capital, Washington, D.C., to get married and to raise their three children. Little did they know that during this time, with the rise of the Civil Rights Movement, their experience with the law would be a gateway to make a change for equality.<\/span>\r\n\r\nBoth Joel Edgarton and Ruth Negga do a satisfying job in their roles as Richard and Mildred. They have good chemistry on emotional scenes, such as, powerful expressions on their faces so the audience would figure out what they were feeling, some could see them working together in the future. Bernie Cohen, played by Nick Kroll, is the lawer who picks up this case. This character plays as comic relief because he is an ackward person as a result of the words he uses and his posture on scene, which is what Nichols is going for. His partner Phill Bass, played by Jon Bass, is the more serious lawer that keeps him in check. Both of these characters do a good job of creating suspense in the film.\r\n\r\n<span style=\"font-weight: 400;\">As the story unfolds, the audience can't help but side with and cheer on the couple because of the connection they have and everything they have been through. Some people at the time got harassed for being in a multi-racial relationship; they were judged by peers and loved ones. The love that Mildred and Richard share for each other and the conflicted emotions that others have toward them make it clear that this story is going to pull at some heartstrings. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Movie's cinematographer Adam Stone, portrays police in the movie as villains who will do anything to get the protagonists in jail. Stone uses dark lighting and body language well with these characters, highlighting the use of their aggressive nature and atmosphere that is apparent.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">However, throughout the movie it was hard to understand the dialogue between characters because of their accents and soft voices, which some could argue made the movie more realistic, but at times made the conversations harder to understand.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">As the movie continues, you feel the injustice of these laws. The government is dictating who people are allowed to love and marry. Mildred and Richard are everyday people who weren’t looking for fame or publicity but rather just wanted what most of us desire, a person to love and be with forever and a chance at happiness. This movie is a must see for those looking for good character development, an authentic snapshot of that time and an emotionally uplifting story that will put you in the shoes of the people who fought against the law.<\/span>\r\n\r\n<strong>Loving<\/strong>\r\n\r\n<strong>Rating: PG-13<\/strong>\r\n\r\n<strong>Run time: 123 minutes <\/strong>\r\n\r\n<strong>Director: Jeff Nichols<\/strong>\r\n\r\n<b>Actors\/Actresses: Joel Edgerton as Richard, Ruth Negga as Mildred,  Michael Shannon as Grey Villet, Nick Kroll as Bernie Cohen, Marton Csokas as Sheriff Brooks, Alano Miller as Raymond Green, and Jon Bass as Phil Bass<\/b>","excerpt":"Did you know that interracial marriage wasn’t always legal in the United States? In the non-fiction, historical-drama film , 'Loving,' directed by Jeff Nichols, the audience follows two main characters — a black woman, Mildred, and a white man, Richard — who fall in love and want to get married despite obstacles; however, it’s not that simple.","date":"2016-12-01 19:15:53","author":"Bradley Smith","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/1475626768_focusfeatures_loving_jeffnichols_joeledgerton_ruthnegga_voteloving_instagram.jpg","categories":["Entertainment"],"tags":["history","Loving","movie review"]},{"id":126680,"title":"Sculpture program to hold second glass sale of the year","permalink":"http:\/\/palyvoice.com\/2016\/12\/01\/sculpture-program-to-hold-second-glass-sale-of-the-year\/","content":"<span style=\"font-weight: 400;\">Palo Alto High School’s glass blowing program is hosting a holiday glass sale on Friday, Dec. 2, and Saturday, Dec. 3, in the Tower Building. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The sale will be open tomorrow from 3 to 6 p.m., and will continue on Saturday from 11 a.m. to 4 p.m.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to glass blowing instructor Steve Ferrera, this is the program’s second and, traditionally, the biggest sale of the year.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We have a whole bunch of glass for sale,” Ferrera said. “Holiday items, cups, vases, goblets, elephants, cats, hearts, seashells, snails. It’s a huge assortment of glass items [at] all different prices.”<\/span>\r\n\r\n[caption id=\"attachment_126684\" align=\"alignright\" width=\"498\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15310588_361267514218387_1663107699_n.jpg\"><img class=\"wp-image-126684\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15310588_361267514218387_1663107699_n.jpg\" alt=\"15310588_361267514218387_1663107699_n\" width=\"498\" height=\"351\" \/><\/a> Trees and Christmas ornaments are among the items that will be sold on Friday and Saturday. Photo by Maya Reuven.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Work from a variety of artists will be available for purchase, the majority of which are created by glass blowing teachers.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“<\/span><span style=\"font-weight: 400;\">The work is not student work, but students can sell their own work, and they can keep all the money from that,” Ferrera said.<\/span> <span style=\"font-weight: 400;\">“Most of it [the glass] is blown by the instructors, Peter and Dana, our TAs, myself, and a few other professional glass blowers.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">While student artists get to keep their profits, the rest of the proceeds will go towards funding Paly’s sculpture program.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Our program is mostly self-funded, so we really rely on these sales to keep the program going,” Ferrera said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The sculpture program is beloved by many students, including Paly junior and advanced ceramics and sculpture student Julia Doubson, making the funding a critical issue.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Paly's sculpture program enables students to create many forms of art,” Doubson said. “Having the opportunity to blow glass at school is a very unique experience that we're lucky to have.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">If the artwork itself is not incentive enough to stop in, complementary snacks and beverages will also be provided.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We have cookies and hot apple cider,” Ferrera said.<\/span>","excerpt":"Palo Alto High School’s glass blowing program is hosting a holiday glass sale on Friday, Dec. 2, and Saturday, Dec. 3, in the Tower Building.","date":"2016-12-01 18:45:13","author":"Maya Akkaraju","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15310588_361267514218387_1663107699_n.jpg","categories":["News","Spotlight"],"tags":["art","artists","fundraiser","glass","glass blowing","holiday","sale","sculpture"]},{"id":126686,"title":"Boys&#8217; soccer defeats Carlmont","permalink":"http:\/\/palyvoice.com\/2016\/12\/01\/boys-soccer-defeats-carlmont\/","content":"[caption id=\"attachment_126689\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/DSC_0052.jpg\"><img class=\"size-full wp-image-126689\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/DSC_0052.jpg\" alt=\"Sophomore outside midfielder Jason Shorin dribbles up the sideline. Shorin is a first-year Varisty player on the boys' soccer team. Photo: Emma van der Veen.\" width=\"600\" height=\"400\" \/><\/a> Sophomore outside midfielder Jason Shorin dribbles up the sideline. Shorin is a first-year varsity player on the boys' soccer team. Photo: Emma van der Veen.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto High School boys’ soccer team (2-0-0, 0-0-0) triumphed over the Carlmont High School Scots (1-0-1, 0-0-0) 2-1 yesterday at Paly in a preseason match.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">In the first half, Paly sophomore outside midfielder Kenzo Morabia scored the first goal by finishing a cross from senior center midfielder Jack Stoksik. Stoksik dribbled down the left sideline and around multiple defenders, then passed center to Morabia. Soon after, a Carlmont forward chipped the ball over Paly junior goalkeeper Kiran Misner as he ran out to try to stop the attack. After some more attacks on goal and strong defensive play from both sides, the Vikings took the lead again. Sophomore outside midfielder Marco Tan crossed the ball to Morabia for another goal. The first half ended with a score of 2-1.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“At the beginning, we were moving the ball around really well and using the field,” head coach Don Briggs said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The second half was much less eventful, with no goals scored. Although both teams had chances on goal, neither were able to put the ball in the net. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We definitely had a better first half,” Briggs said. “We had a lot of opportunities [in the second half], we just didn’t quite put it [the ball] away. We had chances in the second half where, if we put it away, the game would’ve been over.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Vikings had matches on both Tuesday and Wednesday, which Briggs suspects caused the team to fatigue later on in the game.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Yesterday’s game took a little bit of a toll on us,” Briggs said. “We seemed a little tired and weren’t moving quite as well. We had guys cramping up, which usually means more conditioning [is needed]. That made the second half tougher.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Morabia, Paly’s effort showed through its consistent contact throughout the match.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We had a lot of passion and determination toward the end of the game,” Morabia said. “I think that’s what won us the game.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior center defender and captain Neil Verwillow says that the lack of attack in the second half was executed in an effort to preserve Paly’s lead.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We didn’t have much offensive thrust in the second half,” Verwillow said. “After half time, we wanted to preserve the lead rather than extending it.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Next up, the Vikings will face Lincoln High School at 11 a.m. on Saturday at Homestead High School Stadium.<\/span>","excerpt":"The Palo Alto High School boys’ soccer team (2-0-0, 0-0-0) triumphed over the Carlmont High School Scots (1-0-1, 0-0-0) 2-1 yesterday at Paly in a preseason match.","date":"2016-12-01 17:55:45","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/DSC_0060.jpg","categories":["Sports","Spotlight"],"tags":["atheltics","boys soccer","briggs","carlmont","carlmont high school","jack stoksik","jason shorin","kenzo morabia","kiran misner","marco tan","misner","morabia","neil verwillow","palo alto high school","paly athletics","preseason","shorin","Soccer","sports","stoksik","tan","verwillow","vikings"]},{"id":126331,"title":"Season Preview: Wrestling team hopes to thrive in lower division","permalink":"http:\/\/palyvoice.com\/2016\/12\/01\/season-preview-wrestling-team-hopes-to-thrive-in-lower-division\/","content":"[caption id=\"attachment_116559\" align=\"alignnone\" width=\"617\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Screenshot-2016-02-18-at-8.50.58-AM.png\"><img class=\" wp-image-116559\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Screenshot-2016-02-18-at-8.50.58-AM.png\" alt=\"Members of the Palo Alto wrestling team pose for a picture after competing at the Santa Clara Valley Athletic League Championships last weekend. \" width=\"617\" height=\"422\" \/><\/a> Members of the Palo Alto wrestling team pose for a picture after competing at the Santa Clara Valley Athletic League Championships last season. Photo: Jonathan Kessler.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto High School wrestling team looks to thrive this season after being moving down from the De Anza division to the El Camino division of the Santa Clara Valley Athletic League.\r\n<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We were placed in the lower division this season and one of our team goals is to win the division,” coach Jonathan Kessler said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\"> <\/span><span style=\"font-weight: 400;\">Last year, the 0-6 season ended with six of the team's wrestlers competing at the Central Coast Section championships. The team finished with a combined record of 14-9 during the two days at the competition, according to Kessler. <\/span>\r\n\r\nWith nearly 2o returning team members and<span style=\"font-weight: 400;\"> fresh talent, this year the team is optimistic, according to Kessler.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We return 18 wrestlers from last year, so that's huge after the way we started last season,\" Kessler said. \"Currently we have 40 wrestlers on the roster.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The wrestling program hopes that with this surge of new members on the team, the team can start to improve its record from last year and dominate in a lower league.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“As a team, we hope to return to the De Anza division and for my<\/span>self, I expect to win CCS and place at the state tournament,” senior Sara Aguilar said.\r\n\r\n<span style=\"font-weight: 400;\">Some athletes to look out for this season include Aguilar, senior Seth Goyal, junior Calvin Grewel, sophomores Callum Day Ham, Andrew Wang and Aidan Gans. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Vikings' first league competition will be on Saturday at the Peninsula Invitational at Half Moon Bay High School.<\/span>","excerpt":"The Palo Alto High School wrestling team looks to thrive this season after being moving down from the De Anza division to the El Camino division of the Santa Clara Valley Athletic League.","date":"2016-12-01 15:40:38","author":"Katie Cox","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/Screen-Shot-2016-11-22-at-9.41.25-AM.png","categories":["Spotlight","Wrestling"],"tags":["CCS","Jonathan Kessler","paly","preview","season","vikings","wrestling"]},{"id":126580,"title":"Girls&#8217; water polo season comes to a halt in CCS second round","permalink":"http:\/\/palyvoice.com\/2016\/11\/29\/girls-water-polo-season-comes-to-a-halt-in-ccs-second-round\/","content":"[caption id=\"attachment_122551\" align=\"alignnone\" width=\"648\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/IMG_4533.jpg\"><img class=\" wp-image-122551\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/IMG_4533.jpg\" alt=\"Junior Hollie Chiao passes the ball late in the third quarter during a season game at Gunn High School. The Vikings ended their season after being eliminated from the second round of the CCS tournament against Leland High School on Nov. 5. Photo by Sam Lee. \" width=\"648\" height=\"442\" \/><\/a> Junior Hollie Chiao passes the ball late in the third quarter during a season game at Gunn High School. The Vikings ended their season after being eliminated from the second round of the Central Coast Section tournament against Leland High School on Nov. 5. Photo: Sam Lee.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto High School girls’ water polo team (14-16, 4-8) concluded its season with a loss to Leland High School in the second round of the Central Coast Section (CCS) playoffs on Nov. 5 at a neutral location. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">After edging out Menlo-Atherton in the first round of the CCS tournament by a score of 9-6, the Vikings fell to the Leland Chargers by a score of 15-8 in the following round. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">However, according to senior field player Haley Chalmers, the Vikings are reflective of their season and have taken the time to appreciate the highlights of their year.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We grew a lot as a team and ended up doing better than we all anticipated,” Chalmers said. “It was definitely a growing experience, but we all came together well by the end of the season. I would have to say that the highlight of the season was beating Menlo-Atherton at the beginning of the CCS tournament because it was a super close game, and we lost to them at the beginning of our season.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior goalkeeper Joanna Falla was in accordance with Chalmers’ thoughts.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It was definitely a growing year for the team and I'm incredibly excited to see how the team does next year,” Falla said. “This season has been an incredible experience, and it was amazing to see the team chemistry build throughout the games and practices.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Junior field player Talia Stanley also voiced her gratitude for the seniors on the team. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Although we had some losses here and there, the season was incredibly fun and I took it as an opportunity to learn and develop my game,” Stanley said. “The seniors on the team are great because they were vocal in telling us what to do or to not do, and because of that, the team communication really improved.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Falla said she is bittersweet about leaving the team next year and she gave her departing thoughts on the team.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I'm pretty sentimental about leaving the team,” Falla said. “I had never played water polo before high school, so leaving definitely is hard. The team is full of amazing, hilarious girls, and that's probably what I'll miss most. I have complete faith that the team will do just as well, if not better, next season. Next season, I'm expecting [junior field player] Sabrina Hall, [freshman field player] Chesnie Cheung and Talia Stanley to make some great plays; but I truly think that everyone will be integral to the team.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Chalmers expressed similar sentiments as Falla, and praised newcomer freshman Chesnie Cheung.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I am pretty sad about leaving this team – we really grew this season and I know they are going to do really well next year,” Chalmers said. “I think that the juniors will be great leaders next year, and we have a pretty young team so there's a lot of potential there. I think one of our younger players, Cheung, really stood out this year. It was her first year ever playing water polo, and ended up being one of the starters and our strongest players.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The girls’ water polo team hopes to return with a vengeance next autumn, according to Stanley.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We will continue to practice and improve, and next year, we hope to make it farther in the postseason to win the CCS championship,” Stanley said.<\/span>\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School girls’ water polo team (14-16, 4-8) concluded its season with a loss to Leland High School in the second round of the Central Coast Section (CCS) playoffs on Nov. 5 at a neutral location.","date":"2016-11-29 09:05:05","author":"Sam Lee","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/IMG_4533.jpg","categories":["Sports","water polo"],"tags":["CCS","haley chalmers","joanna falla","leland high school","paly","season recap","talia stanley","tournament","vikings","water polo"]}]