[{"id":120999,"title":"Star players lead badminton team to successful season","permalink":"http:\/\/palyvoice.com\/2016\/05\/26\/star-players-lead-badminton-team-to-successful-season\/","content":"[caption id=\"attachment_121081\" align=\"alignnone\" width=\"537\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Flavia-and-michael.jpg\"><img class=\"wp-image-121081\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Flavia-and-michael.jpg\" alt=\"Flavia and michael\" width=\"537\" height=\"419\" \/><\/a> On the left, sophomore Michael Chau prepares to smash the birdie across the net in a match against Wilcox on March 31. On the right, junior Flavia Sitglich practices her return during training. Both players attended to California Interscholastic Federation Northern California Tournament last weekend. Photo: Julia Qiao[\/caption]\r\n\r\nAlthough they may not always train or play together, sophomore Michael Chau and junior Flavia Stiglich are connected by a deeper bond – their love for badminton.\r\n\r\nIn a short amount of time at Palo Alto High School, Stiglich and Chau have become close friends through their many discussions about their badminton experiences. Both are highly successful players: Chau is nationally ranked in the United States and Stiglich is a member of the Peruvian National Badminton Team.\r\n\r\nTogether, these newcomers have led Paly's badminton team to one of its best seasons in years, including successful showings at the California Interscholastic Federation Northern California Tournament over the weekend.\r\n\r\nChau and senior Eric Chiang placed third in the boys’ double division at CIF-Norcal in San Jose, according to Chau. Senior Priya Misner and junior Stiglich also made it into quarterfinals before falling to a team from Carlmont. Chau and Chiang were seeded third heading into Saturday’s tournament after placing second at Central Coast Section finals and first at Santa Clara Valley Athletic League, according to Chau.\r\n\r\n<strong>Michael Chau: Leader by example\r\n<\/strong>\r\n\r\nChau joined the Vikings this year and quickly helped lead the team to victory. Currently, he is ranked 32nd in the Under-19 age group for Boys' Singles. To be nationally ranked, players must compete in many USA Badminton tournaments. At his peak, Chau was ranked 19th in the nation is his age group playing Boys' Singles.\r\n\r\nChau's mother introduced him to the sport at the age of eight, hoping that he would play a sport that he could not get injured in. Having fallen in love with the sport, Chau has spent the last eight years practicing and honing his technique. He hopes to follow his passion and continue badminton far into the future.\r\n\r\n“My ultimate goal is to go to the Olympics, but I do not really know if that will happen,” Chau said. “It seems really far away, but you have to dream to keep going.”\r\n\r\nBeyond the national tournaments and Olympic dream, Chau has found his spot on Paly’s badminton team. According to assistant coach Arne Lim, he was able to carry the team’s spirit and boost its moral.\r\n\r\n“Michael did not win every single time, yet every time he played, everyone watched him,” Lim said. “We usually tried to set his match early in the tournament so it [his match] sets the tone for the team, because when he won, everyone said, ‘Okay, we can do this.’”\r\n\r\nChau’s talent is well known throughout the team and many members value his expertise.\r\n\r\n“He is kind of a team leader without a title,” Lim said. “He leads through example and skill. He is a nice guy and a very good team player as well.”\r\n\r\n<strong>Flavia Stiglich: Leader by teaching\r\n<\/strong>\r\n\r\nThe Vikings also saw the addition of member Flavia Stiglich, who moved from Peru in December 2015. Although she no longer practices with the Peruvian National Badminton Team, she still represents Peru in international competition, including the Pan American Junior Competition, which she has competed in since 2011, and the World Junior Championships, which she competed in since 2015. Stiglich also represents her country at many Southern American tournaments and has been doing so since 2011.\r\n\r\n“The best feeling is when I compete with other countries and compete for my country,” Stiglich said. “Because then, you are no longer playing for yourself, but also for your country. When you win something, you are serving something bigger than yourself, and that feeling is something I just cannot describe.”\r\n\r\nStiglich first started badminton at the age of 10, and after two years of practice, she decided to try out for the national badminton team in 2011. At first glance, it seems as though Stiglich’s path has been relatively smooth, reaching national success after two years. However, Stiglich has had to overcome many barriers, the biggest being herself.\r\n\r\n“Before the qualification for the World Junior Championships in 2015, I played a tournament to qualify to the 2015 South American Tournament and did not do as well as expected,” Stiglich said. “My mental game was off ... so my game was not the level it should have been. During the time between the South American and Worlds qualifications, I had a tough time thinking that I was not going to make it to Worlds and that I was not good enough.”\r\n\r\nStiglich admits that she thought about quitting badminton but ultimately decided to continue working towards her goal.\r\n\r\n“I learned to never give up on my dreams,” Stiglich said. “After working on my mental strength and confidence, I was able to overcome all the negative thoughts. When the World Junior Championship qualification tournament came around, I was ready to do my best and qualified to represent my country at the championships.”\r\n\r\nLike Chau, Stiglich found her place on the team and soon became a valuable leader on and off the court.\r\n\r\n“She is willing to teach others who are willing to listen,” Lim said. “She is willing to take some time to root them on, to be part of the team and really support the women who are on our team. People like her a lot and she has got a wonderful personality. She has a very strong charisma that is poised and confident while not overbearing. ... She leads by her knowledge and help.”\r\n\r\nWith Chau and Stiglich at the helm, the team will already have a strong start by the time the spring badminton season rolls around, despite assistant coach Arne Lim leaving.\r\n\r\n“We expect to have a great season next year,” Lim said. “Flavia is only a junior and Michael is only a sophomore, so they will be playing for us next year as well. We also have some people who are returning next year who took this year off, which will add to our team. It will be a season to watch out for.”","excerpt":"Although they may not always train or play together, sophomore Michael Chau and junior Flavia Stiglich are connected by a deeper bond – their love for badminton.","date":"2016-05-26 22:31:03","author":"Julia Qiao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Flavia-and-michael.jpg","categories":["A&amp;E Section Spotlight","Badminton","Features","Spotlight"],"tags":["#norcal","Arne Lim","badminton","CIF-Norcal","Flavia Stiglich","Michael Chau","paly","season recap","states"]},{"id":120671,"title":"School board representatives to obtain preferential vote","permalink":"http:\/\/palyvoice.com\/2016\/05\/26\/school-board-representatives-to-obtain-preferential-vote\/","content":"Pending approval at a meeting in June, Board of Education student representatives will cast preferential votes during Palo Alto Unified School District board meetings starting next school year.\r\n\r\nAccording to Supt. Max McGee, the policy will be approved at the final board meeting of the school year on June 22, and representatives will begin casting preferential votes in the first board meeting of the next school year. The vote will be in response to a successful student petition calling for preferential votes, which received the required 400 signatures.\r\n\r\nUnlike the votes that school board members cast, preferential votes are not included in the vote counts. However, the votes are recorded in the minutes and allow student representatives to take an official stance on issues.\r\n\r\nJunior Gunn High School school board representative Ankit Ranjan said the preferential votes will increase transparency and avoid any miscommunication between the board and the student body.\r\n\r\n\"[Junior school board representative] David [Tayeri] and I both care about increasing student involvement in district decision-making, and this is a great step toward that goal,\" Ranjan said. \"It allows us to take an unequivocal stance on issues and limit misinterpretation.\"\r\n\r\nTayeri and Ranjan created the petition calling for preferential votes, which the board is required to accept with support from over 10 percent of the high school population under <a href=\"http:\/\/www.leginfo.ca.gov\/cgi-bin\/displaycode?section=edc&amp;group=35001-36000&amp;file=35010-35012\" target=\"_blank\">California Education Code 35012<\/a>.\r\n\r\nAccording to Ranjan, the petition easily received support from students, as well as community members.\r\n\r\n\"It was just waiting to happen,\" Ranjan said. \"Students generally supported the idea of improved student voice, board members were not opposed and there is legal basis.\"\r\n\r\nMcGee said the change to allow preferential votes is a huge step to advance student voice, but sees the potential for more improvement.\r\n\r\n\"I think we can still do much more regarding student voice being heard,\" McGee said. \"I have some more plans that I will be sharing at our board retreat in June and announcing in August. One will be a student advisory board and one will be a variation on the policy commonly called 'Open Door' to an open outdoor one [office].\"\r\n\r\nTo ensure the preferential votes are representative of the entire student body, Tayeri said he plans to encourage student involvement and communication.\r\n\r\n\"I strongly encourage students to attend school board meetings,\" Tayeri said. \"When students become more informed about the nature of the meetings and the issues being discussed, they can better take part in the discussion about where my vote will go. I also encourage anyone with a question about a school board decision or upcoming ballot measure to contact me anytime.\"","excerpt":"Student school board representatives will cast preferential votes during board meetings starting next school year.","date":"2016-05-26 20:51:35","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/IMG_5454.jpg","categories":["Editor's Pick","News"],"tags":["McGee","preferential","School Board","school representative","student","vote"]},{"id":120718,"title":"Baseball season yields familiar results","permalink":"http:\/\/palyvoice.com\/2016\/05\/26\/baseball-season-yields-familiar-results\/","content":"[caption id=\"attachment_121096\" align=\"alignnone\" width=\"499\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/baseballlast.jpg\"><img class=\"size-full wp-image-121096\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/baseballlast.jpg\" alt=\"Senior Alec Olmsted throws a fastball to a Los Gatos hitter. Olmstead pitched four innings and gave up three earned runs during a regular season home game. Photo by Cooper Lou.\" width=\"499\" height=\"379\" \/><\/a> Senior Alec Olmsted throws a fastball to a Los Gatos hitter. Olmstead pitched four innings and gave up three earned runs during a regular season home game. Photo by Cooper Lou.[\/caption]\r\n\r\nThe Palo Alto High School baseball team's (23-6-1, 12-2) season came to a close after a, 2-0, loss to Valley Christian High School (16-15, 6-8) in the first round of the Central Coast Section playoff on Thursday, despite holding the No.1 seed.\r\n\r\nThe Vikings suffered a similar loss to Carlmont High School during the 2014-2015 season in the first round of CCS.\r\n\r\nAlthough the Vikings ended up in the same position as last year, the <a href=\"http:\/\/paly.io\/v\/120542\">Vikings captured the Santa Clara Athletic League title<\/a> which capped off another incredible season for the team.\r\n\r\nAccording to junior pitcher Ryan Chang, the team is happy with its success throughout the season, regardless of the loss in CCS.\r\n\r\n\"Anytime you win the league it's a satisfying feeling,\" Chang said. \"It was disappointing getting knocked out of CCS so early, but it doesn't take away from the success we had prior.\"\r\n\r\nSenior ace Justin Hull said he will miss playing for Paly and that the team will succeed with the absence of the graduating seniors.\r\n\r\n\"I'll miss everything about it [the team], but specifically will miss talking with all the guys during practice,\" Hull said. \"I think the team will do just fine next year. They've got plenty of players to replace the ones they're losing and have a number of good JV players who will get some time.\"\r\n\r\nRegarding the future season, sophomore division one baseball commit Max Jung-Goldberg said the Vikings will look to underclassmen to fill some of the roles of the graduating seniors.\r\n\r\n\"Next year we are going to be a young team,\" Jung-Goldberg said. \"But I think that a lot of the underclassmen will be able to step up and fill the roles that the seniors played this year.\"\r\n\r\nAccording to maxpreps.com, a high school sports website, individual highlights include Hull, who led the De Anza League in runs on offense and batters struck out, and second best earned run average on defense. Additionally, junior center fielder Ben Cleasby led the league in runs batted in.\r\n\r\nThe team will also greatly miss the production of six seniors: Hull, Riley Schoeben, Albert Han, Laurence Han, Owen Plambeck, and Alec Olmstead.","excerpt":"The Palo Alto High School baseball team's (23-6-1, 12-2) season came to a close after a loss to Valley Christian High School (16-15, 6-8) in the first round of the Central Coast Section playoff on Thursday, despite holding the number one seed. ","date":"2016-05-26 20:19:44","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/I9P85543.jpg","categories":["Baseball","Sports Recap","Uncategorized"],"tags":["Baseball","Chang","christian","ending","high school","Jung-Goldberg","paly","recap","seniors","valley","vikings"]},{"id":120964,"title":"Board approves raise for teachers","permalink":"http:\/\/palyvoice.com\/2016\/05\/26\/board-approves-raise-for-teachers\/","content":"[caption id=\"attachment_120967\" align=\"aligncenter\" width=\"593\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/IMG_5470.jpg\"><img class=\"wp-image-120967\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/IMG_5470.jpg\" alt=\"IMG_5470\" width=\"593\" height=\"396\" \/><\/a> Palo Alto Unified School District Board of Education member Camille Townsend strongly voiced her support for a salary raise, repeatedly opposing board member Ken Dauber's concern for managing class sizes. Photo by Takaaki Sagawa.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto Unified School District Board of Education approved a contract to increase teacher salary by 12 percent over the next three years on Tuesday in the board chambers at the district office.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The teachers' contract was accepted by a vote of 4-1, with board member Ken Dauber casting the only opposing vote. Teachers and board members have been negotiating matters in regards to teacher salary for months, according to board member Melissa Baten-Caswell. The contract will enact a 5 percent raise from July 2015 for this year, a 4 percent raise in the 2016-17 school year and a 3 percent raise in 2017-18. It will also include bonuses to teacher salaries that depend on property tax growth in the area.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">In the presence of a crowd of Palo Alto Educators Association members, Baten-Caswell expressed her support for the contract.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I am completely in support of this contract,” Baten-Caswell said. “The thing that makes the biggest difference isn’t the buildings textbooks or class sizes, but the teachers.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Dauber, the 12 percent increase is much less desirable than his proposed 9 percent increase, as a smaller increase would allow the district to hire approximately 35 additional teachers, which would decrease class size.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It [the contract] doesn’t strike the balance that we need between reducing class size and continuing to get excellent teachers,” Dauber said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Board member Camille Townsend denied Dauber claim about teacher salary increase linking to decreasing class size, which was largely supported by those who attended the meeting. Townsend emphasized the importance of increasing the salaries to make living in this area affordable for them, as many current teachers currently commute to Palo Alto because the cost of living is too high.<\/span>\r\n\r\nPAUSD parent Susan Ozman echoed Townsend's points, adding that the district will miss the opportunity to hire high quality teachers if there is no raise. According to Ozman, paying teachers less will not equate to being able to hire more of them, as potential teachers will be deterred by the salaries that do not cater to the high living costs in the area.\r\n\r\n<span style=\"font-weight: 400;\">According to board member Terry Godfrey, the contract will be beneficial and affordable for the district.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We [the district] currently have $30 million in reserves,” Godfrey said. “Much of that is for economic uncertainty … so that we can make deals and negotiations like this.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Raising teacher pay allows for the district to be a desirable place for teachers to be employed, according to board president Heidi Emberling.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Let us continue to be a destination district for educators,” Emberling said.<\/span>","excerpt":"The Palo Alto Unified School District Board of Education approved a contract to increase teacher salary by 12 percent over the next three years on Tuesday in the board chambers at the district office.\r\n","date":"2016-05-26 18:50:56","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/IMG_5475.jpg","categories":["News","Spotlight"],"tags":["district","PAUSD","raise","Salary","School Board","Teacher"]},{"id":120815,"title":"Global math phenoms strike again","permalink":"http:\/\/palyvoice.com\/2016\/05\/26\/global-math-phenoms-strike-again\/","content":"[caption id=\"attachment_121046\" align=\"alignnone\" width=\"575\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/IMG_43931.jpg\"><img class=\" wp-image-121046\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/IMG_43931.jpg\" alt=\"Seniors Eric Foster, Andrew Lee, Kathryn Li and Allison Zhang pose for a picture after winning the International Math Modeling Competition last July. This year, the team \" width=\"575\" height=\"384\" \/><\/a> Seniors Eric Foster, Andrew Lee, Kathryn Li and Allison Zhang pose for a picture after winning the International Math Modeling Competition last July. As of right now, the team's paper is being judged in the international stage of the IMMC. Photo: Radu Toma.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">A team of four Palo Alto High School seniors awaits results from the <a href=\"http:\/\/immchallenge.org\/\">International Math Modeling Competition<\/a> after being selected as one of the two US representatives on May 17, according to math instructional supervisor Radu Toma.\r\n<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The seniors, Allison Zhang, Kathryn Li, Eric Foster and Andrew Lee, will<\/span> now have their IMMC paper judged in the international stage of the IMMC.\r\n\r\n<span style=\"font-weight: 400;\">“Our paper will compete against papers on the same problem chosen by the judging panels in about 20 other countries, and those international results will be announced in June,” Foster said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The teams that produce the top four papers internationally will be invited to the International Conference on Mathematical Education in Hamburg, Germany this July, according to Li.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The team qualified for the IMMC after winning the <a href=\"http:\/\/www.comap.com\/highschool\/contests\/himcm\/\">High School Mathematical Contest in Modeling<\/a> last fall, according to Foster. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to the Li, the team got a classroom at Paly to work in for IMMC, and had five days to complete its mathematical model after receiving the modeling problem.<\/span>\r\n\r\nFoster explains that the team created a mathematical model that determined the viability of prize indemnification insurance.\r\n\r\n<span style=\"font-weight: 400;\">\"People organizing athletic events can offer a financial prize to anyone who breaks a world record at their event,\" Foster said. \"However, they would rather not have to pay out that prize and can buy insurance that will insure the race organizers against the need to pay: if an athlete breaks a world record, the insurance will pay the prize. In return, the race organizers pay a regular fee to the insurance company. Our paper developed a mathematical model that tells insurance companies how much they should charge and tells race organizers the conditions under which it makes financial sense for them to buy, or not buy, that insurance.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Zhang attributes the team’s strong performance to its perseverance, as they had to start over multiple times.<\/span>\r\n\r\n“Competing in a 5-day challenge is a lot like running a marathon,” Zhang said. “By the end of our time allotted, all of us were exhausted and incoherent in our speech. In almost each of our competitions, we would find a possible solution, only to discover later that it had a fatal flaw. Initially, we were extremely frustrated, but as we became more experienced, we also got used to starting over after failure. I think the ability to rebound is important as a life skill, and for this reason would strongly encourage anyone interested in mathematics to try a math modeling competition, because it really builds perseverance.”\r\n\r\n<span style=\"font-weight: 400;\">According to Lee, the team felt more prepared for the competition this year than last year.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"Another year of math courses, programming classes, and developing problem solving skills in general helped immensely,\" Lee said. \"Last year, we struggled far more with both the development of an abstract solution as well as the technical implementation of our algorithm. This year, there was not as much lag time between reading the problem and completing a thorough response. As a result, we had a lot more time to polish the writing and explanations in the paper. We definitely feel that the last couple hours we spent thoroughly proofreading our paper improved its quality and appeal to the judges.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The team has used its experience in previous math classes and competitions to incorporate more advanced mathematics into their its solutions, according to Foster.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Our model in this paper had a natural opening for the use of partial derivatives, something we only learned in math a few months back,” Foster said. “We wouldn't have been able to use this in our previous papers because we didn't know how, but they became an important part of our solution for this latest contest, showing how our papers can improve not just with practice but with more exposure to math, as well.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Foster, although the results of the competition are presented as a reflection of the work the team put into the contest, the results are just as much of what they have learned in their math classes throughout Paly.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I'm grateful to have such talented and hardworking teammates in addition to having the support of the math department and the school as we participate in these contests,” Foster said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Foster recommends that any students interested in math to try the High School Mathematical Contest in Modeling.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It's [the contest is] fun and also a great way to take what you've learned for so long in school and apply it to a real-world problem that requires math for its solution and, in many cases has not yet been satisfactorily solved,” Foster said. “Paly's Analysis, AB, BC, MV [Multivariable] Calculus, and Statistics courses provide any interested students with the needed mathematical foundations for these contests, and I'm confident any student who can succeed in those courses can succeed in these contests, as well.\"<\/span>","excerpt":"A team of four Palo Alto High School seniors were notified on May 17 that they have been selected as one of the two US representatives for the International Math Modeling Competition, according to math instructional supervisor Radu Toma.\r\n","date":"2016-05-26 11:08:32","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/IMG_43931.jpg","categories":["News"],"tags":["allison","andrew","contest","eric","foster","kathryn","lee","li","math","modeling","radu","toma","win","Zhang"]},{"id":120948,"title":"District plans overhaul of standardized test administration","permalink":"http:\/\/palyvoice.com\/2016\/05\/25\/district-plans-overhaul-of-standardized-test-administration\/","content":"[caption id=\"attachment_120958\" align=\"aligncenter\" width=\"562\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/IMG_5419.png\"><img class=\"wp-image-120958\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/IMG_5419.png\" alt=\"IMG_5419\" width=\"562\" height=\"421\" \/><\/a> Gunn High School school board representative senior Grace Park expressed her thoughts regarding students' frustration of retaking AP exams in her last board meeting. \"The atmosphere on campus is that students are dealing with this simply because that is the only option,\" Park said. Photo by Takaaki Sagawa.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">In response to the <a href=\"http:\/\/palyvoice.com\/2016\/05\/23\/gunn-students-plan-sit-in-teacher-salary-decision-looms\/\" target=\"_blank\">errors in the administration of Advanced Placement exams at Gunn High School<\/a> the Palo Alto Unified School District Board of Education is looking to implement a new five point plan to prevent mistakes in standardized testing procedures.\r\n<\/span>\r\n\r\nSupt. Max McGee briefly outlined the procedure during a school board meeting on Tuesday.\r\n\r\n<span style=\"font-weight: 400;\">“Christopher Kolar [director of research and evaluation] and Janine Penney will review all testing procedure for the SAT, ACT, and AP tests,” McGee said. “Chris [Kolar] and Janine [Penney] will supervise the training of all proctors every year. There will only be one student per table and at least one certificated staff member will serve as a proctor for each exam. The administration will review the full list of proctors and their experience and cycle through individuals providing a form of a sabbatical when necessary.\"<\/span>\r\n\r\n[caption id=\"attachment_120949\" align=\"alignright\" width=\"443\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/IMG_5417.jpg\"><img class=\"wp-image-120949\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/IMG_5417.jpg\" alt=\"IMG_5417\" width=\"443\" height=\"296\" \/><\/a> Supt. Max McGee briefs the audience on Gunn High School's current situation with AP examination retakes, as well as its causes. “The mistake was self-reported to the College Board, which I think is a hallmark of integrity of Gunn High School and PAUSD,” McGee said. Photo by Takaaki Sagawa.[\/caption]\r\n\r\nIn addition, McGee attended a meeting with the staff and administration of Gunn to discuss student stress in response to the rescheduled AP exams.\r\n\r\n“I got to hear how much everyone of those teachers was concerned for their students,” McGee said. “We continue to check-in with students, teachers and counselors on a daily basis to make sure students do have the necessary flexibility regarding their assignments, projects and tests.”\r\n\r\n<span style=\"font-weight: 400;\">Gunn’s student school board representative, senior Grace Park, echoed similar sentiments, but explained that most students, despite the available refund, will retake exams.<\/span>\r\n\r\n“Over the past few days I've talked to many teachers and students,” Park said. “Not all, but the vast majority of teachers are being very flexible and understanding. Many students have no choice but to retake them [AP exams]. These courses serve as college credit and for some students thinking about their future, not taking it just isn’t a feasible option.”\r\n\r\n<span style=\"font-weight: 400;\">According to Park, Gunn’s Student Executive Council is working to reschedule events that have become annual senior traditions.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"End of the year events have been rescheduled and the student body is coping,” Park said. “Events like the paper toss cannot be done at the usual time because seniors are scheduled to retake AP exams.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">McGee hopes to prevent future incidents and expressed his sympathy for the Gunn students, partly compensating by offering free ice cream for students after AP exams.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"Ice cream sundaes is our way of saying we believe in you, we are proud of you, and regret what happened,” McGee said.<\/span>","excerpt":"The Palo Alto Unified School District Board of Education is implementing a new five point plan to prevent mistakes in standardized testing procedure.","date":"2016-05-25 22:53:25","author":"Zahra Muzaffar","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/IMG_5419.png","categories":["News","Spotlight"],"tags":["ap","apgate","district","gunn","McGee","PAUSD","School Board"]},{"id":120673,"title":"Get Involved Palo Alto to provide student internships over the summer","permalink":"http:\/\/palyvoice.com\/2016\/05\/25\/get-involved-palo-alto-to-provide-student-internships-over-the-summer\/","content":"<span style=\"font-weight: 400;\">Get Involved Palo Alto, an organization focused on engaging high school students in the community through community service, internships and career education, is accepting applications for its Summer Service Learning Internship Academy until May 29.<\/span>\r\n\r\n[caption id=\"attachment_120912\" align=\"alignnone\" width=\"615\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/GetInvolvedPA.jpg\"><img class=\"wp-image-120912\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/GetInvolvedPA.jpg\" alt=\"Juniors Candace Wang, and Vivian Wu collaborate with Christina Owen during a Get Involved Palo Alto meeting. &quot;&quot;Photo by Daniella Maydan\" width=\"615\" height=\"461\" \/><\/a> Juniors Candace Wang and Vivian Wu, and freshman Grace Lam collaborate with Christina Owen during a Get Involved Academy meeting. Photo: Daniella Maydan[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Summer Internship Academy is a one-month internship which will run from June 6 to June 30, according to the <a href=\"link: http:\/\/www.getinvolvedpa.com\/\">Get Involved Palo Alto website<\/a>. Participating students will be matched with mentors at any of the 25 local partner organizations that relate to their talents and interests. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">A few of the partner organizations include, but are not limited to the <a href=\"http:\/\/www.paloaltochamber.com\/\">Chamber of Commerce<\/a>, <a href=\"http:\/\/www.dreamcatchersyouth.org\/\">Dream Catchers<\/a>, <a href=\"http:\/\/readingpartners.org\/\">Reading Partners<\/a>, <a href=\"http:\/\/onemillionlights.org\/blog\/2010\/10\/04\/mission\/\">One Million Lights<\/a>, <a href=\"http:\/\/www.abilitiesunited.org\/\">Abilities United<\/a> and <a href=\"http:\/\/www.penvol.org\/\">Peninsula Volunteers<\/a>. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Depending on the specific organization students are matched to, they can expect to work five to six hours a day during the week, in either the Palo Alto, Menlo Park or Los Altos area. Additionally, participating students will be awarded the President’s Award for Volunteer Services, according to the Get Involved Palo Alto website. <\/span>\r\n\r\nAccording to junior Candace Wang, Get Involved Academy's project manager, the internship program is a great way for people to get working experience in the community.\r\n\r\n\"I don't know of any other program out there that actively works to match you with a summer internship with a mentor with similar interests as you and that gives you the opportunity to do meaningful work for an entire month,\" Wang said. \"At the end of the day, I think this is one of those opportunities that should not be passed up because it's the best way to get real world experience with the least hassle, and at the same time be able to contribute in the field of the participant's interest.\"\r\n\r\n<span style=\"font-weight: 400;\">In order to be eligible to apply, students must be currently in high school, according to the Get Involved PA website. The cost of attendance is $1880 per student, and financial assistance will be given to those who need it.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Students can visit the web pages about the <a href=\"http:\/\/www.getinvolvedpa.com\/info-for-students.html\">program<\/a> and <\/span><span style=\"font-weight: 400;\"><a href=\"http:\/\/www.getinvolvedpa.com\/application-steps.html\">application process<\/a> for more information, <\/span>and can contact Get Involved PA at <a href=\"mailto:internships@getinvolvedpa.com\">internships@getinvolvedpa.com<\/a>.","excerpt":"Get Involved Palo Alto, an organization focused on engaging high school students in the community through community service, internships and career education, is accepting applications for its Summer Service Learning Internship Academy until May 29.","date":"2016-05-25 22:50:30","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Screen-Shot-2016-05-20-at-8.38.52-PM.png","categories":["News","Spotlight"],"tags":["abilities united","candace wang","chamber of commerce","dream catchers","get involved palo alto","internships","juniors","los altos","menlo park","one million lights","outgoing seniors","palo alto","penninsula volunteers","reading partners","seniors","sophmores","studens","summer","Summer Service Learning Internship Academy","work"]},{"id":120678,"title":"Time for a second draft: Alignment reform needed in Paly’s English department","permalink":"http:\/\/palyvoice.com\/2016\/05\/25\/time-for-a-second-draft-alignment-reform-needed-in-palys-english-department\/","content":"<span style=\"font-weight: 400;\">English is a class about interpretation. People either love it or hate it for existing outside the black-and-white world. It only takes a few fishbowls and Socratic Seminars to see that it’s often just as easy to prove the converse of a theme using slightly different evidence. Still, exploring all the avenues available to find the hidden meaning in a text can be rewarding.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">As such, English is a class that is inherently subjective. When analyzed under different rubrics, the same work gets different credit. Distorted by layers of partiality, from interpretation to writing style to a teacher’s own opinion of a thesis, we feel that at Palo Alto High School, equality before the gradebook is not a sufficiently enforced policy. In short, the differences in grading and expectations in English classes at Paly are detrimental to students and ultimately result in inaccurate representations of both talent and effort. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Before we get into the horizontal and vertical alignment alluded to above, we’d like to clarify something. We do not intend to call out any specific English teacher in this article, and we don’t believe any of these teachers are consciously biased. We are extremely grateful to all our English teachers for everything they’ve taught us, from the x-y-z’s of thesis writing to the MLA format of a final paper. The Paly faculty is a passionate, talented group of teachers who all want their students to succeed. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">But if students are to succeed, Paly needs to have a new policy enforcing alignment, so that every student is given an equal opportunity to learn and excel. Additionally, this kind of adaptation to Paly’s current alignment efforts would also help fulfill the most recent <a href=\"http:\/\/palyvoice.com\/2015\/02\/22\/wasc-team-announces-results-of-self-study-report\/\">WASC goals<\/a> of systems alignment, student engagement and innovation in the English department.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Horizontal alignment is the educational practice of ensuring that students taking the same course under different teachers are still learning the same material. This doesn’t solely mean they read similar literature, but that they are taught the same writing techniques and organizational formats. Vertical alignment holds teachers accountable for adequately preparing their students to succeed in the next level course, meaning that if a junior year course is open to both regular and honors sophomore students, both should be able to effectively complete the course junior year. <\/span>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/english-horizontal-alignment.jpeg\"><img class=\"aligncenter size-full wp-image-120858\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/english-horizontal-alignment.jpeg\" alt=\"english-horizontal-alignment\" width=\"800\" height=\"490\" \/><\/a>\r\n\r\n<span style=\"font-weight: 400;\">Imagine this scenario. You read the required book for your class, and after discussions and analysis, you receive an essay prompt, the prompt given to all students in your lane. You write an essay, using the instructions given to you by your teacher. Then you add it to the pile of essays for a different teacher teaching a different period of the same class. Would you be confident your work would get the grade it deserved? Would you bet 10 or 15 or 20 percent of your grade on it? We wouldn’t.\r\n<\/span>\r\n\r\n<span style=\"font-weight: 400;\">What isolates English as the least horizontally aligned subject is the lack of common material shared between classes. In STEM classes, differences between two teachers can be frustrating, but at least students have a common textbook or common notes. Reading the same book in two different classes does not guarantee the same knowledge, as the material used to analyze the book can completely change your perspective of the literature.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Paly’s current departmental policy requires that English teachers hold bimonthly grade-level meetings to discuss how credit should be awarded in each class and other aspects of student learning. Instructional Supervisor Shirley Tokheim finds the grade-level teams to be useful in facilitating cohesion. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“When we have collaboration, teachers meet in their grade-level teams and ... talk about creating common assessments, creating a common syllabus … and [calibrating] essays,” Tokheim said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Despite acknowledging room for improvement, Tokheim feels that alignment is not an issue that can be corrected quickly. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It’s something that takes years and years .… It’s something that you’re constantly working on and something that our department is constantly working on,” Tokheim said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Unfortunately, we feel that this approach is too passive for such a pervasive problem within the English department. The fact that certain teachers within the same lane are infamous for their intense discussion groups or their emphasis on participation screams inconsistency. Teachers have their own style, and we value learning to adapt to different learning methods, but in past courses we’ve compared our assignments to find completely different resources and templates available. The difference between the basic writing materials provided to us can only mean that our writing is graded differently. The fact that colleges will see the same course on our transcripts, when in actuality our courses are far from the same, is not okay. It’s pretty misleading.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">English teacher Julia Taylor cautions that complete uniformity is a dangerous goal when it comes to English alignment.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“In English class we have to be really careful because there is a way to take alignment a little bit too far,” Taylor said. “When all the teachers decide that they’re going to be using the exact same terminology …  it’s a little problematic because what happens when students go to colleges all over the place and someone uses different terminology? The students don’t have flexibility of thinking.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">We feel that there must be a way to achieve this flexibility of thinking while maintaining consistency between classes. English is meant to be a creative subject, but there are ways to find a balance between creativity and structure. As a first step, we suggest all potential biases are eliminated from the gradebook. We invite teachers to try our scenario above, and adopt Advanced Placement Psychology’s policy of identifying written work by student ID, not name. We personally do not think teachers are biased against students, but this method would prevent students from blaming grades on subjectivity, instead initiating a conversation about what’s actually wrong with poorly graded work.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Grades aren’t the only thing hurt by insufficient vertical alignment. Psychology shows that a student’s self-esteem, their confidence in their ability, and their intrinsic motivation to succeed are all damaged when they’re thrown into a class unprepared. Tenth grade English teacher Mimi Park explains that this problem is being tackled in the form of Thursday collaborations between the ninth and 10th grade levels.<\/span>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/english-vertical-alignment.jpeg\"><img class=\"aligncenter size-full wp-image-120865\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/english-vertical-alignment.jpeg\" alt=\"english-vertical-alignment\" width=\"800\" height=\"480\" \/><\/a>\r\n\r\n“With ninth and 10th grade discussions, and really this is all I can speak to just on personal experience, we have meetings where we talk about expectations and the transition from ninth grade to 10th grade, the skill sets that we’re seeing,” Park said.\r\n\r\n<span style=\"font-weight: 400;\">While we applaud the department’s increasing focus on vertical alignment, this focus seems to be struggling to reach the 11th and 12th grade classes, years with a particularly significant increase in academic rigor. If collaboration in these teacher teams is more difficult, we suggest a set of uniform handouts to set expectations between lanes. A teacher could then prepare students for next year, teaching a few lessons in advance, the same way some math classes spend the last weeks of school going over materials that will be seen in next year’s lane.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">While most teachers seem to be working towards goals of alignment, an increase of student feedback could help them get there. Right now, mandatory end-of-year surveys question a single teacher’s skills, but rarely touch on the alignment between classes in the same lane or reflections of students’ satisfaction with their previous class’ preparation for their course. Teachers should do more than just look at the responses to these surveys; there should at least be a department meeting to discuss the results. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">We attribute some of these alignment issues to flaws in the department’s solicitation of student feedback. Some of the burden is on students to actually provide constructive feedback instead of just venting. We also suspect that part of the difficulty stems from teachers' resistance to examine criticism, and part of it comes from the logistical challenges of collecting this kind of feedback.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Sometimes, inconvenient truths can only be faced when they come with a side of data, and we hope that the upcoming end-of-year survey is used to evaluate not only individual performance, but the orchestrations of the department as a whole. Alignment may require trial and error, from trying out student IDs on essays to improving standardized grade-level expectations, but we believe the Paly English department will handle it well. After all, if there is one thing that English has taught us, it's that the best work always needs multiple drafts. <\/span>","excerpt":"Imagine this scenario. You read the required book for your class, and write an essay, using the instructions given to you by your teacher. Then you add it to the pile of essays for a different teacher teaching a different period of the same class. Would you be confident your work would get the grade it deserved? Would you bet 10 or 15 or 20 percent of your grade on it? We wouldn’t.","date":"2016-05-25 21:46:30","author":"Maya McNealis","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/english-alignment-featured-image1.jpeg","categories":["Opinion","Spotlight"],"tags":["alignment","english","opinion","park","reform","taylor","tokheim","WASC"]},{"id":120840,"title":"Season recap: Girls&#8217; and boys&#8217; teams finish strong for both swimming and diving","permalink":"http:\/\/palyvoice.com\/2016\/05\/25\/season-recap-girls-and-boys-teams-finish-strong-for-both-swimming-and-diving\/","content":"The Palo Alto High School boys' and girls' swimming teams wrapped up their seasons after the girls' swimming team placed second and the boys placed fourth at the California Interscholastic Federation State Swimming and Diving Championships last weekend in Clovis. The diving team did exceptionally well too, with senior diver Mimi Lin placing first at the Central Coast Section Championships and the state meet as well. Senior diver Reed Merritt also captured the boys' diving CCS title.\r\n\r\nAccording to senior swim captain Kayleigh Svensson, the team has done a great job this season and has worked extremely hard to do well.\r\n\r\n“It was a wonderful end to the season, and to my time here at Paly,” Svensson said. “I'm incredibly proud of our girls this year. We've worked through a lot of hardships, but we did well.”\r\n\r\nAccording to Svensson, junior swimmer Alex Liang won two events in Clovis, setting state records in the 500-yard freestyle and the 200-yard freestyle.\r\n\r\nAlthough the boys swim team did not place first, junior swimmer Andrew Jozefov said that this season was more than just getting the best times. It was also about bonding with the team.\r\n\r\n\"A lot of people had some huge time drops and although we came up just short of our goals we can't be unhappy with [our] new best times,\" Jozefov said. \"It was a lot of fun spending time with my teammates this season.\"\r\n\r\nAs for the diving team, senior diving captain Mimi Lin said that she believes this was the best year for the diving team that she has seen at Paly.\r\n\r\n\"I think this is one of the most successful seasons since I've been here,\" Lin said. \"Not because of the placings, but because of how much we improved as a team.\"\r\n\r\nSvensson echoed the same sentiment for the swimming team.\r\n\r\n\"I think we had a great season as a team. I'll miss having them around next year,\" Svensson said.","excerpt":"The Palo Alto High School boys' and girls' swimming teams wrapped up their seasons after the girls' swimming team placed second and the boys placed fourth at the California Interscholastic Federation State Swimming and Diving Championships last weekend in Clovis.","date":"2016-05-25 19:35:15","author":"Victor Carlsson","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/IMG_6264.jpg","categories":["Sports","Spotlight"],"tags":["boys swimming","CCS","Diving","girls' swimming"]},{"id":120836,"title":"Tuesday Tunes: Jenny Xin","permalink":"http:\/\/palyvoice.com\/2016\/05\/24\/tuesday-tunes-jenny-xin\/","content":"[caption id=\"attachment_120937\" align=\"aligncenter\" width=\"605\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/DSC_00081.jpg\"><img class=\" wp-image-120937\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/DSC_00081.jpg\" alt=\"Senior Jenny Xin describes her muical ventures and prefrences during her sit own with the Paly Voice. Photo by Nika Woodfill. \" width=\"605\" height=\"403\" \/><\/a> Senior Jenny Xin sits down with the Paly Voice to discuss her musical ventures and favorite songs. Photo by Nika Woodfill.[\/caption]\r\n\r\nThis week the Paly Voice sat down with music enthusiast and Vikapella member senior Jenny Xin, to discuss pop music, her perfect pitch and choir.\r\n\r\nXin has participated in choir for all four years of high school, but claims it has not influenced her music taste substantially, despite its importance to her musical education.\r\n\r\n“My music taste is independent from choir,” Xin said. “However, choir has exposed me to a lot of new ideas musically, and stylistically, and I’ve kind of learned what makes the songs I like listening to catchy. And kind of been able to learn about popular music throughout the ages. Even though I don't listen to a lot of the songs we sing in choir it is definitely really interesting to learn about them and perform and that has definitely broadened my musical horizons.”\r\n\r\nOver the course of Xin’s musical career, she has been able to develop something called perfect pitch.\r\n\r\n“So perfect pitch is generally like being a glorified tuning fork,” Xin said. “Basically perfect pitch or relative pitch means just being able to identify notes by their name, so if you hear the letter C or E or A flat you'll be able to hear that note in your head.”\r\n\r\nDespite the talent that stems from having perfect pitch, Xin explains that it is more of an annoyance when it comes to listening to music.\r\n\r\n“It gets kind of annoying. It’s not really a help as much as it is a giant pain,” Xin said. “I’ll listen to a radio station and sometimes they'll pitch their songs to avoid copyright issues and so I can kind of realize that it annoys me the whole time.”\r\n\r\nAccording to Xin, she most enjoys listening to high tempo upbeat songs, however, her individual music taste is difficult to categorize.\r\n\r\n“A lot of the songs I listen to are so different I'm not really sure what the underlying theme is,” Xin said.\" For me, it is to an extent lyrical but also the production behind the song. But mostly I tend to like really upbeat catchy music.”\r\n\r\nAdditionally, Xin described how her music preference has evolved in high school.\r\n\r\n“I used to think listening to mainstream pop was kind of a guilty pleasure thing, but I think I enjoy more now without too much shame, and I have gotten more into musicals,” Xin said. “My music taste has definitely developed. Before I would mostly be listening to classical or pop music but now I listen to everything.”\r\n\r\n<iframe src=\"https:\/\/embed.spotify.com\/?uri=spotify%3Auser%3Aclairekrugler%3Aplaylist%3A3Z3oH0xrxcXRUJQij2AQbv\" width=\"300\" height=\"380\" frameborder=\"0\"><\/iframe>","excerpt":"This week the Paly Voice sat down with music enthusiast and Vikapella member senior Jenny Xin, to discuss pop music, her perfect pitch and choir. <a href=\"http:\/\/palyvoice.com\/2016\/05\/24\/tuesday-tunes-jenny-xin\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2016-05-24 23:31:31","author":"Claire Krugler","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/DSC_00081.jpg","categories":["Entertainment","Spotlight","Tuesday Tunes"],"tags":["choir","Jenny Xin","music","perfect pitch","Tuesday Tunes","vikapella","wombats"]}]