[{"id":127078,"title":"Know your options: How to cope with finals stress","permalink":"http:\/\/palyvoice.com\/2016\/12\/09\/know-your-options-how-to-cope-with-finals-stress\/","content":"[caption id=\"attachment_127087\" align=\"alignright\" width=\"467\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/IMG_7837.jpg\"><img class=\" wp-image-127087\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/IMG_7837.jpg\" alt=\"The library's &quot;Food for Thought&quot; will be beginning for students on Monday of next week, and ends Thursday. Photo by Kasra Orumchian\" width=\"467\" height=\"311\" \/><\/a> The library's \"Food for Thought\" will be beginning for students on Monday of next week, and ends Thursday.<br \/>Photo by Kasra Orumchian[\/caption]\r\n\r\n<span style=\"font-weight: 400;\"> Beginning next Wednesday, Palo Alto High School administrators will implement both old and new programs aimed towards alleviating student stress and helping students through final exams next week.<\/span>\r\n\r\n<b>Food For Thought<\/b>\r\n\r\nFood For thought is a study hall open to all Paly Students , and is a returning program from prior years.\r\n\r\n<span style=\"font-weight: 400;\">According to librarian Debby Henry, the program offers extended study hours for all students and will be in the Media Arts Center and the library from 4 p.m. to 8 p.m. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The locations will be in the library and in the MAC,” Henry said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Henry said students will also have access to all of the library’s normal resources, and teacher volunteers will be present to help students in need. The volunteers will provide snacks and dinner to all who attend.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“There will be teachers and special ed [Education] aids in both areas [the MAC and the library] to help with tutoring or projects or whatever students require at that time,” Henry said. “Food will be served in the student center, and there will be a variety [of choices] each night.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to junior Avery Wooten, who has attended Food For Thought in previous years, the program is both enjoyable and helpful.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I liked studying in the library because I could study with friends and there was dinner afterwards,” Wooten said. “I had all of the textbooks I needed, so I could get all of my work done.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">For those looking for a quiet space to study either with friends or independently, Food for Thought will provide a productive environment free from distractions where students can focus, enjoy dinner and complete their studying.<\/span>\r\n\r\n<b>Wellness Center<\/b>\r\n\r\n<span style=\"font-weight: 400;\">In its opening year, the Palo Alto High School Wellness Center is aiding the stress relief effort, by providing students with board games, snacks, tea, <\/span><a href=\"https:\/\/docs.google.com\/a\/pausd.us\/forms\/d\/e\/1FAIpQLSeG77YaFb2pHp39BOKv9ClwOUIQ0Zp4WBa3N5_6Myb3E0PJRQ\/viewform?c=0&amp;w=1\"><span style=\"font-weight: 400;\">DIY bath salts<\/span><\/a><span style=\"font-weight: 400;\">, arts and crafts, music and therapy dogs. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Wellness Center Outreach Coordinator Julia Chang is looking forwards to allowing students to relax and escape the stress that comes with final exams.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I think blocking off that flex time on Tuesday is super useful because that gives students some time for themselves, and some time to come together and take care of their bodies and minds, as opposed to stressing over finals continuously,” Chang said. “I hope students take advantage of the time and understand that self care is important when stress levels are high.”<\/span>\r\n\r\n<b>PTA Snacks<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Each day of finals, volunteers from the Parent Teacher Student Association will continue the tradition of handing out snacks to students at brunch and lunch.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Tina Semba, a Paly parent and a long term volunteer, there will be a wide variety of  snacks available.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Parents sign up to bring sweet treats and healthy snacks like fruit,” Semba said. “Tables will be located by the library and the student center.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Semba has been volunteering and handing out finals snacks for seven years.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I love volunteering for bringing treats to students, especially during finals because it can be a stressful time and handing out treats is an easy and fun way to show our support and wish them good luck,” Semba said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The list of parent volunteers is posted on the quad, by the library, the 800’s building and numerous other locations around campus.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Whether you’re looking for a place to group study, eat snacks, or find inner peace this finals week, the Paly administration will provide a place for you.<\/span>","excerpt":" Beginning next Wednesday, Palo Alto High School administrators will implement both old and new programs aimed towards alleviating student stress and helping students through final exams next week.\r\n","date":"2016-12-09 21:34:10","author":"Kasra Orumchian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/IMG_78371.jpg","categories":["News","Spotlight","Uncategorized"],"tags":[]},{"id":127031,"title":"Pertussis exposure threatens student health before finals","permalink":"http:\/\/palyvoice.com\/2016\/12\/09\/pertussis-exposure-threatens-student-health-before-finals\/","content":"Palo Alto High School students are cautiously protecting themselves from germs as final exams are approaching after multiple classes were exposed to pertussis — better known as whooping cough — over the course of the past week.\r\n\r\nThe administration called students who share classes with a student who has been diagnosed with the disease. In the call, students were asked to take precautions and to contact their health care providers if they experience any symptoms such as coughing, a runny nose or a low-grade fever.\r\n\r\nAccording to district nurse Rosemarie Craig, students who receive a phone call and later develop symptoms should meet with their health care providers immediately.\r\n\r\n\"If a student has been exposed to a confirmed case of pertussis, and develops symptoms, they should follow-up with their health care provider for a possible pertussis diagnosis,\" Craig said.\r\n\r\nAccording to Craig, the best way to stay healthy is to keep up to date on all vaccinations and to try to stop the spread of germs.\r\n\r\n\"The most effective way to prevent pertussis is to be up to date on your vaccinations,\" Craig said. \"However, in general, to avoid getting sick you want to practice good hand washing and covering your mouth for coughs and sneezes.\"\r\n\r\nCraig said that whooping cough is a communicable disease which can spread easily from person to person.\r\n\r\n\"People with pertussis usually spread the disease to another person by coughing or sneezing or when spending a lot of time near one another where they share breathing space,\" Craig said.\r\n\r\nAccording to Craig, despite the contagious nature of the disease, those who don't come into contact with a student who has contracted whooping cough are not at high risk.\r\n\r\n\"If you are not exposed to a student with a confirmed case of pertussis, you are likely not to have contracted pertussis,\" Craig said.\r\n\r\nAccording to Craig, students should minimize risk  \"While we want all of our students at school every day engaged in learning, their health and that of their classmates is a top priority,\" Craig said.","excerpt":"Palo Alto High School students are cautiously protecting themselves from germs as final exams are approaching after multiple classes were exposed to pertussis — better known as whooping cough — over the course of the past week.","date":"2016-12-09 21:10:44","author":"William Sallomi","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/08\/Screen-Shot-2016-12-07-at-8.08.26-PM.png","categories":["News","Spotlight"],"tags":["administration","district nurse","finals","health","pertussis","rosemarie craig","whooping cough"]},{"id":126947,"title":"Ways to enjoy winter break in the Bay Area","permalink":"http:\/\/palyvoice.com\/2016\/12\/09\/ways-to-enjoy-winter-break-in-the-bay-area\/","content":"<span style=\"font-weight: 400;\">Looking to have some fun over winter break without leaving your beloved Bay Area? Check out these fun and festive winter activities you can do close to home. <\/span>\r\n\r\n<strong>Explore your own city:<\/strong>\r\n\r\n[caption id=\"attachment_127098\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/unspecified-1.jpeg\"><img class=\"wp-image-127098 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/unspecified-1.jpeg\" alt=\"unspecified-1\" width=\"600\" height=\"400\" \/><\/a> The Mill located in Alamo Square in San Francisco is a known for its cozy atmosphere and well made coffee and cinnamon toast. Photo: Aisha Chabane.[\/caption]\r\n\r\nEven though you may think you know your city there is always more to explore. Grab a few friends and hop on a train to San Francisco and begin an adventure right at home. Union Square is a super festive location with its decorated Christmas tree in the middle of the square. This spot offers a variety of activities in the winter including shopping, ice skating and an animal adoption pop-up center. You can also venture over to the \"Painted Ladies\" a popular tourist attraction in the city which is conveniently located near a hip and cozy coffee shop called The Mill famously known for its cinnamon toast and great coffee.\r\n\r\n<strong>The Movies:<\/strong>\r\n\r\n[caption id=\"attachment_127112\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/FullSizeRender-3.jpg\"><img class=\"wp-image-127112 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/FullSizeRender-3.jpg\" alt=\"FullSizeRender-3\" width=\"600\" height=\"400\" \/><\/a> \"The Edge of 17,\" released on Nov. 18, follows a struggling teenage girl as she learns to accept herself and others. This is a great movie to go see with your friends over winter break. Photo: Emma van der Veen.[\/caption]\r\n\r\nGrab some blankets and head to your local movie theater to catch a new flick. Many movies will be coming out this December, such as “Office Christmas Party” and “Assassin's Creed.” Other movies such as \"Arrival,\" or \"Midnight\" are already in theaters and are currently generating a lot of buzz and are sure to win some awards this coming Oscar season. If you’d rather stay in or want to save money, cuddle up on the couch instead and tune into a holiday special or watch the countdown to the new year in Times Square in New York City.\r\n\r\n<strong>Ice Skating:<\/strong>\r\n\r\n[caption id=\"attachment_127107\" align=\"alignnone\" width=\"600\"]<img class=\"wp-image-127107 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15450958_1205214706221282_565397705_n.jpg\" alt=\"15450958_1205214706221282_565397705_n\" width=\"600\" height=\"400\" \/> The Winter Lodge is a popular spot over winter break for beautifully lit up rink creating a cozy atmosphere. Photo: Emilia Diaz-Magaloni[\/caption]\r\n\r\nA consistent winner for getting in the holiday spirit is dressing up in a cute scarf and winter coat and going ice skating at your local rink. The cold ice gives the illusion that California really does have a winter, a bonus to the fun, but challenging activity. Afterward, grab a cup of hot cocoa and sit by a fire to warm up, completing your typical holiday outing.\r\n\r\n<strong>Making Winter Decorations:<\/strong>\r\n\r\n[caption id=\"attachment_127116\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/IMG_3464.jpg\"><img class=\"size-full wp-image-127116\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/IMG_3464.jpg\" alt=\"Photo: Emma van der Veen.\" width=\"600\" height=\"400\" \/><\/a> Fun winter snowflake decorations light up the room. Photo: Emma van der Veen.[\/caption]\r\n\r\nGrab some construction paper and some scissors and get to work! You can make snowflakes, homemade Christmas ornaments (if you celebrate Christmas) or strands of paper people to hang around your home. This is a great activity to do with younger children as well, so you can include all of your family members, no matter how young.\r\n\r\n<strong>Gingerbread Houses &amp; Baking:<\/strong>\r\n\r\n[caption id=\"attachment_127117\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/FullSizeRender-2.jpg\"><img class=\"size-full wp-image-127117\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/FullSizeRender-2.jpg\" alt=\"Photo: Emma van der Veen.\" width=\"600\" height=\"400\" \/><\/a> The scent of pumpkin pie fills up the room, creating a festive vibe. Photo: Emma van der Veen.[\/caption]\r\n\r\nGather your friends and throw a sweet decorating party. This can range from sugar cookies with store-bought frosting to elaborate gingerbread houses with detailed adornments. If you are feeling very adventurous you can attempt to create <a href=\"http:\/\/www.bhg.com\/christmas\/recipes\/traditional-holiday-desserts-from-around-the-world\/#page=1\">different holiday treats from places around the world such as Mexican Citrus-pumpkin Flan or Italian Amaretti cookies.<\/a>","excerpt":"Looking to have some fun over winter break without leaving your beloved Bay Area? Check out these fun winter activities to see what The Paly Voice thinks will give you a truly memorable winter holiday break.\r\n\r\n","date":"2016-12-09 15:52:02","author":"Aisha Chabane","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15450958_1205214706221282_565397705_n.jpg","categories":["Lifestyle","Spotlight"],"tags":["baking","unionsquare","winterbreak"]},{"id":127168,"title":"With blowout, girls&#8217; soccer undefeated streak hits five games","permalink":"http:\/\/palyvoice.com\/2016\/12\/09\/with-blowout-girls-soccer-undefeated-streak-hits-five-games\/","content":"[caption id=\"attachment_127236\" align=\"alignnone\" width=\"648\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/IMG_79041.jpg\"><img class=\"size-full wp-image-127236\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/IMG_79041.jpg\" alt=\"Senior midfielder and captain Natalie Maloney attempts to make a pass to freshman forward Sophie Vogel, who makes a cut towards the goal. Maloney would go on to score four goals for Palo Alto High School, in its 11-0 rout of El Camino High School on Thursday at home. Photo: Sam Lee.\" width=\"648\" height=\"313\" \/><\/a> Senior midfielder and captain Natalie Maloney attempts to make a pass to freshman forward Sophie Vogel, who makes a cut towards the goal. Maloney would go on to score four goals for Palo Alto High School, in its 11-0 rout of El Camino High School on Thursday at home. Photo: Sam Lee.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">There are several consistent occurrences at Palo Alto High School that one can count on to transpire annually. The senior deck will get vandalized, The Paly Voice will publish excellent articles and the Paly girls’ soccer team (5-0, 0-0) will dominate its competition. This season is looking like it will be no different. With a stunning 11-0 victory over El Camino High School (0-6, 0-0) yesterday, the Vikings extended their undefeated streak to five games.<\/span>\r\n\r\n[caption id=\"attachment_127172\" align=\"alignright\" width=\"325\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/IMG_7848.jpg\"><img class=\"wp-image-127172 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/IMG_7848.jpg\" alt=\"IMG_7848\" width=\"325\" height=\"388\" \/><\/a> Sophomore Ally Scheve winds up to take a corner kick during the first half of Paly's game against El Camino. Scheve scored the first goal of the game from a direct free kick. Photo: Jackson Doerr.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Vikings commanded complete control of the game in the first five minutes, scoring twice in rapid succession. The first goal came off a direct free kick by junior forward Ally Scheve, quickly followed by a second goal from sophomore forward Leela Srinivasan. Paly kept the ball on El Camino’s side of the field for the majority of the first half, scoring three more goals before the initial 45 minutes came to a close.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Despite entering the second half with a score of 5-0, the Vikings did not slow down. Paly continued to extend its lead, scoring six additional goals to bring the final score to 11-0.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to senior midfielder and captain Natalie Maloney, El Camino's utter demolition gave Paly a unique practice opportunity. <\/span>\r\n\r\n<span style=\"font-weight: 400;\"> “It [the game] definitely gave us a chance to work on some other skills we wouldn’t have been be able to practice against harder teams like M-A [Menlo-Atherton High School],” Maloney said. “It’s also nice to have players who normally wouldn’t play an entire match come into the game.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The game allowed the Vikings to work on their team chemistry, something that had been lacking since the start of the season. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The past couple games, especially against M-A, we really came together,” Maloney said. “Even though we’ve only practiced maybe four or five times since we’ve started this season, the chemistry is definitely getting better.” <\/span>\r\n\r\nFreshman Sophie Vogel agrees that the team started to connect the more they played together.\r\n\r\n<span style=\"font-weight: 400;\">“It’s really just starting to click, since the beginning of the season was a little off,” Vogel said. “Now we’re playing off of each other.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Vogel is one of two freshman players that made the varsity team this year. Eleven new players total were added to varsity this season, upsetting the team's leftover chemistry from last season. Despite taking so many new players, the problem seems to be receding and will soon be behind them, according to Vogel.<\/span>\r\n\r\nThe Vikings' chemistry will be put to the test once again at 10 a.m. on Saturday, as they take on the Terra Nova Tigers (2-2, 0-0) at Terra Nova High School.","excerpt":"There are several constants at Paly that you can count on to occur throughout the year. The senior deck will get vandalized, administration will make a controversial decision that heavily affects students and the Palo Alto High School girls’ soccer team will dominate its competition. ","date":"2016-12-09 11:30:42","author":"Jackson Doerr","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/IMG_7904.jpg","categories":["Sports","Sports Recap"],"tags":["2016","ally scheve","el camino high school","girls","leela srinivasan","natalie maloney","preseason","Soccer","sophie vogel"]},{"id":127070,"title":"Review: Childish Gambino takes 180-degree turn with &#8216;Awaken, my love!&#8217;","permalink":"http:\/\/palyvoice.com\/2016\/12\/09\/review-childish-gambino-takes-180-degree-turn-with-awaken-my-love\/","content":"Donald Glover, better known by his stage name, Childish Gambino, has become known for his versatility in the entertainment business, from his work as an actor and producer to his stand-up comedy, and of course, his music. <span style=\"font-weight: 400;\">Gambino’s latest album “Awaken, My love!” departs from his previous hip-hop and rap focused style to experiment with a creative fusion of soul, psychedelia and funk. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The album is seemingly dedicated to Gambino's newborn son through songs like \"Baby Boy\", \"Me and Your Mama\" and \"The Night I Met Your Mama\" that suggest he is singing directly to his child. <\/span>\r\n\r\n\"Awaken, My Love!\" has a cohesive message centering around hope and nostalgia. Gambino incorporates a groovy motif throughout the album that ties individual songs together to create a seamless collective work.\r\n\r\nHere are in-depth examinations of the tracks that stand out from the rest of the album.\r\n\r\n<strong>Me and Your Mama<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">The first single released from the album, \"Me and Your Mama\" s<\/span><span style=\"font-weight: 400;\">tarts slowly, opening like a lullaby with chime-like and dreamy synths.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">A choir loop enters<\/span> as more high-pitched synths join in the background. The original synth ostinato continues throughout.\r\n\r\nThe percussion, provided by hi-hats and snaps, keep a slow and melodic R&amp;B rhythm. The choir’s vocalization is airy and disjointed, repeating an unintelligible melody.\r\n\r\n<span style=\"font-weight: 400;\">For the first two minutes, this pattern is repeated, setting a mood that feels relaxed and redundant. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">As the second minute comes to a close, a fast, repeating beat enters and gradually grows in volume. At 2:02, a blues-tinged guitar chord blasts out, smothering the droning choir and starting a new, funkier section of the song.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Suddenly, Gambino's wailing voice<\/span><span style=\"font-weight: 400;\"> enters the vocal stage, screaming an anguished whine alongside the bold and buzzy cadence of the guitar. Soon after this begins, a<\/span><span style=\"font-weight: 400;\">n ensemble of soulful voices transform the song into a gospel rock anthem.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Gambino’s grizzly and distorted voice howls heartbroken and bluesy lyrics about the perils of love as an acoustic guitar and synths join in, the choir harmonizing in the background.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The song slows down to a mellow and soft ballad, complete with the tender chords from an organ as the low warbles of a synth fade into silence.<\/span>\r\n\r\nThe dichotomous sounds form an enjoyable song that exhibits how much Gambino has changed from his first studio album, \"Camp.\"<em> <\/em>\r\n\r\n<strong>Redbone<\/strong>\r\n\r\nRedbone, the second single to be released from this album, is a masterfully done reconstruction of funk to accentuate an enhanced, deeper and more sober single.\r\n\r\n<span style=\"font-weight: 400;\">The melody strolls at an andante tempo with synths chattering while kits roll at a walking pace. Gambino's f<\/span><span style=\"font-weight: 400;\">alsetto voice contrasts and complements the deep bass and soulful feeling of the melody. His stretched out <\/span><span style=\"font-weight: 400;\">screeches evoke emotion, especially adding a forlorn quality to the sound. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The chorus transforms the low synths and funky melody into a more orchestral climax, where Gambino's voice and the harmony of the choir seem to exchange dialogue and emotion.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The song utilizes pop instrument with a slower, moderate tempo to create a sort of futuristic feeling that is both uplifting and melancholy.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Redbone's beautiful melody paints a picture of a casual, groovy stroll down a boulevard on a late, starry night. <\/span><span style=\"font-weight: 400;\">It shows Gambino's ability to create slow-paced songs with vocals that take a backseat, letting the complex layers of innovative instruments guide the listener. <\/span>\r\n\r\n<strong>Boogieman<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">The attention to detail in this track is evident. The chorus of voices starts high, dominating other instruments at the beginning of the song. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Gradually, the lower frequency becomes louder as the voices get lower until the piece reaches a tenor that matches and gets drowned out by the underlying drum. This technique helps create a streamlined transition from vocals to instrumental. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Boogieman was one of the songs that stood out as an h<\/span><span style=\"font-weight: 400;\">omage to boogie rock and the high energy dance music from the 1970's funk scene. The piece is an innovative fusion of old-school dance music with a synth-garnished modern flare, making it the mo<\/span><span style=\"font-weight: 400;\">st fast-paced and energetic song on the album.<\/span>\r\n\r\n<strong>Baby Boy<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">This song is an ode to Gambino's recently born son. \"Baby Boy\" sounds like a lullaby, confessing the artist's desires and fears of parenthood. The vocals feel like a parent lulling their child to sleep, caressing and mellow, yet optimistic, giving the listener serenity and peace in its' sound. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">T<\/span><span style=\"font-weight: 400;\">he use of the glockenspiel is appropriate for a sort of simple, melodic feeling. Similarly,  Gambino uses the clavinet to mimic a crying baby with the \"wah wah\" sound of the chords serving as the bass line for the song. However, the use of guitar does not match the feeling of a lullaby at times. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The ending simple instrumental solo immerses the listener in a calming, sleepy feeling.<\/span>\r\n\r\n<strong>Two songs to Avoid<\/strong>\r\n\r\n<strong>1. Zombies<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">\"Zombies\" gives off a thriller vibe and is reminiscent of a 1990's pop song. There is some interesting use of the rain stick but the instrumental tends not to match the feeling of lyrics, which are unnecessarily creepy and uninspired. Overall, the song feels far from innovative or experimental. <\/span>\r\n\r\n<strong>2. Terrified<\/strong><span style=\"font-weight: 400;\">\r\n<\/span><span style=\"font-weight: 400;\">\"Terrfied\" is well-intentioned but the lackluster and unflattering pitchiness in the chorus jars the listener. However, the end shines with minimal melody and an impressive soul back and forth between Gambino and his predominantly female guest choir. <\/span>\r\n\r\nAll in all this album is refreshing and we would highly recommend it to any reader.\r\n\r\n<span style=\"font-weight: 400;\">List of Songs:                                                        <\/span>\r\n<ol>\r\n\t<li>Me and Your Mama                               6:19<\/li>\r\n\t<li>Have Some Love                                     3:44<\/li>\r\n\t<li>Boogieman                                               3:36<\/li>\r\n\t<li>Zombies                                                    4:41<\/li>\r\n\t<li>Riot                                                            2:05<\/li>\r\n\t<li>Redbone                                                   5:26<\/li>\r\n\t<li>California                                                 2:45<\/li>\r\n\t<li>Terrified                                                   4:15<\/li>\r\n\t<li>Baby Boy                                                  6:22<\/li>\r\n\t<li>The Night Me and Your Mama Met   3:34<\/li>\r\n\t<li>Stand Tall                                                6:10<\/li>\r\n<\/ol>\r\nAlbum Length: 48:57\r\n\r\n<iframe src=\"https:\/\/embed.spotify.com\/?uri=spotify%3Aalbum%3A4xnq1L6P551Qcb9gBXNMK7\" width=\"300\" height=\"380\" frameborder=\"0\"><\/iframe>","excerpt":"Donald Glover, better known by his stage name, Childish Gambino, has become known for his versatility in talent between acting and producing music. Gambino’s latest album “Awaken, My love!” departs from his previous hip-hop and rap focused style to explore a smooth fusion of soul, psychedelia and funk. ","date":"2016-12-09 10:03:44","author":"Donnesh Farmanfarmaian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/Awaken_My_Love.jpg","categories":["Entertainment","Spotlight"],"tags":["awaken my love","because of the internet","Camp","Childish Gambino","music","review"]},{"id":126870,"title":"Coffee Chats: College counselor Sandra Cernobori","permalink":"http:\/\/palyvoice.com\/2016\/12\/09\/coffee-chats-college-counselor-sandra-cernobori\/","content":"<i>This is the seventh installment of Coffee Chats, where The Paly Voice gets to know staff members over a cup of coffee. <\/i>\r\n\r\n[caption id=\"attachment_127218\" align=\"alignnone\" width=\"390\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/IMG_7955-2.jpg\"><img class=\" wp-image-127218\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/IMG_7955-2.jpg\" alt=\"College counselor Sandra Cernobori has helped junior and senior students make post-high school plan for the last 11 years. Photo by Morgan Keller.\" width=\"390\" height=\"485\" \/><\/a> College counselor Sandra Cernobori has helped junior and senior students make post-high school plan for the last 11 years. Photo by Morgan Keller.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Paly Voice sat down with college counselor Sandra Cernobori over a small decaf non-fat latte last week, and discussed her interests and the path she took to become a part of the Palo Alto High School staff.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">This is the 11th year Cernobori has acted as a counselor for senior students in the middle of post-high school planning.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Before becoming a counselor at Paly, Cernobori said she studied at a community college and later transferred to California Polytechnic State University as an English major. After graduating, she earned a teaching credential at San Francisco State University and later a master's degree in Pupil Personnel Services along with her counseling credentials at San Jose State University.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Cernobori, the first job Cernobori she pursued was an English and Psychology teaching career for eight years at San Mateo High School.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I taught all grades, and I even taught psychology,” Cernobori said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">After taking a leave of absence, she became interested in non-profit jobs. However, after not being successful in her search, she took a temporary job at a tech company, SAP, in the Bay Area. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“9\/11 happened and there was no funding for non-profits so I took a temp job at SAP,” Cernobori said.  “It was fine, but I was bored because it was not a very taxing job.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Cernobori applied to her current job at Paly while finishing her counseling credential at San Jose State University.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Cernobori, her favorite activity outside of school is to watch and review theater performances.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I am a big theater person,” Cernobori said.  “I have three theater subscriptions and [am part of] two theater groups in the city.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Two current and former Paly staff members, including guidance counselor Susan Shultz,  join Cernobori in these groups in San Francisco or on Broadway.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Not that I’m an actor at all, I just appreciate the talent,” Cernobori said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">While seniors struggle through the college application process, Cernobori has a few tips she likes to share to help relieve some stress.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“My tips for students is for them to be organized and knowing what you need to do and by when,” Cernobori said. “So you can feel more in control of the process.”<\/span>","excerpt":"The Paly Voice sat down with College Counselor Sandra Cernobori last week, and discussed her interests and the path she took in becoming a part of the Palo Alto High School staff.","date":"2016-12-09 09:55:58","author":"Katie Cox","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/IMG_13851.jpg","categories":["Coffee chats","Features","Spotlight"],"tags":["cernobori","coffee","coffee chats","college counselor","paly","sandra","Staff"]},{"id":126845,"title":"Mitchell Park Library to host annual Finals Cram Slams","permalink":"http:\/\/palyvoice.com\/2016\/12\/08\/mitchell-park-library-to-host-annual-finals-cram-slams\/","content":"[caption id=\"attachment_73573\" align=\"alignnone\" width=\"490\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_0793.jpg\"><img class=\" wp-image-73573\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_0793.jpg\" alt=\"The Mitchell Park Library is one of the three main libraries in Palo Alto Photos by William Zhou.\" width=\"490\" height=\"368\" \/><\/a> Breathtaking view of Mitchell Park Library's main building during the first year of its opening, illustrating the large capacity it can withstand. Photo: William Zhou.[\/caption]\r\n\r\nThe Mitchell Park Library will host several high school study sessions known as the 'Finals Cram Slams,' which are open to students who are looking for a place to study with their peers.\r\n\r\nThis will happen on Monday, Dec. 12 and Tuesday, Dec. 13. both from 6 p.m. to 9 p.m.\r\n\r\nAccording to the City of Palo Alto <a href=\"http:\/\/www.cityofpaloalto.org\/news\/displaynews.asp?NewsID=3147&amp;TargetID=140\">website<\/a>, Mitchell Park Library personnel will “provide snacks and activities to de-stress in between studying including visits from therapy dogs.”\r\n\r\nThe Palo Alto community suggests that the Mitchell Park Library aims to provide a welcoming place for students to study and help decrease stress during this anxious time of the year.\r\n\r\nPalo Alto High School junior Rahul Sankar expressed excitement toward the opportunity.\r\n\r\n\"I'm going to the Finals Cram Slam because a lot of my friends are going and it will be a great opportunity to ask them questions,\" Sankar said. \"It should be a good time.\"\r\n\r\nOther options to find a quiet place to study are the Downtown Palo Alto <a href=\"http:\/\/www.cityofpaloalto.org\/gov\/topics\/projects\/facilities\/library\/downtown.asp\">Library<\/a> and Rinconada <a href=\"http:\/\/www.cityofpaloalto.org\/gov\/depts\/lib\/branches\/rinconada.asp\">Library<\/a>. Described in both libraries websites, they will provide students with materials such as textbooks and note cards.\r\n\r\nAccording to the City of Palo Alto website, students wishing to participate in these activities must bring a valid high school ID.\r\n<ul>\r\n\t<li><strong>Mitchell Park Library<\/strong><\/li>\r\n<\/ul>\r\n<strong>3700 Middlefield Rd, Palo Alto, CA 94303<\/strong>\r\n<ul>\r\n\t<li><b>Downtown Palo Alto Library<\/b><\/li>\r\n<\/ul>\r\n<strong>270 Forest Ave, Palo Alto, CA 94301<\/strong>\r\n<ul>\r\n\t<li><strong>Rinconada Library <\/strong><\/li>\r\n<\/ul>\r\n<strong>1213 Newell Rd, Palo Alto, CA 94303<\/strong>","excerpt":"The Mitchell Park Library will host several high school studying sessions known as the 'Finals Cram Slams', which are open to students who are looking for a place to study with their peers. This will happen on Monday, Dec. 12 and Tuesday, Dec. 13 both from 6pm to 9pm.","date":"2016-12-08 22:52:06","author":"Bradley Smith","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_0793.jpg","categories":["News","Spotlight"],"tags":["finals","Food","friends","mitchell park","studying","therapy dogs"]},{"id":127134,"title":"Boys&#8217; soccer to face Burlingame in preseason game","permalink":"http:\/\/palyvoice.com\/2016\/12\/08\/boys-soccer-to-face-burlingame-in-preseason-game\/","content":"[caption id=\"attachment_127135\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/jackstoksikvsMA.jpg\"><img class=\"size-full wp-image-127135\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/jackstoksikvsMA.jpg\" alt=\"Senior center midfielder Charles Stoksik sprints to intercept a lofty pass during a preseason matchup against Menlo-Atherton on Dec. 6 at Paly.\" width=\"600\" height=\"533\" \/><\/a> Senior center midfielder Charles Stoksik sprints to intercept a lofty pass during a preseason matchup against Menlo-Atherton High School on Dec. 6 at Palo Alto High School. Paly won the match by a score of 1-0. Photo: Julia Qiao.[\/caption]\r\n\r\nSenior center back and captain Neil Verwillow embraced his joyous teammates in celebration with an undeniable grin after scoring the first goal against Menlo-Atherton High School on Tuesday. It had only been five minutes into the first half, but the Palo Alto High School boys’ soccer team (4-0, 0-0) was suddenly in charge of the game with a one-goal lead. The game would end without any additional goals from either team, but Verwillow’s early goal was enough to extend the Vikings’ perfect record to four wins.\r\n\r\n<span style=\"font-weight: 400;\">After the 1-0 victory against Menlo-Atherton, the Paly boys’ soccer team envisions continuing its undefeated preseason record against Burlingame High School at 6 p.m. today at home. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Verwillow, the Vikings feel ready for the upcoming match.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The game for today shouldn't be anything too challenging,” Verwillow said. “We are just coming off a win versus Menlo-Atherton, which is a CCS [Central Coast Section] caliber team every year. So while I can't say for certain how good Burlingame is, I'll be disappointed if we can't pull out a win.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior midfielder and captain Derek Schoenberger agreed with Verwillow’s expectations despite his lack of experience playing against Burlingame.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I'm looking forward to the game today,” Schoenberger said. “I've never played Burlingame before in all four years at Paly, so it's going to nice to see how well we can compete with a team we have no expectations for.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior midfielder Ethan Ho said he believes that a key aspect to the team's early success is warmly welcoming the underclassmen as part of the team.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“With the influx of new sophomores on the team, I think the chemistry in the team is surprisingly good, but this might be partially due to the fact that a lot of us all play on the same club team,” Ho said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior left midfielder Yahli Malchin also credited the team's sterling chemistry due to their comradery formed through outside club teams. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We have a lot of guys from the same club team so we're already really close from that and we play well together,” Malchin said. “Everyone has fun playing together and our chemistry is getting better each game.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Vikings prepared for this game the same way they have prepared for all their previous games, according to Schoenberger.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"We haven't prepared for this game any different than the previous games,” Schoenberger said. “Like every game, all players are expected to be ready to step onto the field and fight to the last minute for the win. This idea doesn't change depending on what team we're playing, so our approach to every game shouldn't change as well.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior center midfielder Charles Stoksik echoed Schoenberger on the tactics to approaching the game.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We haven't done anything too special to prepare,” Stoksik said. “We had a tough and very physical game the day before, so we took it easy in practice by working on the fundamentals and finishing.”<\/span>","excerpt":"After a 1-0 victory against Menlo-Atherton, the Paly boys’ soccer team envisions to continue its undefeated preseason record against Burlingame High School at 6 p.m. today at home.","date":"2016-12-08 17:29:28","author":"Sam Lee","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/jackstoksikvsMA.jpg","categories":["Sports"],"tags":["Boys","burlingame","captain","charles stoksik","derek schoenberger","ethan ho","neil verwillow","preseason","preview","Soccer","sports","yahli malchin"]},{"id":126841,"title":"Girls&#8217; soccer to play Gunn in preseason match","permalink":"http:\/\/palyvoice.com\/2016\/12\/08\/girls-soccer-to-play-gunn-in-preseason-match\/","content":"[caption id=\"attachment_127006\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/girls-soccer-pic-vs-gunn.jpg\"><img class=\"size-full wp-image-127006\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/girls-soccer-pic-vs-gunn.jpg\" alt=\"Sophomore forward Mia Zenger dribbles past Gunn defenders last Thursday during a preseason match at Gunn. Photo by Rachel Code.\" width=\"600\" height=\"554\" \/><\/a> Sophomore forward Mia Zenger dribbles past Gunn defenders last Thursday during a preseason match at Gunn. Photo by Rachel Code.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto High School girls’ soccer team (1-0, 0-0) will face off against the Gunn High School Titans (0-1, 0-0) for its second preseason match at 6 p.m. today at the Gunn soccer field.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">After a 3-0 victory against Woodside High School on Monday, Paly hopes to win its second consecutive game and continue a winning preseason record, according to senior midfielder Tess Preising. The Vikings played a strong match despite the loss of significant seniors from last year, including current UCLA freshman star, Jacey Pederson.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I think the team is going to focus on advancing our play throughout the season,” Preising said. “We lost a lot of key players but I think we came out really strong yesterday and I hope we can carry that out through the season.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Although today’s game is merely a preseason match, senior defender Lauola Amanoni anticipates a spirited competition due to the cross-town rivalry between the two teams.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Gunn and Paly is the best rivalry in Palo Alto, and it is always a fun game to watch and play,” Amanoni said. “So far though, Paly has gotten the best of Gunn in the recent years we have played them.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Junior midfielder Emily Tomz echoed the competition that comes with playing a rival.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I definitely think there will be a competitive spirit at the game this Thursday against Gunn,” Tomz said. “Although it is a preseason match and they are not in our league, every game counts, and there is a historical Gunn-Paly rivalry that will make this game intense and exciting. Also, the boys soccer team will be there cheering us on, so it's good to know we will have a lot of support from the stands this game.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to senior midfielder Talia Malchin, the Vikings will take this opportunity to display their newly developed talent during the match and to test the team chemistry. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We are really trying to figure out how to play as a team and I think the game versus Gunn will be a great opportunity to do so,” Malchin said. “We haven’t had very much time to practice in game situations, so the game will be a good time to get down chemistry. We know how Gunn plays because we’ve played them before, so I think our focus will be on team play. Organization and communication will be a priority.”<\/span>","excerpt":"The Palo Alto High School girls’ soccer team (1-0, 0-0) will face off against the Gunn High School Titans (0-1, 0-0) for its second preseason match at 6 p.m. today at the Gunn soccer field.","date":"2016-12-08 10:54:40","author":"Sam Lee","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/girls-soccer-pic-vs-gunn.jpg","categories":["Uncategorized"],"tags":["Boys and Girls","emily tomz","girls","gunn","Lauola Amonani","paly","preseason","Soccer","talia malchin","Tess Preising","titans","vikings"]},{"id":126863,"title":"Freshman stands out in girls&#8217; soccer victory against rivals","permalink":"http:\/\/palyvoice.com\/2016\/12\/08\/freshman-stands-out-in-girls-soccer-victory-against-rivals\/","content":"[caption id=\"attachment_127004\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/emily-tomz-2.jpg\"><img class=\"size-full wp-image-127004\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/emily-tomz-2.jpg\" alt=\"Junior midfielder gets ready to take a corner kick against Gunn last Thursday during the second half of an away preseason match. Senior Tess Preising converted the goal off Tomz' cross. Photo by Rachel Code.\" width=\"600\" height=\"520\" \/><\/a> Paly junior midfielder Emily Tomz gets ready to take a corner kick against Gunn last Thursday during the second half of an away preseason match. Senior Tess Preising converted the goal off Tomz' cross. Photo by Rachel Code.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Senior midfielder Tess Preising broke out in cold sweat as she sprinted down the middle of the pitch, her exhalation visible in the 48-degree weather on Thursday night. She dribbled deftly past multiple Gunn High School defenders, using her foot skills to advance towards the goal. Preising looked up just in time to see freshman Chloe Japic making a cut and passed a leading ball to her. Japic took a few small touches and wound up a shot at the goal. Needless to say, she took care of the rest.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Japic’s goal asserted the Palo Alto High School (4-0, 0-0)  girls’ soccer team’s dominance in the first half, giving the Vikings a 1-0 lead against the Titans (1-2-1, 0-0) at the Gunn field last Thursday night. Preising later scored a goal off a header from a corner kick by junior Emily Tomz in the second half, extending Paly’s lead to 2-0. Gunn made a late goal, but it was not enough to make a comeback, and the game ended with a score of 2-1.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Preising, playing against Gunn was an exciting matchup, despite the game being part of the preseason schedule.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Playing Gunn is always fun and it's always been a good experience,” Preising said. “I love playing them [Titans], and I am definitely glad to take part in this rivalry.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Paly girls' soccer coach Jon Seedman expressed his opinion on the competition between Paly and Gunn.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Gunn always gives us their best shot,” Seedman said. “I think if Gunn goes through its season and loses every game but beats Paly, that is a successful season for them. You can definitely see it in their [Gunn players’] eyes and with the way they played. They were extremely pumped up. If you looked at the faces of the winning team and losing team and didn’t know who won, you would've thought the opposite way. They were so happy that they had given us a battle. It's not that much of a rivalry for us as much as it is for them.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Preising said while playing the game, she observed what the team needs to work on for the future.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I thought we would score more goals because we kept possession in their attacking third quite often and we took a lot of shots,” Preising said. “The team dynamic isn’t as great as it needs to be but I think the team looks forward to improving that. We definitely need to work on shooting. We had multiple opportunities for easy shots but we chose to pass instead. We don’t have many players who like to shoot so that is something we need to work on as a team.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">However, Preising believes that the struggles will sort itself out through practice and as the season develops.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Seedman also commented that the team can work to build its chemistry with the younger players on the team.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“They are great socially but when we’re playing, we’ve got a long way to go,” Seedman said. “Chloe [Japic] really played well and scored our first goal. She made a lot of other good plays but she needs to figure out the way we play as a team, but that will come.”<\/span>","excerpt":"The Palo Alto High School girls' soccer team (4-0, 0-0) beat the Gunn High School Titans (0-2-1, 0-0) last Thursday night at Gunn by a score of 2-1.","date":"2016-12-08 09:31:55","author":"Sam Lee","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/emily-tomz-2.jpg","categories":["Sports"],"tags":["chloe japic","emily tomz","freshman","gunn","Jon Seedman","paly","preseason","recap","Tess Preising","titans","vikings","win"]}]