[{"id":114093,"title":"Preview: Girls&#8217; soccer to face Mountain View","permalink":"http:\/\/palyvoice.com\/2016\/01\/14\/preview-girls-soccer-to-face-mountain-view\/","content":"[caption id=\"attachment_114276\" align=\"alignnone\" width=\"395\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Screen-Shot-2016-01-14-at-12.12.37-PM.png\"><img class=\"size-full wp-image-114276\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Screen-Shot-2016-01-14-at-12.12.37-PM.png\" alt=\"Junior right mid Tess Preising drives through Gunn High School defenders in a heated Paly vs Gunn match last year. The game resulted in a Paly win, the Vikings hope to continue a winning streak against Mountain VIew High School. Photo by George Lu.\" width=\"395\" height=\"253\" \/><\/a> Junior right mid Tess Preising drives through Gunn High School defenders in a heated Paly vs Gunn match last year. The game resulted in a Paly win, the Vikings hope to continue a winning streak against Mountain View High School. Photo by George Lu.[\/caption]\r\n\r\nThe Palo Alto High School girls' soccer team (8-0,3-0) aims to continue its winning streak tomorrow with an away game against Mountain View High School (3-5-2, 0-1-1) with a 3:30 p.m. kickoff.\r\n\r\nThe rivalry between the Vikings and the Mountain View Spartans dates back to the 2015 CCS finals when the Spartans defeated the Vikings during the final.\r\n\r\n\"Since our loss to Mountain View in CCS finals last year, the rivalry has been fierce,\" Maloney said. \"As of now we try to prove ourselves.\"\r\n\r\nSenior Spartan player Allie Coyne predicts an intense match.\r\n\r\n\"It'll be one of the harder, if not the hardest game this year, and what with CCS last year and being cross-town rivals it'll definitely make for an intense game.\"\r\n\r\nNatalie Maloney said, \"Going into any game we have to be confident, especially when going up against a strong opponent like Mountain View. We're training hard at practice and preparing as we countdown the days until this game. I'm very confident in our team that we have the better skill, stamina and mindset than Mountain View to win.\"\r\n\r\nSenior Viking captain Jacey Pederson has confidence in her team's chances and pushes her teammates to be better.\r\n\r\n\"We have a lot of strengths,\" Pederson said. \"Individually, we have some really good players, all who can do a lot so I think one thing we can work on is bringing that together. We do a really good job of getting to the goal and creating chances, but now it's a matter of finishing those chances and taking advantage of those opportunities.\"\r\n\r\nMountain View midfielder junior Karissa Hayes looks forward to the game.\r\n\r\n\"I think this game is important, but win or lose we aren't going to let it effect the rest of the season,\" Hayes said. \"I would say we have a strong team through out the whole line up, there aren't any weak links, and we all work really well together.We are trying not to get too ahead of ourselves for the Friday match, we know that Paly wants their revenge, but we are just going to lay out game, and hopefully it goes our way\".","excerpt":"The Palo Alto High School girls' soccer team (8-0,3-0) aims to continue its winning streak tomorrow with an away game against Mountain View High School (3-5-2, 0-1-1) with a 3:30 p.m. kickoff.","date":"2016-01-14 23:06:20","author":"Bianca Al-Shamari","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Screen-Shot-2016-01-14-at-12.12.37-PM.png","categories":["Sports"],"tags":["Allie Coyne","girls soccer","jacey pederson","Karissa Hayes","mountain view","natalie maloney"]},{"id":113793,"title":"Caltrain improves fencing with noble intentions","permalink":"http:\/\/palyvoice.com\/2016\/01\/14\/caltrain-improves-fencing-with-noble-intentions\/","content":"[caption id=\"attachment_114020\" align=\"alignnone\" width=\"620\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/DSC_00101.jpg\"><img class=\" wp-image-114020\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/DSC_00101.jpg\" alt=\"captionnnnn\" width=\"620\" height=\"438\" \/><\/a> A construction worker helps to finalize the new fencing along the Caltrain railway behind Palo Alto High School. Photo by Emma van der Veen.[\/caption]\r\n\r\nCaltrain, the commuter rail that runs from San Francisco to San Jose, is undertaking a project in collaboration with the City of Palo Alto to further restrict access to the train tracks by installing new fencing along both sides of the rail in Palo Alto.\r\n\r\nThe new fencing is a significant improvement from the previous protection from the rail, according to Palo Alto Unified School District Supt. Max McGee.\r\n\r\n“It [the fence] runs along the whole sides of the tracks,” McGee said. “Some of the fencing had been up before, and it was already secure, but they took out vegetation and this other fence that was frankly easy to climb.”\r\n\r\nAccording to McGee, the improvement to fencing along the tracks is an effort to address the means by which multiple students have died by suicide in recent years. The fence should serve as a physical deterrent to gaining access to the tracks, but also as a symbol of the value that the community holds in its members lives, McGee said.\r\n\r\n“It is a constant reminder of how important the city, the schools, the parents, the students consider each other's lives,” McGee said. “It’s a very positive reminder that you [the students] matter so deeply to us. If someone has this impulse to run onto the train tracks or to hop the fence, it will make it much more difficult. Sometimes, that little bit of delay is enough to make someone think ‘Well, at least I'm going to call someone first.’”\r\n\r\nPaly parent Lauren Barley was the first to thoroughly advocate for means restriction in Palo Alto, the limiting of access to the way by which the most well-known suicides have been committed in this community, following the first student suicide of the 2014-15 cluster of suicides within the Palo Alto community, according to McGee.\r\n\r\nBarley, who knows the family of the girl from Woodside that died by suicide in 2014, was moved by how the community came together in the wake of Byron's death, the Paly sophomore who committed suicide in March, 2015.\r\n\r\n\"I attended the two parent events that Paly held and was struck by how these deaths had such an extended and deep impact on administrators and students, even those who did not know Byron directly,\" Barley said.\r\n\r\nBarley researched \"means restriction,\" which, in the context of Palo Alto, specifically focused on railroad access. She presented her findings to Caltrain along with McGee and city officials.\r\n\r\n\"I was driven by the belief that reducing access to Caltrain in Palo Alto would reduce and prevent deaths by suicide,\" Barley said.\r\n\r\nAccording to McGee, the City of Palo Alto officials also assumed a great role in pursuing the effort to improve fencing and sensor technology along the Caltrain railroad by participating in meetings and advocating for the project.\r\n\r\n“They [city officials] really took the lead in these meetings and persisted with Caltrain,” McGee said. “It [the project] was funded by Caltrain and the city. They’re also looking at putting in sensors to sense if someone does get over or around the fence at a crossing.\"\r\n\r\nRestricting the means by which someone may harm themselves serves as way to force them to slow down and does not allow them to act as impulsively as they might otherwise, according to McGee.\r\n\r\n“If you have to climb, or get a ladder, or walk across one crossing or the other, that two to three minutes can make someone reconsider and think, ‘What am I doing?’” McGee said.","excerpt":"Caltrain, the commuter rail that runs from San Francisco to San Jose, is undertaking a project in collaboration with the city of Palo Alto to further restrict access to the train tracks by installing new fencing along both sides of the rail in Palo Alto.","date":"2016-01-14 15:52:55","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/DSC_0010.jpg","categories":["News","Spotlight"],"tags":["caltrain","fence","McGee","means prevention","palo alto","palo alto high school","railroad","suicide","Suicide prevention","superintendent","tracks"]},{"id":114287,"title":"Celebration of Life for Kenyon Scott will be at 2 p.m. on Saturday, Jan. 23 on the Quad","permalink":"http:\/\/palyvoice.com\/2016\/01\/14\/celebration-of-life-for-kenyon-scott-will-be-at-2-p-m-on-saturday-jan-23-on-the-quad\/","content":"","excerpt":"","date":"2016-01-14 15:12:22","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":114259,"title":"Prom 2016 will be held at the Design Galleria in San Francisco","permalink":"http:\/\/palyvoice.com\/2016\/01\/14\/prom-2016-will-be-held-at-the-design-galleria-in-san-francisco\/","content":"","excerpt":"","date":"2016-01-14 11:02:43","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":114120,"title":"Girls&#8217; basketball dominates cross-town rival","permalink":"http:\/\/palyvoice.com\/2016\/01\/12\/girls-basketball-dominates-cross-town-rival\/","content":"[caption id=\"attachment_114225\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/IMG_7851.jpg\"><img class=\"size-full wp-image-114225\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/IMG_7851.jpg\" alt=\"Senior Coco Lovely sets up to shoot a free throw in the Friday game on Quad Night against cross-town rival Gunn High School. Lovely led the Vikings in points, helping the team to an exciting win.\" width=\"800\" height=\"500\" \/><\/a> Senior center Courtney Lovely sets up to shoot a free throw in the Friday game on Quad Night against cross-town rival Gunn High School. Lovely led the Vikings in points, bringing the team to an exciting win. Photo by Emma van der Veen.[\/caption]\r\n\r\nThe Palo Alto High School girls' basketball team (8-4, 1-1) routed cross-town rival Gunn High School (8-4, 0-2) with a 49-34 win on Quad Night last Friday at Gunn High School.\r\n\r\nThe Vikings’ lockdown defense held the Titans to zero points scored in the second and third quarter, allowing Paly to come back from a four point deficit in the first quarter.\r\n\r\n“We were able to hold them scoreless for two quarters and that’s pretty good,” head coach Scott Peters said. “Our biggest problem was shooting. A lot of that was being too nervous or us putting too much pressure on ourselves. We just have to relax.”\r\n\r\nThe momentum shifted in the second quarter when junior forward Julie Chandler dished assists to sophomore forward Sophie Frick on backdoor cuts on two consecutive possessions. Frick’s layups helped the Vikings take the lead, 22-19.\r\n\r\nSenior center Courtney Lovely was the leading scorer for the team with 13 points, though the Vikings struggled with shooting overall, according to senior guard Maddy Atwater.\r\n\r\n“We rush our shots sometimes and we don’t need to,” Atwater said. “We just have to relax and take our shots.”\r\n\r\nThe amount of energy from the team, amplified by the crowd, helped Paly to come back from their first quarter performance, according to Peters.\r\n\r\n“They scored 19 points and we didn’t get down,” Peters said. “In the first quarter, we just kept at it with that same energy, and that paid off.”\r\n\r\nJunior guard Lauren Koyama also emphasized the significance of the team’s energy.\r\n\r\n“We were very amped up,” Koyama said. “The crowd brought energy that kind of made us overwhelmed, but we played well and we did what we wanted to do … we really got after it and we had a ton of energy.”\r\n\r\nThe Vikings will face off against the Saratoga Falcons (10-4, 1-1) at 7 p.m. on Tuesday at Gunn, Paly’s home gym for the season.","excerpt":"The Palo Alto High School girls' basketball team (8-4, 1-1) routed cross-town rival Gunn High School (8-4, 0-2) with a 49-34 Quad Night win last Friday at Gunn.","date":"2016-01-12 22:29:32","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/IMG_7851.jpg","categories":["Sports","Sports Recap"],"tags":["ball is life","basketball","coco lovely","girls basketball","gunn","julie chandler","lauren koyama","maddy atwater","palo alto","palo alto high school","paly","Quad Night","scott peters","sophie frick","titans","vikings"]},{"id":114161,"title":"Football head coach resigns","permalink":"http:\/\/palyvoice.com\/2016\/01\/12\/football-head-coach-resigns\/","content":"The Palo Alto High School football team is preparing to adapt to a new coaching situation, as its head coach's resignation from his position was confirmed on Tuesday.\r\n\r\nHead coach Jake Halas confirmed his resignation after two years in that position after taking over for long-time head coach Earl Hansen, largely because he wants to spend more time with his family.\r\n\r\n“I did step down,” Halas said. “A variety of factors contributed to this, but the overriding factor was basically family. Just the chance to see the kids at home. I have three kids under six years old and that’s where I’m going to put my focus right now.”\r\n\r\nAccording to Halas, the head coach position is open to anyone, and a committee to search for a new head coach is already on the hunt to fill his spot.\r\n\r\n“It’s open to whoever [within qualification],” Halas said. “They [committee members] are actively searching. I’d be shocked if they don’t have a person in place by February. They have to get a head football coach sooner rather than later just because there’s so much stuff to do.”\r\n\r\nDespite stepping down from coaching the football team, Halas will stay at Paly as a physical education teacher and a football supporter.\r\n\r\n“I’m going to support in any way I can,” Halas said. “I’m going to continue teaching in the spot I’m in, but I’m not going to coach football or any other sport for the next couple of years. I’m going to coach my kids' teams, as a matter of fact.”\r\n\r\nHalas is still thinking about coaching in the future.\r\n\r\n“I’m just going to reset,” Halas said. “I’m not done coaching, I have a lot of coaching left in me, but I have to back away for a while and reset.”\r\n\r\nIn the fall, the Vikings (5-7, 3-3) competed in the Central Coast Section playoffs through the semifinal round. Sophomore kicker Max Dorward was shocked by Halas’ resignation and recognizes the challenges this may pose for future seasons.\r\n\r\n“I was pretty surprised he decided to resign because he did a great job with us this past season,” Dorward said. “It will be challenging for next season because we have to adapt to a new head coach. Whenever there’s a coaching change in sports, there are always changes [to the team] and that can be difficult for returning players.”","excerpt":"The Palo Alto High School football team is preparing to adapt to a new coaching situation, as its head coach has officially resigned from his position.","date":"2016-01-12 20:01:28","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/rsz_img_1343.jpg","categories":["Sports","Spotlight"],"tags":["football","halas","max dorward","palo alto high school","paly","Paly football"]},{"id":113098,"title":"Blogger without borders: Refugee stories, Part 3","permalink":"http:\/\/palyvoice.com\/2016\/01\/12\/blogger-without-borders-refugee-stories-part-3\/","content":"<em>The third and final installment of \"Blogger without borders: Refugee stories,\" where <span class=\"Apple-style-span\">junior Bianca Al-Shamari shares refugees' stories that are translated from Farsi, Russian and Mongolian.<\/span><\/em>\r\n\r\n[caption id=\"attachment_114149\" align=\"alignnone\" width=\"627\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12399082_1680231118856874_1609822708_n.jpg\"><img class=\"wp-image-114149\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12399082_1680231118856874_1609822708_n.jpg\" alt=\"12399082_1680231118856874_1609822708_n\" width=\"627\" height=\"470\" \/><\/a> A section of an Austrian refugee camp in Schwechat houses men, women and children in make-shift bedding. Refugees, over 80 individuals in total, were placed under a mass tent set up by local volunteers. Photo by Bianca Al-Shamari.[\/caption]\r\n\r\n<strong>Interview #1 - Farsi<\/strong>\r\n\r\n[audio m4a=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/Farsi-3.m4a\"][\/audio]\r\n\r\nAndeshir Naziri came to Austria from Afghanistan with his wife, daughter and son, all while experiencing health issues. The family continues to assimilate in any way possible.\r\n\r\n“It’s difficult because I have an illness,\" Naziri said. \"I have a mental condition [nervous illness] and a heart condition. My daughter needs ear surgery and my wife has herniated disks in her back. These have been the difficulties of life since we came to Austria.”\r\n\r\n&nbsp;\r\n\r\n<span style=\"text-decoration: underline;\"><strong>Interview #2 - Farsi<\/strong><\/span>\r\n\r\n[audio m4a=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/Farsi-2.m4a\"][\/audio]\r\n\r\nMohammad Ehsan and his wife, 13-year-old daughter and 15-year-old son are from Mazar-e-Sharif, a province in Afghanistan that is in the midst of political turmoil.\r\n\r\n\"In Kunduz [a nearby city], they [ISIS] were taking women and girls with them which was causing great concern for all the people of Afghanistan,\" Ehsan said. \"Furthermore, the government took inappropriate political actions by not properly attacking against DAESH [ISIS]. They [government] would block and prevent things and engage in corruption and bribery. All this contributed to the people becoming restless and anxious and many, after the Taliban took Kunduz, were homeless.\"\r\n\r\nThe family soon fled to Turkey to obtain a visa from the Turkish Consulate.\r\n\r\n\"I wanted to leave the country and come to Turkey for the safety of my children, and then from Turkey I got in touch with a smuggler,\" Ehsan said. \"On the same day that we arrived in Turkey, he took us to the jungle in the evening and that night in the woods we waited for a ship. The next day we got on board a boat in dangerous conditions, with cross winds and with approximately 53 people. We arrived to the island of 'Mesrini,' then, after being near Klini, arrived in Greece. There we received departure permits, and we went from Mesrini to Macedonia, from Macedonia by train to Serbia. From Serbia by means of motor, caravan and train, we arrived to a train in Austria.\"\r\n\r\nEhsan and his family now have a home and basic living necessities after arriving in Austria in late September. His two children are successfully enrolled into a neighboring school, Bundesgymnasium und Bundesrealgymnasium Schwechat, and are learning German with the help of volunteers in the Schwechat city community every week.\r\n\r\n\"Life here [Austria] is good,\" Ehsan said. \"There is safety for the children and things are better. We have bread and money. For us, the main issue is safety, specifically the safety of my wife and children, so that the children can successfully go to school. Thanks to God. We are in hope that this war and insecurity will be cleared from our homeland and that we might be able to once again return with dignity.\"\r\n\r\n&nbsp;\r\n\r\n<span style=\"text-decoration: underline;\"><strong>Interview #3 - Farsi<\/strong><\/span>\r\n\r\n[audio m4a=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/Farsi-1.m4a\"][\/audio]\r\n\r\nMilad Hashemi arrived in Austria from Afghanistan with his sister and her sister's husband in early September.\r\n\r\n“In the name of God the merciful, my name is Milad. My family name is Hashemi. We had a long trip to get here. Our current condition and the condition of our country is not so good. Day-by-day, there were many killed and injured. We couldn’t easily go to the bazaar [market] or travel around town. Every minute you could see killings and war and everything. In brief, it was not a happy life for us in Afghanistan.\"\r\n\r\nHashemi feared each day in Afghanistan.\r\n\r\n\"It was difficult to go out. When we would go out, there was no guarantee we would come back. Life was tough within the country. If you left in the morning, you had no hope you would return at night. Only war, death and carnage.\"\r\n\r\nThe family hopes to find a better life in Austria.\r\n\r\n\"So far we’ve arrived in Austria. It’s a good country, we’re pleased being here. So far, we’re living here to see what God will want. If they allow us, we’ll continue living here.\"\r\n\r\n&nbsp;\r\n\r\n<span style=\"text-decoration: underline;\"><strong>Interview #4 - Mongolian<\/strong><\/span>\r\n\r\nThe following interview was carried out in Russian with two Mongolian sisters. Ninety percent of the population speaks the official language of Khalkha Mongolian in Mongolia, but Russian is a common second language.\r\n\r\n[audio m4a=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/Mongolian-Women-1.m4a\"][\/audio]\r\n\r\nThe two sisters, Uchrava and Urunduks, left Mongolia in early August to join their older sister and her husband in Vienna. The sisters sought business opportunities in Austria after they noticed their educational progress dwindle during Mongolia's economic decline.\r\n\r\nUchravna: “We arrived here in Austria three months ago. My sister lives here with her husband, so my little sister and I left Mongolia to live with her. She [Urunduks] studies business. In a year, I still want to be living in Austria, with my sister [Urunduks]. I want to study here. I need to find work but there are no jobs.\"\r\n\r\nUrunduks: \"In Mongolia, I was working on business. I want to study here and Austria and continue my work. Right not what I need to learn is how to speak Deutsch [German] for business.\"\r\n\r\nUchravna: \"Some of our family still lives in Mongolia. My sister and her husband live here, and we are with them. Our parents are gone. In six months, I hope to still be living here in Austria, and in a year as well. My goal is to learn German and go into business again. Some of my family is still in Mongolia, but my parents are no longer with me.\"","excerpt":"The third installment of \"Blogger without borders: Refugee stories,\" where junior Bianca Al-Shamari shares refugees' stories that are translated from Farsi, Russian and Mongolian.","date":"2016-01-12 11:31:43","author":"Bianca Al-Shamari","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12399082_1680231118856874_1609822708_n.jpg","categories":["Blog","Blogger without borders"],"tags":["afghanistan","al shamari","bianca","blogger","blogger without borders","borders","farsi","hashemi","isis","kunduz","mongolian","Refugee","refugee stories","turkey","turkish"]},{"id":114082,"title":"Liveblog: State of the Union Address","permalink":"http:\/\/palyvoice.com\/2016\/01\/12\/liveblog-state-of-the-union-address\/","content":"President Barack Obama will deliver the State of the Union Address tonight. Check back in at 6 p.m. to read The Paly Voice's liveblog.\r\n\r\n[liveblog]","excerpt":"President Barack Obama will deliver the State of the Union Address tonight. Check back in at 6 p.m. to read The Paly Voice's liveblog.","date":"2016-01-12 10:18:36","author":"Mary McNamara","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/obama-close-up-copy.jpg","categories":["Entertainment","Uncategorized"],"tags":["america","barack","Democrat","liveblog","obama","palo alto high school","paly","Politics","President","state of the union","thanks obama","usa"]},{"id":114034,"title":"Boys&#8217; soccer triumphs over Homestead","permalink":"http:\/\/palyvoice.com\/2016\/01\/11\/boys-soccer-triumphs-over-homestead\/","content":"[caption id=\"attachment_114045\" align=\"alignnone\" width=\"767\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/IMG_78111.jpg\"><img class=\" wp-image-114045\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/IMG_78111.jpg\" alt=\"dhsdg\" width=\"767\" height=\"511\" \/><\/a> Senior midfielder Dami Bolarinwa beats out a defender to maintain possession of the ball during Friday's match against Homestead High School. The win over the Mustangs allowed Palo Alto High School to maintain its perfect record in league play, with two wins and no losses or ties. Photo by Emma van der Veen.[\/caption]\r\n\r\nThe Palo Alto High School boys’ soccer team (2-0, 6-1) shut out Homestead High School (1-1, 7-2-2) 2-0 on Friday in its second De Anza League game of the season.\r\n\r\nThe Vikings dominated the first portion of the game with possession-focused play, according to head coach Don Briggs.\r\n\r\n“The first half of the first half, the first 20 minutes, we played really well, but we didn’t score,” Briggs said. “They just took it to us in the last 20 minutes of the first half and I was a little bit concerned, but we pulled it back together at halftime and we had a good second half.”\r\n\r\nAccording to junior midfielder Jack Stoksik, who scored both of the goals for the Vikings, the halftime talk acted as a reminder to what they had to do to succeed. Stoksik accredited much of the team’s success to its defensive play.\r\n\r\n“Coach told us to pick it up at halftime, and we did that,” Stoksik said. “I thought that we were really solid defensively and kept it tight.”\r\n\r\nPaly was able to secure the win through the effort of all of its players and their ability to work together, according to senior goalkeeper Eli Friedlander.\r\n\r\n“We stayed organized in the back, and they didn’t get any clear cut chances,” Friedlander said. “Everyone came out here and played really hard. When we play as hard as we did today, we’re going to win a lot of the 50-50 balls and that’s going to put us in a good position to win a game.”\r\n\r\nAccording to senior center defender Reuben Kramer, the Vikings struggled with staying focused and composed, as play was fast-paced throughout the match.\r\n\r\n“We struggled the most in keeping our composure,” Kramer said. “There were a couple of moments when we got excited when they had the ball and we started not thinking rationally. It was just us getting outside of our heads.”\r\n\r\nThe Mustangs were the biggest defensive challenge for Paly so far this season, according to Briggs.\r\n\r\n“They were pushing us,” Briggs said. “That’s the hardest that our defense has been pushed this year.”\r\n\r\nBriggs intends to address the team’s issue of staying in position and adjusting appropriately.\r\n\r\n“Right now, we need to work on keeping our shape,” Briggs said. “We have guys flying out to try to defend or get a ball and they leave a hole behind them and then they [other team] start play-making us.”\r\n\r\nHomestead head coach Luis Comesana recognized his own team’s struggle to possess and stay composed under high pressure.\r\n\r\n“We needed to possess the ball a little bit more,” Comesana said. “We were rushed. We were put under pressure. I think that today, the better team won.”\r\n\r\nDespite the score, Comesana remained proud of his players' resilience.\r\n\r\n“We fought back,” Comesana said. “As a coach, you always want your players to give their best all the way to the end, no matter what the score is.”\r\n\r\nLooking ahead, the Vikings hope to live up to <a href=\"http:\/\/palyvoice.com\/2015\/01\/22\/liveblog-boys-soccer-fights-for-first-in-league-against-homestead\/\">last year’s record<\/a> with a De Anza League title, according to Stoksik.\r\n\r\n“If we continue in this form, I think we definitely have a shot at winning league,” Stoksik said.\r\n\r\nPaly will play its cross-town rivals, the Gunn Titans, at 3:30 p.m. on Wednesday at Gunn High School.","excerpt":"The Palo Alto High School boys’ soccer team (2-0, 6-1) shut out the Homestead Mustangs (1-1, 7-2-2) 2-0 on Friday in its second De Anza League game of the season.\r\n","date":"2016-01-11 11:16:25","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/IMG_78001.jpg","categories":["Sports","Spotlight"],"tags":["boys soccer","briggs","comesana","de anza","friedlander","homestead","kramer","mustangs","palo alto high school","paly","Soccer","sports","stoksik","vikings"]},{"id":113812,"title":"Recap: Girls&#8217; soccer dominates Los Gatos","permalink":"http:\/\/palyvoice.com\/2016\/01\/09\/recap-girls-soccer-dominates-los-gatos\/","content":"[caption id=\"attachment_114024\" align=\"alignnone\" width=\"499\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Screen-Shot-2016-01-09-at-8.58.40-PM.png\"><img class=\" wp-image-114024\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Screen-Shot-2016-01-09-at-8.58.40-PM.png\" alt=\"Sophomore Emily Tomz dribbles towards a Los Gatos defender as Paly takes an early 1-0 lead. The Vikings went on to win 3-0 keeping their perfect record. Photo by Bianca Al-Shamary. \" width=\"499\" height=\"331\" \/><\/a> Sophomore Emily Tomz dribbles towards a Los Gatos defender as Paly takes an early 1-0 lead. The Vikings went on to win 3-0, preserving their perfect record. Photo by Bianca Al-Shamary.[\/caption]\r\n\r\nIn dominating fashion, the Palo Alto High School girls’ soccer team (7-0, 2-0) shut down the Los Gatos Wildcats (3-6-1, 1-1) 3-0 in its first Santa Clara Valley Athletic, De Anza league game of the season.\r\n\r\nA first-half goal by Vikings senior left back Jacey Pederson gave the Vikings the lead, ending the constant struggle to score on multiple opportunities earlier in the match. This first goal gave the team momentum to add two more goals by junior Natalie Maloney and senior Alison Lu.\r\n\r\nVikings Junior mid-fielder Tess Preising recalls the struggle to keep the shots on goal throughout the match.\r\n\r\n“I think we played very well, we were in their box most of the game but we had a lot of chances that we didn’t follow through with,” Preising said. “We definitely need to work on our shots because a lot of them were off-frame.”\r\n\r\nVikings Senior forward Heidi Moeser wants the team to focus on what they can improve, in order to maintain what is already a fantastic start.\r\n\r\n\"We need to work on moving off the ball and getting open, and just playing the simple ball,\" Moeser said.\r\n\r\nThe team's next match will take place from 3:30-5:30 p.m. on Jan. 13 against Milpitas High School. The Paly girls' varsity soccer team looks forward to a promising season.\r\n\r\n&nbsp;","excerpt":"In dominating fashion, the Palo Alto High School girls’ soccer team (7-0, 2-0) shut down Los Gatos High School (3-6-1, 1-1) 3-0 in its first SCVAL De Anza league game of the season.","date":"2016-01-09 23:15:15","author":"Bianca Al-Shamari","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Screen-Shot-2016-01-09-at-8.58.40-PM.png","categories":["Sports","Sports Recap"],"tags":["blow out","girls","lu","maloney","moeser","pederson","preising","recap","Soccer","wiin"]}]