[{"id":126927,"title":"Thursday&#8217;s blood drive donation slots filled to capacity","permalink":"http:\/\/palyvoice.com\/2016\/12\/07\/thursdays-blood-drive-donation-slots-filled-to-capacity\/","content":"<span style=\"font-family: Georgia, Palatino;\">Organizers of <span style=\"color: #45494d;\">Palo Alto High School’s American Red Cross Club’s blood drive, taking place <span class=\"aBn\" tabindex=\"0\" data-term=\"goog_452565514\"><span class=\"aQJ\">this Thursday<\/span><\/span> in the Library Resource Center, are suggesting donors schedule visits to the Stanford Blood Center after slots at the Paly event filled up ahead of schedule.<\/span><\/span>\r\n\r\n<span style=\"font-family: Georgia, Palatino;\">According to club president senior Celia Willner, there are not enough Red Cross volunteers to accommodate all of the students that want to donate blood.<\/span>\r\n\r\n<span style=\"font-family: Georgia, Palatino;\">\"The American Red Cross Foundation only needed 35 units of blood, which is equal to approximately 50 student blood donations,\" Willner said. \"Unfortunately, that means that a lot of students interested in donating their blood will not get a chance to do so.\"<\/span>\r\n\r\n<span style=\"font-family: Georgia, Palatino;\">Senior Avanika Narayan expressed frustration at not being able to donate blood.<\/span>\r\n\r\n<span style=\"font-family: Georgia, Palatino;\">\"I was really disappointed when I found out that there were no more slots open for Thursday's blood drive because I’ve always wanted to donate blood,\" Narayan said. \"I decided to make an appointment at the <a href=\"http:\/\/bloodcenter.stanford.edu\/donate\/appointment.php\">Stanford Blood Center<\/a> to donate blood, and I encourage any other interested students to do the same.\"<\/span>\r\n\r\n<span style=\"font-family: Georgia, Palatino;\">Junior Annie Zhou, one of the few students who managed to secure a donation slot, looks forward to making her first blood donation.<\/span>\r\n\r\n<span style=\"font-family: Georgia, Palatino;\">“I signed up to donate blood because it is an easy way to help people in need,\" Zhou said. \"I would like to think that a little pain on my end can end up saving someone else's life.\"<\/span>\r\n\r\n<span style=\"font-family: Georgia, Palatino;\">Willner hopes to hold more blood drives in the future.<\/span>\r\n\r\n<span style=\"font-family: Georgia, Palatino;\">\"Knowing now just how many students are interested in participating in the blood drive, the Red Cross Club hopes to host another blood drive this Spring to give more students a chance to donate their blood,\" Wilner said.<\/span>\r\n\r\n<span style=\"font-family: Georgia, Palatino;\">According to Willner, students that signed up to donate blood should look at the American Red Cross Foundation's <a href=\"http:\/\/www.redcrossblood.org\/donating-blood\/tips-successful-donation\">website<\/a> for tips on how to make a successful donation.<\/span>\r\n\r\n<span style=\"font-family: Georgia, Palatino;\">For more information on donating blood call 1-800-RED-CROSS or visit Red Cross' <a href=\"http:\/\/www.redcrossblood.org\/\">website<\/a>.<\/span>","excerpt":"Palo Alto High School’s American Red Cross Club will host a blood drive on Thursday, Dec. 8, giving students an opportunity to donate blood.","date":"2016-12-07 20:27:25","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15416075_1293420087399164_261694906_n.jpg","categories":["News"],"tags":["blood drive","celia","donate","red cross","red cross club","wilner"]},{"id":126715,"title":"Little ones in the big leagues: Freshmen on winter varsity teams","permalink":"http:\/\/palyvoice.com\/2016\/12\/06\/little-ones-in-the-big-leagues-freshmen-on-winter-varsity-teams\/","content":"<span style=\"font-weight: 400;\">Palo Alto High School varsity sports are known for being competitive. Athletes who participate in varsity sports are often upperclassmen, though a few younger students are able to make the cut. Sometimes even freshmen get to compete at the varsity level. This winter, there are three.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Read more to find out who they are and what they do.<\/span>\r\n\r\n<b>Sofie Vogel<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Freshman Sofie Vogel is a forward on the Palo Alto High School girls’ soccer team. Girls’ soccer has won its first three preseason games.<\/span>\r\n\r\n[caption id=\"attachment_126742\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/DSC_00471.jpg\"><img class=\"size-full wp-image-126742\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/DSC_00471.jpg\" alt=\"Freshman Sofie Vogel is a first-year Varisty girls' soccer player. Photo: Emma van der Veen.\" width=\"600\" height=\"400\" \/><\/a> Freshman Sofie Vogel, a first-year varsity girls' soccer player. Photo: Emma van der Veen.[\/caption]\r\n\r\n<b>PV: How did you start playing soccer?<\/b>\r\n\r\nSV: I started on AYSO [American Youth Soccer Organization] like most people do. My parents put me in a lot of sports when I was younger, and I stuck to soccer because I liked it a lot more than the others.\r\n\r\n<b>PV: How is playing varsity similar or different to your past experiences?<\/b>\r\n\r\nSV: Varsity is similar to my club experiences because I already play up one year [with girls one year older]. I don't really see the girls on my club team outside of soccer, so it's different playing for a school team because you get to see the people on your team all the time.\r\n\r\n<b>PV: What’s the hardest thing about being a freshman on varsity?<\/b>\r\n\r\nSV: Since we're [Chloe and I are] the youngest, everyone [else] has already had experience and played together for a year, so it's hard being the newest.\r\n\r\n<b>PV: What’s your favorite thing to do outside of soccer?<\/b>\r\n\r\nSV: My favorite thing [outside of soccer] would be to either read or draw.\r\n\r\n<b>PV: What are your goals for this season? For the next four years?<\/b>\r\n\r\nSV: For this season, I want to just try my best. For the next four years, I want to improve and keep getting better.\r\n\r\n&nbsp;\r\n\r\n<b>Chloe Japić<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Freshman Chloe Japić is a midfielder on the Palo Alto High School girls’ soccer team.<\/span>\r\n\r\n[caption id=\"attachment_126743\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/DSC_0051.jpg\"><img class=\"wp-image-126743 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/DSC_0051.jpg\" alt=\"Freshman Chloe Japic is a first-year Varisty girls' soccer player. Photo: Emma van der Veen.\" width=\"600\" height=\"400\" \/><\/a> Freshman Chloe Japić, a first-year varsity girls' soccer player. Photo: Emma van der Veen.[\/caption]\r\n\r\n<b>PV: How did you start playing soccer?<\/b>\r\n\r\nCJ: I started with Kidz Love Soccer and then played AYSO. Right now I'm playing in NPL [National Premier League] on two different teams. I play one year up and I also play four years up.\r\n\r\n<b>PV: How is playing varsity similar or different to your past experiences?<\/b>\r\n\r\nCJ: Playing varsity is similar to my club team because I've played four years up before, so I'm used to being the youngest on the team. The environment is different because club is known for being a little more intense, so it's nice to come to Varsity and breathe a little bit.\r\n\r\n<b>PV: What’s the hardest thing about being a freshman on varsity?<\/b>\r\n\r\nCJ: The hardest thing is getting to know everyone socially and on the field, since we don't really know anybody yet.\r\n\r\n<b>PV: What are your goals for this season?<\/b>\r\n\r\nCJ: I want to score as much as possible and impact the team. I don't want to just be the standby freshman. My club is becoming an academy which means I won't be able to play after this year, so I have to pack the whole experience into one year.\r\n\r\n<b>PV: What are you most excited about for this season?<\/b>\r\n\r\nCJ: I am excited to do something I love with people who love it too.\r\n\r\n&nbsp;\r\n\r\n<b>Grace Thayer<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Freshman Grace Thayer is a center on the Palo Alto High School girls’ basketball team.<\/span>\r\n\r\n[caption id=\"attachment_126826\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/DSC_0035.jpg\"><img class=\"size-full wp-image-126826\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/DSC_0035.jpg\" alt=\"Freshman Grace Thayer ...... Photo: Emma van der Veen.\" width=\"600\" height=\"400\" \/><\/a> Freshman Grace Thayer, a first-year varsity girls' basketball player. Photo: Emma van der Veen.[\/caption]\r\n\r\n<b>PV: How long have you been playing basketball?<\/b>\r\n\r\nGT: Ever since I was really little I played, but I stopped in seventh grade because I had too many injuries. I am just starting again this year.\r\n\r\n<b>PV: How did you start playing basketball?<\/b>\r\n\r\nGT: My parents were always into making us [my siblings and me] play sports and making us go out there and be teammates. I started because my dad pushed me into it, and I just kept with it because I liked it.\r\n\r\n<b>PV: How is playing varsity similar or different to your past experiences?<\/b>\r\n\r\nGT: My past experiences have varied a lot. I've played on AAU [Amateur Athletic Union], with boys on AAU, in middle school with some interesting coaching. This year, there's a really great coach and group of girls who really support you and know what they're doing.\r\n\r\n<b>PV: What is your favorite thing about being on the team?<\/b>\r\n\r\nGT: The best thing is definitely being with the girls because they're so nice. It's really great playing with them because they're so much better than what I'm used to.\r\n\r\n<b>PV: What’s the hardest thing about being a freshman on varsity?<\/b>\r\n\r\nGT: There's a lot of jokes like \"We have a freshman now, she can carry the stuff in,\" but it's all funny.\r\n\r\n<b>PV: What’s your favorite thing to do outside of basketball?<\/b>\r\n\r\nGT: I'm really into volleyball because when I was injured I had to find another sport to play, so I went into volleyball. Right now I'm doing club [volleyball] and [Paly] basketball.\r\n\r\n<b>PV: What are your goals for this season? For the next four years?<\/b>\r\n\r\nGT: I know that last year we won CCS [Central Coast Section playoffs] and that a lot of seniors graduated, so I don't want to let down the team or anything like that. I want to help us go as far as we can. For the future, I want to stay playing basketball with these girls.","excerpt":"Palo Alto High School varsity sports are known for being competitive. Athletes who participate in varsity sports are often upperclassmen, though a few younger students are able to make the cut. Sometimes even freshmen get to compete at the varsity level. This winter, there are three.","date":"2016-12-06 23:27:09","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/DSC_0035.jpg","categories":["Features","Sports","Spotlight"],"tags":["athletics","basketball","chloe japic","freshman","freshmen","girls","girls basketball","girls soccer","grace thayer","japic","palo alto high school","paly","Soccer","sofie vogel","sports","thayer","varsity","vogel"]},{"id":126529,"title":"Season Preview: Boys&#8217; soccer hopes to recreate last year&#8217;s winning streak","permalink":"http:\/\/palyvoice.com\/2016\/12\/06\/season-preview-boys-soccer-hopes-to-recreate-last-years-winning-streak\/","content":"[caption id=\"attachment_126829\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15310449_1268811903190560_598719278_n.jpg\"><img class=\"size-full wp-image-126829\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15310449_1268811903190560_598719278_n.jpg\" alt=\"Sophomore Jason Shorin chases after the ball \" width=\"600\" height=\"400\" \/><\/a> Palo Alto High School sophomore Jason Shorin, an outside midfielder, chases after the ball in a preseason match against Carlmont High School on Nov. 30. The Vikings won the game with a score of 2-1. Photo: Emma van der Veen[\/caption]\r\n\r\nAfter an undefeated regular season that ended with a devastating loss in the quarterfinals of last season's Central Coast Section playoffs, the Palo Alto High School boys' soccer team hopes to repeat last year's success and advance to the final round of CCS.\r\n\r\nThe team is optimistic about its chances to do well in CCS this season, despite losing many graduated seniors. Last year, the Vikings remained undefeated until CCS quarterfinals, where they fell, 3-2, in overtime to <a href=\"http:\/\/palyvoice.com\/2016\/02\/28\/boys-soccer-falls-to-watsonville-in-ccs-quarterfinals-ends-season-with-first-loss\/\">Watsonville High School<\/a>.\r\n\r\n“Although we lost many great seniors last year, we gained a lot more [sophomores] this year,” senior captain Derek Schoenberger said. “I'm not worried about the loss of seniors. This year, we have a group of guys that have been playing together for years and a fresh new group of underclassmen.”\r\n\r\nOne of the departed seniors included the team's goalkeeper, Eli Friedlander, leaving a large hole in the Vikings' defensive roster.\r\n\r\n“With no clear starting goalie at this point, there are a couple a good options ... but we have yet to see them in games, and it's hard to replace someone like [last year’s goalie],” senior team captain Neil Verwillow said.\r\n\r\nHowever, the Vikings have gained many new seniors,  who were inspired to join as it dawned on them this was their last year to play for Paly, according to Verwillow. Four seniors as well as five juniors and sophomores will be joining this year's roster.\r\n\r\n<span class=\"_5yl5\">\"I had played for my club team the last three years during the winter, but I decided to play [high school] soccer with my friends in my last year,\" senior Nicholas Camarena said.<\/span>\r\n\r\n“The guys coming out are very good, so if anything, I believe we have the potential to be even more competitive than last year despite the loss,” Verwillow said.\r\n\r\nVerwillow is excited for another shot at the CCS championship, and encourages student to attend the games.\r\n\r\n“It's a blast when people come out to the games and it makes us all play that much harder,” Verwillow said. “I also can't wait for another chance at CCS, no matter what it takes to get there.”\r\n\r\nBeyond doing well in CCS, the team also has goals to develop stronger team bonds.\r\n\r\n“In past years we've had great groups of individual players, but never really a strong holistic team,” Schoenberger said. “This year one thing [that] seniors are trying to change is the attitude that is carried throughout the year of not only playing lights out during games, but during practices too.”\r\n\r\nThe Vikings played their first preseason game on Nov. 21 against Mountain View, winning 3-0.\r\n\r\n“I think we played pretty well ... there is definitely lots of room for improvement,” junior Xander Sherer said. “I think it was a good opportunity for some of the new players to get a feel for varsity game play.”\r\n\r\nThe team also recently went against Milpitas High School on Nov. 29, winning, 9-0, as well as defeating Carlmont High School, 2-1, on Nov. 30.\r\n\r\nThe team's next preseason game will be at 3:30 p.m. today at home against Menlo-Atherton High School. The regular season will start Jan. 5 at an away game against Los Altos High School.","excerpt":"After an undefeated regular season that ended with a devastating loss in the quarterfinals of last season's Central Coast Section playoffs, the Palo Alto High School boys' soccer team hopes to repeat last year's success and advance to the final round of CCS.","date":"2016-12-06 09:28:09","author":"Julia Qiao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/DSC_0060.jpg","categories":["Sports","Spotlight"],"tags":["Boys","boys soccer","derek schoenberger","neil verwillow","paly","Soccer","varsity","vikings","xander sherer"]},{"id":126675,"title":"Volleyball celebrates improvement, looks to future success","permalink":"http:\/\/palyvoice.com\/2016\/12\/04\/volleyball-celebrates-improvement-looks-to-future-success\/","content":"[caption id=\"attachment_126800\" align=\"alignnone\" width=\"597\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/VB-VS-Gunn.jpg\"><img class=\" wp-image-126800\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/VB-VS-Gunn.jpg\" alt=\"Caption Caption Caption\" width=\"597\" height=\"398\" \/><\/a> The Palo Alto High School volleyball team (23-11, 11-1) huddles during a time out in its match against the Gunn High School Titans (17-14, 10-2) on Oct. 14 at the Gunn gym. According to junior outside hitter Denise Ringwalt, the team had a great season, and improved much more over the span of the season than they had in the recent past. \"Last year everyone got along but we didn't improve as much together as we did this year,\" Ringwalt said.  Photo: William Sallomi.[\/caption]\r\n\r\nThe Palo Alto High School volleyball team is celebrating  an impressive overall record of 23-11 and a successful season, which ended after a loss to the Turlock High School Bull Dogs (28-12, 10-2) the night of Nov. 16 at the Turlock gym in the first round of the Northern California playoffs.\r\n\r\nThe Vikings had a tough preseason, facing off against top level competition like the St. Ignatius College Prepatory Wildcats (32-9, 4-1) and the Valley Christian High School Warriors (28-12, 1-4). These rigorous matches served as solid preparation for the season ahead and were ultimately crucial in helping the girls acclimate to the new roster.\r\n\r\nAccording to junior outside hitter Denise Ringwalt, once the season officially began, the girls began to better combine their talents and work together.\r\n\r\n\"I think the team this year was filled with extremely talented girls that worked together better and better as the season went on,\" Ringwalt said.\r\n\r\nOnly the Los Altos High School Eagles (22-15, 7-5), out of all of the teams in the De Anza League, were able to defeat the Vikings, who finished the league with a remarkable record of 11-1.\r\n\r\nThe season had several high points, including a nail-biting match against the Eagles in which the Vikings won each set 25-22, and shattered a three-year losing streak to the Eagles.\r\n\r\nDespite having an excellent season, Los Gatos High School Wildcats (20-16, 7-5) overpowered the Vikings in the Central Coast Section championship match. According to Ringwalt, the loss was unexpected and unfortunate for the hard working Vikings, and the injury of junior outside hitter Chelsea Fan was a key factor in the defeat.\r\n\r\n\"The CCS championships was a really difficult loss,\" Ringwalt said. \"The team worked really hard, but when Chelsea got hurt, everyone kinda fell apart.\"\r\n\r\nFan said despite not making it as far as she had hoped, she is proud of the team and what it accomplished this season.\r\n\r\n\"A couple injuries toward the end made it [the season] end a little sooner than it truly should have, but overall I'm happy with how far we went this year compared to previous seasons,\" Fan said.\r\n\r\nThe Vikings must say goodbye to many talented seniors, including setters Cassie Fong and Jessica Lee, and outside hitters Fiona Green and Katie Passarello. Fan said the seniors performed well throughout the year and will be tough to replace.\r\n\r\n\"The seniors were a huge part of our team this year and they contributed a lot on the court,\" Fan said. \"Next year we'll definitely have trouble filling their spots.\"\r\n\r\nThe team as a whole displayed excellent chemistry on and off the court, which was a significant strength and advantage. According to Fan, returning Paly players built upon chemistry that they formed during the previous year.\r\n\r\n\"A lot of girls who started this year played together last season so our on-court team chemistry was great,\" Fan said.\r\n\r\nThis chemistry will play a role in the strength of the Vikings next season, who will take their experience this year and continue to work to create another high-level team.","excerpt":"The Palo Alto High School volleyball team is celebrating  an impressive overall record of 23-11 and a successful season, which ended after a loss to the Turlock High School Bull Dogs (28-12, 10-2) in the first round of the States competition.","date":"2016-12-04 20:56:31","author":"William Sallomi","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/VB-VS-Gunn.jpg","categories":["Sports","Spotlight"],"tags":["CCS","Chelsea Fan","deedee ringwalt","season recap","sports","volleyball"]},{"id":126695,"title":"Verbatim: What&#8217;d you do over the Thanksgiving break?","permalink":"http:\/\/palyvoice.com\/2016\/12\/04\/verbatim-whatd-you-do-over-the-thanksgiving-break\/","content":"Last week, Palo Alto High School students and faculty enjoyed a break from school for the Thanksgiving holiday. The day they returned to school, The Paly Voice walked around campus to ask the Paly community what it did over the break.\r\n<img class=\"alwaysThinglink\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/860926233280512002\/1024\/10\/scaletowidth#tl-860926233280512002;1043138249'\" alt=\"\" \/><script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script>","excerpt":"Following the five day Thanksgiving break, The Paly Voice asked the students of Palo Alto High School about their Thanksgiving break.\r\n\r\n","date":"2016-12-04 20:29:04","author":"Kasra Orumchian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/tmp860926233280512002.jpg","categories":["Uncategorized"],"tags":["2016","palo alto","palo alto high school","paly","thanksgiving","thanksgiving break","verbatim","vikings"]},{"id":126777,"title":"Madrigal Feaste to take place in Performing Arts Center","permalink":"http:\/\/palyvoice.com\/2016\/12\/03\/madrigal-feaste-to-take-place-in-performing-arts-center\/","content":"&nbsp;\r\n\r\n[caption id=\"attachment_126786\" align=\"alignnone\" width=\"617\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15326583_878173125651771_4109063694938312295_n.jpg\"><img class=\" wp-image-126786\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15326583_878173125651771_4109063694938312295_n.jpg\" alt=\"The Madrigal cast in their costumes. Photo: Cas Caswell.\" width=\"617\" height=\"347\" \/><\/a> The Madrigal cast in their costumes. Photo: Michael Najar.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto High School Choir program will host its 50th annual Madrigal Feaste this Saturday and Sunday at 2 p.m. in the Performing Arts Center, otherwise known as Westminster Hall.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to choir member and senior Georgia Wood, the Feaste, which revolves around King Henry VII, will consist of a concert, play and dinner and will last two hours.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The Madrigal Feaste is our annual Christmas performance,” Wood said. “It includes not only songs from the various choral groups such as Concert Choir, Spectrum, Madrigals or the Acapella groups, but also a storyline surrounding King Henry the VIII and his court, and food served to the audience by freshman choir members.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to choir member and senior Alissa Bernstein, Paly alumna and current New York University student Grace Barry wrote this year's script. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The script, written by Grace Barry, is hysterical,\" Bernstein said. \"If you listen close enough, the dialogue references a lot of political figures and events, making the script a bit more engaging for the audience.\" <\/span>\r\n\r\nChoir member and senior Georgina Wu encourages everyone to attend.\r\n\r\n<span style=\"font-weight: 400;\">“The script is very cleverly written and super hilarious,” Wu said. “It’s probably the best one of all my four years at Paly, so everyone should come watch the show.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The price of admission ranges from $35 to $100, depending on how close the table is to the stage. Tickets are sold <\/span><a href=\"http:\/\/palychoirs.com\/2016\/11\/14\/14th-annual-madrigal-feaste\/\"><span style=\"font-weight: 400;\">here<\/span><\/a><span style=\"font-weight: 400;\">.<\/span>","excerpt":"The Palo Alto High School Choir program will host its 50th annual Madrigal Feast this Saturday and Sunday at 2 p.m. in the Performing Arts Center, otherwise known as Westminster Hall.","date":"2016-12-03 11:32:14","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/Madrigal-Poster-web-2016.jpg","categories":["News","Spotlight"],"tags":["alissa bernstein","choir","georgia wood","georgina wu","grace barry","madrigral feaste","performing arts center","wetminster hall"]},{"id":126255,"title":"Cross country impresses at States","permalink":"http:\/\/palyvoice.com\/2016\/12\/02\/cross-country-impresses-at-states\/","content":"This season, both the Palo Alto High School boys' and girls' cross country teams reached the Central Coast Section championship meet and advanced runners to the California Interscholastic Federation State championship meet in Fresno.\r\n\r\nThe boys' team finished second overall at CCS and 13th at the state meet, while the girls' team sent freshman Miranda Jimenez to the state meet, where she finished 135th.\r\n\r\nIndividually, senior Naveen Pai led the charge for the boys' team at the state meet, posting a time of 16:07.4 and finishing 48th overall.\r\n\r\n\"I was hurting after the climb but I knew I had to go for it to finish cross country strong,\" Pai said. \"I finished on a 5:07 so I'm proud of the effort I was able to give.\"\r\n\r\nSophomore Henry Saul capped off his breakout season, finishing second among the Paly boys at states.\r\n\r\n\"<span style=\"font-weight: 400;\">I think I was able to improve so much because I put in a lot of work in during the off season, I took off only two weeks after track before I started training hard again,\" Saul said. \"I think with a coach that made me run a lot more really helped me improve as a runner.\"<\/span>\r\n\r\nJimenez was the only member of the girls' team to advance to the state meet, where she posted a time of 20:10.1, finishing 135th overall.\r\n\r\n\"I'm so proud of Miranda's overall performance at States,\" co-head coach Michael Granville said.\r\n\r\nGranville is already looking forward to prepping the team for another strong season next year.\r\n\r\n<span style=\"font-weight: 400;\">\"Next season I look forward to coaching the student-athletes to practice daily,\" Granville said. \"Not just running but, teaching the importance of stretching, abdominal work and team unity.\"<\/span>\r\n\r\nThe loss of seniors Pai, Kent Slaney, Spencer Morganfeld and Ben Beaudry will hurt, but the core of Saul, juniors Sam Craig and Reed Foster will look to step up and fill the holes left by the seniors next year, according to Saul.\r\n\r\n\"I'll try to include a lot of the younger runners, and try not to overwork them,\" Saul said. \"I'm already pumped for next season.\"","excerpt":"This season, both the Palo Alto High School boys' and girls' cross country teams reached the Central Coast Section championship meet and advanced runners to the California Interscholastic Federation State championship meet in Fresno.","date":"2016-12-02 16:50:23","author":"Kasra Orumchian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/Screen-Shot-2015-11-27-at-6.38.22-PM.png","categories":["Cross Country","Sports","Spotlight"],"tags":["2016","boys cross country","CCS","cross country","girls cross country","kent slaney","palo alto","palo alto high school","paly","recap","season recap","sports","student","vikings"]},{"id":126670,"title":"Season Preview: CCS loss motivates girls&#8217; soccer","permalink":"http:\/\/palyvoice.com\/2016\/12\/02\/season-preview-ccs-finals-loss-motivates-girls-soccer\/","content":"[caption id=\"attachment_115393\" align=\"aligncenter\" width=\"659\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/GIRLS-SOCCER-Season-recap.png\"><img class=\" wp-image-115393\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/GIRLS-SOCCER-Season-recap.png\" alt=\"Paly class of 2016 alumnus Alison Lu dribbles the ball in a league match against Homestead High School. Lu, who now plays collegiate soccer at Williams College, was an essential piece to last years success. Photo by Ethan Kao.\" width=\"659\" height=\"494\" \/><\/a> Paly class of 2016 alumnus Alison Lu dribbles the ball in a league match against Homestead High School. Lu, who now plays collegiate soccer at Williams College, was an essential piece to last years success. Photo by Ethan Kao.[\/caption]\r\n\r\nAfter a riveting 4-3  loss to Archbishop Mitty High School Monarchs (14-2-5, 8-1-3)in the first round of the Central Coast Section playoffs last season, the Palo Alto High School (16-2-1, 10-1-1) girls’ soccer team hopes to make another playoff run despite the loss of key seniors.\r\n\r\nPaly has turned the, 4-3, loss to Archbishop Mitty into a source of motivation, according to senior forward Tess Preising.\r\n\r\n“The outcome of the game wasn’t the result we wanted but we definitely learned a lot throughout the season,” Preising said. “It was a game we had a very good chance of winning but I think the team got stronger and even more motivated because of the experience. We are definitely looking to win [CCS] this year.”\r\n\r\nAccording to senior defender Lauola Amanoni, the loss of last year’s seniors Jacey Pederson, Heidi Moeser and Allison Lu will greatly affect the leadership of the team, but this year’s returning upperclassmen are prepared to fill those roles.\r\n\r\n“They [Pederson, Moeser, and Lu] were a huge part of our success last year and we’ll definitely miss them but we have many players such as Tess [Preising], Talia [Malchin], and Emily [Tomz] who are ready to take over with leadership,”Amanoni said.\r\n\r\nIn addition, the team will be just as competitive as last season due to the addition of talented underclassmen, according to Preising.\r\n\r\n“We lost some good talent but we have many new players that can fill their spots,” Preising said. “[freshman forward] Chloe Japić is someone to definitely watch for.”\r\n\r\nPreising said the team's biggest weakness is its lack of chemistry due to new players.\r\n\r\n“I think the weakness right now is that we are all not very comfortable with each other on the field and don’t know each other's strengths or weaknesses yet,” Preising said. “Hopefully through more practice, we will get better and more cohesive in our play.”\r\n\r\nThe Vikings will take on rivals, Menlo-Atherton High School, at 2:30 p.m. on Saturday at Paly.","excerpt":"After a riveting, 3-2, loss to Mountain View High School in the Central Coast Section championship match last season, the Palo Alto High School girls’ soccer team hopes to make another playoff run despite the loss of key seniors.","date":"2016-12-02 09:42:54","author":"Ethan Kao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/GIRLS-SOCCER-Season-recap.png","categories":["Sports","Spotlight","Uncategorized"],"tags":["almost","amazing","but","cccs","CCS","finals","football","girls","great","jacey pederson","mountain view","no","Soccer","tess","won"]},{"id":126517,"title":"&#8216;Loving&#8217;: What&#8217;s not to love?","permalink":"http:\/\/palyvoice.com\/2016\/12\/01\/loving-whats-not-to-love\/","content":"[caption id=\"attachment_126666\" align=\"alignnone\" width=\"430\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/1475626768_focusfeatures_loving_jeffnichols_joeledgerton_ruthnegga_voteloving_instagram1.jpg\"><img class=\" wp-image-126666\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/1475626768_focusfeatures_loving_jeffnichols_joeledgerton_ruthnegga_voteloving_instagram1.jpg\" alt=\"Ruth Negga and Joel Edgerton star in the latest historical film 'Loving'. Photo: Focus Features\" width=\"430\" height=\"430\" \/><\/a> Ruth Negga and Joel Edgerton star in the latest historical film 'Loving'. Photo: Focus Features[\/caption]\r\n\r\nDid you know that interracial marriage wasn’t always legal in the United States? In the non-fiction, historical-drama film , 'Loving,' directed by Jeff Nichols, the audience follows two main characters — a black woman, Mildred, and a white man, Richard — who fall in love and want to get married despite obstacles; however, it’s not that simple.\r\n\r\n<span style=\"font-weight: 400;\">Both lived most of their lives in the small town of Central Point, Virginia, which takes place in the late 1960's, where interracial marriage was illegal at the time, and one was only allowed to marry someone of his or her own race. The movie is told through Mildred and Richard’s eyes. While they are living in Virginia, police arrest them in their own home, in the middle of the night, for breaking the anti-miscegenation laws of their state. They move to the nation’s capital, Washington, D.C., to get married and to raise their three children. Little did they know that during this time, with the rise of the Civil Rights Movement, their experience with the law would be a gateway to make a change for equality.<\/span>\r\n\r\nBoth Joel Edgarton and Ruth Negga do a satisfying job in their roles as Richard and Mildred. They have good chemistry on emotional scenes, such as, powerful expressions on their faces so the audience would figure out what they were feeling, some could see them working together in the future. Bernie Cohen, played by Nick Kroll, is the lawer who picks up this case. This character plays as comic relief because he is an ackward person as a result of the words he uses and his posture on scene, which is what Nichols is going for. His partner Phill Bass, played by Jon Bass, is the more serious lawer that keeps him in check. Both of these characters do a good job of creating suspense in the film.\r\n\r\n<span style=\"font-weight: 400;\">As the story unfolds, the audience can't help but side with and cheer on the couple because of the connection they have and everything they have been through. Some people at the time got harassed for being in a multi-racial relationship; they were judged by peers and loved ones. The love that Mildred and Richard share for each other and the conflicted emotions that others have toward them make it clear that this story is going to pull at some heartstrings. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Movie's cinematographer Adam Stone, portrays police in the movie as villains who will do anything to get the protagonists in jail. Stone uses dark lighting and body language well with these characters, highlighting the use of their aggressive nature and atmosphere that is apparent.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">However, throughout the movie it was hard to understand the dialogue between characters because of their accents and soft voices, which some could argue made the movie more realistic, but at times made the conversations harder to understand.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">As the movie continues, you feel the injustice of these laws. The government is dictating who people are allowed to love and marry. Mildred and Richard are everyday people who weren’t looking for fame or publicity but rather just wanted what most of us desire, a person to love and be with forever and a chance at happiness. This movie is a must see for those looking for good character development, an authentic snapshot of that time and an emotionally uplifting story that will put you in the shoes of the people who fought against the law.<\/span>\r\n\r\n<strong>Loving<\/strong>\r\n\r\n<strong>Rating: PG-13<\/strong>\r\n\r\n<strong>Run time: 123 minutes <\/strong>\r\n\r\n<strong>Director: Jeff Nichols<\/strong>\r\n\r\n<b>Actors\/Actresses: Joel Edgerton as Richard, Ruth Negga as Mildred,  Michael Shannon as Grey Villet, Nick Kroll as Bernie Cohen, Marton Csokas as Sheriff Brooks, Alano Miller as Raymond Green, and Jon Bass as Phil Bass<\/b>","excerpt":"Did you know that interracial marriage wasn’t always legal in the United States? In the non-fiction, historical-drama film , 'Loving,' directed by Jeff Nichols, the audience follows two main characters — a black woman, Mildred, and a white man, Richard — who fall in love and want to get married despite obstacles; however, it’s not that simple.","date":"2016-12-01 19:15:53","author":"Bradley Smith","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/1475626768_focusfeatures_loving_jeffnichols_joeledgerton_ruthnegga_voteloving_instagram.jpg","categories":["Entertainment"],"tags":["history","Loving","movie review"]},{"id":126680,"title":"Sculpture program to hold second glass sale of the year","permalink":"http:\/\/palyvoice.com\/2016\/12\/01\/sculpture-program-to-hold-second-glass-sale-of-the-year\/","content":"<span style=\"font-weight: 400;\">Palo Alto High School’s glass blowing program is hosting a holiday glass sale on Friday, Dec. 2, and Saturday, Dec. 3, in the Tower Building. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The sale will be open tomorrow from 3 to 6 p.m., and will continue on Saturday from 11 a.m. to 4 p.m.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to glass blowing instructor Steve Ferrera, this is the program’s second and, traditionally, the biggest sale of the year.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We have a whole bunch of glass for sale,” Ferrera said. “Holiday items, cups, vases, goblets, elephants, cats, hearts, seashells, snails. It’s a huge assortment of glass items [at] all different prices.”<\/span>\r\n\r\n[caption id=\"attachment_126684\" align=\"alignright\" width=\"498\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15310588_361267514218387_1663107699_n.jpg\"><img class=\"wp-image-126684\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15310588_361267514218387_1663107699_n.jpg\" alt=\"15310588_361267514218387_1663107699_n\" width=\"498\" height=\"351\" \/><\/a> Trees and Christmas ornaments are among the items that will be sold on Friday and Saturday. Photo by Maya Reuven.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Work from a variety of artists will be available for purchase, the majority of which are created by glass blowing teachers.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“<\/span><span style=\"font-weight: 400;\">The work is not student work, but students can sell their own work, and they can keep all the money from that,” Ferrera said.<\/span> <span style=\"font-weight: 400;\">“Most of it [the glass] is blown by the instructors, Peter and Dana, our TAs, myself, and a few other professional glass blowers.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">While student artists get to keep their profits, the rest of the proceeds will go towards funding Paly’s sculpture program.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Our program is mostly self-funded, so we really rely on these sales to keep the program going,” Ferrera said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The sculpture program is beloved by many students, including Paly junior and advanced ceramics and sculpture student Julia Doubson, making the funding a critical issue.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Paly's sculpture program enables students to create many forms of art,” Doubson said. “Having the opportunity to blow glass at school is a very unique experience that we're lucky to have.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">If the artwork itself is not incentive enough to stop in, complementary snacks and beverages will also be provided.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We have cookies and hot apple cider,” Ferrera said.<\/span>","excerpt":"Palo Alto High School’s glass blowing program is hosting a holiday glass sale on Friday, Dec. 2, and Saturday, Dec. 3, in the Tower Building.","date":"2016-12-01 18:45:13","author":"Maya Akkaraju","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15310588_361267514218387_1663107699_n.jpg","categories":["News","Spotlight"],"tags":["art","artists","fundraiser","glass","glass blowing","holiday","sale","sculpture"]}]