[{"id":113825,"title":"Community shares memories amid teacher&#8217;s passing","permalink":"http:\/\/palyvoice.com\/2016\/01\/22\/community-shares-memories-amid-teachers-passing\/","content":"The Palo Alto community is sharing its memories of Palo Alto High School science teacher Kenyon Scott, <a href=\"http:\/\/palyvoice.com\/2016\/01\/07\/community-mourns-teacher-death\/\">who died of unidentified natural causes on Jan. 6 in his home.<\/a> Photos by William Zhou, Bianca Al-Shamari, Sam Lee and Takaaki Sagawa.\r\n\r\n<iframe src=\"\/\/www.cincopa.com\/media-platform\/iframe.aspx?fid=AILABMtesoWk\" width=\"600\" height=\"430\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n&nbsp;","excerpt":"The Palo Alto community is sharing its memories of Palo Alto High School science teacher Kenyon Scott.","date":"2016-01-22 16:34:16","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Reaction-.jpg","categories":["Multimedia","News"],"tags":["apes","Death","Kenyon Scott","Kenyonn Scott","loss","palo alto high shcool","paly","passing","Scott","Teacher"]},{"id":114077,"title":"Trust and Respect: Remembering Kenyon Scott","permalink":"http:\/\/palyvoice.com\/2016\/01\/22\/trust-and-respect-remembering-kenyon-scott\/","content":"[caption id=\"attachment_113826\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Screen-Shot-2016-01-07-at-2.12.19-PM.png\"><img class=\"wp-image-113826 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Screen-Shot-2016-01-07-at-2.12.19-PM.png\" alt=\"Screen Shot 2016-01-07 at 2.12.19 PM\" width=\"600\" height=\"453\" \/><\/a> Advanced Placement Environmental Science teacher Kenyon Scott takes a selfie with his fourth period APES class during the final week of classes last year. It was his enthusiasm and personal connections with students that made him a remarkably special teacher. Photo: Bryce Rockwell.[\/caption]\r\n\r\nWhen students, faculty and friends gather in the Media Arts Center at Palo Alto High School on Saturday to mark the passing of science teacher Kenyon Scott, they will be celebrating a man whose passion for teaching impacted many community members' lives.\r\n\r\n<span style=\"font-weight: 400;\">Mr. Scott passed away due to natural causes on the morning of Jan. 6, 2016, at his residence in Palo Alto. He was 60. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to students, colleagues, and family, Scott was an optimistic, energetic man who always maintained a passion for teaching students in a classroom environment filled with infectious laugher. He cared for his students in a uniquely powerful way by celebrating each person as an individual. <\/span>\r\n\r\n\"He was a really nice teacher who respected his students and treated them with patience and respect,\" junior Spencer Wycoff said. \"He was always with a smile and trying to make people happy in his class.\"\r\n\r\n<span style=\"font-weight: 400;\">One of Mr. Scott's well-known and loved mantras,<\/span><span style=\"font-weight: 400;\"> “trust and respect,” emphasized his philosophy of care between students and their teachers. On campus, he could be found actively participating in staff and school-wide events, annually drawing repeated chants of “Mr. Scott!” at the Staff Dance during Spirit Week. When he saw his students outside of the classroom, he never failed to greet them by name and give them a smile.<\/span>\r\n\r\n\"I didn’t think of him as a teacher, but a really close friend,\" senior Dami Bolarinwa said. \"He was someone who I could talk to about problems.\"\r\n\r\n<span style=\"font-weight: 400;\">The Paly Voice sat down and spoke with one of his two daughters, Emily Scott, a special education instructional aide at Paly, about her father's life growing up. Born on June 24, 1955, in San Jose, Mr. Scott’s dream job as a child was to be president of the United States. Rather than sleeping with a pillow, he spent most nights with Jojo,<span style=\"color: #007f00;\"> <\/span>his beloved stuffed animal monkey, the younger Scott said, adding that she recalled that her father's family made an appearance on one of the early episodes of Family Feud; the Scott family was eliminated after his brother Jon Scott was unable to correctly identify a Jewish holiday. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Mr. Scott could be found during his childhood summers working at Bay Meadows, a horse racing track in San Mateo that closed in 2008. He graduated from Pioneer High School in San Jose before attending the University of California at Berkeley, where he majored in Earth Sciences. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Those that were close to him, especially his high school students, know just how attached he was to exploring the outdoors and spreading awareness about environmental issues. He rode his bike to Paly every morning alongside hundreds of students, even during the rainy season when many students would catch a ride with their parents during a downpour. In class, he wouldn’t hesitate to put lessons on hold to discuss and monitor current environmental events going on at a local or even international level. He valued the importance of not just teaching his students about the environment, but encouraging them to apply classroom lessons to the real world. Many of his extra credit assignments involved researching newsworthy environmental topics or going to the Palo Alto Baylands to explore natural habitats. <\/span>\r\n\r\n\"When we would go on trips he would always stop and look at rocks,\" Emily Scott recounted. \"He was very into rocks and fossils.\"\r\n\r\n<span style=\"font-weight: 400;\">His first job teaching was at Charles Armstrong School in Belmont, a school for children with special needs, according to his daughter. It was during this time when he met his wife, Katherine, to whom he was married to for approximately 18 years until their divorce. Outside of teaching, he loved doing crossword puzzles, reading newspapers, discovering new music and playing games with his two daughters. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">At Paly, he taught a variety of subjects including physics, chemistry, and most notably, Advanced Placement Environmental Science, popularly for over 18 years, beginning in 1985. According to his daughter, he left Paly in 1991 to work for Apple in the technology industry before returning to the classroom in 2003. He supervised numerous clubs over the course of his time at Paly, and was the Paly Environmental Club adviser at the time of his passing. He also served as Paly’s student activities director in the late 1980s. <\/span>\r\n\r\n“It’s a huge loss for our community and our school,” Paly principal Kim Diorio said. “He was a great man, great teacher. I’m personally going to miss him tremendously.”\r\n\r\n<span style=\"font-weight: 400;\">In addition to his meaningful lessons in science, Mr. Scott will be widely remembered for his classroom traditions. On Friday afternoons, he would lead his classes in a “TGIF” chant to celebrate the beginning of the weekend. His most beloved teaching tradition is simply known as “The Clap.” To begin class, he would stand up in the front of the room and start clapping in a rhythm that his students would soon replicate in unison. After a few rounds of clapping, he would welcome his class and begin doing what he did best, helping high school students become not just smarter thinkers, but better people.<\/span>\r\n\r\nHe is survived by his parents, Joan and Jerry Scott; sister Laurie Burmeister; brothers Joe and Jon Scott; daughters Emily and Elizabeth Scott; and his partner, Sara Tanous.\r\n\r\n<span style=\"font-weight: 400;\">Students and colleagues say it will be a long time before we come across another teacher who leads the clap, spreads environmental optimism and inspires students the way Mr. Scott did. <\/span>\r\n\r\n\"People loved him, and I don't think he will be forgotten,\" junior Emily Read said. \"[Principal] Kim Diorio came to visit our class, and she was in tears. She was crying so hard, and I could see the connection that he had made being here for so long. He impacted so many people.\"\r\n\r\n<span style=\"font-weight: 400;\"><span class=\"aBn\" tabindex=\"0\" data-term=\"goog_1182669811\"><span class=\"aQJ\">Saturday’s<\/span><\/span> celebration of life event for Mr. Scott, originally scheduled for the Quad but moved to the MAC out of concern for the weather, will begin at <span class=\"aBn\" tabindex=\"0\" data-term=\"goog_1182669812\"><span class=\"aQJ\">2 p.m.<\/span><\/span> Attendees are encouraged to wear blue and gold clothing, the colors of his alma mater, UC Berkeley.<\/span>","excerpt":"Recently, Palo Alto High School lost one of its most beloved teachers, Kenyon Scott. The Paly Voice celebrates and reflects on the life of a motivational man who inspired students and teachers alike with his passionate personality.","date":"2016-01-22 15:34:55","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/0000\/00\/mrscott.jpg","categories":["Editor's Pick","Features","Spotlight"],"tags":["advanced placement","ap","ap environment science","apes","clap","Kenyon","Kenyon Scott","obituary","science","Scott","selfie","tgif","trust and respect"]},{"id":114106,"title":"Parent starts El Niño evacuation program","permalink":"http:\/\/palyvoice.com\/2016\/01\/21\/parent-starts-el-nino-evacuation-program\/","content":"[caption id=\"attachment_114541\" align=\"alignright\" width=\"613\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/2.jpg\"><img class=\"wp-image-114541\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/2.jpg\" alt=\"2\" width=\"613\" height=\"367\" \/><\/a> In the past, extensive periods of rain has caused flooding both at Palo Alto High School and the nearby Town &amp; Country Village where many students go to for lunch. Photo by William Zhou.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">In light of the increase of rain from El Niño, a Palo Alto High School parent is aiming to provide shelter for Paly families at risk of flooding. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Paly parent and founder, Liz Lee, the unofficially named “Paly Matching Program” works to connect families who are willing to provide shelter with those who need it. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Lee started the program because her own house was at risk. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I just started this [program] because my family lives in a flood zone and may need emergency shelter,” Lee said. “I figured that other Paly families may also [be in a flood zone], so that’s how I got the idea.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The matching program will be especially useful as hotels, which could be used as flood shelters, become harder to book, according to Lee. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“<\/span><span style=\"font-weight: 400;\">If it [flooding] happens during Super Bowl weekend on Feb. 7, lodging is expected to booked up as far off as Modesto,” Lee said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Lee believes there are many ways for families to prepare for flooding. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“My husband and I attended some emergency preparedness meetings put on by the San Francisquito Joint Powers Authority (JPA),” Lee said. “They recommend that all families in high flood risk areas have a plan for where to stay with a relative or friend in case they are evacuated. It’s important because if flooding coincides with a Baylands supertide, flooding could be worse.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Additionally, families can gather supplies, according to Lee. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It’s better to have a plan and not need it,” Lee said. “People can prepare if they live in a flood zone by stocking on emergency supplies like flashlights, candles, bottled water, canned food for people and pets, other supplies like a wrench in case they need to turn off their gas and knowing how to turn it off.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Other preparations include purchasing plastic tarps and sandbags, putting things high up off the ground, and arranging for pet care, according to Lee. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Those who are interested in either providing or seeking shelter can contact Lee at <\/span><a href=\"mailto:liz@funghi.com\"><span style=\"font-weight: 400;\">liz@funghi.com<\/span><\/a><span style=\"font-weight: 400;\">. <\/span><span style=\"font-weight: 400;\"> <\/span>","excerpt":"In light of the increase of rain that El Niño brings, a Palo Alto High School parent is aiming to provide shelter for Paly families at risk of flooding.","date":"2016-01-21 18:14:35","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/2.jpg","categories":["News","Spotlight"],"tags":["El nino","evacuation","flood","high school","palo alto","paly"]},{"id":114557,"title":"Teachers defeat students at Winter Rally","permalink":"http:\/\/palyvoice.com\/2016\/01\/21\/teachers-defeat-students-at-winter-rally\/","content":"The teachers defeated the senior class at the first student vs. staff soccer game during the Winter Rally last week. The final score was 3-2.\r\n\r\n<span style=\"font-weight: 400;\">Due to current <a href=\"http:\/\/palyvoice.com\/2015\/09\/02\/video-big-gym\/\">gym renovations<\/a>, this was the first Winter Rally to feature an outdoor event instead of a traditional basketball game inside a gym.<\/span>\r\n\r\n\"I think we adjusted really well to not having our gym,\" Junior Class President Noa Ben-Efraim said.\r\n\r\n<span style=\"font-weight: 400;\">After falling behind in the first half, the teachers took the lead in the closing minutes with a goal. Senior goalie Matt O’Reilly was disappointed with the game's final outcome but thinks the students played well overall. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I don’t think the game went quite as expected,\" O'Reilly said. \"We were hoping to win. But I think our team played really well, we just had a couple defensive miscues and I think the teachers also played really well. They took advantage of their opportunities. I just wish we hadn’t let in that one right in the end.”<\/span>\r\n\r\nTeacher Chris Farina says he enjoyed the game and thought that the staff played well.\r\n\r\n“It was fun to have a back and forth game,\"Farina said. \"We had a good number of goals, kept it pretty exciting. I thought the staff did a good job sticking to our game plan and not doing anything too dumb.”\r\n\r\n<iframe src=\"\/\/www.cincopa.com\/media-platform\/iframe.aspx?fid=A8CAGNtZc-sn\" width=\"600\" height=\"430\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The teachers defeated the senior class at the first student vs. staff soccer game during the Winter Rally on Thursday. The final score was 3-2. ","date":"2016-01-21 18:13:06","author":"Annika Behal","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/unnamed.jpg","categories":["News"],"tags":["chris farina","Matt O'Reily","soccer game","student v.s. staff","students","teachers","teachers v.s. students","winter rally"]},{"id":114569,"title":"Girls&#8217; basketball dominates Los Altos","permalink":"http:\/\/palyvoice.com\/2016\/01\/21\/girls-basketball-dominates-los-altos\/","content":"[caption id=\"attachment_114575\" align=\"alignnone\" width=\"700\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/LK-WITH-THE-SHOT-BOY.jpg\"><img class=\"size-full wp-image-114575\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/LK-WITH-THE-SHOT-BOY.jpg\" alt=\"Junior guard Lauren Koyama drives to the basket in the second quarter against Los Altos High School. The Vikings went on to win 69-31. Photo by Sam Lee.\" width=\"700\" height=\"698\" \/><\/a> Junior guard Lauren Koyama drives to the basket in the second quarter against Los Altos High School at Gunn. The Vikings went on to win 69-31. Photo by Sam Lee.[\/caption]\r\n\r\nThe Palo Alto High School girls’ basketball team (10-6, 3-2) blew out the Los Altos Eagles (10-5, 1-2) with a 69-31 victory on Friday at Gunn High School.\r\n\r\nAfter coming off of a devastating three-point loss to Saratoga High School last Tuesday, the Vikings bounced back with a strong performance against Los Altos.\r\n\r\n“It feels great because we haven’t been playing great lately, and we clicked this game,” sophomore guard Carly Leong said.\r\n\r\nVikings head coach Scott Peters emphasized how overall team hustle made a difference against the Eagles.\r\n\r\n“It wasn’t as much about the win, but about how we played,” Peters said. “We played hard and there was a sense of joy as we played.”\r\n\r\nThe game started off competitively, with the Vikings holding onto a 17-15 lead by the end of the first quarter. Leong led the Vikings early on, scoring seven out of her 13 total points in the first quarter.\r\n\r\nThe Vikings extended their lead in the second half, scoring 18 in the third quarter and 20 in the fourth.\r\n\r\nTransitioning and rebounding were major keys to routing Los Altos, according to junior guard Lauren Koyama, who scored 10 points in the game.\r\n\r\n“We usually don’t offensively transition or rebound that well, so improving on those factors were significant to the win,” Koyama said.\r\n\r\nThe Vikings began to edge away in the second quarter as shots started to go in, according to Leong.\r\n\r\n“W<span style=\"font-weight: 400;\">e hadn't been playing great lately and we clicked this game<\/span>,” Leong said. \"My threes were going in and we were doing well.\"\r\n\r\nSenior forward Courtney Lovely also racked up eight points in the second quarter, putting Paly up 13 points by halftime.\r\n\r\nThe team played well as a unit, according to senior center Alexis Harris, who returned to the lineup from a leg injury.\r\n\r\n“I think it was a good win today,” Harris said.\r\n\r\nThe Vikings play next against Wilcox High School at 7 p.m. on Tuesday at Gunn.\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School girls’ basketball team (10-6, 3-2) trounced over Los Altos High School (10-5, 1-2) with a 69-31 domination on Friday at Gunn High School. \r\n","date":"2016-01-21 10:31:31","author":"Sam Lee","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Untitled-1.jpg","categories":["Sports"],"tags":["alexis harris","ball","basketball","carly leong","courtney lovely","girls","hustle","lauren koyama","los altos","maddy atwater","paly","rebound","scott peters","sports","team","transition","vikings","win"]},{"id":114598,"title":"Video: Staff defeats students in Winter Rally soccer game","permalink":"http:\/\/palyvoice.com\/2016\/01\/20\/video-staff-defeats-students-in-winter-rally-soccer-game\/","content":"With ongoing gym construction at Palo Alto High School, the 2016 Winter Rally featured a staff-vs.-student soccer game. The staff beat the seniors, 3-2, and the Associated Student Body announced the Prom 2016 location to be the Design Galleria in San Francisco. Watch the highlights of the game.\r\n\r\nhttps:\/\/youtu.be\/QhNuIAZT9xg\r\n\r\n&nbsp;","excerpt":"With ongoing gym construction, Winter Rally 2016 featured a staff vs. student soccer game. The staff beat the seniors 3-2 and the Associated Student Body announced the Prom 2016 location to be the Design Galleria in San Francisco. Watch the highlights of the game.\r\n\r\n \r\n","date":"2016-01-20 22:58:58","author":"Aisha Chabane","categories":["News"],"tags":["paly cheer","paly dance","seniors vs. staff","Soccer","winter rally 2016"]},{"id":114605,"title":"Power outage affects Palo Alto community","permalink":"http:\/\/palyvoice.com\/2016\/01\/20\/power-outage-affects-palo-alto-community\/","content":"[caption id=\"attachment_114606\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12575823_784888971616653_143733276_n.jpg\"><img class=\"wp-image-114606\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12575823_784888971616653_143733276_n.jpg\" alt=\"Students gather at the football field after a fire alarm went off. According to Assistant Principal Jerry Berkson, the alarm was set off by rewiring the electricity. Photo by Adele Bloch\" width=\"600\" height=\"276\" \/><\/a> Students gather at the football field after a fire alarm went off during third period at Palo Alto High School. According to Assistant Principal Jerry Berkson, rewiring of the electricity set the alarm off. Photo by Adele Bloch.[\/caption]\r\n\r\nMore than 5,000 citizens at Palo Alto High School and surrounding neighborhoods are regaining power after a power outage occurred this morning.\r\n\r\nAccording to the City of Palo Alto Utilities Twitter account, 2,921 people, not including teachers and students at Paly, lost power in various neighborhoods around Palo Alto. City utility workers restored power at around 11:07 a.m. after a blown fuse caused the outage at 10:20 a.m. While the majority of Paly's electricity is restored, several buildings continue to lack full power as of 4:00 p.m.\r\n\r\n“There are still a few spots in the math department and the 800s Building that are not working yet,” Assistant Principal Jerry Berkson said.\r\n\r\nPower went out sporadically around Paly, with classrooms across campus losing power.\r\n\r\n“It [the outage] is kind of weird because it’s school-wide,” Berkson said. “But it’s not all school-wide and it’s not necessarily all of one building. Some of the building might have electricity, some of one might not.”\r\n\r\nAt Paly, classes were disturbed by both the outage and a fire alarm that went off during fifth period. According to Berkson, the fire alarm was a side effect of restoring the electricity.\r\n\r\nDespite the disturbance caused by the outage, Berkson feels that Paly is all right.\r\n\r\n\"There are a few rooms that are still lacking light,\" Berkson said. \"But for the most part the school’s set.\"","excerpt":"More than 5,000 citizens at Palo Alto High School and surrounding neighborhoods are regaining power after a power outage occurred this morning.\r\n","date":"2016-01-20 21:20:51","author":"Jackson Doerr","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12575823_784888971616653_143733276_n-2.jpg","categories":["News","Spotlight"],"tags":["electricity outage","outage","paly","power outage"]},{"id":114266,"title":"County opens nation&#8217;s first LGBTQ Affairs Office","permalink":"http:\/\/palyvoice.com\/2016\/01\/19\/county-opens-nations-first-lgbtq-affairs-office\/","content":"[caption id=\"attachment_114467\" align=\"aligncenter\" width=\"680\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/2296055722_3ab87f0f1a1.jpg\"><img class=\" wp-image-114467\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/2296055722_3ab87f0f1a1.jpg\" alt=\"The Santa Clara County gov prepares to open a new LGBTQ Office of Affairs to the public on Jan 19. Photo courtesy of Santa Clara County government website.\" width=\"680\" height=\"476\" \/><\/a> The Santa Clara County government center will house a new LGBTQ Affairs Office similar to previous efforts to reach out to other minority groups. Photo: Santa Clara County government website.[\/caption]\r\n\r\nSanta Clara's County opens the first office of Lesbian, Gay, Bisexual, Transgender and Questioning Affairs in the nation today, Jan. 19 at the county government center.\r\n\r\nSanta Clara’s LGBTQ Affairs office will serve the community by assisting local community members with services such as the health and hospital system, reentry services, probation, corrections and social services, according to office manager Maribel Martinez. The office will train staff members on LGBTQ issues and provide case-specific assistance, according to Santa Clara County supervisor Ken Yeager.\r\n\r\nThe office employees hope that the establishment of the office will inspire all counties to open similar offices, according to Yeager.\r\n\r\n“For many years, Santa Clara has been a leader in addressing the needs of underserved populations that require the services of the county,” Yeager said. “It is my hope that by establishing the nations first county office dedicated to the needs of LGBTQ residents, Santa Clara County will serve as an example for other counties looking to do the same.”\r\n\r\nIn March 2015, Yeager sent a referral to the Board of Supervisors for the creation of the LGBTQ office.  The board approved the plan and funded it later in the summer, officially establishing the office on Jan. 7, according to Yeager.\r\n\r\nAccording to Yeager, the office will be led by Martinez and management analyst Ashley Scarborough.\r\n\r\nMartinez is a director of the associated students at San Jose State University, while Scarborough works for the California STD and HIV Prevention Training Center in Oakland.\r\n\r\n“I hope to continue to serve as an advocate for community needs and a bridge to services,” Martinez said. “Also, I hope to support local leaders in creating programs, services and policies that create a just and welcoming community for all residents.”\r\n\r\nCounty officials hope this opportunity will improve the lives of the LGBTQ community in Santa Clara County, according to Yeager.\r\n\r\n“In recent years, the county has created individual offices to serve women, veterans, racial and ethnic minorities and soon immigrants,” Yeager said. “By focusing particular attention on these groups, we are able to better serve them.  It is my hope that this will be the case with the office of LGBTQ affairs.”","excerpt":"Santa Clara County’s Lesbian, Gay, Bisexual, Transgender, and Questioning Affairs office, the first county office in the nation, will be opening on Jan. 19 at the county government center.","date":"2016-01-19 21:02:29","author":"Zahra Muzaffar","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/2296055722_3ab87f0f1a1.jpg","categories":["News"],"tags":["bisexual","board","county","establishment","first office","gay","Ken Yeager","lesbiang","lgbtq","Maribel Martinez","office","questioning","santa clara","santa clara county","transgender"]},{"id":114404,"title":"Wrestling to compete at first home dual meet","permalink":"http:\/\/palyvoice.com\/2016\/01\/19\/wrestling-to-compete-at-first-home-dual-meet\/","content":"[caption id=\"attachment_114527\" align=\"alignnone\" width=\"558\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Screen-Shot-2016-01-19-at-9.12.25-AM.png\"><img class=\" wp-image-114527\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Screen-Shot-2016-01-19-at-9.12.25-AM.png\" alt=\"Sophomore Calvin Grewal, freshman [[]], junior Seth Goyal and freshman [[]] pose for a picture after placing at the \" width=\"558\" height=\"429\" \/><\/a> Sophomore Calvin Grewal, freshman Andrew Wang, junior Seth Goyal and freshman Callum Day Ham pose for a picture after placing at the Bianchini Varsity Tournament. According to coach Jonathan Kessler, Goyal was awarded with the title \"Most Outstanding Wrestler.\" Photo by Kessler.[\/caption]<span style=\"font-weight: 400;\">After a strong showing in the <\/span><span style=\"font-weight: 400;\">Bianchini Varsity Tournament, the Palo Alto High School Wrestling team is gearing up for its first home dual meet tomorrow at Gunn High School, the team's home gym for the season.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Junior Seth Goyal won the 132-pound weight class and was voted \"Most Outstanding Wrestler\" at the Bianchini Varsity tournament, according Kessler. <\/span><span style=\"font-weight: 400;\">Other notable performances include sophomore Calvin Grewal, who won the consolation final for the 113-pound bracket. Freshman Andrew Wang took 5th place in the 120-pound bracket, while freshman Callum Day Ham placed 6th in the 106-pound weight class.<\/span>\r\n\r\n“We are happy with the way the team competed there,” coach Jonathan Kessler said. “We only entered five wrestlers in the Cupertino Bianchini Varsity tournament. Four of the five wrestlers competed in their first varsity tournament.”\r\n\r\n<span style=\"line-height: 1.5;\">Despite these wins, Kessler says that the season has been tough so far with wrestlers quitting and getting injured.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Most of our varsity lineup is comprised of freshmen,” Kessler said. “This gives them an opportunity to start their varsity career at an early age.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Goyal, the team has been training hard in practice for its first home dual meet against Los Gatos High School.<\/span>\r\n\r\n“We believe our wrestlers have a chance at winning their respective weight classes but they understand nothing is given in this sport,” Kessler said.\r\n\r\n<span style=\"font-weight: 400;\">The Vikings will face off against Los Gatos at 6:30 p.m. tomorrow at Gunn. <\/span>","excerpt":"After a strong showing in the Bianchini Varsity Tournament on Saturday, the Palo Alto High School Wrestling team is gearing up for its first home dual meet tomorrow at Gunn High School, the team's home gym for the season.\r\n","date":"2016-01-19 11:24:19","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Screen-Shot-2016-01-15-at-5.55.17-PM.png","categories":["Sports"],"tags":["goyal","jonathan","kessler","paly","seth","tournament","wrestling"]},{"id":114454,"title":"Boys&#8217; soccer routs Mountain View","permalink":"http:\/\/palyvoice.com\/2016\/01\/18\/boys-soccer-routs-mountain-view\/","content":"[caption id=\"attachment_114456\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/IMG_7940.jpg\"><img class=\"size-full wp-image-114456\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/IMG_7940.jpg\" alt=\"Senior outside defender Roberto Sotelo slides to keep the ball in bounds during the second half of the Vikings' game against Mountain View High School.\" width=\"600\" height=\"425\" \/><\/a> Senior outside defender Roberto Sotelo slides to keep the ball in bounds during the second half of the Vikings' game against Mountain View High School. Sotelo assisted on one goal against the Spartans. Photo by Emma van der Veen.[\/caption]\r\n\r\nThe Palo Alto High School boys' soccer team (8-0-1, 4-0) dominated the Mountain View High School Spartans (5-2-4, 0-1-1) on Friday at the Paly soccer field by a score of 5-0.\r\n\r\nThe Vikings controlled the ball throughout the game, using possession to keep the other team chasing them. According to head coach Don Briggs, this allowed him to change the lineup later in the game, when Paly was leading 3-0.\r\n\r\n“We were able to possess the ball when we needed to,” Briggs said. “Ten minutes into the second half, we started putting people in different positions. Doing that is actually good for them because it gives them the chance to work on different things.”\r\n\r\nThe Vikings took advantage of their offensive opportunities much better than in previous matches, with goals by senior midfielder Cole Tierney, senior defender Cam Huard, senior forward Max Hallberg, senior midfielder Dami Bolarinwa and senior forward Ariya Momeny.\r\n\r\n“We got five goals and we capitalized on most of our opportunities, which is an improvement from our other games,” Tierney said. “I definitely have more confidence now and I think a lot of people do because there was a wealth of goals. That’s always good to build confidence and have confidence in other people too.”\r\n\r\nAccording to Mountain View head coach Jim Mcguirk, the Spartans struggled to adjust their defensive strategy against Paly.\r\n\r\n“Defensively, we’ve played pretty good all year, but we didn’t play as good today,” Mcguirk said. “We didn’t adjust to how fast they were. There were things we could’ve done, like changed positioning to be in the right spots. We were in the spots that we’re in against other teams, but we didn’t adjust to their speed and get into different positions where we could handle their speed better.”\r\n\r\nThe Vikings worked together more effectively in this game than they had in previous weeks, according to Bolarinwa.\r\n\r\n\"We moved the ball, got open, found the time to pass and hold the ball,” Bolarinwa said. “It was really good to see how our team is finally clicking together.”\r\n\r\nPaly will play Fremont High School (2-4-3, 1-1-1) at 3:30 p.m. on Wednesday at Fremont.","excerpt":"The Palo Alto High School boys' soccer team (8-0-1, 4-0) dominated the Mountain View High School Spartans (5-2-4, 0-1-1) on Friday at the Paly soccer field by a score of 5-0.","date":"2016-01-18 22:38:20","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/IMG_7965.jpg","categories":["Sports","Sports Recap"],"tags":["ariya momeny","boys soccer","cam huard","cole tierney","dami bolarinwa","don briggs","jim mcguirk","max hallberg","mountain view","palo alto high school","roberto sotelo","Soccer","spartans","vikings"]}]