[{"id":119034,"title":"Band to perform Pops Concert","permalink":"http:\/\/palyvoice.com\/2016\/04\/14\/band-to-perform-pops-concert\/","content":"[caption id=\"attachment_72720\" align=\"aligncenter\" width=\"573\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/IMG_9970.jpg\"><img class=\" wp-image-72720\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/IMG_9970.jpg\" alt=\"Paly's Symphonic and Concert bands performed during the dinner. Photo by Lizzie Chun.\" width=\"573\" height=\"382\" \/><\/a> Paly's Symphonic and Concert bands perform during the back to school dinner last year. Photo by Lizzie Chun.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Palo Alto High School’s symphonic and concert band is performing a Pop Concert in the Haymarket Theater tonight at 7 p.m.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The concert will feature an assortment of lively songs true to the pop genre, including the symphonic band's medley's for Aladdin and Overture to the Opera Orpheus. The concert band will perform soul music medleys as well.<\/span>\r\n\r\nThe music picked out for the performance has special meaning to the band, according to band member junior Celia Willner.\r\n\r\n<span style=\"font-weight: 400;\">“Aladdin is really fun [to play] because on our New York trip this year, we saw Aladdin on Broadway,” Willner said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Even though the symphonic band is performing separately from the concert band, there will be a collaboration at the end of the concert for a surprise combined performance, according to Willner.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Paly’s band has been preparing for this concert since the middle of March. Practicing was quicker and easier than normal because of the previous preparation for the New York trip, Willner said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I am so happy with the results of the month of work,” Willner said.  “It really is amazing because Orpheus is kind of a difficult piece to put together.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The band has one more concert this school year in May, as well as the California Music Education Association Festival and the May Fete parade.  The pop concert might be the last concert performed in the Haymarket theater by the band since they are expecting to be moved into the new performing arts theater by then, according to Willner.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Paly's band is excited to be able to perform pop music in a concert. <\/span>\r\n\r\n\"We are all having fun with this music,\" Willner said.","excerpt":"Palo Alto High School’s band is performing a pop concert in the Haymarket Theater tonight at 7 p.m.","date":"2016-04-14 18:22:16","author":"Morgan Keller","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/IMG_9970.jpg","categories":["News","Spotlight"],"tags":["band","concert","haymarket theater","paly","pop"]},{"id":118886,"title":"Preview: Girls&#8217; lacrosse to face rival Gunn","permalink":"http:\/\/palyvoice.com\/2016\/04\/14\/preview-girls-lacrosse-to-face-rival-gunn\/","content":"The Palo Alto High School girls' lacrosse team (8-3, 7-0) will take on rival Gunn High School (4-6, 3-2) at 7 p.m. on Friday at the Paly lacrosse field, hoping to defeat the Titans for the second time this season.\r\n\r\nThe Vikings are currently undefeated in the Santa Clara Valley Athletic League and hope to maintain their seven-game winning streak on Friday. Senior goalkeeper Meredith Kinnaman attributes the team's recent success to talented newcomers.\r\n\r\n\"We have a lot of young talent this season, which has contributed to us doing so well in the season so far,\" Kinnaman said.\r\n\r\nThe Vikings head into Friday's matchup fresh off of a 16-6 victory against league opponent Saratoga High School (5-4, 2-3) on Wednesday. According to senior midfielder Maya Benatar, the upcoming game with the Titans will be a challenge, but Wednesday's victory provided the team with momentum.\r\n\r\n\"Last time we played [Gunn] we were losing 6-1 at the half and came through with an 8-7 win,\" Benatar said. \"I think we are going into Friday with our main goal being to maintain the momentum and energy we gained during Wednesday's game against Saratoga.\"\r\n\r\nThe Titans, who have struggled to a 4-6 overall record on the season, lost on their home turf to the Vikings, 8-7, in a close match on March 23.\r\n\r\nAccording to Titan senior attacker Yui Sasajima, the rivalry between the two schools has been a motivational boost for her team.\r\n\r\n\"I think we're pretty lucky to be each other's rivals,\" Sasajima said. \"In the past, our scores have always been pretty close, so I think both schools motivate each other to work hard for this game.\"\r\n\r\nDespite the last match between the two teams resulting in a victory for Vikings, Kinnaman still feels the team can improve its level of play against its crosstown rivals.\r\n\r\n\"Although we ended up winning the game, one thing that we need to work on is starting the game off strong and really setting ourselves up to have a good game,\" Kinnaman said.\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School girls' lacrosse team (8-3, 7-0) will take on rival Gunn High School (4-6, 3-2) at 7 p.m. this Friday at the Paly lacrosse field, hoping to defeat the Titans for the second time this season.","date":"2016-04-14 17:54:46","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/03\/mce_030213_0193.jpg","categories":["Sports","Spotlight"],"tags":["gunn","Lacrosse","maya benatar","meredith kinnaman","paly","rivalry","yui sasajima"]},{"id":119093,"title":"Elevator malfunctions, trapping students inside","permalink":"http:\/\/palyvoice.com\/2016\/04\/14\/elevator-malfunctions-trapping-students-inside\/","content":"Three students were trapped in the elevator of Palo Alto High School’s 800 building at brunch today after an unexplained malfunction.\r\n\r\n<span style=\"font-weight: 400;\">According to sophomore Rebecca Yao, one of the students who was in the elevator, she and her friends entered the elevator at the end of brunch and discovered that the buttons weren’t working.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I tore ligaments [in my knee] so I’ve been scootering around and using the elevator to get to class,” Yao said. “Me and two other friends realized that we weren’t moving up and initially thought that maybe we didn't press the button. And then we realized that the second floor button wasn't working. We tried to open the door and get out but the door shuttered and then wouldn't open.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Despite the potentially frightening situation, Yao and her friends stayed calm. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It was actually kind of funny,” Yao said. “When we first went in one of my friends was like ‘Wouldn’t it be funny if we got stuck in here’ and then we got stuck.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Yao, other students heard her friends and her in the elevator and called for help.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Luckily, another one of my classmates also needs the elevator to get up the stairs,” Yao said. “He and his friends were outside and they were able to hear us and go get help.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Assistant Principal Jerry Berkson was one of the first people alerted about the situation.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I was happy to hear that there wasn’t a student in there that was claustrophobic,” Berkson said. “I was also happy that we could take care of it right and the girls inside were good sports about it. They sounded calm the whole time, that was the key.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Berkson, the elevator door opened after it was turned off.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We first turned off the power and opened the outer door,” Berkson said. “After we hit the big switch, we were able to open the front door.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Yao says she believes the administration handled the situation well. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Administration had someone talking to us through us the door and telling us to be patient and that  getting more people to come help,” Yao said. “They weren't sure how long it would be so we ate snacks and did homework. We were in there for around 20 - 25 minutes.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Administration is looking to repair the elevator, according to Berkson. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The repair guy is coming to see why the elevator stopped working,” Berkson said. “First we have to find out why it happened then move on from there. The elevator will be off until the repair guys comes to check it out.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">This wasn’t the first incident of the elevator malfunctioning, according to Yao. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“A couple weeks ago it [the elevator] broke,” Yao said. “But I was outside so somebody carried my scooter and I hopped up. That’s what I ended up doing today after I got out of the elevator.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Berkson, if students find themselves trapped in a broken elevator they should remain calm and seek help. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“If something like that does ever happen again, admin will know what to do,” Berkson said. “There is also a phone in the elevator that you can use to call someone from.”  <\/span>","excerpt":"Three students were trapped in the elevator of Palo Alto High School’s 800 building at brunch today after an unexplained malfunction.","date":"2016-04-14 17:20:30","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/photo-18.jpg","categories":["Editor's Pick","News","Spotlight"],"tags":["Berkson","broken","elevator","fixed","high school","palo alto","paly","trapped"]},{"id":118895,"title":"Track and Field struggles to keep up with Los Gatos","permalink":"http:\/\/palyvoice.com\/2016\/04\/14\/track-and-field-struggles-to-keep-up-with-los-gatos\/","content":"[caption id=\"attachment_119084\" align=\"alignnone\" width=\"613\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/I9P81991.jpg\"><img class=\"size-full wp-image-119084\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/I9P81991.jpg\" alt=\"Palo Alto High School senior Kelly Branson competes in the 100-meter race at the Paly vs. Los Gatos track and field meet. Both the boys and the girls team fell to the Wildcats on Tuesday at home. Photo by Cooper Lou.\" width=\"613\" height=\"369\" \/><\/a> Palo Alto High School senior Kelly Branson competes in the 100-meter race at the Paly vs. Los Gatos track and field meet. Both the boys and the girls team fell to the Wildcats on Tuesday at home. Photo by Cooper Lou.[\/caption]\r\n\r\nThe Palo Alto High School track and field team hopes to improve after suffering a tough loss to Los Gatos High School  on Tuesday at home.\r\n\r\nDespite the Viking boys' team placing first in eight out of 15 events, Los Gatos  gained more points overall by winning just seven events but placing  second and third more often than Paly.\r\n\r\nThe Viking girls' team fared even worse, winning only two out of 15 events.\r\n\r\nTrack standouts senior Eli Givens and junior Kent Slaney set new personal records. Givens ran the 100-meter race with a time of 10.87 seconds and Slaney ran the 800-meter race with a time of 1.57.72 minutes.\r\n\r\nAccording to sophomore Reed Foster, the team was unable to capitalize on specific events.\r\n\r\n\"We lost a lot of points on several of the races,\" Foster said. \"That made it really hard to come back in the end. With the two-mile we really needed to sweep that and we were only able to get first and third.\"\r\n\r\nFoster said that Los Gatos is one of the toughest teams that Paly will face during the season.\r\n\r\n\"In dual meets they [Los Gatos] will be the toughest one,\" Foster said. \"I don't think that Gunn will be as hard.\"\r\n\r\nPaly's next meet is against Gunn High School, at 3:15 p.m. on Tuesday at Gunn.\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School track and field team hopes to improve after suffering a tough loss to the Los Gatos High School  on Tuesday at home.","date":"2016-04-14 15:24:51","author":"Jackson Doerr","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/I9P8199.jpg","categories":["Sports","Sports Recap","Track and Field"],"tags":["2016","eli givens","kent slaney","los gatos","paly","track and field"]},{"id":118929,"title":"Slideshow: Boys’ swimming loses, girls’ swimming beats Gunn on Senior Night","permalink":"http:\/\/palyvoice.com\/2016\/04\/14\/slideshow-boys-swimming-loses-girls-swimming-beats-gunn-on-senior-night\/","content":"The Palo Alto High School boys’ swim team lost to Gunn High School while the girls’ swim team defeated Gunn on Tuesday on Senior Night at Gunn High School.\r\n<div id=\"cp_widget_7054845b-c1c9-49bc-8f12-c9a4e3a2c9d6\">\r\n\r\n...<script type=\"text\/javascript\">\/\/ <![CDATA[\r\nvar cpo = []; cpo[\"_object\"] =\"cp_widget_7054845b-c1c9-49bc-8f12-c9a4e3a2c9d6\"; cpo[\"_fid\"] = \"AEIA0ZtDxeUm\"; var _cpmp = _cpmp || []; _cpmp.push(cpo); (function() { var cp = document.createElement(\"script\"); cp.type = \"text\/javascript\"; cp.async = true; cp.src = \"\/\/www.cincopa.com\/media-platform\/runtime\/libasync.js\"; var c = document.getElementsByTagName(\"script\")[0]; c.parentNode.insertBefore(cp, c); })();\r\n\/\/ ]]><\/script><noscript>Powered by Cincopa &lt;a href='http:\/\/www.cincopa.com\/video-hosting'&gt;Video Hosting&lt;\/a&gt; for Business solution.<\/noscript>\r\n\r\n","excerpt":"The Palo Alto High School boys’ swim team lost to Gunn High School while the girls’ swim team defeated Gunn on Tuesday on Senior Night at Gunn High School.","date":"2016-04-14 12:17:29","author":"Victor Carlsson","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_6199.jpg","categories":["Sports","Spotlight"],"tags":["boys swimming","girls' swimming","gunn","Swimming"]},{"id":118846,"title":"TEAMS place in engineering tourney, advance to nationals","permalink":"http:\/\/palyvoice.com\/2016\/04\/14\/teams-place-in-engineering-tourney-advance-to-nationals\/","content":"[caption id=\"attachment_118983\" align=\"alignnone\" width=\"555\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/teams-pic.jpg\"><img class=\" wp-image-118983\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/teams-pic.jpg\" alt=\"All three teams pose for a picture after competing at the TEAMS state competition. The underclassmen team placed sixth, while the upperclassmen A team took fourth and the B team placed first. Photo: Jerry Hong. \" width=\"555\" height=\"416\" \/><\/a> The Palo Alto High School Test of Engineering Aptitude in Math and Sciences club poses for a picture after their annual state competition on Feb. 27 at San Jose State University. The club has attended all state competitions held since its creation in 2015. Photo by Jerry Hong.[\/caption]\r\n\r\nThree teams of Palo Alto High School students are preparing to attend the nationals competition this summer after placing at a state engineering contest on Feb. 27.\r\n\r\nAccording to junior co-president Jerry Hong, Paly sent three teams to the Test of Engineering Aptitude in Math and Science competition: one underclassmen team and two upperclassmen teams. According to the <a href=\"https:\/\/www.registermychapter.com\/tsa\/teams\/reg\/staterank.aspx?A=teams1516\">results<\/a> released to coaches on Monday, Paly's underclassmen team placed sixth overall, the upperclassmen B team placed first and the A team placed fourth.\r\n\r\n“Although our main goal at the competition was to try to make it to the national conference, we certainly did not expect to make first in the state, of which I'm very proud of our team,” junior B team member Stefan Quach said.\r\n\r\nThe underclassmen competed against 21 other teams, and the upperclassmen teams competed against 36 other teams. All three teams have been preparing for the state competition since November, according to Hong.\r\n\r\n“We had study meetings about twice a month, where each member would research one of the eight topics covered in this year's competition and practice the first part of the competition,” Hong said.\r\n\r\nAccording to the TEAMS's official <a href=\"http:\/\/teams.tsaweb.org\/\">website<\/a>, the nationals competition consists of three parts: an essay, a presentation and an event called “problem solving.” The top ranked team for each level in each state will receive a 'Best in State' banner for its school, medals for the team members and a certificate.\r\n\r\n<span style=\"font-weight: 400;\">“The essay is due two weeks before the actual competition; it involves researching a certain topic and making a certain decision, such as investing in specific biofuel-related technologies, which was last year’s topic,” Hong said. “The presentation is similar but is delivered on site. Last year the topic was rebuilding cities struck with a natural disaster using renewable energy.”<\/span>\r\n\r\nThe problem-solving portion involves both a build event and a set of questions related to eight topics, according to Hong. The eight topics are pumping systems, failure engineering and materials science, genomics, lenses and telescopes, microscope technology, semiconductor materials, six sigma manufacturing methods and space exploration.\r\n\r\nThe club hopes to retain its previous rankings and improve its ranking in the problem solving portion, according to junior co-president Samarth Venkatasubramaniam.\r\n\r\n“Last year, we got second in essay, sixth in presentation and seventh overall,” Venkatasubramaniam said. “In the upcoming months, we'll be writing our essay and then we will research and practice for the other two events.”\r\n\r\n<span style=\"font-weight: 400;\">Because the club is only in its second year, Hong says he believes it will continue to grow and members will gain valuable experience competing in competitions with real-world topics.<\/span>\r\n\r\n<span style=\"line-height: 1.5;\">“Hopefully the introduction of a club like this will allow even more students to explore STEM [Science Technology Engineering and Math] and investigate topics that aren't taught in a typical science class,” Hong said.<\/span>\r\n\r\nThe national competition will take place from June 28 to July 2 in Nashville, Tennessee.","excerpt":"Three teams of Palo Alto High School students are preparing to attend the nationals competition this summer after placing at the TEAMS (Test of Engineering Aptitude in Math and Science) state competition on Feb. 27.\r\n","date":"2016-04-14 11:13:00","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/teams-pic.jpg","categories":["News"],"tags":["competition","daniel","hong","Jerry","nationals","palo alto high school","paly","samarth","states","stem","teams","venkatasubramaniam","zahra"]},{"id":118987,"title":"ASB elections for Treasurer and Junior VP take place on Thursday, April 14 and Friday, April 15","permalink":"http:\/\/palyvoice.com\/2016\/04\/13\/asb-elections-for-treasurer-and-junior-vp-take-place-on-april-14-and-april-15\/","content":"","excerpt":"","date":"2016-04-13 22:14:46","author":"Chirag Akella","categories":["Ticker"],"tags":[]},{"id":118817,"title":"ASB announces majority of team for 2016-17 school year","permalink":"http:\/\/palyvoice.com\/2016\/04\/13\/asb-announces-majority-of-team-for-2016-17-school-year\/","content":"[caption id=\"attachment_118953\" align=\"alignnone\" width=\"620\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/12312469_481970981983406_483221451_n1.jpg\"><img class=\" wp-image-118953\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/12312469_481970981983406_483221451_n1.jpg\" alt=\"Paly's ASB poses for a photo during a meeting. Many of these members will returning to serve another term during the 2016-2017 school year. Photo by Mathew Hall.\" width=\"620\" height=\"412\" \/><\/a> Palo Alto High School Associated Student Body poses for a photo during a meeting. Many of the underclassmen and juniors will be returning to serve another term during the 2016-17 school year. From left to right: junior Cezanne Lane, seniors Eli Friedlander, Griffin Carlson and Reid Walters, juniors Maryland Valdez and Natalie Maloney, sophomore Jaiveer Sandhu, seniors Joseph Kao, Ariya Momeny and William Zhou, sophomores Claire Billman and Noga Hurwitz, senior Mariah Poitier, junior Anmol Nagar, seniors Bryn Carlson and Emma Cole, junior Noa Ben-Efraim.  Photo by Matthew Hall.[\/caption]\r\n\r\nThe Palo Alto High School Associated Student Body has announced the winners of the 2016-17 election for ASB and class officer positions, with the exception of the two vacant spots.\r\n\r\nASB will be led by its newly elected president, junior Anmol Nagar, and vice president, junior Maya Lathi. These two will be accompanied by ASB secretary junior Kevin Chen. The treasurer position remains unfilled, along with the junior vice president position. These positions will be filled in a <a href=\"http:\/\/paly.io\/v\/118740\">special election<\/a> this Thursday and Friday.\r\n\r\nNagar said she believes the ASB president is a very influential position within the student government, and that it is key for the president to make sure everyone has their voice heard.\r\n\r\n\"The ASB president is someone who empowers everyone in ASB to be their best,\" Nagar said. \"I think it's very important that the ASB president makes the ASB class somewhere people can brainstorm, plan, and execute their ideas, as well as receive input from the student body.\"\r\n\r\nNagar's counterpart, Lathi, is excited for the opportunity to bridge the gap between different grades, and strengthen the bonds between ASB and club officers. Lathi is also looking to reach out to the incoming freshman and help ensure a smooth transition into high school.\r\n\r\n\"Being vice president means that I will be responsible chiefly for the connection between ASB and club officers, though I would also like to promote stronger bonds between students of different grades,\" Lathi said. \"I also hope to reach incoming freshmen, and garner their interest in participating in clubs prior to the first Club Day.\"\r\n\r\nChen believes that he will be playing a smaller role in ASB, but hopes to contribute as much as possible to group discussions.\r\n\r\n\"I don't really have an agenda or plans, but I hope to listen to to the ideas and give my two cents into the discussion,\" Chen said. \"Since this is my first year having an ASB position I do not have any big goals.\"\r\n\r\nThe full list of newly elected ASB and class officers can be viewed below.\r\n\r\nASB President: Anmol Nagar\r\nASB Vice President: Maya Lathi\r\nASB Treasurer: (unfilled)\r\nASB Secretary: Kevin Chen\r\n\r\nSenior President: Noa Ben-Efraim\r\nSenior Vice President: Natalie Maloney\r\n\r\nJunior President: Jaiveer Sandhu\r\nJunior Vice President: (unfilled)\r\n\r\nSophomore President: Caroline Furrier\r\nSophomore Vice President: Shannon Zhao","excerpt":"The Palo Alto High School Associated Student Body has announced the winners of the 2016-2017 election for ASB and class officer positions.","date":"2016-04-13 18:27:57","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/12312469_481970981983406_483221451_n.jpg","categories":["ASB Election 2016","News"],"tags":["ASB","ben-efraim","Chen","election","Furrier","junior","Lathi","maloney","nagar","officer","President","sandhu","secretary","senior","sophomore","treasurer","vice president","winners","Zhao"]},{"id":118866,"title":"Admin investigates window vandalism","permalink":"http:\/\/palyvoice.com\/2016\/04\/12\/admin-investigates-window-vandalism\/","content":"[caption id=\"attachment_118873\" align=\"alignnone\" width=\"596\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_0574-2.jpg\"><img class=\"wp-image-118873 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_0574-2.jpg\" alt=\"window vandalism\" width=\"596\" height=\"447\" \/><\/a> A Palo Alto High School student observes the damage done to her science classroom before entering sixth period yesterday. Room P9 was one of multiple classrooms targeted by a student who shot at windows with a BB gun over Spring Break, according to Assistant Principal Jerry Berkson. Photo: Adrienne Kwok.[\/caption]\r\n\r\nThe Palo Alto High School administration is working to repair damage done to multiple buildings after discovering eight shattered windows last Tuesday, according to Assistant Principal Jerry Berkson.\r\n\r\nBerkson said he received a call during Spring Break indicating an individual had used a BB gun to shoot at classrooms P6A, P9, P12 and 901, which include science portables and an administrative building. Paly is covering the broken windows with plywood while waiting for the out-of-stock replacements to arrive.\r\n\r\nThe administration is analyzing the extent of the damage before deciding on a penalty, according to Berkson. The perpetrators, currently unidentified, could face legal consequences and pay upwards of $1000 in damage. Other repercussions may include suspension, a permanent addition to a student’s record that could affect their college eligibility, says Berkson.\r\n\r\nThe administration may take further legal action, as a BB gun was brought on campus. According to the Paly Student Handbook, weapons, including paint ball and squirt guns, are prohibited on campus and could result in PAUSD expulsion and arrest per the California State Educational Code.\r\n\r\n“Having been a teenager at one time, I understand that kids may sometimes do things that are inappropriate,” Berkson said. “Kids should really think about what they are doing before they do it, because the consequences could be a very big deal.”\r\n\r\nOther than a decrease in natural lighting, science teacher Elizabeth Brimhall, whose classroom suffered a broken window, does not believe the vandalism is significantly affecting her teaching.\r\n\r\n\"It's shocking and I think the students were surprised [at the vandalism]” Brimhall said. “For me, luckily it’s not the only window we have so we have other ways to get light in the room. It [vandalism] has a minor effect except for the fact that it’s a sad thing to have happened.”\r\n\r\nPaly is no new victim to vandalism. In February, a student <a href=\"http:\/\/palyvoice.com\/2016\/02\/16\/admin-investigates-franco-mural-vandalism\/\" target=\"_blank\">spray painted<\/a> over one of two James Franco murals with red words, “How do you vandalize garbage?\"\r\n\r\nStudents responded to the most recent vandalism by expressing their disapproval.\r\n\r\n“I don't think that's okay at all,” junior Aman Mittal said. “Vandalizing the school you learn in is so disrespectful, and we're blessed to go to a beautiful-looking school like Paly.”","excerpt":"Palo Alto High School administration is working to repair damages done to multiple buildings after discovering eight shattered windows on Tuesday.","date":"2016-04-12 11:32:37","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_0574-2.jpg","categories":["News","Spotlight"],"tags":["assistant","bb","Berkson","brimhall","elizabeth","franco","gun","james","Jerry","mural","plywood","principal","science","suspension","vandalism","window"]},{"id":118906,"title":"Paly cheer and dance team tryouts Monday, April 11 to Friday, April 15","permalink":"http:\/\/palyvoice.com\/2016\/04\/12\/cheer-and-dance-tryouts-monday-april-11-to-friday-april-15\/","content":"","excerpt":"","date":"2016-04-12 11:25:52","author":"Sherwin Amsbaugh","categories":["Ticker"],"tags":[]}]