[{"id":124433,"title":"Spirit Week Day One results","permalink":"http:\/\/palyvoice.com\/2016\/10\/17\/spirit-week-day-one-results-3\/","content":"<a href=\"http:\/\/palyvoice.com\/2016\/10\/17\/recap-spirit-week-day-one\/\" target=\"_blank\">Spirit Week Day One<\/a> results are in, and the seniors are <a href=\"http:\/\/palyvoice.com\/2016\/10\/17\/video-paly-launches-spirit-week-2016\/\" target=\"_blank\">narrowly in the lead<\/a> with 100 points ahead of the second-place sophomores. The freshmen remain in last place by a large margin of 1050 points behind the juniors.\r\n\r\nCheck back tomorrow as The Paly Voice summarizes Day Two of Spirit Week, where students and staff will dress up for the Salad Dressing theme.\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/spirit-week-201_17214602_df8fcc92aad2b37d3bc758aa59833a41ceae560c.png\"><img class=\"alignnone wp-image-124520\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/spirit-week-201_17214602_df8fcc92aad2b37d3bc758aa59833a41ceae560c.png\" alt=\"spirit-week-201_17214602_df8fcc92aad2b37d3bc758aa59833a41ceae560c\" width=\"621\" height=\"1472\" \/><\/a>\r\n\r\n&nbsp;","excerpt":"Spirit Week Day One results are in, and seniors take the lead with 2200 points with sophomores close behind. Stay tuned this week as The Paly Voice summarizes this year's Spirit Week scores.","date":"2016-10-17 23:10:45","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Spirit-Week-2016-Featured-Images-2.png","categories":["Multimedia","Spirit Week 2016"],"tags":["2016","classes","Fall","freshmen","juniors","piktochart","results","seniors","Sophomores","spirit","statistics","stats","week","win"]},{"id":124429,"title":"Recap: Spirit Week Day One","permalink":"http:\/\/palyvoice.com\/2016\/10\/17\/recap-spirit-week-day-one\/","content":"The first day of Spirit Week saw the debut of several new activities in addition to some old classics, creating a level playing field for both veteran and rookie competitors.\r\n\r\nAs usual, Spirit Week started off with “Theme Day,” where each class (except for seniors) dressed up for its respective themes. The freshman theme is \"Eye of the Tiger,\"  the sophomores, \"Firefighters,\" and the juniors, \"Boxing.\"  As per tradition, the senior class dressed up in 90’s attire instead of its theme, “Game Over.”\r\n\r\nClear skies and temperate weather enabled a large student turnout to watch the lunchtime activities.\r\n\r\nThe sophomores managed to take first place in “Knee Trembler” after barely edging out the seniors, while the junior class won “Pass the Water.”\r\n\r\nDespite losing both of the new events, the senior class was able to get a win in the “Banana Bump” activity.\r\n\r\nAccording to senior Jackson Dahl, who won the event, the trick was to get some momentum going.\r\n\r\nDahl came from behind to get the win for the senior class.\r\n\r\n“Well, I was practicing last night and I knew that it was hard to get started,” Dahl said. “But once I got going, I knew I was unstoppable.”\r\n\r\nDespite not winning an event, members of the freshman class still had a good time.\r\n\r\n“We weren't exactly experienced, but it was fun nevertheless and I like dressing up,” freshman Lanie Germain said. “The seniors helped us out a bit.”\r\n\r\nThere was a minor disruption during a break between activities when several junior boys ran out onto the field holding a sign containing profanity targeted at the senior class. According to senior Vice President Natalie Maloney, the junior class as a whole will lose sportsmanship points.\r\n\r\nTotal points will be posted at the end of float building on the <a href=\"https:\/\/sites.google.com\/site\/pahsasb\/\">ASB website<\/a>. Spirit Week continues tomorrow with <a href=\"http:\/\/palyvoice.com\/2016\/10\/17\/preview-spirit-week-excitement-to-continue-with-salad-dressing-day\/\" target=\"_blank\">Salad Dressing Day<\/a>. Continue to check the Paly Voice for more updates on Spirit Week 2016.\r\n\r\n<iframe src=\"https:\/\/docs.google.com\/presentation\/d\/1gF2wRG8TPC9ATMY_CrQos30CQENyswcRouy8RXtJKrY\/embed?start=false&amp;loop=false&amp;delayms=3000\" width=\"620\" height=\"620\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The first day of Spirit Week saw the debut of several new activities in addition to some old classics, creating a level playing field for both veteran and rookie competitors. ","date":"2016-10-17 22:07:31","author":"Jackson Doerr","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/DSC_00272.jpg","categories":["News","Spirit Week 2016"],"tags":["90s","boxing","day 1","day one","eye of the tiger","firefighters","spirit week 2016","theme day"]},{"id":124441,"title":"Video: Paly launches Spirit Week 2016","permalink":"http:\/\/palyvoice.com\/2016\/10\/17\/video-paly-launches-spirit-week-2016\/","content":"The Paly Voice documented the first day of Palo Alto High School's Spirit Week 2016. After an exciting brunch, the classes participated in “minute to win it” games including “Banana Bump,” \"Knee Trembler\" and “Pass the Water.”\r\n\r\nMake to sure to check Associated Student Body’s <a href=\"https:\/\/sites.google.com\/site\/pahsasb\/sw2016\">master schedule<\/a> for information on daily events as well as scoring and keep checking the Paly Voice for more <a href=\"http:\/\/palyvoice.com\/category\/spirit-week-2016\/\">Spirit Week<\/a> updates.\r\n\r\n<iframe src=\"https:\/\/www.youtube.com\/embed\/WiL_Scsq98o\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Paly Voice documented the first day of Palo Alto High School's Spirit Week 2016. After an exciting brunch, the classes participated in “minute to win it” games including “Banana Bump,” \"Knee Trembler\" and “Pass the Water.”","date":"2016-10-17 21:27:28","author":"Aisha Chabane","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_96391.jpg","categories":["Spirit Week 2016"],"tags":["90s","paly","spirit","spiritweek2016","themeday"]},{"id":124383,"title":"Preview: Spirit Week excitement to continue with &#8216;Salad Dressing&#8217; day","permalink":"http:\/\/palyvoice.com\/2016\/10\/17\/preview-spirit-week-excitement-to-continue-with-salad-dressing-day\/","content":"[caption id=\"attachment_124477\" align=\"alignnone\" width=\"599\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Junior-Photo.jpg\"><img class=\" wp-image-124477\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Junior-Photo.jpg\" alt=\"Palo Alto High School students cheer during a rally at lunch today on the football field. According to junior class president Jaiveer Sandhu, the rally was a success and an omen of victory for the junior class. &quot;My personal highlight today was during pass that water when the Juniors came in first. That was big and I think it's a sign of more first place wins to come throughout the week.&quot; Photo: Rachel Code\" width=\"599\" height=\"399\" \/><\/a> Palo Alto High School students cheer during a rally at lunch today on the football field. According to Junior Class President Jaiveer Sandhu, the rally was a success and an omen of victory for the junior class. \"My personal highlight today was during 'Pass that Water' when the juniors came in first,\" Sandhu said. \"That was big and I think it's a sign of more first place wins to come throughout the week.\" Photo: Rachel Code[\/caption]\r\n\r\nCan the junior class beat the tropical heat? Will the Roman armies of the senior class reign victorious? Tomorrow, the Palo Alto High School students will don all their salad dressing garb and compete in a tug-of-war tournament during the second day of Spirit Week.\r\n\r\nEach grade's theme corresponds to a different type of salad dressing. The freshman theme will be \"Healthy Choice,\" the sophomore theme will be \"Ranch,\" the junior theme will be \"Thousand Island\" and the senior theme will be \"Caesar.\"\r\n\r\nIn addition to dressing up, the classes will compete in a tug-of-war tournament. Each grade's team will be made up of 10 girls and 10 boys, and the first class to pull a flag tied to the rope past a line in the middle will win.\r\n\r\nThe participating grades for the first two rounds will be drawn out of a hat, and the third round will be a match between the two losing classes. The stakes are high, as the winning class will receive 1,500 points, second place will receive 1,200 points, third place will receive 1,000 points and fourth place will receive 800 points.\r\n\r\nJunior class president Jaiveer Sandhu said that he is very excited for the event.\r\n\r\n\"It [Tug-of-war] is one of my favorite events because it's really visual to the crowd,\" Sandhu said. \"It's really in-your-face to the other classes too.\"\r\n\r\nAccording to Sandhu, Paly football players may be unable to participate in the event because of a scheduling conflict.\r\n\r\n\"The football players have film on Monday and Tuesday, so me and Noa [senior class president] went to talk with the football coach today,\" Sandhu said. \"He [Coach Danny Sullivan] said he would talk to other football coaches [about rescheduling film]. ... So there's a chance that we may not have the football players.\"\r\n\r\nMake sure to tag all of your Spirit Week social media posts with #palyspirit for a chance to be featured on The Paly Voice website.","excerpt":"Can the junior class beat the tropical heat? Will the Roman armies of the senior class reign victorious? Tomorrow, the Palo Alto High School students will dawn all their salad dressing garb and compete in a tug-of-war tournament during the second day of Spirit Week.","date":"2016-10-17 21:03:57","author":"William Sallomi","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Junior-Photo.jpg","categories":["News","Spirit Week 2016","Spotlight"],"tags":["freshmen","juniors","rally","seniors","Sophomores","Spirit Week","tug of war"]},{"id":124404,"title":"Preview: Spirit Week to kick off with Theme Day","permalink":"http:\/\/palyvoice.com\/2016\/10\/16\/preview-spirit-week-to-kick-off-with-theme-day\/","content":"The most anticipated week of the year, Spirit Week, kicks off this Monday at Palo Alto High School with Theme Day.\r\n\r\nOn Theme Day, students from each grade dress up based on a theme voted on by their class. Each theme corresponds with each class’ color: orange for freshmen, red for sophomores, yellow for juniors and green for seniors.\r\n\r\nThis year, the freshman theme is “Eye of the Tiger,” the sophomore theme is “Firefighters,” the junior theme is “Boxing” and the senior theme is “Game Over.” Rather than wearing clothes that correspond to their theme, due to Paly tradition, seniors instead wear 90s apparel on Monday.\r\n\r\nThis year, Spirit Week festivities open at lunch on the football field with the lunchtime rally, which will feature three main events: Knee Trembler, Banana Bump and Pass the Water.\r\n\r\nKnee Trembler, a new event to Paly Spirit Week, is a mini relay race consisting of three students from each grade. Using only their knees, students must pick up an orange and hop over to a hula hoop placed on the ground. Whoever has placed the most oranges in the hoop at the end of a minute will win.\r\n\r\nFollowing the Knee Trembler game, the Banana Bump event will take place. This time, only one student from each grade will participate. The student will have a banana tied around his or her waist and must bump an orange, using the banana, past the finish line.\r\n\r\n\"The other new game is Pass the Water,\" ASB Spirit Commissioner Michaela Fogarty said. \"Participants line up and transfer water from one bucket to another by passing it to each other over their heads with cups. The grade with the most water in the final bucket wins.\"\r\n\r\nAccording to Fogarty, the results of the events are unpredictable.\r\n\r\n\"None of the grades are projected to win any of the games,\" Fogarty said. \"It should be very competitive and exciting to watch.\"\r\n\r\nIn addition to the points awarded for the events, class cheers and scores for best dressed will award each grade with extra points. Cheers at each rally can earn up to 800 points for first place and up to 500 points for the best dressed contest.\r\n\r\nUp to 150 points of deductions are possible for sportsmanship and cleanliness.\r\n\r\nFor more information on lunchtime rallies and the Spirit Week scoring system, refer to the <a href=\"https:\/\/sites.google.com\/site\/pahsasb\/sw2016\" target=\"_blank\">ASB master schedule<\/a>. And don't forget to use #palyspirit on all of your social media posts for a chance to have it featured on the Paly Voice website.","excerpt":"The most anticipated week of the year, Spirit Week, kicks off this Monday at Palo Alto High School with Theme Day.","date":"2016-10-16 21:28:00","author":"Isabella Marcus","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/DSC_0197.jpg","categories":["News","Spirit Week 2016","Spotlight"],"tags":["#palyspirit","#spiritweek","90s","boxing","eye of the tiger","firefighters","palo alto high school","paly","paly spirit week","Spirit Week"]},{"id":124407,"title":"Use the hashtag #palyspirit to have your Spirit Week photos featured on the Paly Voice","permalink":"http:\/\/palyvoice.com\/2016\/10\/16\/use-the-hashtag-palyspirit-to-have-your-spirit-week-photos-featured-on-the-paly-voice\/","content":"","excerpt":"","date":"2016-10-16 15:59:14","author":"Chirag Akella","categories":["Ticker"],"tags":[]},{"id":124260,"title":"School board to discuss weighted vs. unweighted transcripts","permalink":"http:\/\/palyvoice.com\/2016\/10\/16\/school-board-to-discuss-weighted-vs-unweighted-transcripts\/","content":"The Palo Alto Unified School District Board of Education will be discussing whether PAUSD high schools will be submitting weighted or unweighted grade point averages to colleges at <a href=\"http:\/\/www.boarddocs.com\/ca\/pausd\/Board.nsf\/goto?open=&amp;id=AEETTD772CFC\">6:30 Tuesday, Oct. 18 at the district office.<\/a>\r\n\r\nThe meeting will include a discussion of grade reporting after concerns were raised by parents and students. The full discussion agenda can be found <a href=\"http:\/\/www.boarddocs.com\/ca\/pausd\/Board.nsf\/goto?open=&amp;id=AEETTD772CFC\">here<\/a>.\r\n\r\nA number of Palo Alto parents and students are pushing for the option of reporting weighted GPAs, and have sent numerous messages to Paly administration and the school board, according to Principal Kim Diorio.\r\n\r\nPTSA President Katie Shade sent an e-mail to Paly parents on Wednesday to inform them of Paly's <a href=\"https:\/\/docs.google.com\/document\/d\/1dgRurvVuzDXtwWqByW2LQgKYiFhHWuQ84r_lCxhSteY\/edit\">position statement<\/a> in response to the message.\r\n\r\nPaly's position paper states that the administration and faculty \"feel strongly that when schools use weighted grades, a culture of competition and stress develops\" and stand against submitting weighted GPAs. Stating there should be no submitting of weighted GPAs for this years' graduating class, which has caused uproar from some parents and students\r\n\r\nIn a meeting with the Paly Associated Student Body, Diorio outlined her concerns with submitting weighted GPAs.\r\n\r\n\"By having an unweighted transcript, it draws focus away from student competition and will help reduce stress,\" Diorio said. \"[Gunn Principal] Dr. [Denise] Herrmann and I have <span style=\"font-weight: 400;\">big goals in redefining success and strengthening Gunn and Paly culture. We want to have a<\/span><span style=\"font-weight: 400;\">lternate pathways to success, where students are more than their GPA.\"<\/span>\r\n\r\nAccording to Diorio, for the past 35 years Paly has been exclusively reporting unweighted grades. Neither Gunn nor Paly report weighted grades on transcripts, and Gunn reports weighted grades within applications.\r\n\r\nGunn School Board Representative senior Ankit Ranjan says this difference between the schools' reporting methods has pushed students from both PAUSD high schools to voice their opinions on the matter at the upcoming board meeting.\r\n\r\n\"Gunn students can ask to have either their weighted or unweighted GPA reported [to colleges],\" Ranjan said. \"We're currently working with members of the Paly community with [Paly senior] Maya Katz in getting more students involved at Tuesday's board meeting.\"\r\n\r\nAccording to the <a href=\"http:\/\/www.boarddocs.com\/ca\/pausd\/Board.nsf\/goto?open&amp;id=AEPV5U7F1FB4\">School Board agenda<\/a>, the primary argument in support of weighted grades to this point has revolved around scholarships for out of state public schools, particularly University of Oregon. Scholarship money is important, and according to counselors, is increasingly more of a factor for students making decisions as to what institutions they will apply to and attend.  The discussion around weighted grading arose from a conversation several months ago regarding the University of Oregon’s practices for awarding merit scholarships.  The University awards an automatic $36,000 Summit Scholarship for out of state students with a GPA of 3.8 or higher, and an automatic $16,000 Apex Scholarship for a GPA of 3.6 or higher.  They do not recalculate GPAs and only use what is on the transcript.\r\n\r\nConcerns raised by parent and students of the Paly community are primarily represented by Katz and her family. Katz has recently reached out to Paly and Gunn Student Executive Council (SEC) in bringing more student voice into the issue.\r\n\r\nIn a subsequent meeting with Paly ASB, Katz articulated her position on the issue, stating the need for the submission of weighted GPAs for students seeking scholarships.\r\n\r\n\"I've come to ASB to get more students informed on the issue, and to make sure students are able to understand what is at stake,\" Katz said. \"By releasing only unweighted GPAs we become ineligible for merit-based scholarships for universities. Students with an unweighted GPA of 3.75, for example, and a weighted GPA of 4.0 will not be eligible for scholarships that require a 3.8. That's $36,000 or more just because of the report. I've spoken to the admissions staff for universities like University of Oregon and they blatantly said they would not accept this GPA for a scholarship. If a weighted GPA were submitted, this wouldn't be the case.\"\r\n\r\nKatz says she wants all students to have a say regardless of if they agree or disagree with her opinion, and is currently working with her family and a community of parents in doing research to better inform members of the Paly community of the issue.\r\n\r\n\"There are a lot of parents involved in this, and it's important to be getting more students involved,\" Katz said. \"It will affect them directly.\"\r\n\r\nKatz will be speaking at the upcoming board meeting this Tuesday.\r\n\r\nMcGee recommends that the board not make any change for this years' graduating seniors (class of 2017), and then make a decision after community involvement. He has mentioned that he is predisposed to not offering a weighted grade option in order to limit our emphasis on honors and AP classes, but doesn't want to make a decision without consulting students, according to statements made by Ranjan, Diorio and Paly School Board Representative David Tayeri.\r\n\r\nAccording to McGee, the board meeting will not feature a vote on the issue that day, but will instead be a chance for an open discussion that could lead to a vote in the future.\r\n\r\n\"Please let everyone know that there is no action item on the agenda for the 18th,\" McGee stated according to the email from Shade. \"[The meeting] is an information[al] discussion item that may or may not lead to action at a future date.”\r\n\r\nMcGee is interested in receiving comprehensive student input, according to Tayeri. McGee has contacted Tayeri in providing an outlet for students to voice their concerns.\r\n\r\n\"Until a couple years ago, board members would buy pizza and invite students to discuss their views on issues,\" Tayeri said. \"They'd have time to talk to board members one-on-one. They haven't done this in a few years, but I think it would be a good idea to bring that back. There is enough student engagement that we would have a good turnout.\"","excerpt":"The Palo Alto Unified School District Board of Education will be discussing whether PAUSD High Schools' will be submitting weighted or unweighted grade point averages (GPAs) to colleges at 6:30 Tuesday Oct. 18. at the district office.","date":"2016-10-16 15:52:33","author":"Bianca Al-Shamari","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2012\/10\/IMG_0070.jpg","categories":["News","Spotlight"],"tags":["ASB","board meeting","college","diorio","gpa","grades","gunn","herrmann","high school","McGee","paly","sec","tayeri","transcipts","unweighted","weighted"]},{"id":124267,"title":"Vikings defeat Gunn to redeem themselves","permalink":"http:\/\/palyvoice.com\/2016\/10\/16\/vikings-defeat-gunn-to-redeem-themselves\/","content":"[caption id=\"attachment_124368\" align=\"alignnone\" width=\"602\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Celebration1.jpg\"><img class=\" wp-image-124368\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Celebration1.jpg\" alt=\"The Vikings celebrate last night in the Gunn High School gym. According to Viking head coach Jekara Wilson, the match was an emotional and mental ordeal for the team. &quot;Obviously emotions are running high,&quot; Wilson said. &quot;It's definitely a mental match more than anything.&quot;\" width=\"602\" height=\"401\" \/><\/a> The Vikings celebrate Friday night after winning a point in the Gunn High School gym. According to Viking head coach Jekara Wilson, the match was an intense ordeal for the team. \"Obviously, emotions are running high,\" Wilson said. \"It's definitely a mental match more than anything.\" Photo: William Sallomi[\/caption]\r\n\r\nA few days after their first league loss of the season, the Palo Alto High School volleyball team (15-7, 8-1) defeated the Gunn High School Titans (14-12, 8-1) in three nail-biting sets Friday night in the Gunn gym.\r\n\r\nThe team narrowly took each set by only two points. The Vikings won the first set (26-24), the second set (28-26) and the third set (26-24).\r\n\r\nViking head coach Jekara Wilson said she is proud of the group's performance against a team as strong as Gunn.\r\n\r\n\"I think they performed well,\" Wilson said. \"I think that [a close game] is going to happen any time we [Paly and Gunn] play each other,\" Wilson said.\r\n\r\nAccording to Wilson, the Vikings excelled offensively by finding a rhythm and sticking with it.\r\n\r\n\"Offensively, we just got in a really good groove and kept with it,\" Wilson said.\r\n\r\nJunior outside hitter Avery Wooten said that strong individual performances allowed the Vikings to overcome struggles with communication.\r\n\r\n\"Individually, we played really well, but as a team we started out slow and we weren't communicating in the beginning,\" Wooten said.\r\n\r\nAccording to Wooten, improving the team's communication is crucial in enhancing its performance.\r\n\r\n\"We definitely need to work on communication and keeping our energy levels up,\" Wooten said.\r\n\r\nSenior outside hitter Fiona Green said that the Vikings stayed consistent in the face of pressure and overall played a solid game.\r\n\r\n\"I think we played pretty consistently throughout the night,\" Green said. \"There were some ups and downs, but ultimately we played well.\"\r\n\r\nAccording to Green, the energetic Viking crowd helped pump the team up.\r\n\r\n\"We haven't really played any games with such a large crowd or had that much support,\" Green said. \"It was really exciting to have those people here.\"\r\n\r\nThe Vikings aim to continue their success in a match against the Homestead High School Mustangs (8-15, 3-5) at 6:45 pm on Oct. 18 at the Homestead gym.","excerpt":"A few days after their first league loss of the season, the Palo Alto High School volleyball team (15-7, 8-1) defeated the Gunn High School Titans (14-12, 8-1) in three nail-biting sets Friday night in the Gunn gym.\r\n","date":"2016-10-16 12:11:51","author":"William Sallomi","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Celebration1.jpg","categories":["Sports","Spotlight","Volleyball"],"tags":["Avery Wooten","Chelsea Fan","fiona green","Jekara Wilson","sports","vikings","volleyball"]},{"id":124262,"title":"Liveblog: Football hopes to bounce back against Wilcox after consecutive losses","permalink":"http:\/\/palyvoice.com\/2016\/10\/14\/liveblog-football-hopes-to-bounce-back-against-wilcox-after-consecutive-losses\/","content":"[liveblog]The Palo Alto High School football team (1-2, 2-5) looks to defeat the Wilcox High School Chargers (3-0, 4-3) in rainy weather at home. The Vikings hope to snap their 2-game losing streak with a win tonight.","excerpt":"The Palo Alto High School football team (1-2, 2-5) looks to defeat the Wilcox High School Chargers (3-0, 4-3) in rainy weather at home. The <a href=\"http:\/\/palyvoice.com\/2016\/10\/14\/liveblog-football-hopes-to-bounce-back-against-wilcox-after-consecutive-losses\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2016-10-14 17:57:00","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/08\/pauljackson11.jpg","categories":["Uncategorized"],"tags":["chargers","football","vikings","wilcox"]},{"id":124119,"title":"Robotics wins big at off-season competition","permalink":"http:\/\/palyvoice.com\/2016\/10\/13\/robotics-wins-big-at-off-season-competition\/","content":"The Palo Alto High School robotics team looks forward to a promising year after winning multiple awards at the CalGames competition at Fremont High School this past weekend.\r\n\r\n<span style=\"font-weight: 400;\">According to senior Lauren Nolen, the robotics team’s Strategic Director, the competition was off-season, and was hosted by the Western Region Robotics Forum in the style of a \"For Inspiration and Recognition of Science and Technology\" <a href=\"http:\/\/www.firstinspires.org\/robotics\/frc\">robotics game.<\/a> <\/span>\r\n\r\nPaly robotics, otherwise known as \"Team Eight,\" won the Entrepreneurship Award.\r\n\r\n<span style=\"font-weight: 400;\">As described by the <a href=\"http:\/\/wrrf.org\/calgames\/calgames-2016\/\">CalGames<\/a> website, the Entrepreneurship Award, won by Team Eight, is awarded to the team “that demonstrates a business organization and execution that help its team succeed on the field.” <\/span>\r\n\r\nThe Space Cookies, a Paly student all-girls robotics team, won the overall competition as well as the Design and CAD Award and Paly student Terrance Tech team won the Rookie Award.\r\n\r\nAccording to the <a href=\"http:\/\/wrrf.org\/calgames\/calgames-2016\/\">CalGames<\/a> website, the Design Award and the CAD award, won by the Space Cookies in addition to winning the whole competition, are awarded to a team with \"exceptional design element\" and \"exceptional use and connections from CAD design to implementation,\" respectively. The Rookie Award, won by the Terrance Tech team, is described the award for the \"first-timer teams\" at the competition, for a team who \"inspires us all with its efforts and accomplishments as a team.\"\r\n\r\n[caption id=\"attachment_124178\" align=\"alignleft\" width=\"359\"]<img class=\"wp-image-124178\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Screenshot-2016-10-13-at-8.36.47-AM-3.png\" alt=\"Screenshot 2016-10-13 at 8.36.47 AM-3\" width=\"359\" height=\"313\" \/> Participates of pose with their awards at the 2016 CalGames competition. Photo: Natalie Bruster[\/caption]\r\n\r\nAccording to Space Cookies member senior Erin Mittman, after the teams are ranked in certain qualification rounds, top teams will from alliances of three teams and move on to the playoffs.\r\n\r\n\"Whichever team wins two matches advances,\" Mittman said. \"There are eight alliances to start with and one at the end. The final alliance wins the competition.\"\r\n\r\n<span style=\"font-weight: 400;\">Junior Annalee Soohoo, Team Eight business captain, explains that the process for competing at the CalGames competition requires the teams to submit their applications for the award a month in advance, and then present their business plan at the competition.<\/span>\r\n\r\n“We applied for an interview slot around a month ago, and we presented our plan this Saturday at 10 a.m.,\" Soohoo said. \"Team Captain senior Kenneth Cheung, Business Project Manager senior Jennifer Xu, and I presented to the judges for 15 minutes and gave the judges our <a href=\"https:\/\/drive.google.com\/file\/d\/0B_sAFWYnsl_WazJfakkySWwtaHM\/view?usp=sharing\">business plan<\/a>, budget, and project management schedules for review,”  “We were notified that we won the award at around 7 p.m. that night.”\r\n\r\nCheung, says that the team's business plan was centered around its growth.\r\n\r\n“We framed the presentation around the story of how our team has grown from being a last-place-team in 2014 to a world-class one that not only performs better on the field, but is also dedicated to STEM outreach,” Cheung said. “We talked about the creation and success of our art and business subteams, and our extensive project management system that enables us to manage projects for 85 members. We also talked about the free <a href=\"http:\/\/paly.io\/v\/121100\">summer camp<\/a> we ran this past summer, which was developed and taught completely by students.”\r\n\r\n[caption id=\"attachment_124181\" align=\"alignright\" width=\"364\"]<img class=\"wp-image-124181\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Screenshot-2016-10-13-at-8.36.41-AM.png\" alt=\"Screenshot 2016-10-13 at 8.36.41 AM\" width=\"364\" height=\"374\" \/> Space Cookie members senior Erin Mittmann and sophomore Grace Lam pose with their robot. The Space Cookies won the competition as well as the Design Award and CAD Award. Photo: Ushana Goyal[\/caption]\r\n\r\nAccording to Cheung, this is not the first time <a href=\"http:\/\/palyvoice.com\/2015\/03\/17\/robotics-team-wins-entrepreneurship-award-at-regional-competition\/\">Paly robotics has won the entrepreneurship award<\/a>, but the first time winning it at the CalGames competition.\r\n\r\n“This is the third Entrepreneurship Award Paly robotics has won in the past two years,” Cheung said. “And this upcoming season, we are aiming even higher for the Engineering Inspiration Award and Chairman's Awards; the two most prestigious awards in the FIRST Robotics Competition.”\r\n\r\nThis is also not the first win for the Space Cookies, who have won in past competitions awards such as the Chairman's award for embodying <a href=\"http:\/\/www.firstinspires.org\/about\/vision-and-mission\">FIRST<\/a> values and doing outreach, among many others, according to Mittman.\r\n\r\n\"I hope we can win this Chairman's Award again along with continuing to expand our outreach,\" Mittman said. \"We also hope to build an equally successful robot for the next year.\"","excerpt":"The Palo Alto High School robotics team looks forward to a promising year after winning multiple awards at the CalGames competition at Fremont High School this past weekend.","date":"2016-10-13 21:15:11","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Screenshot-2016-10-13-at-8.36.47-AM-3.png","categories":["News","Spotlight"],"tags":["Award","CalGames","entrepreneurship award","robotics"]}]