[{"id":120386,"title":"Boys&#8217; golf qualifies for CCS Championship","permalink":"http:\/\/palyvoice.com\/2016\/05\/11\/boys-golf-qualifies-for-ccs-championship\/","content":"[caption id=\"attachment_120403\" align=\"alignnone\" width=\"619\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/13184547_1720898391485755_1901.jpg\"><img class=\" wp-image-120403\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/13184547_1720898391485755_1901.jpg\" alt=\"Junior Timothy Liu tees off at a match against Los Altos during the regular season. Photo by Cooper Lou \" width=\"619\" height=\"414\" \/><\/a> Junior Timothy Liu tees off at a match against Los Altos High School during the regular season. Photo by Cooper Lou.[\/caption]\r\n\r\nTop members of the Palo Alto High School boys' golf team dominated their competition at the Central Coast Section regionals on Tuesday in Carmel Valley, allowing them to qualify for the CCS final.\r\n\r\nAccording to head coach Doyle Knight, the team shot 367, only 12 over par, securing the victory for the Vikings.\r\n\r\nThe Vikings have yet to lose a match all season, as they head into the final.\r\n\r\nAccording to sophomore Ahmed Ali, the team is looking forward to CCS and possibly beyond.\r\n\r\n\"The depth on our team is great and we are really looking forward to trying to advance to NorCal,\" Ali said.\r\n\r\nDespite winning the game, Ali says that the team has the ability to play at an even higher level.\r\n\r\n\"Individually I think each one of us could've played a little better, [this] is great because we won CCS [regionals] without all of our A games,\" Ali said.\r\n\r\nThe team will compete in the CCS finals next Tuesday again at Rancho Canada Golf Club in Carmel Valley.","excerpt":"Top members of the Palo Alto high school boys' golf team dominated the competition at the Central Coast Section regionals on Tuesday in Monterey, allowing them to qualify for the CCS final.\r\n","date":"2016-05-11 21:20:53","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/13184547_1720898391485755_1901.jpg","categories":["Golf","Sports","Spotlight"],"tags":["ahmed ali","Boys","CCS","Golf"]},{"id":120260,"title":"Season recap: Seniors reflect on boys&#8217; tennis experience","permalink":"http:\/\/palyvoice.com\/2016\/05\/11\/season-recap-seniors-reflect-on-boys-tennis-experience\/","content":"[caption id=\"attachment_120315\" align=\"alignnone\" width=\"620\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Adriancandid1.jpg\"><img class=\" wp-image-120315\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Adriancandid1.jpg\" alt=\"Junior Adrian Smith will look to make his fourth and final year his best when tennis resumes next season. Photo by Sam Lee. \" width=\"620\" height=\"413\" \/><\/a> Junior Adrian Smith will try to make his fourth and final year his best when tennis resumes next season. Photo by Sam Lee.[\/caption]\r\n\r\nDespite an injury-riddled season and the departure of several key seniors, members of the Palo Alto High School boys' tennis team are excited for what next season will bring, even with the departure of several key seniors.\r\n\r\nThe Vikings failed to reach the Central Coast Section playoffs this season, but juniors Jerry Hong, Adrian Smith and Henry Badger, sophomore Hunter North, and freshmen Adam Love and Antony Georgiadis <a href=\"http:\/\/palyvoice.com\/2016\/04\/26\/viking-boys-tennis-players-advance-to-scval-finals\/\">all participated<\/a> in Santa Clara Valley Athletic League postseason play. None of the players advanced past the SCVAL rounds.\r\n\r\nAccording to senior captain Shiv Matta, who suffered a concussion midway before the start of the De Anza League regular season, minor injuries frequently prevented the team from playing up to its full potential.\r\n\r\n\"It was a tough season because we had a lot of injuries and a lot of people missed time,\" Matta said. \"Our lineup had to keep changing to accommodate that, but nonetheless it was another fun season with the team.\"\r\n\r\nAlthough Matta and fellow seniors Drew Embersits and Carl Goodfriend are frustrated by the tough season, they say that they are excited for the team's future.\r\n\r\n\"It was a tough season with injuries and the like, but a lot of underclassmen performed really well, which means a lot of potential for the future,\" Embersits said. \"Overall it was a good season with only better ones ahead.\"\r\n\r\nThe leadership role will be assumed by Smith, a varsity player since his freshman year, and other rising seniors including Badger and Hong.\r\n\r\nGoodfriend recalls team bonding activities as one of the top highlights of his Paly career.\r\n\r\n\"I really enjoyed all of the creative cheers we came up with over the years,\" Goodfriend said.\r\n\r\nAs for Matta, who is thinking of walking on to the University of Illinois at Urbana-Champaign tennis team in the future, his favorite memories consist of the team's competitive tournaments in Fresno.\r\n\r\n\"My favorite moments were the two Fresno trips I was a part of,\" Matta said. \"Sophomore year we won the back-draw [losers play a minimum of three matches] tournament and last year we won it all so they were two great trips with a lot of success and a lot of fun.\"\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"Despite an injury-riddled season, members of the Palo Alto boys' tennis team are excited for what next season will bring, even with the departure of several key seniors. ","date":"2016-05-11 18:42:32","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Adriancandid1.jpg","categories":["Sports","Spotlight"],"tags":["#tagsarecool","badger","cause nika said so","embersits","georgiadis","goodfriend","Harader","hong","love","matta","north","paly tennis","sports","tennis"]},{"id":120398,"title":"Advisory this week is for all freshman and sophomores","permalink":"http:\/\/palyvoice.com\/2016\/05\/11\/advisory-this-week-is-for-all-freshman-and-sophomores\/","content":"","excerpt":"","date":"2016-05-11 18:00:06","author":"Chirag Akella","categories":["Ticker"],"tags":[]},{"id":120352,"title":"Boys&#8217; lacrosse looks to move onto league finals","permalink":"http:\/\/palyvoice.com\/2016\/05\/10\/boys-lacrosse-looks-to-move-onto-league-finals\/","content":"[caption id=\"attachment_51413\" align=\"alignnone\" width=\"568\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/03\/mce_031113_0382.jpg\"><img class=\" wp-image-51413\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/03\/mce_031113_0382.jpg\" alt=\"Seniors Skyler Anderson (left) and Weston Preising celebrate Anderson's goal in the second quarter of Paly's 12-11 home loss to Burlingame Monday night. Photo by Matt Ersted.\" width=\"568\" height=\"378\" \/><\/a> Seniors Skyler Anderson (left) and Weston Preising celebrate Anderson's goal in the second quarter of Palo Alto High School's 12-11 home loss to Burlingame. Photo by Matt Ersted.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto High School boys’ lacrosse team (15-5, 8-1) will take on Saratoga High School (6-7, 4-4) at 5:30 p.m. on Wednesday at the Paly lacrosse field, hoping to defeat the Falcons in the Santa Clara Valley Athletic League semi-finals. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">After a blowout win over Los Altos High School last Thursday, the Vikings look to continue their six-game win streak as the team heads towards the SCVAL finals. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to senior co-captain Cole Tierney, the Vikings feel optimistic heading into tomorrow’s game.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We feel pretty confident considering our placement in league,” Tierney said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Furthermore, Tierney said that the Vikings will focus on infiltrating the Falcons’ weak defense.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Saratoga has a good midfield, but their [Saratoga] defense is slow and they leave the back side open,” Tierney said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The last time the two teams met, the Vikings dominated the Falcons, scoring a massive 12 goals in the match according to Maxpreps.com<\/span>\r\n\r\nAlong with the team’s confidence, junior midfielder Jackson Dahl stresses the importance of staying focused.\r\n\r\n<span style=\"font-weight: 400;\">“In practice our major focus has been our mental game, because that is usually our limiting factor,” Dahl said. “If we can pull together, work as a team, and stay focused throughout the entire game, then we can do anything.”<\/span>","excerpt":"The Palo Alto High School boys’ lacrosse team (15-5, 8-1) will take on Saratoga High School (6-7, 4-4) at 5:30 p.m. on Wednesday at the Paly lacrosse field, hoping to defeat the Falcons in the Santa Clara Valley Athletic League semi-finals.\r\n","date":"2016-05-10 23:31:48","author":"Sam Lee","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/03\/mce_031113_0382.jpg","categories":["Sports","Spotlight"],"tags":["Boys","cole tierney","Jackson Dahl","Lacrosse","lax","paly","Saratoga Falcons","scvals","sports","vikings"]},{"id":120239,"title":"What&#8217;s in my bag: Tiffany Tsay","permalink":"http:\/\/palyvoice.com\/2016\/05\/10\/whats-in-my-bag-tiffany-tsay\/","content":"As part of The Paly Voice’s “What’s in my Bag” series to find out more about students at Palo Alto High School, we sat down with senior Tiffany Tsay to ask what’s in her bag. Hover around the photos to learn more. Photos by Cooper Lou.\r\n\r\n<img class=\"alwaysThinglink\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/785370092467650561\/1024\/10\/scaletowidth#tl-785370092467650561;1043138249'\" alt=\"\" \/><script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script>","excerpt":"As part of The Paly Voice’s “What’s in my Bag” series to find out more about students at Palo Alto High School, we sat down with senior Tiffany Tsay to ask what’s in her bag. ","date":"2016-05-10 10:51:35","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Tiff2.jpg","categories":["Multimedia","Spotlight"],"tags":["jackson nelson-gal","palo alto high school","paly","tiffany tsay","what's in my bag"]},{"id":120317,"title":"Badminton players win at Leagues, head to CCS","permalink":"http:\/\/palyvoice.com\/2016\/05\/09\/badminton-players-win-at-leagues-head-to-ccs\/","content":"Four players from the Palo Alto High School badminton team are heading to the Central Coast Section finals after placing at the Santa Clara Valley Athletic League competition on Saturday.\r\n\r\nThe three-day tournament started on Thursday, and determined who goes to the Central Coast Sections finals and ultimately, the CIF-Norcal competition. The team went into Leagues winning five of the 12 dual games, according to sophomore Emily Yu.\r\n\r\nAccording to Yu, the top four players in each division heads to CCS. There were 24 players from Paly who competed at Leagues.\r\n\r\nSophomore Michael Chau and senior Eric Chiang placed first in the boy's doubles division, according to Chiang. The pair won six of their seven games.\r\n<div class=\"_4tdt\">\r\n<div class=\"_4tdv\">\r\n<div class=\"_5wd4 _1nc7 direction_ltr\">\r\n<div class=\"_5wd9\">\r\n<div class=\"_5wde _n4o\">\r\n<div class=\"_5w1r _3_om _5wdf\">\r\n<div class=\"_4gx_\">\r\n<div class=\"_d97\">\r\n\r\n<span class=\"_5yl5\">\"I think we played pretty well,\" Chiang said. \"For the past week or two, I have had a shoulder injury which prevented us from playing at our best. There are still things we can approve as this is just the second time we played doubles together this season.\"<\/span>\r\n<div class=\"_d97\">\r\n<div class=\"_4tdt\">\r\n<div class=\"_4tdv\">\r\n<div class=\"_5wd4 _1nc7 direction_ltr\">\r\n<div class=\"_5wd9\">\r\n<div class=\"_5wde _n4o\">\r\n<div class=\"_5w1r _3_om _5wdf\">\r\n<div class=\"_4gx_\">\r\n<div class=\"_d97\">\r\n\r\nThe pair hopes to final at CCS and advance to the CIF-Norcal competition.\r\n<div class=\"_4tdt\">\r\n<div class=\"_31o4\">\r\n\r\n\"The only goal we have in mind right now, considering the regular season is over, is to get to NorCal and hopefully place at NorCal,\" Chiang said.\r\n<div class=\"_31o4\">\r\n\r\n The Vikings also did well in the girl's double division, with senior Priya Misner and junior Flavia Stiglich finishing second, winning five of their seven games.\r\n<div class=\"_31o4\">\r\n\r\nOther notable performances included sophomore Tilak Misner, who got to the quarterfinals in the boy's single division before dropping. He won four of his six games, placing him in seventh place.\r\n\r\nMore information on rankings and records can be found at this <a href=\"http:\/\/challonge.com\/users\/mugdays\">website<\/a>.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","excerpt":"Four players from the Palo Alto High School Badminton team are heading to the Central Coast Section finals after placing at the Santa Clara Valley Athletic League competition on Saturday. ","date":"2016-05-09 21:25:22","author":"Julia Qiao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/IMG_0416.jpg","categories":["Badminton","News","Spotlight"],"tags":["badminton","CCS","eric chiang","Flavia Stiglich","leagues","Michael Chau","Priya Misner","scval","Tilak Misner"]},{"id":120266,"title":"&#8220;Captain America: Civil War&#8221; is basically &#8220;Avengers 2.5&#8221;","permalink":"http:\/\/palyvoice.com\/2016\/05\/09\/captain-america-civil-war-is-basically-avengers-2-5\/","content":"[caption id=\"attachment_120296\" align=\"alignnone\" width=\"640\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Captain-America-Civil-War_1457366587703_891849_ver1.0_640_360.png\"><img src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Captain-America-Civil-War_1457366587703_891849_ver1.0_640_360.png\" alt=\"Falcon (Anthony Mackie), Ant-Man (Paul Rudd), Hawkeye (Jeremy Renner), Captain America (Chris Evans), Scarlet Witch (Elizabeth Olson) and the Winter Soldier (Sebastian Stan) make up Captain America&#039;s team in &#039;Captain America: Civil War.&#039; Photo: © 2016-Marvel Studios\" width=\"640\" height=\"334\" class=\"size-full wp-image-120296\" \/><\/a> Falcon (Anthony Mackie), Ant-Man (Paul Rudd), Hawkeye (Jeremy Renner), Captain America (Chris Evans), Scarlet Witch (Elizabeth Olson) and the Winter Soldier (Sebastian Stan) make up Captain America's team in 'Captain America: Civil War.' Photo: © 2016-Marvel Studios[\/caption]\r\n\r\n\r\n\"Captain America: Civil War\" directors Joe and Anthony Russo tell the story of the conflict between two central characters in the Marvel Universe, succeeding in some areas but falling short in others. Based off of a Marvel comic of the same name, \"Civil War\" revolves around the the growing rift between Iron Man (Robert Downey Jr.) and Captain America (Chris Evans). As the situation escalates, their friends are forced to choose sides and fight.\r\n\r\nThe movie begins with a bang, as Scarlet Witch (Elizabeth Olsen) accidentally causes an explosion, killing several civilians which leads to the question of whether the Avengers should be regulated. Secretary of State Thaddeus Ross (William Hurt) approaches the Avengers with a plan to place them under United Nations control, no longer allowing them to operate independently.  Lines are drawn quickly as Iron Man voices his support for the plan, along with Black Widow (Scarlett Johansson), Vision (Paul Bettany) and War Machine (Don Cheadle). Captain America is against the plan and refuses to obey them, putting him and Iron Man on opposing sides.\r\n\r\nDespite all this, the plan proposed by Ross is not the main source of conflict. This instead comes from the reappearance of the Winter Soldier (Sebastian Stan), and the introduction of a mysterious villain Helmut Zemo, (Daniel Bruhl). It is the lengths that Captain America goes to protect his friend, and the loyalty that he has towards him that drives the conflict and results in quite possibly the most spectacular battle scene in the Marvel franchise, bringing together all of the Avengers and some extras as Ant-Man (Paul Rudd), Spider-Man (Tom Holland) and Black Panther (Chadwick Boseman) all choose sides and fight.\r\n\r\nWhere the movie falls flat, however, is the main underlying story. Captain America and Iron Man are friends, then they fight, but then they become friends again? Wait, no, they're fighting again. The final fight between the two just feels too forced; there isn't really a rational reason behind it. In addition, the main villain, Zemo, doesn't seem to convey a serious threat. His motives are clear, but his plan is simply too convoluted. He does however participate in a nice little twist that breaks away from the standard Marvel formula. Despite this Zemo simply isn't given enough room to work a screen, creating a flimsy antagonist, a problem that Marvel movies have been repeating, with the exception of Loki (Tom Hiddleston) in \"The Avengers.\" \r\n\r\nOne of the best parts of the movie is the addition of Spider-Man, who makes his debut in the Marvel cinematic universe. With Sony's release of the Spider-Man license, Marvel is now able to use the character in future movies. Holland nails the role of a teen superhero, with all the quips and jokes that the superhero is supposed to have. He is the first movie version of Spider-Man that actually feels and acts like a kid. Despite only appearing in the movie for a brief moment, he absolutely steals the spotlight, overshadowing the introduction of another key Marvel character, Black Panther. Nonetheless, Black Panther is a welcome addition to the movie and has a solid subplot to the overall story.\r\n\r\nWhile not on the same level as \"Captain America: The Winter Soldier\", \"Civil War\" manages to deliver a solid package. The introduction of new characters (Spider-Man!) and some incredible fight scenes more than make up for a shaky plot. If you enjoy any Marvel movie, do yourself a favor and go see this one.\r\n\r\n<strong> Captain America: Civil War\r\n2 hours 27 minutes\r\nRated PG-13\r\nDirected by Joe and Anthony Russo\r\nStarring Chris Evans, Robert Downey Jr., Sebastian Stan<\/strong>\r\n","excerpt":" Based off of a Marvel comic of the same name, \"Civil War\" revolves around the the growing rift between Iron Man (Robert Downey Jr.) and Captain America (Chris Evans). As the situation escalates, their friends are forced to choose sides and fight.","date":"2016-05-09 18:07:01","author":"Jackson Doerr","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Captain-America-Civil-War_1457366587703_891849_ver1.0_640_360.png","categories":["Entertainment","Reviews","Uncategorized"],"tags":["avengers","captain america","civil war","marvel"]},{"id":120137,"title":"News in Review: April 2016","permalink":"http:\/\/palyvoice.com\/2016\/05\/08\/news-in-review-april-2016\/","content":"<em>This installment of the News in Review series summarizes the most important news stories and events from the month of April in a timeline format.\r\n<\/em>\r\n\r\n&nbsp;\r\n\r\n<iframe src=\"https:\/\/cdn.knightlab.com\/libs\/timeline3\/latest\/embed\/index.html?source=1vtcizLawVLBD5S3vLWcpwxxr8TeYE8PY2rVQjXNGQrE&amp;font=Default&amp;lang=en&amp;initial_zoom=2&amp;height=650\" width=\"100%\" height=\"650\" frameborder=\"0\"><\/iframe>","excerpt":"This installment of the News in Review series summarizes the most important news stories and events from the month of April in a timeline format.","date":"2016-05-08 14:15:22","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/untitled-presentation1.png","categories":["Multimedia","Spotlight"],"tags":["i love news","more news","news","news ???","news in review","news is crazy fun","news news news","news saved my life","news&lt;3333","plz news","review","so much news","such news","very news"]},{"id":120171,"title":"Performing Arts Center ushers in a new era","permalink":"http:\/\/palyvoice.com\/2016\/05\/06\/performing-arts-center-ushers-in-a-new-era\/","content":"[caption id=\"attachment_120173\" align=\"aligncenter\" width=\"592\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Screen-Shot-2016-05-05-at-6.15.59-PM.png\"><img class=\" wp-image-120173\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Screen-Shot-2016-05-05-at-6.15.59-PM.png\" alt=\"new performing arts center \" width=\"592\" height=\"395\" \/><\/a> Palo Alto High School's orchestra plays for the first time in the new Performing Arts Center to test and adjust the new acoustic audio system of the building. Instrumental Music teacher Jeff Willner experiments with the space, moving students while working with the sound technician to create the best settings for the band and orchestra. Photo: Zahra Muzaffar.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Palo Alto High School’s new Performing Arts Center is opening this week for the first time after nearly two years of construction. The new PAC will replace the historic Haymarket Theatre that has been a trademark of Paly history since 1917, according to <a href=\"http:\/\/www.paly.net\/paly-history\">paly.net<\/a>.\r\n<\/span>\r\n\r\n<span style=\"font-weight: 400;\">As the final touches are made to the building, Paly's various performing groups have begun rehearsing with the new sound system and work to manage the sound settings to calibrate it with each individual ensemble.\r\n<\/span>\r\n\r\nChoir, band and orchestra have all been given the chance to perform in the new building and work alongside the sound technicians, though the center is only open for students during school practices, according to choir teacher Michael Najar.\r\n\r\n<span style=\"font-weight: 400;\">One new aspect of the center are the audio settings. The building has a <a href=\"http:\/\/www.meyersound.com\/product\/constellation\/\">Constellation sound system<\/a>, which is a digitally acoustic environment that can change depending on the performer and what type of sound they want, according to Najar.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It changes the audience's perspective of the sound,” Najar said. “The system doesn't feel inauthentic and the bottom line is that it creates delay and strength without them even knowing it. You can feel like you’re in a 16th century chapel or an intimate jazz setting depending on which ensemble is on stage.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Paly's student performers are also very excited about its opening and how it will contribute to their shows and productions in the future.\r\n<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It's just a beautiful space,” junior choir member Anisha Patwardhan said. “The acoustic panels allowed our acapella groups to have the perfect opportunity to sing and be able to hear each other.”  <\/span>\r\n\r\nAlthough the building will not be officially opening until the fall of 2016, it will be used for the next choir concert and have soft openings for previewing the space, according to Najar.\r\n\r\n“As someone who has had many opportunities to stand on many different stages, it was a beautiful and unique experience,” Najar said. \"I encourage everyone to experience the theater. For me this [process] has been a magical experience.\"","excerpt":"Palo Alto High School’s new Performing Arts Center is opening this week for the first time after nearly two years of construction. The new PAC will replace the historic Haymarket Theatre that has been a trademark of Paly history since 1917, according to paly.net.","date":"2016-05-06 17:18:44","author":"Morgan Keller","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/Screen-Shot-2016-05-05-at-6.15.59-PM.png","categories":["News"],"tags":["arts","band","building","center","construction","najar","new","open","paly","Performing","performing arts center","practice","sound","student","testing","willner"]},{"id":120200,"title":"Liveblog: Girls&#8217; lacrosse plays Pioneer on Senior Night","permalink":"http:\/\/palyvoice.com\/2016\/05\/06\/liveblog-girls-lacrosse-plays-pioneer-on-senior-night\/","content":"Check back at 5:30 p.m. for live updates as Palo Alto High School girls' lacrosse (14-4, 12-1) takes on Pioneer High School (2-11, 2-11). The Vikings will celebrate their seniors tonight in a ceremony before the game tonight at Paly's field.\r\n\r\n[liveblog]","excerpt":"Check back at 5:30 p.m. for live updates as Palo Alto High School girls' lacrosse (14-4, 12-1) takes on Pioneer High School (2-11, 2-11). The Vikings will celebrate their seniors tonight in a ceremony before the game tonight at Paly's field.","date":"2016-05-06 17:17:57","author":"Claire Krugler","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/390.jpg","categories":["Sports"],"tags":[]}]