[{"id":125827,"title":"How Palo Alto voted in the 2016 election","permalink":"http:\/\/palyvoice.com\/2016\/11\/10\/how-palo-alto-voted-in-the-2016-election\/","content":"<iframe style=\"overflow-y: hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/17978386-how-palo-alto-voted\" width=\"620\" height=\"1850\" frameborder=\"0\" scrolling=\"no\"><\/iframe>","excerpt":"This infographic shows the margins that Palo Alto residents voted for Hillary Clinton, Vicki Veenker, Todd Collins, Jennifer DiBrienza, and Kamala Harris.","date":"2016-11-10 11:29:05","author":"Siddarth Sharma","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/DSC_0003.jpg","categories":["Multimedia","News","Spotlight"],"tags":["2016 election","berman","Hillary","infographic","johnson","kamala harris","loretta sanchez","President","School Board","senate","state assembly","Trump","veenker"]},{"id":125679,"title":"Girls&#8217; golf season ends with CIF knockout round loss","permalink":"http:\/\/palyvoice.com\/2016\/11\/10\/girls-golf-season-ends-with-cif-knockout-round-loss\/","content":"[caption id=\"attachment_125824\" align=\"alignnone\" width=\"698\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/15045532_911617032305538_23200426_o2.jpg\"><img class=\"size-full wp-image-125824\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/15045532_911617032305538_23200426_o2.jpg\" alt=\"The Palo Alto High School girls' golf team poses with their plaque at the NorCal tournament in Salinas. The team would go on to place 6th and unfortunately not advance to the next stage. Photo: Joyce Choi\" width=\"698\" height=\"460\" \/><\/a> The Palo Alto High School girls' golf team poses with its plaque at the CCS tournament in Carmel Valley. The team placed 2nd at CCS and would go on to compete at NorCal, where it ended its season with a 6th place finish. Photo: Joyce Choi.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto High School girls’ golf team saw its season come to a close Monday  with a 6th place finish in the Northern California tournament in Salinas.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Strong performances from several players, including junior Stephanie Yu and sophomore Jasmine Choi, boosted Paly in the standings, but the team as a whole was unable to advance to the California Interscholastic Federation State Championship.<\/span>\r\n\r\nYu, who was the medalist at the Central Coast Section tournament after facing down four other players in a sudden death round, found herself in a similar situation on Monday, when she tied with three other players and entered into another sudden death round. The golfers competed for the last open individual spot at CIF.\r\n\r\n<span style=\"font-weight: 400;\">Despite seeing her season end along with her teams, Yu remains happy with the end result. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I think we had a really strong team this year,” Yu said. “I was really hoping that we would be able to make it to States, but making it to NorCal was already pretty great, since we only made it to CCS last year.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Choi has a slightly different view from Yu. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I’m really proud of the team for making it that far even though we didn’t play as well as we could’ve,\" Choi said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Going forward, Choi says she believes that the team’s main focus should be tournament practice.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We definitely need to practice more and be prepared for big tournaments,” Choi said. “We also need to play more 18-hole courses as a team because it's different from playing  nine-hole courses.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Nine-hole courses are the standard matches that the Vikings played during the regular season against other schools. Tournament play consists of 18-holes, which is significantly longer. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The success of the team this year is a major step up from the 2015 season. Last year, the team was able to reach CCS, but could not advance past that stage to the NorCal tournament.<\/span>\r\n\r\n[caption id=\"attachment_125819\" align=\"alignleft\" width=\"333\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/slack_for_ios_upload_960.jpg\"><img class=\" wp-image-125819\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/slack_for_ios_upload_960.jpg\" alt=\"Senior Elise Kiya played in her last golf match for Paly this past Tuesday. Kiya shot 89, and with her team was unable to advance. Photo: Emily Hwang\" width=\"333\" height=\"350\" \/><\/a> Senior Elise Kiya played in her last golf match for Paly this past Tuesday. Kiya shot 89, and with her team was unable to advance. Photo: Emily Hwang.[\/caption]\r\n\r\nElise Kiya, a senior on the team, is glad she decided to play golf for the Vikings.\r\n\r\n<span style=\"font-weight: 400;\">“Golf is hard and time-consuming,” senior Elise Kiya said. “But it's been fun and I've met some really fantastic people.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">With the loss of its seniors, the team will have to look towards its younger players for guidance in the future seasons.<\/span>\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School girls’ golf team saw its season come to a close Monday  with a 6th place finish in the Northern California tournament in Salinas.","date":"2016-11-10 10:58:50","author":"Jackson Doerr","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/15045532_911617032305538_23200426_o2.jpg","categories":["Golf","Sports","Sports Recap"],"tags":["#norcal","2016","CCS","cif","elise kiya","girls golf","Golf","jasmine choi","states","stephanie yu"]},{"id":125263,"title":"Opinion: Shortage of senior advisories leads to confusion","permalink":"http:\/\/palyvoice.com\/2016\/11\/10\/opinion-shortage-of-senior-advisories-leads-to-confusion\/","content":"<span style=\"font-weight: 400;\">On Nov. 1, many Palo Alto High School seniors submitted their early applications for college. On Nov. 3, two days after the deadline, advisory was held for seniors for the first time in over two months.  This ineffective schedule has led to confusion and stress for seniors currently going through the college application process.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Paly created the Teacher Advisor system in part, to provide guidance for students as they navigate post-high school planning. <\/span>However, the lack of senior class advisories has created chaos and confusion during a critical time in students' high school careers.  While current seniors could still benefit from an improved advisory system, it is imperative that Paly implement more college-oriented advisories for future senior classes.\r\n\r\n<span style=\"font-weight: 400;\">Seniors applying to college expect guidance from their TAs, however, this is not possible if advisories aren’t scheduled.  Although students are able to set up individual meetings with their advisors, mandatory advisories have to be implemented so all students are motivated to receive the critical information about the whole process.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">College form deadlines that are set by Paly, such as those for the Cover sheet or the NACAC form, an application to receive financial aid, have left seniors in a state of confusion.  Also, leading up to and on the due date of transcript orders, students served as peer advisors warning friends about the deadline; had an advisory been scheduled for the previous week, the chaos could have been avoided.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to TA coordinator Ann Deggelman, seniors have all the information they need to know about applications.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We set up the calendar so it’s the same every year,\" Deggelman said.  \"At the end of junior [year] there are a lot of junior advisories preparing them for senior year and post college planning.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Junior year advisories do prepare students well for upcoming events and for taking standardized testing; however, seniors do not have all the information they need to know about applications during the actual process. Students also receive the Viking Guide at the beginning of their junior year. This guide is not very beneficial because there is a great amount of information in them that students are not able to navigate through without the guidance of advisors.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">While beneficial to prepare students ahead of time, many misplace materials or forget essential information and deadlines over the summer. Additionally, the substantial amount of information given during junior year can be overwhelming and should be spread out over the course of senior year.  Seniors need to have advisory during the actual process so their TAs can guide them through the applications in real time and remind them of deadlines or timelines they should be currently aware of.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">While one of the last advisories for seniors did review early applications and financial aid for students, the meeting was held on Sept 1., two months before the actual application deadlines.  Many students did not retain all this information, nor did they carry it with them for over six weeks.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior Andrea O’Riordan believes that more advisories are necessary for seniors.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I think the cover letter was briefly mentioned [last advisory] but other than that I don’t remember much else that we did,” O’Riordan said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The advisory system is meant to help students through the confusing times of college applications, but the insufficient advisory schedule makes seniors feel like Paly admin threw a great amount of information at them and then left them on their own through the actual college application process.  It was created with goals that include helping students connect with their advisors as well as reduce stress throughout their post-high school planning, but until more senior advisories are implemented with actual information about current timelines or deadlines, the system is not fulfilling its purpose.  <\/span>","excerpt":"While current seniors could benefit from an improved advisory system, it is imperative that Paly implement more college oriented advisories for future seniors.","date":"2016-11-10 09:52:26","author":"Morgan Keller","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/CCC-Photo.jpg","categories":["Opinion","Spotlight"],"tags":["Advisory","college","college applications","early","new","Nov 1","opinion","revamp advisory","seniors","shortage","Stress"]},{"id":125886,"title":"There is no school on Friday, Nov. 11 due to veterans day","permalink":"http:\/\/palyvoice.com\/2016\/11\/10\/there-is-no-school-on-friday-nov-11-due-to-veterans-day\/","content":"","excerpt":"","date":"2016-11-10 09:42:27","author":"Chirag Akella","categories":["Ticker"],"tags":[]},{"id":125652,"title":"Liveblog: 2016 elections results","permalink":"http:\/\/palyvoice.com\/2016\/11\/08\/liveblog-2016-elections-results\/","content":"Voters across the United States will be selecting their future president along with an array of local and state politicians today.\r\n\r\nTune in to see The Paly Voice's liveblog of all local, state and national elections.\r\n\r\n<hr \/>\r\n\r\n<strong>11:33 p.m.<\/strong>\r\n\r\nTrump will be the 45th president of the United States.\r\n\r\n<strong>9:56 p.m.<\/strong>\r\n\r\nThanks for tuning in to The Paly Voice's liveblog! Stay tuned on major networks to see the final election results. Check out the in-depth state election results <a href=\"http:\/\/apps.mercurynews.com\/election-results-2016\/#santaclaracounty\">here<\/a>.\r\n\r\n<strong>9:33 p.m.<\/strong>\r\n\r\nNevada, with six electoral votes, goes to Clinton. Clinton has 215 votes to Trump's 244.\r\n\r\n<strong>9:25 p.m.<\/strong>\r\n\r\nThe Dow Jones has dropped more than 800 points, and the NASDAQ is stumbling, according to NBC.\r\n\r\n<strong>9:21 p.m.<\/strong>\r\n\r\nClinton leads in Nevada, though it is too close to project a winner.\r\n\r\n<strong>9:13 p.m.<\/strong>\r\n\r\nTrump is only 26 electoral votes from becoming the next president of the United States.\r\n\r\n<strong>9:10 p.m.<\/strong>\r\n\r\nIn comparison to 2012, fewer people voted for third party candidates than in this year's election.\r\n\r\n<strong>9:09 p.m.<\/strong>\r\n\r\n\"He [Trump] won this by trashing the press. He won this by saying things we thought you couldn't say,\" says an NBC reporter.\r\n\r\n<b>9:07 p.m.<\/b>\r\n\r\nFun Fact #9: It is important to note that the electoral college can vote for whomever they want, even if the voters in their state choose otherwise. Throughout American history, although there have been instances where electoral members have voted for someone other than who the public voted for, it has never changed the outcome of the election.\r\n\r\n<strong>9:02 p.m.<\/strong>\r\n\r\nClinton's popular vote is at 47% to Trump's 48%.\r\n\r\nAs of now, Maine, Minnesota, Nevada, Arizona and Pennsylvania are too close to call. However, Trump is still projected to win.\r\n\r\n<strong>8:47 p.m.<\/strong>\r\n\r\nProposition 53, which requires statewide voter approval for bonds over 2 billion dollars, is split by 50%.\r\n\r\n<b>8:44 p.m.<\/b>\r\n\r\nJohnson and Stein take up a total of 2.7% of popular votes. Could this have swayed the election results?\r\n\r\n<strong>8:37 p.m.<\/strong>\r\n\r\nCrowds of Trump supporters can be seen jumping and cheering, while Clinton supporters seem to be quiet.\r\n\r\n<b>8:35 p.m.<\/b>\r\n\r\nDemocrats lag in the presidential, Senate, and House of Representatives races.\r\n\r\n<strong>8:33 p.m.<\/strong>\r\n\r\nFun Fact #8: Kamala Harris is the second black woman to be elected to the US Senate.\r\n\r\n<strong>8:31 p.m.<\/strong>\r\n\r\nTrump just won Utah, NBC says. He leads with 228 electoral votes over Clinton's 209.\r\n\r\n<strong>8:27 p.m.<\/strong>\r\n\r\nIf Trump takes Michigan and Arizona, ABC predicts Trump will win the presidency.\r\n\r\n<strong>8:26 p.m.<\/strong>\r\n\r\nThe Dow Jones is down around 700 points, which is the largest dip since the Great Recession.\r\n\r\n<b>8:25 p.m.<\/b>\r\n\r\nProposition 64 in California is projected to pass, which may legalize the use of recreational marijuana. Kamala Harris has just been elected to the US Senate.\r\n\r\n<strong>8:19 p.m.<\/strong>\r\n\r\nTrump leads in Utah, Montana, and Iowa.\r\n\r\n<b>8:17 p.m.<\/b>\r\n\r\nFun Fact #7: Clinton was a part of Wellesley Young Republicans Club, and grew up in a conservative Illinois household.\r\n\r\n<strong>8:12 p.m.<\/strong>\r\n\r\nTrump takes North Carolina.\r\n\r\n<strong>8:11 p.m.<\/strong>\r\n\r\nFun Fact #6: If Clinton wins the presidency, daughter Chelsea Clinton will be the first person to have both parents in the White House.\r\n\r\n<strong>8:01 p.m.<\/strong>\r\n\r\nCalifornia, Oregon and Washington voted for Clinton; Idaho voted for Trump.\r\n\r\n<strong>7:57 p.m.<\/strong>\r\n\r\nElection website 270 to Win appears to have crashed.\r\n\r\n<strong>7:54 p.m.<\/strong>\r\n\r\nTrump has won Florida. This makes Clinton's path to victory much more difficult.\r\n\r\n<strong>7:47 p.m.<\/strong>\r\n\r\nIn order for Clinton to win, she must win Wisconsin AND Michigan, along with either New Hampshire or Nevada.\r\n\r\n<strong>7:42 p.m.<\/strong>\r\n\r\nIn Michigan, Trump has 49 percent to Clinton's 46 percent. Trump's lead has shrank by a little bit, but is it enough?\r\n\r\n<strong>7:37 p.m.<\/strong>\r\n\r\nAP hasn't updated the results in a long time. It looks like Trump has the edge.\r\n\r\n<strong>7:28 p.m.<\/strong>\r\n\r\nNBC reports that Virginia has gone for Clinton. This was a state she needed to win.\r\n\r\n<strong>7:24 p.m.<\/strong>\r\n\r\nOhio has gone for Trump. Polls in California close in about half an hour.\r\n\r\n<strong>7:18 p.m.<\/strong>\r\n\r\nThere are many states too close to call.  Wisconsin is slowing inching towards Clinton. New Hampshire remains red.\r\n\r\n<strong>7:08 p.m.<\/strong>\r\n\r\nAt this point, it looks like it will be very difficult for Democrats to capture the Senate. Republicans have 44 seats; Democrats 42.\r\n\r\n<strong>7:06 p.m. <\/strong>\r\n\r\nNBC calls New Mexico for Clinton; Missouri for Trump.\r\n\r\n<strong>6:54 p.m.<\/strong>\r\n\r\nNBC reporting that Clinton has taken the lead in Virginia. Minnesota also trending blue. Wisconsin and Michigan still trending red.\r\n\r\n<strong>6:48 p.m.<\/strong>\r\n\r\nClinton is slowly gaining votes in Virginia. Minnesota, Michigan and Wisconsin are all trending red. I think we may be seeing the Brexit effect in the United States.\r\n\r\n<strong>6:43 p.m.<\/strong>\r\n\r\nWith 90 percent voting in Virginia, Trump is ahead by 16,000 votes.\r\n\r\n<strong>6:41 p.m.<\/strong>\r\n\r\nIf Trump wins the election, I will be very disappointed in many the polls that showed Clinton ahead.\r\n\r\n<strong>6:38 p.m.<\/strong>\r\n\r\nClinton can afford to lose North Carolina, Florida, Ohio, Iowa, New Hampshire and Arizona if she holds her other firewall states. Unfortunately for Clinton, Virginia currently leans red. So does Minnesota and Michigan.\r\n\r\n<strong>6:33 p.m.<\/strong>\r\n\r\nIs anyone else really surprised by how close the results are so far? I thought Clinton had it in the bag.\r\n\r\n<strong>6:28 p.m.<\/strong>\r\n\r\nClinton still trails Trump, this time 97 to 129 electoral votes, according to AP.\r\n\r\n<strong>6:20 p.m.<\/strong>\r\n\r\n\"It's incredibly how tight all these races are,\" an NBC reporter says.\r\n\r\n<strong>6:13 p.m.<\/strong>\r\n\r\nMichigan is extremely close, with Trump in the lead by a few hundred votes.\r\n\r\n<strong>6:05 p.m.<\/strong>\r\n\r\nClinton now trails in the electoral college with 97 votes to Trump's 123, after Wyoming, North Dakota, South Dakota, Nebraska, Kansas and Texas voted red while New York voted blue.\r\n\r\n<strong>6:00 p.m.<\/strong>\r\n\r\nAccording to AP,\r\n\r\nClinton has won: DE, DC, MD, MA, NJ, RI, IL and VT (68 electoral votes)\r\n\r\nTrump has won: AL, IN, KY, MS, OK, SC, TN and WV (66 electoral votes)\r\n\r\nOther news organizations are reporting different demographics.\r\n\r\n<strong>5:56 p.m.<\/strong>\r\n\r\nAccording to ABC News, Republicans will retain control of the House of Representatives.\r\n\r\n<strong>5:52 p.m.<\/strong>\r\n\r\nClinton has not lead in Virginia all night. This will concern her supporters, as the state was considered by many pundits to be a safe state for her.\r\n\r\n<strong>5:44 p.m.<\/strong>\r\n\r\nFun Fact #5: Hillary was part of the presidential impeachment inquiry of President Richard Nixon.\r\n\r\n<strong>5:42 p.m.<\/strong>\r\n\r\nClinton leads in Michigan and Pennsylvania, both of which are too early to call. Trump and Clinton are both beginning to solidify leads in a plethora of other states.\r\n\r\n<strong>5:35 p.m.<\/strong>\r\n\r\n\"We are feeling really good ... It's still early, but we're feeling really good about the ground we have mustered,\" a Clinton spokeswoman says.\r\n\r\n<strong>5:32 p.m.<\/strong>\r\n\r\nNBC reporters are highlighting the importance of Florida, where Trump currently has a slight edge. \"It becomes increasingly difficult for Trump to win without Florida.\"\r\n\r\n<strong>5:29 p.m.<\/strong>\r\n\r\nTrump has won Tennessee and Alabama, securing 60 electoral votes to Clinton's 44.\r\n\r\n<strong>5:18 p.m.<\/strong>\r\n\r\nAP shows that Trump now has a slight lead in the electoral college, with 51 votes to Clinton's 44.\r\n\r\n<strong>5:17 p.m.<\/strong>\r\n\r\nIn the Senate race, Democrats lead in New Hampshire, North Carolina and have won Connecticut and Maryland. Republicans have won Ohio, Kentucky, Oklahoma, South Carolina and Florida and are leading in Indiana, Alabama and Georgia.\r\n\r\n<strong>5:14 p.m.<\/strong>\r\n\r\nNote: The Paly Voice will not be able to begin reporting on local polls until at least 8 p.m., as that is when polls here closed.\r\n\r\n<strong>5:09 p.m.<\/strong>\r\n\r\nTrump is ahead in Texas, Tennessee and Alabama. Clinton wins Delaware. Clinton is ahead overall, 44 electoral votes to 31, according to Associated Press.\r\n\r\n<strong>5:07 p.m.<\/strong>\r\n\r\nElection Fun Fact #3: If elected, Trump would be the second president to be divorced.\r\n\r\n<strong>5:02 p.m.<\/strong>\r\n\r\nAssociated Press reports that Trump won Oklahoma; Clinton won Maryland, New Jersey &amp; Massachusetts.\r\n\r\n<strong>4:55 p.m.<\/strong>\r\n\r\n\"All eyes are on New York, where the polls are closing,\" an NBC reporter says.\r\n\r\n<strong>4:51 p.m.<\/strong>\r\n\r\nNBC has called South Carolina for Trump.\r\n\r\n<strong>4:41 p.m.<\/strong>\r\n\r\nClinton now leads in New Hampshire; Trump leads in Ohio.\r\n\r\n<strong>4:37 p.m.<\/strong>\r\n\r\nTrump is leading in Florida, Georgia, South Carolina, North Carolina, Virginia &amp; New Hampshire.\r\n\r\n<strong>4:34 p.m.<\/strong>\r\n\r\nElection Fun Fact #2: A candidate has lost the election after winning the popular vote four times. The last was Al Gore versus George W. Bush in 2000. The others are: Grover Cleveland in 1888; Samuel Tilden in 1876; and Andrew Jackson in 1824.\r\n\r\n<strong>4:32 p.m.<\/strong>\r\n\r\nTrump has won West Virginia (with five electoral votes). According to NBC, Trump supporters should be worried by Clinton's current lead in Florida.\r\n\r\n<strong>4:31 p.m.<\/strong>\r\n\r\nPolls have closed in Ohio, North Carolina and West Virginia. South Carolina is leaning towards Trump.\r\n\r\n<strong>4:30 p.m.<\/strong>\r\n\r\nFlorida is now leaning blue again. Is it just me, or does Florida always make elections 10 times more wild?\r\n\r\n<strong>4:28 p.m.<\/strong>\r\n\r\nIf you are in the Bay Area and still need to vote, polls will be open for 3.5 more hours.\r\n\r\n<strong>4:22 p.m.<\/strong>\r\n\r\nAs the votes come in, many swing states are flipping back and forth in terms of who is in the lead. Trump takes the lead in Virginia and Georgia. Florida is extremely competitive; Trump is ahead by three percent.\r\n\r\n<strong>4:21 p.m.<\/strong>\r\n\r\nAccording to NBC, the candidates are the least popular Presidential candidates in history.\r\n\r\n<strong>4:16 p.m.<\/strong>\r\n\r\nResults from Virginia are beginning to be revealed. Clinton leads, 50 percent to 45 percent, with about 7,000 votes counted.\r\n\r\n<strong>4:12 p.m.<\/strong>\r\n\r\nTrump is leading Clinton, 57 percent to 28 percent, in Florida. However, Florida's major liberal cities have not tallied their votes yet.\r\n\r\n<strong>4:10 p.m.<\/strong>\r\n\r\nSenator Marco Rubio (aka \"Little Marco\") is currently ahead in the Florida senate race.\r\n\r\n<strong>4:07 p.m.<\/strong>\r\n\r\nTo pass the time, we will be peppering this liveblog with election fun facts!\r\n\r\nFun fact #1: At 70, Donald Trump would be the oldest candidate to be elected as a first-term president. Ronald Reagan was 69 when he won his first term, and 73 when he won for the second time.\r\n\r\n<strong>4:03 p.m.<\/strong>\r\n\r\nClinton has won Vermont; Trump wins Indiana. Trump leads with 19 electoral votes to Clinton's three.\r\n\r\n<strong>4:01 p.m.<\/strong>\r\n\r\nTrump has officially won Kentucky (no surprise)!\r\n\r\n<strong>3:36 p.m. <\/strong>\r\n\r\nTrump's lead in Kentucky and Indiana is rapidly growing. In New Hampshire, only 57 votes have been counted.\r\n\r\n<strong>3:23 p.m.<\/strong>\r\n\r\nTrump is now leading in Indiana—Not a surprise, given that Trump's running mate Mike Pence is the governor of the state.\r\n\r\n<strong>3:14 p.m.<\/strong>\r\n\r\nPresidential results are slowing coming in in Kentucky and New Hampshire. Donald Trump is leading in both, but few votes have been counted.\r\n\r\n<strong>3:09 p.m.<\/strong>\r\n\r\nThe very first results are coming through, but they don't relate to California. Republican Senate candidates Kelly Ayotte and Rand Paul lead in New Hampshire and Kentucky, respectively.\r\n\r\n<strong>3:05 p.m.<\/strong>\r\n\r\nThank you for tuning into The Paly Voice's liveblog! Polls on the East Coast began closing at 3 p.m. so some states' results will be published soon.","excerpt":"Voters across the United States will be selecting their future president along with an array of local and state politicians today. Tune in to see The Paly Voice's liveblog of all local, state and national elections.","date":"2016-11-08 09:23:15","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/voting-booth1.jpg","categories":["Election 2016","Spotlight"],"tags":["2016","assembly","California","city council","Donald Trump","election","Hillary Clinton","house of representatives","Politics","President","School Board","senate","spooky"]},{"id":125630,"title":"Grin and bear it: America should rally behind the next president","permalink":"http:\/\/palyvoice.com\/2016\/11\/07\/grin-and-bear-it-america-should-rally-behind-the-next-president\/","content":"In a race commonly referred to as the \"ugliest election season of all time,\" many voters are just as eager to express their readiness for it to all be over as they are to tell of their fear for America's future.\r\n\r\nRegardless of whether you're \"with her\" or if you want to \"make America great again,\" it is our duty as citizens of the United States to support our president, even if we have to grin and bear it.\r\n\r\nThis election has been far from civil. The Morning Conduct carried out a <a href=\"https:\/\/morningconsult.com\/trump-clinton-unpopular\/\">survey<\/a> asking voters who disapproved of the two candidates about the reasons for their views. To nobody's surprise, Clinton haters called her a liar, and 56 percent of voters think Trump is a racist. So why should anyone look up to either of these two as our president?\r\n\r\nWell, the answer lies in our country's roots. America has always been a nation driven by compromise: it is what allows us to function and thrive as a country. Our unique ability to work together despite sometimes having starkly differing opinions is imperative for finding middle ground on important issues and ultimately solving them.\r\n\r\nGenerally we live in a country where there is a division of power amongst the two major political parties. It is rare for Democrats or Republicans to hold the White House as well as a majority in both houses of Congress, meaning that most of American history has been comprised of inter-party collaboration.\r\n\r\nWhen we sacrifice our willingness to cooperate we give up our power to solve problems and continue to move forward as a nation. Part of what makes our political system so special is that we don't quit. Every four years roughly half the population is disappointed by the outcome of the presidential election, and that's just the nature of the system. However upsetting the result may be to some people, we all continue to work together in the meantime, and the losers simply try again in four years.\r\n\r\nThe worst decision Americans can truly make is to fail to honor the sacred electoral system that holds our great nation together. These next four years will be one the most consequential periods of modern American history, and we cannot look at issues like the war on terror and restoring the American economy with minds turned away from the idea of collaboration.\r\n\r\nWe could all spend the next four years complaining about how this November forced us to choose between the lesser of two evils, but where would that get us? I implore you, in an election season overrun by paranoia and hate, to see our next president as the leader of our nation, not the face of the party you didn't vote for.","excerpt":"Regardless of whether you're \"with her\" or if you want to \"make America great again,\" it is our duty as citizens of the United States to support our president, even if we have to grin and bear it.","date":"2016-11-07 22:01:50","author":"William Sallomi","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/Trump-and-Clinton.jpg","categories":["Opinion","Spotlight"],"tags":["Clinton","Donald Trump","election 2016","Hillary Clinton","Politics","Trump","voting"]},{"id":125467,"title":"Paly students: Who&#8217;s voting and why","permalink":"http:\/\/palyvoice.com\/2016\/11\/07\/paly-students-whos-voting-and-why\/","content":"<span style=\"font-weight: 400;\">The 2016 presidential election will no doubt go down in history as one of the most intense, controversial and chaotic elections in the history of the United States, but also as one of the most important national decisions. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Americans are tasked with choosing between presidential candidates Hillary Clinton and Donald Trump, both of whom have run campaigns riddled with scandals, leaving some voters with an extremely difficult decision to make.<\/span>\r\n\r\n[caption id=\"attachment_43954\" align=\"alignright\" width=\"478\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2012\/11\/2012-11-06-08.09.12.jpg\"><img class=\"wp-image-43954\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2012\/11\/2012-11-06-08.09.12.jpg\" alt=\"Voters wait in line inside Palo Alto High School's Tower Building to cast their vote. Photo by Phoebe So.\" width=\"478\" height=\"359\" \/><\/a> Voters wait in line inside Palo Alto High School's Tower Building to cast their vote in the 2012 elections, as many will this year as well. Photo by Phoebe So.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">That decision also rests on the shoulders of approximately 60 Palo Alto High School students, according to Karla Larson, Guidance Tech Assistant. Within just weeks — and in some cases, days — of turning 18 years old, a few lucky juniors and seniors have the chance to utilize their newfound rights and leave their mark on this year's election.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">For senior Tanner Newell, who turned 18 this past September, the decision to vote was difficult. He ultimately decided against voting in both the presidential and local elections. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I’m not going [to vote],” Newell said. “I don’t have enough time and I have other responsibilities.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">However, Newell emphasized that if he did find the time to vote come Nov. 8, he still would not participate in the local elections, because he will be moving out soon.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“If I do vote, it will just be to the presidential,” Newell said. “I'm not going to be in Palo Alto for the local elections to affect me.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">However, many eligible Paly students have decided to vote in the local and presidential elections this Tuesday. <\/span>Senior Matthew Seto credits his duty to vote in both elections to his time as a Boy Scout.\r\n\r\n“As Boy Scouts, we were taught about a duty to our nation, and voting was one of those obligations,” Seto said. \"It helps determine the future of your local community, as well as [the nation's.] Getting youth to vote is also very important as voting turnout in California is lower than the national average.”\r\n\r\nSeto emphasized that this specific election was not the basis of his decision to vote.\r\n\r\n“I think I still would have voted, regardless of the candidates or propositions on each ballot,” Seto said. “Even though California is dominantly Democratic, each vote for a policy or candidate still carries weight and importance.”\r\n\r\nOthers, like senior Ibby Day, feel that this presidential election is especially crucial to vote in.\r\n\r\n“I'm voting because this election matters to my future, and my peers' futures. Every vote does count, especially in this election,” Day said. “I'm voting for Hillary Clinton because I respect her as a candidate, and my political priorities align with her priorities the most. The President is essentially the most powerful person in the world, and to think that Trump, someone who is careless with his words and actions, might be in a position to make crucial decisions is absolutely terrifying.”\r\n\r\nSenior Ethan Bundy also feels that voting is essential, despite the unlikelihood of his candidate winning in California.\r\n\r\n\"Although I know my vote most likely won't make a difference because my political views are the opposite of approximately 99 percent of the people in California, I am still going to vote because people have died to give me the right to do so and in a lot of countries around the world people don't have that right, so I think it is disrespectful for people not to give their vote,\" Bundy said. \"Also, I am not voting for Hillary because I cannot vote for someone who is supposed to uphold the law when time after time she exhibits behavior that shows she believes she is above the law.\"\r\n\r\nMany view voting as a good way to remain informed about politics.\r\n\r\n\"Before I vote, I have to be reasonably well versed in current politics,\" senior Brian Tracy said. \"This is good information to stay up to date on and it allows me to have interesting discussions with my friends.\"\r\n\r\n<span style=\"font-weight: 400;\">And for other students, it only takes a small incentive to motivate them to get to the polls on Nov. 8.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I'm just looking forward to voting so I can get the ‘I voted’ sticker,” senior Andrew Vargha said. <\/span>","excerpt":"Within just weeks — and in some cases, days — of turning 18 years old, a few lucky juniors and seniors have the chance to utilize their newfound rights and leave their mark on this year's election.","date":"2016-11-07 17:47:52","author":"Maya Reuven","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2012\/11\/2012-11-06-08.09.12.jpg","categories":["Election 2016","News","Spotlight"],"tags":["18","Andrew Vargha","brian tracy","Clinton","day","donald","election","election 2016","ethan bundy","hilary","ibby day","local elections","matthew seto","President","presidential","propositions","seniors","Seto","student voters","Trump","Vargha","voting"]},{"id":125512,"title":"The education argument — why students should support Clinton","permalink":"http:\/\/palyvoice.com\/2016\/11\/06\/the-education-argument-why-students-should-support-clinton\/","content":"In a presidential election torn between unpopular candidates Hillary Clinton and Donald Trump, many voters will be holding their noses as they vote or won’t be voting at all. This is especially true for younger demographics, who have the <a href=\"http:\/\/www.npr.org\/2016\/05\/16\/478237882\/millennials-now-rival-boomers-as-a-political-force-but-will-they-actually-vote\">lowest voter turnout rates<\/a> in the nation. While the candidates’ policies have been largely overshadowed by political scandals and heated bickering, their views on primary and higher education will no doubt have lasting impacts on American students.\n\nClinton’s education plans, while flawed, provide much greater benefits to students and most Americans as a whole. Trump’s plans, on the other hand, will degrade the public school system and have limited effects on nearly all college students.\n\nClinton is pursuing a <a href=\"https:\/\/www.hillaryclinton.com\/issues\/college\/\">bold and expensive plan <\/a>on making higher education more accessible. According to her website, her top priorities include making community college free, funding minority-majority colleges and assisting student parents. Most notably, she plans to make public colleges tuition free for families with incomes at or below $125,000 by 2021. On the topic of student debt, Clinton has proposed cracking down on predatory schools and lenders, cutting loan interest rates and offering a three-month moratorium on student loan payments to federal loan borrowers.\n\nClinton’s plans will no doubt be an asset to lower-income families who cannot afford to send their children to college as well as to students buried in debt. Her plans have also earned her the <a href=\"http:\/\/www.aft.org\/resolution\/endorsement-hillary-clinton\">endorsement<\/a> of the American Federation of Teachers union. By making college more accessible to all students, her plan will greatly increase the number of students completing some form of higher education.\n\nThe main problems with Clinton’s plans are cost-related. According to the higher education writer and political analyst Kevin Carey, Clinton’s original education plan, based on making community college free, was economically feasible. However, after adopting many of Bernie Sanders’ policies, <a href=\"http:\/\/www.nytimes.com\/2016\/07\/20\/upshot\/the-trouble-with-hillary-clintons-free-tuition-plan.html\">her new plan became extremely expensive and would reward states that spend the least money on students.<\/a> An increase in tax rates on the wealthy would likely be needed to fund her ambitious program.\n\nTrump, on the other hand, has no specific plan on student debt or even college in general. His claim that the federal government shouldn’t profit from student loans is a positive statement but far from the set of policies that America needs. In September, <a href=\"http:\/\/www.slate.com\/articles\/life\/inside_higher_ed\/2016\/09\/what_is_donald_trump_s_plan_on_college_affordability.html\">he revealed his goal <\/a>of pressuring academic institutions with large endowments to spend more on students or lose their tax-exempt status. This would be a helpful action for some college students, but only for those who attend universities with multi-billion dollar endowments. Moreover, it is impossible to judge Trump’s plan for college education because he doesn’t even have one outside of the two simple statements outlined above.\n\nTrump’s primary education plans are significantly better than his college education plans, but that isn't saying much. An enthusiastic proponent of “school choice,” Trump believes that students should be able to attend any school they wish, public or private. This policy choice is interesting and could have the power to improve the educations of lower-income, minority students. However, it carries some significant flaws. Though Trump has touted such plans time and time again, he has never specifically stated how he will finance the $20 billion initiative. Given his opposition to raising taxes, the costs would likely either add to the federal debt or result in cuts to other parts of the current education budget.\n\nSchool choice also furthers the degradation of public schools by taking money away from the public school system. Furthermore, because many private schools are religious, allowing tax dollars to pay for private schools that subscribe to a particular faith is a blatant violation of the constitutional separation of church and state, according to <a href=\"http:\/\/www.publicschoolreview.com\/blog\/the-ongoing-debate-over-school-choice\">Public School Review<\/a>.\n\nTrump’s opposition to Common Core is a plus, as its standards are <a href=\"http:\/\/www.westernjournalism.com\/common-core-fundamental-flaws\/\">not based on sound research<\/a> and have resulted in<a href=\"http:\/\/www.westernjournalism.com\/common-core-fundamental-flaws\/\"> lower test scores<\/a>, according to Western Journalism. However, the United States president has no power to repeal these standards, as they were adopted at a state level, according to <a href=\"http:\/\/www.npr.org\/sections\/ed\/2016\/09\/25\/494740056\/donald-trumps-plan-for-americas-schools\">NPR<\/a>. Furthermore, ending Common Core is not a magical solution to America’s education problems. By basing nearly his entire education platform on denouncing these standards, Trump is ignoring issues plaguing American students that are not affected by the Common Core, such as nationwide achievement gaps and student debt.\n\nClinton’s K-12 plans, on the other hand, are probably more expensive yet simultaneously more far-reaching. While Trump’s school choice would push students to leave public schools, Clinton aims to go to the root of the problem by improving public schools themselves. <a href=\"https:\/\/www.hillaryclinton.com\/briefing\/factsheets\/2016\/02\/18\/ending-the-school-to-prison-pipeline\/\">Her website outlines specific policies <\/a>on elevating the quality of teaching, investing in run-down schools and helping each student learn computer science. When compared to Trump’s simple viewpoints on K-12, Clinton's plans help combat a broader range of education problems.\n\nUnfortunately, Clinton has never stated how she will finance these new plans, and given the billions of dollars she has pledged to invest in this area, it is unlikely that simply reprioritizing the current budget will allow her to pursue these policies. As a result, Clinton’s extensive K-12 education plan will help students at the expense of higher taxes on the upper class—a consequence that is arguably relatively minor as it will likely affect few people.\n\nClinton’s policies have their own expensive flaws, but they greatly outweigh Trump’s college and K-12 education plans as they actively attempt to limit student debt and address primary education problems ranging from run-down schools to teaching quality. In the end Americans will have the final say: By casting a vote, we will choose either debt reduction and college accessibility or a bleak future for students.","excerpt":"Clinton’s education plans, while flawed, provide much greater benefits to students and most Americans as a whole while Trump’s plans will degrade the public school system and have limited effects on most college students.","date":"2016-11-06 20:34:17","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/Screenshot-2016-11-06-at-4.01.42-PM.png","categories":["Election 2016","Opinion","Spotlight"],"tags":["2016","Clinton","college","Community","donald","education","election","Hillary","K-12","Trump","University"]},{"id":125463,"title":"Football clinches spot in CCS with victory over Mountain View","permalink":"http:\/\/palyvoice.com\/2016\/11\/06\/football-clinches-spot-in-ccs-with-victory-over-mountain-view\/","content":"<span style=\"font-weight: 400;\">The Palo Alto High School football team (4-6, 3-3) is preparing for its first game in the Central Coast Section playoffs after it defeated the Mountain View Spartans (5-5, 2-4) on Friday night, earning the Vikings a spot in the playoffs. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">After a tough loss to Los Gatos High School (7-3, 6-0) on Oct. 21, and a bye week, the Vikings bounced back and beat the Spartans. The victory secured the Vikings a fourth place finish in league and pushed them out of a potential tie with Mountain View. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Viking head coach Danny Sullivan, the bye week following the Vikings' loss to Los Gatos was crucial to its success.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We got a couple guys back that we needed and we were able to put in some new things that we wanted to try, and it worked out,” Sullivan said. “We challenged the kids a little bit and made sure they were ready to go.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Vikings and the Spartans fought hard throughout the game, trading two touchdowns each, with junior running back Paul Jackson III scoring both touchdowns for the Vikings. Jackson went on to score the fourth touchdown as well. The first half ended with a spectacular rush by sophomore running back Paul Thie for a touchdown. The Vikings led, 22-13, at the end of the first half.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Throughout the game, the offensive line showcased strong play, according to Jackson III.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We went hard every rep [play],” Jackson III said. “Sometimes we let things go, but offensively, we played great.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Paly fell behind during the third quarter after Mountain View scored two consecutive touchdowns, but the Vikings battled hard and fought back. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The third quarter was strange,” Sullivan said. “We needed to keep pushing, keep putting the petal to the metal and we did the complete opposite. I had to really stick to them and say we need some energy right now. Luckily, we found it and the kids responded well.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The energy was dwindling, but the players brought it back up.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We managed to not put our heads down and keep them down,” senior defensive lineman Alec Cohen-Schisler said. “In the past we’ve had issues with getting down by one or two touchdowns or even just a couple of points, and really getting our heads down. I really made an effort to hype up our sideline, keep us in the game and make sure no one was giving up.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">At the end of the second half, the Vikings and Spartans were neck and neck, with with the Vikings up, 30-26. With the clock winding down, junior running back Sione Latu ran the ball for the final touchdown in the game. The Vikings won the match with a final score of 36-29.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Sione’s got the ability to rip off a huge run which he did to clinch it at the end,” Sullivan said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Jackson III says he feels confident that the Vikings will do well in its next matchup, the first round of CCS playoffs.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We shocked a lot of people with this win tonight,” Jackson III said. “Going into the playoffs, I’ve never felt better. I have a lot of confidence in these boys.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">With its season on the line, Paly will face off against the Los Gatos Wildcats (7-3, 6-0) at 7pm on Nov. 11 at Los Gatos High School for the first round of CCS playoffs.<\/span>","excerpt":"The Palo Alto High School football team (4-6, 3-3) is preparing for its first game in the Central Coast Section (CCS) playoffs after it defeated the Mountain View Spartans (5-5, 2-4) on Friday night, earning the Vikings a spot in the playoffs.","date":"2016-11-06 19:01:13","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/A6F1852.jpg","categories":["Sports","Spotlight"],"tags":["alec cohen-schisler","CCS","de anza league","football","jackson","mountain view","palo alto high school","paul jackson","paul thie","playoffs","spartans","Sullivan","vikings"]},{"id":125424,"title":"Profile: California&#8217;s 24th District State Assembly candidates","permalink":"http:\/\/palyvoice.com\/2016\/11\/05\/profile-californias-24th-district-state-assembly-candidates\/","content":"[caption id=\"attachment_125428\" align=\"alignnone\" width=\"570\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/14937843_888612964608899_1431028650_n.jpg\"><img class=\" wp-image-125428\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/14937843_888612964608899_1431028650_n.jpg\" alt=\"Candidates Vicki Veenker and Marc Berman are campaigning to represent the 24th District in the State Assembly. \" width=\"570\" height=\"380\" \/><\/a> Candidates Vicki Veenker and Marc Berman are campaigning to represent the 24th District of California in the State Assembly.[\/caption]\r\n\r\nWith election day coming up Tuesday, the State Assembly race sees two former attorneys campaigning to next represent the 24th district of California.\r\n\r\nThe candidates, Marc Berman and Vicki Veenker, are pushing to replace retiring assemblyman Rich Gordon, who will be stepping down after six years.\r\n\r\nIn an attempt to hear the candidates' thoughts on certain issues affecting the 24th District, The Paly Voice sat down to interview both.\r\n\r\nDespite having similar ideas on many topics, both Berman and Veenker have focused on different issues in their respective campaigns.\r\n\r\nAccording to Berman, a Palo Alto High School alum, an attorney by training and current Palo Alto City Council member, he plans on focusing on improving education, making housing more affordable and fixing the infrastructure.\r\n\r\nOn the other hand, according to Veenker, a Palo Alto High School parent and fellow attorney by training, she plans on limiting greenhouse gases to protect the environment, protecting the water supply and increasing education funding.\r\n\r\nWith the Nov. 8 election day coming up soon, citizens will be casting their ballots. Not sure who to vote for? Check out these profiles on both candidates' positions to help make your decision.\r\n\r\n<a href=\"http:\/\/paly.io\/v\/125336\">Vicki Veenker on the issues<\/a>\r\n\r\n<a href=\"http:\/\/paly.io\/v\/125365\">Marc Berman on the issues<\/a>\r\n\r\n&nbsp;","excerpt":"With election day coming up Tuesday, the State Assembly race sees two former attorneys campaigning to next represent the 24th district of California.","date":"2016-11-05 14:55:27","author":"Chirag Akella","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/14937843_888612964608899_1431028650_n.jpg","categories":["Features","Spotlight"],"tags":["2016","berman","education","election","issues","state assembly","veenker"]}]