[{"id":118506,"title":"Dance team triumphs at national competition","permalink":"http:\/\/palyvoice.com\/2016\/03\/31\/dance-team-triumphs-at-national-competition\/","content":"[caption id=\"attachment_118568\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/Dance.jpg\"><img class=\" wp-image-118568\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/Dance.jpg\" alt=\"Photo by Nathalia Castillo.\" width=\"600\" height=\"375\" \/><\/a> After a five-year absence from the United Spirits Association national competition, the Palo Alto High School dance team placed first in the Extra Small Dance category and recieved the judges' award of excellence. Photo by Nathalia Castillo.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto High School dance team triumphed at <\/span><span style=\"font-weight: 400;\">the United Spirits Association national competition this weekend, clinching first place in the Lyrical Extra Small Dance category in Anaheim, California.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to junior Nathalia Castillo, it has been five years since the Paly dance team last went to the national competition and the first time competing in five categories. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It wasn't our first time competing at nationals, but the last time we went was almost 5 years ago,” Castillo said. “We competed in five different categories: jazz, hip hop,<\/span><span style=\"font-weight: 400;\"> lyrical with small dance, team lyrical and character dance.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to senior Catherine Yu, the team was very proud of placing in its first year back.<\/span>\r\n\r\n“This was the first year in a while that the dance team competed so going to nationals and placing first in the Lyrical Small Dance category was a huge success,” Yu said. “I feel incredibly proud of our team, especially because we definitely went into the competition feeling like the underdog and not expecting to win anything.”\r\n\r\n<span style=\"font-weight: 400;\">Nevertheless, the team faced complications in other categories due to changes in the rules.<\/span>\r\n\r\n“Unfortunately, we didn't do as well in other categories because of some complications with rules,” Yu said. “However, competing in five different categories qualified us to win the judges' award of excellence, which is only given to three teams out of the entire competition.”\r\n\r\n<span style=\"font-weight: 400;\">The merits at the tournament did not come without preparation, according to Yu. Dance members dedicated large portions of their time to get ready for the competition.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We practiced four times a week after school, just running through the dances and cleaning them,” Yu said. “We actually learned all of our dances the week of regionals and were still making changes to choreography the week of nationals. It was a creative process the entire time.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Although the team will not participate in another competition until the next school year, senior Emma Sternfield hopes the team will continue to improve year after year. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“As a senior, I’m passing the baton down but I hope the team will become better and better,” Sternfield said. “I’m extremely proud of the team and what we have achieved and could not have asked for a better ending.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">As for next season, Sternfield anticipates another appearance at nationals. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I’m not sure about the plans for next year but hopefully the team competes at nationals again,” Sternfield said. “I think the team has what it takes to do well and I’m excited to see where they go.”<\/span>\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School dance team triumphs at the United Spirits Association national competition this weekend clinching first place in the country in the lyrical dance category in Anaheim, California.","date":"2016-03-31 11:00:20","author":"Ethan Kao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/Dance.jpg","categories":["News"],"tags":["dance team","nationals","paly"]},{"id":118740,"title":"ASB to hold special elections for vacant positions","permalink":"http:\/\/palyvoice.com\/2016\/03\/30\/asb-to-hold-special-elections-for-vacant-positions\/","content":"Palo Alto High School students will be able to digitally vote in special elections for vacant Associated Student Body positions on April 14 and 15.\r\n\r\nApplications for  positions of ASB Treasurer and Junior Class Vice President, identical to those of the regular election, were released March 28 and will be accepted until 3:30 p.m. on Thursday March 31, according to Student Activities Director Matthew Hall.\r\n\r\n“I had already had some [students] email me, but they weren’t allowed to get in on the regular election because ostensibly they didn’t make the original deadline,” Hall said.\r\n\r\nAccording to Hall, candidate statements and speeches will be recorded April 11 and 12 and released along with their photos.\r\n\r\n“They [special election candidates] probably won’t even be putting up posters, we’re just going to do it digitally and find out who wins,” Hall said. “We have to fill those positions [ASB Treasurer and Junior Vice President] prior to interviews for appointed positions.”\r\n\r\nSpecial elections are a rare occurrence and the system for special elections was created in the ASB 2012-13 election, according to Hall.\r\n\r\n“Special elections are only used when we have positions for which nobody originally ran,\" Hall said. \"That precedent goes back to [the election of] 2012 to 2013 when the ASB Vice Presidential position was unfilled,” Hall said.","excerpt":"Digital voting for Palo Alto High School Associated Student Body's special elections for the vacant positions of ASB Treasurer and Junior Class Vice President will be available April 14 and 15.","date":"2016-03-30 21:33:43","author":"Zahra Muzaffar","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/0000\/00\/matt.jpg","categories":["News"],"tags":["ASB","ASB elections","Associated Student Body","hall","matt","palo alto high school","paly","special elections","Student activities director"]},{"id":118640,"title":"Liveblog: Baseball vs. Los Altos","permalink":"http:\/\/palyvoice.com\/2016\/03\/30\/liveblog-baseball-vs-los-altos\/","content":"Check back in at 4 p.m. as the Palo Alto High School baseball team (11-1-1, 6-0) looks to continue an undefeated league season against Los Altos High School (8-6, 3-3) at home.\r\n\r\n[liveblog]","excerpt":"The Palo Alto High School baseball team (11-1-1, 6-0) looks to continue an undefeated league season against Los Altos High School (8-6, 3-3) 4 p.m Wednesday at home. ","date":"2016-03-30 14:23:05","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/MG_32931.jpg","categories":["Baseball","Sports"],"tags":[]},{"id":118608,"title":"First Paly vs. Gunn night rally debuts, ASB looks to start tradition","permalink":"http:\/\/palyvoice.com\/2016\/03\/30\/first-paly-vs-gunn-night-rally-debuts-asb-looks-to-start-tradition\/","content":"[caption id=\"attachment_118609\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/IMG_0024.jpg\"><img class=\"size-full wp-image-118609\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/IMG_0024.jpg\" alt=\"Paly dance team members (left to right) junior Nathalia Castillo, senior Melanie Guan and senior Emma Sternfield perform in a collaboration between the Paly and Gunn dance teams at the first ever Paly vs. Gunn night rally on Thursday at Gunn. Photo by Emma van der Veen.\" width=\"600\" height=\"400\" \/><\/a> Palo Alto High School dance team members (left to right) junior Nathalia Castillo, seniors Melanie Guan and Emma Sternfield perform in a collaboration with the Paly and Gunn High School dance teams at the first ever Paly vs. Gunn night rally on Thursday at Gunn. Photo by Emma van der Veen.[\/caption]\r\n\r\nThe Palo Alto High School Associated Student Body and Gunn High School Student Executive Council are looking forward to making the Paly vs. Gunn night rally an annual tradition after the inaugural event on Thursday at the Titan Gym.\r\n\r\n<span style=\"line-height: 1.5;\">According to Paly Student Activities Director Matt Hall, the event was a success, especially considering all other concurrent events at both schools.<\/span>\r\n\r\n“It was just about what we wanted,” Hall said. “Certainly, we would have liked better attendance, but it was solid for a first time [rally], on a Thursday, with 14 different other events happening at both schools. We have started a new tradition, and next year it will be even better.”\r\n\r\nThe rally events included an obstacle course competition and a staff versus student volleyball game. There were also performances by the Gunn dance team, Gunn cheer team, Paly dance and cheer teams and a collaboration dance.\r\n\r\n“The obstacle course was the most hyped up and people were shouting and screaming,” senior ASB Secretary Joseph Kao said.\r\n\r\n[caption id=\"attachment_118616\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/IMG_0074.jpg\"><img class=\"size-full wp-image-118616\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/IMG_0074.jpg\" alt=\"Junior Skylar Burris attempts to eat a donut in the obstacle course competition as part of the Paly upperclassmen team. Photo by Emma van der Veen.\" width=\"600\" height=\"400\" \/><\/a> Junior Skylar Burris attempts to eat a donut in the obstacle course competition as part of the Paly upperclassmen team. Photo by Emma van der Veen.[\/caption]\r\n\r\nIn the obstacle course, the schools were divided into four teams: the upper and underclassmen of each school. Paly underclassmen won first place, followed by Gunn upperclassmen, Paly upperclassmen and Gunn underclassmen. The course consisted of tag team action in separate sections: the egg carry, toilet paper unroll, frisbee throw, 3-point contest, donut-on-a-string eating and the 3-legged race. According to junior Peter Snodgrass, who participated in the frisbee portion of the Paly upperclassmen team, the Vikings faced some challenges in the first rounds, but adapted later on.\r\n\r\n“We had a rough start, but we pushed through the adversity that we faced,” Snodgrass said. “We came together as a team and got the job done and did very well.”\r\n\r\nAccording to senior Gunn SEC member Grace Park, the student versus staff volleyball game united the students across the district, despite the students losing the game 15-13.\r\n\r\n“Next year we’re going to do a lot more to hype it up,” Park said. “Having Paly here and all of the staff, there was a huge motivation to show come out and unite, especially in the common goal [of Paly and Gunn] to beat the staff.”\r\n\r\nJunior Class Vice President Natalie Maloney is excited at the prospect of future joint rallies with a greater amount of participation.\r\n\r\n“We [Paly ASB and Gunn SEC] were super excited to host the first ever Gunn-Paly rally,” Maloney said. “It was a lot of fun. I was hoping that more people would show up, but I understand that people had tests and homework they had to do. Next year, we will hopefully have it on a Friday night so we can get a better turnout.”","excerpt":"The Palo Alto High School Associated Student Body and Gunn High School Student Executive Council are looking forward to making the Paly vs. Gunn night rally an annual tradition after the inaugural event on Thursday at the Titan Gym.","date":"2016-03-30 09:09:11","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/IMG_0074.jpg","categories":["News"],"tags":["ASB","Associated Student Body","cheer","dance","gunn","hall","Kao","maloney","night rally","obstacle course","paly","paly vs gunn","park","rally","sec","snodgrass","student executive council","underclassmen","upperclassmen"]},{"id":118655,"title":"Spring Break begins on Friday, April 1","permalink":"http:\/\/palyvoice.com\/2016\/03\/29\/spring-break-begins-on-friday-april-1\/","content":"","excerpt":"","date":"2016-03-29 17:47:26","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":117452,"title":"TeamLAB: A spellbinding blend of art and technology","permalink":"http:\/\/palyvoice.com\/2016\/03\/29\/teamlab-an-spellbinding-blend-of-art-and-technology\/","content":"The teamLab exhibit at the Pace Gallery in Menlo Park, open from Feb. 6 to July 1, features a blend of art and technology that encapsulates the Silicon Valley atmosphere of innovation. Rooted in traditional Japanese art, the exhibition highlights how technology can enhance art instead of replace it.\r\n\r\n<iframe style=\"border: none;\" src=\"https:\/\/social.shorthand.com\/thepalyvoice\/embed\/3gVMXbHdaf\" width=\"100%\" height=\"500px\"><\/iframe>","excerpt":"The teamLab exhibit at the Pace Gallery in Menlo Park, open from Feb. 6 to July 1, features a blend of art and technology that encapsulates the Silicon Valley atmosphere of innovation. Rooted in traditional Japanese art, the exhibition highlights how technology can enhance art instead of replace it. ","date":"2016-03-29 11:07:14","author":"Emilia Diaz-Magaloni","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/unspecified.jpg","categories":["Features","Spotlight"],"tags":["art","art exhibit","menlo park","PACE","palo alto high school","technology"]},{"id":117968,"title":"You are so not OCD: The truth behind the colloquialism","permalink":"http:\/\/palyvoice.com\/2016\/03\/28\/you-are-so-not-ocd-the-truth-behind-the-colloquialism\/","content":"[caption id=\"attachment_118591\" align=\"alignnone\" width=\"541\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/ocd.jpg\"><img class=\"wp-image-118591\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/ocd.jpg\" alt=\"Illustration by Portia Barrientos.\" width=\"541\" height=\"408\" \/><\/a> A student struggles to keep up with a teacher's lecture, not because the concepts are difficult to grasp, but rather because his intrusive obsessions halt his ability to focus. Illustration by Portia Barrientos.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Envision sitting in your history class and taking notes on your teacher’s PowerPoint lecture on India. As you copy down the word ‘Buddhism,’ you notice that the ‘h’ is slanted. Compulsively, you erase the word and rewrite it, only to erase it again because now the ‘d’ is smudged. Soon, your brain repeats the word ‘Buddhism’ over and over, and you find that you are unable to pay attention to the lecture. As this all transpires, you come to realize that not only have you missed the remainder of the Buddhism slide, but the following slide as well. For sophomore Darrow Hornik, these nettlesome compulsions are a result of obsessive-compulsive disorder.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“My OCD really depends on how my day is going; if I am more stressed out, my OCD is worse,” Hornik said. “When I am in a happier mood I don’t get it as much, and writing becomes a lot easier, as I am not as affected by the symptoms. <span style=\"font-weight: 400;\">The whole OCD stereotype where everything has to be <\/span><span style=\"font-weight: 400;\">super neat — that is a part of it, and I do get that as well, but there are multiple other symptoms.\"<\/span><\/span>\r\n\r\n<span style=\"font-weight: 400;\">Hornik has publicly expressed her personal journey as a student with OCD. Her talk titled \"Where are you going?\" was part of TEDx Palo Alto High School's third annual conference on March 26. Despite recent examples of online public discussion pertaining to mental illness, with Gunn High School's student newspaper The Oracle publishing a <a href=\"http:\/\/gunnoracle.com\/category\/changing-the-narrative\/\">Changing the Narrative<\/a> series aimed to spread personal stories and a <a href=\"http:\/\/paloaltoonline.com\/print\/story\/2016\/03\/18\/guest-opinion-unmasking-the-truth-beyond-the-stigma-of-mental-illness#.VuwTrFwPVBo.facebook\">guest column<\/a> on Palo Alto Online, many continue to misconceive the terms and phrases often used in casual conversation.\r\n<\/span>\r\n\r\n<b>What is OCD?<\/b>\r\n\r\n<span style=\"font-weight: 400;\">According to Lorrin Koran, M.D., a Stanford University professor of Psychiatry and Behavioral Sciences, obsessive-compulsive disorder is characterized by the presence of obsessions — anxiety-inducing thoughts, images or urges that a person finds difficult to dismiss from his or her mind. The obsessions lead to compulsions — behaviors that are designed to either reduce the anxiety associated with the obsession, or prevent a detrimental outcome if the person does not follow his or her obsession. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“A person with OCD might be afraid that if she leaves her house and does not check the stove, there will be a fire while she is gone, leaving her responsible,” Koran explains. “Consequently, she will check every knob on the stove. Then, she may think that she did not check correctly, so she checks them again. She might spend five or 10 minutes checking the knobs on the stove to make sure they are off before feeling comfortable leaving the house. The obsession is the possibility of a fire and she will be responsible, while the compulsion is frequently checking the knobs.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Koran, OCD affects 1 percent to 2 percent of the population. One out of every three patients is diagnosed with OCD between the ages of three and 15; a third of the time the diagnosis occurs between 15 and 25, and the final third of diagnoses occur between 25 and 35 years old. The brain of a patient with the disorder clearly showcases physical changes.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“OCD from a psychiatric standpoint is a mental disorder in which there is a chemical imbalance within the brains of those diagnosed,” Koran said. “It’s a disorder rather than a disease because diseases are things we know the cause of. Disorders are pathological conditions that we don’t know the cause of and an illness is a disease or disorder as experienced by the patient.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Although a definitive cause for obsessions has not been found, research has shown that its presence is related to genetics. However, exposure to particular environments can, at times, also cause OCD. According to Koran, manganese miners have been known to develop the disorder and occasionally, children who have had a strep infection suddenly develop OCD a few weeks later.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Koran, modern medicine has found two treatments to be most effective: a class of medicine known as selective serotonin reuptake inhibitors and psychotherapy in the form of exposure and response prevention. Not all patients benefit from the prescribed methods of treatment, as 40 percent of those diagnosed will not improve after a first trial of SSRI medications; however, many of those failing to respond to initial treatment benefit from a second or third trial.<\/span>\r\n\r\n<b>The societal issue, defined <\/b>\r\n\r\n<span style=\"font-weight: 400;\">‘I’m so OCD’ has become all too familiar of a phrase, ingrained in speech to justify moments in which one feels the need to perform an action in a certain way. Consider Buzzfeed, a social news and entertainment company that frequently amasses views through articles such as “<\/span><a href=\"http:\/\/www.buzzfeed.com\/peggy\/33-meticulous-cleaning-tricks-for-the-ocd-person-i#.id77mYJzJ\"><span style=\"font-weight: 400;\">33 Meticulous Cleaning Tricks For The OCD Person Inside You<\/span><\/a><span style=\"font-weight: 400;\">” and “<\/span><a href=\"http:\/\/www.buzzfeed.com\/samir\/things-that-will-drive-your-ocd-self-insane#.qyw7xrMqm\"><span style=\"font-weight: 400;\">19 Things That Will Drive Your OCD Self Insane<\/span><\/a><span style=\"font-weight: 400;\">” or the numerous hashtags that have emerged: #ObsessiveChristmasDisorder and #ObsessiveCrossfitDisorder. People have learned to use the disorder as a colloquialism. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Not only do such articles trivialize OCD and its effects, but they equate everyday “obsessions” with the disorder. Because “obsessive” is a personality trait and does not impair functioning, the mental disorder is being mixed with a personality preference.<\/span> <span style=\"font-weight: 400;\">Knowing every lyric to “Hotline Bling” within days of its release is not remotely similar to the irrational need to flip a light switch an even number of times before exiting a room in order to prevent something bad from happening to a loved one. When ‘being so OCD’ is correlated with words such as ‘neat’, ‘picky’ and ‘organized’, it strips the serious mental illness of its harsh reality.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The thing is, everybody assumes that people with OCD are neat freaks or germaphobes,” Hornik said. “That isn’t true. Sure, it’s a fragment of OCD, but it is wrong to characterize that as the entire disorder. The average person is aware of and recognizes the term OCD; however, I don’t think they know what OCD is and its detrimental effects it can have on a person’s life.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The misuse of the term ‘OCD’ leads to misunderstandings revolving around the mental disorder itself. In fact, when people use OCD to describe themselves, they are also forgetting OCD is not an adjective and that a person cannot <\/span><b><i>be<\/i><\/b><span style=\"font-weight: 400;\"> OCD, but rather a person <\/span><b><i>has <\/i><\/b><span style=\"font-weight: 400;\">OCD.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“If you ask somebody ‘Have you heard of OCD?,’ they would say ‘Of course I have,’” Hornik said. “However, most are probably not aware that OCD is actually a chemical imbalance in your brain.”<\/span>\r\n\r\n<b>Delving further into the issue<\/b>\r\n\r\n<span style=\"font-weight: 400;\">But why does society consider it inappropriate and abnormal to say, “I am so cancer,” while accepting the analogous statements when “cancer” is replaced with “OCD,\" “depressed\" or even \"retarded\"? The answer? The stigma around mental illnesses. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to <\/span><a href=\"http:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC1489832\/\"><span style=\"font-weight: 400;\">World Psychiatry<\/span><\/a><span style=\"font-weight: 400;\">, which describes itself as the leading informational center devoted to the diagnosis, prevention, study and treatment of mental disorders, a majority of people hold negative attitudes and stereotypes about diagnosed patients. These people go through life hearing stereotypes such as ‘people with mental illnesses are scary and violent.’ As a result, people diagnosed with a mental disorder may be denied opportunities in everyday life, including jobs, housing and health care.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I don’t think that anyone should be ashamed to have a mental illness,” Hornik said. “The stigma that is created around mental illnesses is affecting so many people’s lives.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Jonathan Frecceri, Paly’s Mental Health and Wellness Coordinator, expanded upon the notion that a significant distinction has developed between physical and mental health, when in reality the two are equally important.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Physical health and mental health are all apart of overall health,” Frecceri said. “We live in a society where there is still kind of a taboo around mental illnesses, which is kind of absurd because the brain is a physical part of the body and that’s where mental illnesses live. However, we are making progress and the first step is to really raise awareness.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Hornik, who has been ashamed to tell her friends that she routinely visits a therapist, stresses her experiences with the negative stigma around the disorder.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“During Tutorial, I have to go see my therapist,” Hornik said. “I was dealing with the stigma around mental illnesses because I was sort of embarrassed to go see a therapist and leave every single Tutorial. My friends would ask me, ‘Where are you going?,’ and I would say, ‘I’m going to the doctor,’ rather than say, ‘I’m going to the therapist to treat my mental illness.’”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Frecceri emphasized that a way to end the negative stigma surrounding mental illnesses is for individuals to be aware of the language they use and its effects on diagnosed patients.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I think it’s an opportunity for all of us, as a part of a community to continue to educate people, not to shame people, but to acknowledge that there are people who suffer from something very real and such phrases should not be used loosely,” Frecceri said. “I think the problem is for individuals that do have a diagnosis, it [colloquial use of the illness] can feel very pejorative, that it’s being used at their expense, even if it’s not being used against them.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Since only 1 percent to 2 percent of the population suffer from OCD, understanding the complexity of the disorder can help foster a community of support and stop individuals from suffering in silence.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“When it is a mental illness like OCD, people think that you are being overly dramatic and that you can stop your brain from thinking constantly,” Hornik explains. “Why is it not acceptable for me to take medicine for a chemical imbalance in my brain, <\/span><span style=\"font-weight: 400;\">when it is acceptable to take insulin for Diabetes, which is caused by a chemical imbalance in your pancreas<\/span><span style=\"font-weight: 400;\">?\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">So the next time your impulse is to say that you are ‘so OCD’ about something, or hop on the bandwagon that is the newest social media trend, remember that #YouAreSoNotOCD. <\/span>","excerpt":"‘I am so OCD’ has become too familiar of a phrase, ingrained in speech to justify moments in which one feels the need to perform an action in a certain way; but this has stripped the serious mental illness of its harsh reality.  ","date":"2016-03-28 21:04:20","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/ocd.jpg","categories":["Opinion","Spotlight"],"tags":["buzzfeed","compulsions","darrow","Frecceri","hornik","jonathan","koran","lorrin","mental health","obsessions","obsessive compulsive disorder","ocd","palo alto high school","paly","stigma"]},{"id":118527,"title":"Service Day inspires volunteer spirit","permalink":"http:\/\/palyvoice.com\/2016\/03\/27\/service-day-inspires-volunteer-spirit\/","content":"Organizers are calling the annual Service Day a success after facilitating a variety of both on and off-campus volunteer activities on Thursday.\r\n\r\nFirst implemented 10 years ago, Palo Alto High School Service Day allows students to showcase their commitment to volunteering and giving back to the community, according to Get Involved Project Manager and junior Candace Wang.\r\n\r\nOver 300 students <a href=\"http:\/\/palyvoice.com\/2016\/03\/17\/service-day-offers-students-wide-range-of-volunteering-opportunities\" target=\"_blank\">travelled to off-campus<\/a> locations to volunteer, ranging from distributing food at the Second Harvest Food Bank to pulling weeds at the Palo Alto Baylands Nature Preserve, according to Wang. In addition, over 500 students participated in on-campus activities on the Quad during lunch.\r\n\r\nGet Involved Palo Alto coordinated the on-campus events while Paly Youth Community Service Club organized the off-campus events, contacted service sites and streamlined student participation, according to YCS Co-President junior Ibby Day.\r\n\r\nService Day featured 20 on-campus booths aimed at promoting volunteerism through small actions, including crafting bookmarks and picking up litter on campus to provide a range of opportunities for those who were unable to travel off campus. As part of the main on-campus service projects, students sewed and tie-dyed bags for The Little Red Shoes Program.\r\n\r\n“Volunteerism is the type of thing that is missing in a lot of students' lives,” Wang said. “People become really busy and forget about giving back, but that's what Service Day is all about. It's about reminding people of all the good that we do.”\r\n\r\n<em>Photos by Adrienne Kwok.<\/em>\r\n<div id=\"cp_widget_cbcebe21-c07e-4dfb-a97c-d01c155db91a\">\r\n\r\n...<script type=\"text\/javascript\">\/\/ <![CDATA[\r\nvar cpo = []; cpo[\"_object\"] =\"cp_widget_cbcebe21-c07e-4dfb-a97c-d01c155db91a\"; cpo[\"_fid\"] = \"AQCAAUdV_H8T\"; var _cpmp = _cpmp || []; _cpmp.push(cpo); (function() { var cp = document.createElement(\"script\"); cp.type = \"text\/javascript\"; cp.async = true; cp.src = \"\/\/www.cincopa.com\/media-platform\/runtime\/libasync.js\"; var c = document.getElementsByTagName(\"script\")[0]; c.parentNode.insertBefore(cp, c); })();\r\n\/\/ ]]><\/script><noscript>Powered by Cincopa <a href='http:\/\/www.cincopa.com\/video-hosting'>Video Hosting<\/a> for Business solution.<span>Service Day 2016<\/span><span>Sophomore Vivian Nguyen concentrates on sewing a bag for The Little Red Shoes Program as part of this year’s sole on-campus service-learning activity. Nguyen, along with all other Social Justice Pathway students, agreed as a class to participate in Service Day.<\/span><span>flash<\/span><span> 16<\/span><span>cameramake<\/span><span> NIKON CORPORATION<\/span><span>height<\/span><span> 4000<\/span><span>orientation<\/span><span> 1<\/span><span>camerasoftware<\/span><span> Ver.1.00 <\/span><span>originaldate<\/span><span> 3\/24\/2016 4:54:34 AM<\/span><span>width<\/span><span> 6000<\/span><span>cameramodel<\/span><span> NIKON D3300<\/span><span>Sophomore Eli Al-Shamari and junior Ibby Day distribute pizza to students who completed service-learning activities during lunch. “Service day was a success from what I hear,” YCS Co-President Ibby Day said. “Most of the new sites were super fun this year.”<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 3456<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 3\/24\/2016 4:56:31 PM<\/span><span>width<\/span><span> 5184<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T4i<\/span><span>Students collaborate on constructing bags, an activity that lasted throughout the day. “I think that it is important to, every once in awhile, take time out of your day and do something good for others, whether it is simply picking up a piece of trash or sewing bags and making cards for younger kids,” sophomore Darrow Hornik said.<\/span><span>flash<\/span><span> 16<\/span><span>cameramake<\/span><span> NIKON CORPORATION<\/span><span>height<\/span><span> 4000<\/span><span>orientation<\/span><span> 1<\/span><span>camerasoftware<\/span><span> Ver.1.00 <\/span><span>originaldate<\/span><span> 3\/24\/2016 4:56:44 AM<\/span><span>width<\/span><span> 6000<\/span><span>cameramodel<\/span><span> NIKON D3300<\/span><span>Sophomore Nicholas Zhao and juniors Serina Nguyen, Kirsten Kwan and Lindsay Chen (left to right) collect student suggestions on what they would like to see changed about Paly. “I am definitely inspired by those who volunteer because they take time out of their day to give back to their community,” Nguyen said.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 3456<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 3\/24\/2016 4:57:30 PM<\/span><span>width<\/span><span> 5184<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T4i<\/span><span>Students listen intently to an organization representative at one of 20 unique booths, each of which provided a unique project centered on a specific mission, such as writing cards for children.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 3456<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 3\/24\/2016 4:58:09 PM<\/span><span>width<\/span><span> 5184<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T4i<\/span><span>Students interact with a representative from Canopy, an organization dedicated to planting and caring for trees in the Palo Alto community. In addition to completing service projects, students were able to sign up for future volunteer opportunities with individual organizations.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 3456<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 3\/24\/2016 5:01:28 PM<\/span><span>width<\/span><span> 5184<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T4i<\/span><span>Get Involved Project Manager and junior Candace Wang distributes lunches to organization representatives. “It was great to see hundreds of students giving part of their day to something, no matter how small, to give back to the community,” Wang said.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 3456<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 3\/24\/2016 5:14:59 PM<\/span><span>width<\/span><span> 5184<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T4i<\/span><span>Students enjoy slices of pizza after completing two service events during lunch. In addition to providing 1000 slices of pizza, Get Involved Palo Alto organized purchasing breakfast for over 200 students partaking in off-campus field trips.<\/span><span>cameramake<\/span><span> Canon<\/span><span>height<\/span><span> 3456<\/span><span>orientation<\/span><span> 1<\/span><span>flash<\/span><span> 16<\/span><span>originaldate<\/span><span> 3\/24\/2016 4:56:21 PM<\/span><span>width<\/span><span> 5184<\/span><span>cameramodel<\/span><span> Canon EOS REBEL T4i<\/span><\/noscript>\r\n\r\n","excerpt":"Organizers are calling the annual Service Day a success after facilitating a variety of both on and off-campus volunteer activities on Thursday.","date":"2016-03-27 10:43:43","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/IMG_9982.jpg","categories":["News"],"tags":["adrienne","Alto","booth","candace","christina","Community","day","get","ibby","involved","kwok","owen","Palo","quad","Service","volunteer","Wang","YCS","youth"]},{"id":116761,"title":"Opinion: Jordan Middle School name change is unnecessary","permalink":"http:\/\/palyvoice.com\/2016\/03\/24\/jordan-middle-school-name-change-is-unnecessary\/","content":"<span style=\"font-weight: 400;\">The Palo Alto Unified School District Board of Education is investigating whether to alter the name of David Starr Jordan Middle School after a parent’s petition urged such a change and Social Justice Pathway students discussed the name at a <a href=\"http:\/\/palyvoice.com\/2016\/01\/23\/plan-to-rename-jordan-takes-next-step-forward\/\">board meeting <\/a>on Feb. 9. David Starr Jordan, a vocal eugenicist, or a person who supports improving the genetic population of humans through inhumane methods, was also Stanford University’s first president, a peace activist and ichthyologist. While some may claim that changing the school’s name promotes a more welcoming environment, the school board should not do so as this would not properly address contemporary racism. In addition, eugenics was considered acceptable in much of the 19th and 20th centuries despite being discredited today, and a name change would cause confusion among community members and waste District funds.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">First of all, a name change would not make the middle school a more welcoming environment for students as it would not properly address racism in our schools and in general. As the son of a Polish father and Mexican mother, I know my ancestors have faced racism and anti-religious sentiment firsthand. David Starr Jordan himself wrote that Poles were \"controlled by ... animal instincts\" and Mexicans \"ignorant and \"superstitious.\" <\/span><span style=\"font-weight: 400;\">But although my ancestors and ethnic groups have been victimized in the past, even through ethnic cleansing and other means, I do not believe changing Jordan's name is the proper way to address contemporary racism. Altering Jordan’s name would not have made any difference in my three-year experience as a Jordan student, nor did it make me feel marginalized or persecuted in any way.<\/span>\r\n\r\n[caption id=\"attachment_118411\" align=\"alignright\" width=\"392\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/IMAG0421.jpg\"><img class=\"wp-image-118411\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/IMAG0421.jpg\" alt=\"IMAG0421\" width=\"392\" height=\"294\" \/><\/a> Jordan Middle School, pictured above, would most likely undergo campus changes such as new paint and a new logo if the name is changed. Photo by Sherwin Amsbaugh.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">If the district wishes to address modern racism, it should not focus on Jordan Middle School’s name, but rather acknowledge social injustice and discrimination in America in social studies classes or through cultural clubs. After all, Jordan's views of eugenics have been mostly discredited and bear little significance in the modern world. Changing the school’s name would not address injustice; it would simply put a bandage on a deep cut. The change will not suddenly transform the district into an open-minded community. Teachers and staff should encourage cultural clubs to provide an in-depth look into social justice rather than bring attention to a name that many are unaware about if they wish to make schools more welcoming. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">One may say that the district can both change the name and acknowledge social injustice in schools. While this is true, there are other and more effective ways to make students feel welcome rather than changing Jordan's name. Administration can use funds that may otherwise go to repainting the school to crack down on bullying and fund cultural programs, both of which are more likely to successfully promote tolerance and unity. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">While it is terrible that David Starr Jordan fostered racist ideologies, he should not just be recognized as a eugenicist when he also promoted pacifism and contributed to the field of science. America’s fourth president, Thomas Jefferson, is revered as a hero despite owning over 600 slaves. Similarly, Jordan should not be edited out of our history due to some of his views which while inhumane, were standard in the late 19th century. It must be noted that at its peak, eugenics was supported by W.E.B Dubois, Theodore Roosevelt and Winston Churchill, all of whom are considered heroes in today's society. This does not mean that Jordan should be excused for his views, as they promoted racism in the 20th century. Rather, we should look at his views in context and acknowledge that what is considered racist today was seen as standard 80 years ago.<\/span>\r\n\r\nAccording to American historian and biographer Garland E. Allen, David Starr Jordan’s views were considered common in his time.\r\n\r\n“Eugenics ... was a widespread and popular movement in the United States and Europe between 1910 and 1940,” Garland wrote. “Eugenics gained much support from progressive reform thinkers, who sought to plan social development using expert knowledge in both the social and natural sciences.”\r\n\r\n<span style=\"font-weight: 400;\">Changing a school’s name because some find it offensive may also set a dangerous precedent. Basically every influential figure has been subject to some form of controversy, regardless of the nobility of their deeds. If we wished to avoid offending all Palo Altans, we would need to rename schools to streets, plants or locations.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">A name change would foster additional consequences. Administration would most likely paint over all Jordan Middle School logos and alter all paperwork referring to the school as “Jordan,” costing the district an unknown amount of money which could be better spent on new textbooks or educational facilities. The change could also cause confusion among citizens who are unaware of the name replacement.<\/span>\r\n\r\nDespite the name change's potential negative effects, some students continue to advocate for such a modification. Social Justice Pathway student and junior Layla Solatan says she believes it would help create a more welcoming environment.\r\n\r\n\"Now that people have shown such passion for changing the name, to ignore their pleas would do harm to the image, values and environment of the district,\" Solatan said.\r\n\r\nHowever, a majority of students do not believe the name has a significant impact on them. The Voice visited random Paly English classrooms and posted a survey in the class Facebook groups to see how students felt about such a change. Of the 219 netted responses, only 28.8 percent of students believe the current name creates an unhealthy environment for students, and 40.6 percent support an actual name change. 68.5 percent of those who responded attended Jordan Middle School. These results demonstrate how, despite a vehement minority of students urging for a name change, these students do not represent their peers' views as a whole.\r\n\r\nSchool board member Melissa Baten Caswell says that while changing the name could set a positive example of upstanding, it also could cause multiple community problems.\r\n\r\n\"There will be expenses involved with changing the name,\" Caswell said. \"Some members of the community are attached to the existing name.\"\r\n\r\nWhen the school board's advisory committee reaches a conclusion on the name's effects later this year, we should definitely listen and take into account their research and advice. However, at this point in time, a Jordan name change is completely unnecessary. Further discussions about promoting tolerance in Palo Alto schools are important and will help to create a healthier, more open-minded community—but a Jordan name change is not the solution.","excerpt":"A Jordan Middle School name change is unnecessary due to potential costs and confusion as well as the fact that eugenics, while an atrocious practice, was universally accepted in the early 20th century.","date":"2016-03-24 21:09:40","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/unnamed.jpg","categories":["Opinion","Spotlight"],"tags":["Alto","David","Eugenics","garland allen","jordan","middle","name","Palo","paly","racism","scandal","School","starr"]},{"id":118458,"title":"Band and orchestra win first place in New York City","permalink":"http:\/\/palyvoice.com\/2016\/03\/24\/band-and-orchestra-win-first-place-in-new-york-city\/","content":"[caption id=\"attachment_118461\" align=\"aligncenter\" width=\"520\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/Screen-Shot-2016-03-24-at-10.33.45-AM1.png\"><img class=\"wp-image-118461\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/Screen-Shot-2016-03-24-at-10.33.45-AM1.png\" alt=\"Paly Band preforms on the quad for Arts in Unusual places. Photo by Emilia Diaz-Magaloni\" width=\"520\" height=\"348\" \/><\/a> The Palo Alto High School band and performs on the Quad for the annual Arts in Unusual places event. Photo by Emilia Diaz-Magaloni.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Palo Alto High School’s band and orchestra won first place in their respective categories in a competition during a trip to New York City last week.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Band and orchestra received the highest scores in both the string and symphonic band categories after playing in front of three judges, according to junior orchestra member Candace Wang.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The orchestra also received the Adjudicator’s Award for the highest singular score from the judges.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Five students at Paly received individual Maestro awards for outstanding performances.  The students include Wang, senior Ely Wing, sophomore Cassandra Chong, junior Celia Willner and junior Alan Huang. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Every two years, the band and orchestra travel to Los Angeles or New York. During the last Los Angeles trip, the band received second place and the orchestra received third place.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Wang, this year the band and orchestra spent three to four weeks practicing the pieces before presenting them in front of the judges panel. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We [orchestra] had previously practiced these pieces, this was just focused finetuning,” Wang said.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Wang thought thought the trip was very valuable, despite the hard work required to prepare. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I loved the trip,\" Wang said. \"I gained a lot of friendships, incredible experiences and memories.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Paly band and orchestra will be participating in the California Music Education Association competition in the upcoming months and will be hosting a concert in April in the Haymarket Theater in April. <\/span>\r\n\r\n&nbsp;","excerpt":"Palo Alto High School’s band and orchestra won first place in their respective categories in a competition during their trip New York City last week.  ","date":"2016-03-24 20:00:42","author":"Morgan Keller","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/Screen-Shot-2016-03-24-at-10.33.45-AM2.png","categories":["News"],"tags":["band","competition","first place","new york","new york city","orchestra","paly"]}]