[{"id":115960,"title":"Advisory this week is on Tuesday for all juniors and freshmen (L-Z)","permalink":"http:\/\/palyvoice.com\/2016\/02\/07\/advisory-this-week-is-on-tuesday-for-all-juniors-and-freshmen-l-z\/","content":"","excerpt":"","date":"2016-02-07 22:34:38","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":115927,"title":"Paly Quad to Levi&#8217;s Stadium: Students perform at Super Bowl 50","permalink":"http:\/\/palyvoice.com\/2016\/02\/07\/paly-quad-to-levis-stadium-students-perform-at-super-bowl-50\/","content":"[caption id=\"attachment_115928\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/12687887_1124695217549030_2321994312789312104_n.jpg\"><img class=\"wp-image-115928\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/12687887_1124695217549030_2321994312789312104_n.jpg\" alt=\"12687887_1124695217549030_2321994312789312104_n\" width=\"600\" height=\"451\" \/><\/a> Members of Palo Alto High School's cheer and dance team pose with a \"Super Bowl 50\" flag before their performance at the halftime show today at Levi's Stadium in Santa Clara. (Left to right, top to bottom row) Senior Emma Sternfield, sophomores Grace Kitayama, Clare Thomas, seniors Melanie Guan, Mariah Poitier, junior Lauren Jozefov, senior Ella Higashi and junior Nathalia Castillo submitted a video and were selected along with 200 other dancers to perform as \"flowers.\" Photo by Julie Sternfield.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Eight members of Palo Alto High School's cheer and dance team performed at the Super Bowl 50 halftime show today. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The performance, inundated with local teenagers, featured seniors Melanie Guan, Ella Higashi, Mariah Poitier and Emma Sternfield; juniors Nathalia Castillo and Lauren Jozefov; and sophomores Grace Kitayama and Clare Thomas. They danced alongside big-time musicians Coldplay, Bruno Mars and Beyoncé, spinning colorful flower umbrellas and precisely rotating formations with around 200 other dancers.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Higashi, the only performer from the cheer team, a favorite part of the experience was spending a few days before the game with the performers. Guan agreed that working alongside the famous artists was a memorable moment. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The highlight of the performance was definitely when Jay-Z and Blue Ivy walked past me and waved,” Guan said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Paly cheer and dance team became involved about a month ago when Julie Zimmer, the halftime show casting director, contacted the team to perform, according to Guan.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The Super Bowl halftime coordinators contacted our coach via email,” Sternfield said. “We submitted a <a href=\"https:\/\/www.youtube.com\/watch?v=AjCgcVY8fJw\" target=\"_blank\">video<\/a> of our team performing multiple dances, and soon after they contacted us saying we've been chosen to dance in the halftime show.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">After being chosen, the performers committed to confidentiality and hours of practice.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We weren’t allowed to tell anyone for around a month, but we had to leave school early a couple days to practice around five to six hours in Santa Clara,” Castillo said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">On the Wednesday through Friday leading up to the Super Bowl, the Paly performers had extra rehearsals from 3 p.m. to 8:30 p.m., according to Jozefov.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Those rehearsals were really fun because most of the time we were watching the singers perform,” Jozefov said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The dancers agreed that overall, their inclusion in the performance was an unforgettable opportunity.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It was definitely an experience of a lifetime and being a part of this event was one that I’ll never forget,” Castillo said.<\/span>\r\n\r\nSee posted recording by \"Heavy\" <a href=\"http:\/\/heavy.com\/sports\/2016\/02\/super-bowl-50-halftime-show-2016-performances-watch-video\/\" target=\"_blank\">here.<\/a>","excerpt":"Eight members of Palo Alto High School's cheer and dance team performed at the Super Bowl 50 halftime show today.","date":"2016-02-07 17:07:57","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/12687887_1124695217549030_2321994312789312104_n.jpg","categories":["News","Spotlight"],"tags":["beyonce","bruno mars","carolina panthers","cheer","chris martin","coldplay","dance","denver broncos","football","halftime show","super bowl 50"]},{"id":115869,"title":"Girls&#8217; soccer falls to Mountain View, ending hopes for perfect season","permalink":"http:\/\/palyvoice.com\/2016\/02\/07\/girls-soccer-falls-to-mountain-view-ending-hopes-for-perfect-season\/","content":"[caption id=\"attachment_115871\" align=\"aligncenter\" width=\"599\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/jacey.jpg\"><img class=\" wp-image-115871\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/jacey.jpg\" alt=\"Senior Jacey Pederson (19) weaves through the Mountain View defense. Pederson was sidelined with a hamstring injury early in the second half in the Viking's loss.\" width=\"599\" height=\"399\" \/><\/a> Senior Jacey Pederson weaves through the Mountain View defense. In the Vikings' loss, Pederson sustained a hamstring injury early in the second half. Photo by Cooper Lou.[\/caption]\r\n<p class=\"p1\">Unable to find offensive rhythm, the Palo Alto High School girls’ soccer team (13-1-1, 8-1-1) saw its hopes of an unbeaten season dashed after falling 0-2 to Mountain View (14-0-2, 7-0-2) on Friday.<\/p>\r\n<p class=\"p1\"><span class=\"s1\">Making the loss even more stinging was the fact that two of Paly’s biggest stars, seniors Alison Lu and University of California, Los Angeles-bound Jacey Pederson, were sidelined with injuries for most of the second half. According to Paly head coach Kurt Devlin, Lu will likely recover soon but Pederson's prognosis is uncertain.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">Right off of the starting whistle, Mountain View and its forward duo, junior Natasha Harris and senior Ysa<\/span><\/p>\r\n\r\n\r\n[caption id=\"attachment_115872\" align=\"alignright\" width=\"323\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/ansley.jpg\"><img class=\" wp-image-115872\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/ansley.jpg\" alt=\"Senior Ansley Queen goes up for a header against Mountain View's Bethan Parry. Photo by Cooper Lou.\" width=\"323\" height=\"485\" \/><\/a> Senior Ansley Queen goes up for a header against Mountain View sophomore Bethan Parry. Queen recently signed her National Letter of Intent and will continue her soccer career at Colorado College this fall. Photo by Cooper Lou.[\/caption]\r\n<p class=\"p1\"><span class=\"s1\">Baluyot, pressed hard offensively, setting up two dangerous chances early that Lu skillfully cleared. But the Spartans broke through in the 10th minute, when Harris received a through ball at the top of the 18-yard box, drew Paly goalkeeper Linnea Carlstrom out of position and evaded two defenders, finding the back of the net for Mountain View's first goal.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">In the first half stoppage time, Harris sent a dangerous chip into the box that resulted in a defensive miscommunication by the Vikings. In the chaos, Mountain View's Maddie Neidig tapped the ball through to double the Spartans' lead.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">Paly's prolific offense, which has produced 51 goals this season, found itself stifled by the Mountain View defense. <\/span><span class=\"s1\">The second half looked like it would be better for the Vikings after they made tactical adjustments, including moving Lu to forward, and created several promising chances. But things quickly deteriorated when Pederson limped off the field 10 minutes into the half with a hamstring injury, and Lu came off a few minutes later with a leg cramp. <\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">Left without two of its biggest playmakers, Paly fizzled toward the end of the half, unable to produce chances as Mountain View continued to apply pressure on the offensive end.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">“We started out the second half pretty well,” Devlin said. “After the injuries, it was pretty much an uphill battle. But you have to give them [Mountain View] a little bit of credit, because they had a good game plan, and they executed pretty well.”<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">Mountain View's Harris emphasized that her team's offensive success was due to tactical improvements.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">“The past couple of games, we hadn’t been able to score much,” Harris said. “Today, we played to our forwards’ strengths by playing to their feet.”<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">Paly junior defender Talia Malchin said that the athleticism of Mountain View’s attackers was the greatest contributing factor to the game’s result.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">“It was more a matter of the individual speed and skill of the forwards, rather than the whole team,” Malchin said. “They created the most issues for us as defenders.”<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">On the offensive front, sophomore midfielder Emily Tomz expressed disappointment with the Vikings’ inability to convert chances.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">“We should have been able to slot some in, with the amount of time we had possession of the ball in the final third of the field,” Tomz said.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">Tomz also noted that the Vikings went in with a more defensive mindset, knowing that they only needed to tie Mountain View to maintain their first-place position in league. Despite the setback, she emphasized that the team was going to bounce back for the final stretch of league play.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">\"A loss is a loss, and as we talked about after the game, that happened to be an important loss,” Tomz said. “But we still have four more games to play.”<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">The result was particularly frustrating for the Vikings because they were looking to avenge their loss to Mountain View in the the Central Coast Section Division I championship game last year. But Tomz remains optimistic that they will have another opportunity to do so.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\">“Hopefully we'll see them sometime again soon in CCS,” Tomz said. <\/span><\/p>\r\n<p class=\"p1\">In their next game, the Vikings will take on Santa Clara at 3:30 p.m. on Feb. 10 at Mountain View High School. To have a shot at the De Anza League title, Paly needs to win out the remainder of its games and have Mountain View lose at least once in league play.<\/p>","excerpt":"Unable to find offensive rhythm, the Palo Alto High School girls’ soccer team (13-1-1, 8-1-1) saw its hopes of an unbeaten season dashed after falling 0-2 to Mountain View (14-0-2, 7-0-2) on Friday.","date":"2016-02-07 11:04:17","author":"Dhara Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/jacey.jpg","categories":["Sports","Sports Recap","Spotlight"],"tags":["emily tomz","girls soccer","jacey pederson","kurt devlin","mountain view","paly","talia malchin","vikings"]},{"id":115387,"title":"Season Update: Girls&#8217; soccer looks towards CCS","permalink":"http:\/\/palyvoice.com\/2016\/02\/05\/season-update-girls-soccer-looks-towards-ccs\/","content":"[caption id=\"attachment_115550\" align=\"alignleft\" width=\"581\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Homestead-vs-PALY.png\"><img class=\" wp-image-115550\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Homestead-vs-PALY.png\" alt=\"Photo by Ethan Kao.\" width=\"581\" height=\"436\" \/><\/a> Junior midfielder Natalie Maloney dribbles the ball past defenders as the Vikings beat the Homestead Mustangs 5-0 on Friday. Photo by Ethan Kao.[\/caption]\r\n\r\nAfter an impressive season comes to a close, the Palo Alto High School girls’ soccer team (12-0-1, 7-0-1) continues to dominate opponents with stellar offense and fluid defense, maintaining their undefeated record.\r\n\r\nWith a recent 5-0 win against the Homestead Mustangs on Friday, and a 6-0 win against the Milpitas Trojans on Wednesday, the Vikings have been crushing opponents game after game.\r\n\r\nAssistant coach Eric Seedman reflects on the team's strong performance so far.\r\n\r\n“The first half of the season has been great and I think our record reflects how the girls have been playing,” Seedman said. “We’ve continued to improve from last season and I think we will only get better.”\r\n\r\nBoth the boys and the girls soccer teams have impressed with their dual undefeated streak, winning all 30 games thus far. Girls' are currently ranked 30th in the nation, and 12th in state according to <a href=\"http:\/\/www.maxpreps.com\/high-schools\/palo-alto-vikings-(palo-alto,ca)\/girls-soccer-winter\/home.htm\" target=\"_blank\">MaxPreps<\/a>.\r\n\r\nSeedman emphasizes the team's ability to play through adversity, due to the loss of senior left back Jacey Pederson the past few games to a national team camp.\r\n\r\n“This week was very tough for us not only because we had three games, but we were missing our best player [Pederson],” Seedman said. “We were also playing three tough opponents with two games on the road but the girls held up well and won them all.”\r\n\r\nAs the season comes to a close, seniors Heidi Moeser, Jacey Pederson, Nika Woodfill, Alison Lu, Linnea Carlstrom, and Ansley Queen look forward to ending the season on a strong note but also to prepare the team for next season as many key players are leaving for college.\r\n\r\nSenior Captain Heidi Moeser remarks on how the team has added multiple new players.\r\n\r\n\"We added 6 new players this year and they are doing an excellent job, and are really a huge part of this team,\" Moeser said. \"With so many of us leaving next year, I still feel confident in the strength of our team. We've proved drastically what we can do and we look to improve every practice, every game.\"\r\n\r\nGiven the success of the Vikings, senior defender Alison Lu stresses the importance of not allowing the wins to stifle improvement.\r\n\r\n“We have been playing well but there are definitely things we can work on,” Lu said. “There are still some communication issues on the field and we need to work on keeping possession. Improving that will really help us out. We also know the rising seniors and juniors are strong and will uphold what we've accomplished this season so far.”\r\n\r\nMidfielder Emily Tomz compares this season to the last, emphasizing how they have improved.\r\n\r\n\"Compared to last season, I definitely think we have a greater chance at winning leagues and CCS,\" Tomz said. \"We are a really strong and talented group, with a firm defense, crafty midfielders, and fast forwards who score often and with precision. This year more than last year we have been doing more fitness, which has and will benefit us in games, helping us keep up a high endurance the whole game.\"\r\n\r\nAs the second half of the season approaches, the Vikings continues to stay optimistic about the teams ability to maintain its undefeated record, and constantly looks to improve.\r\n\r\n\"For the rest of this season we are definitely aiming to continue our undefeated streak, and, of course, beat mountain view next Friday,\" Tomz said.\r\n\r\nThe Vikings will face off against league rivals Mountain View (13-0-1, 6-0-1) on Friday at 3:30 p.m. at Paly.","excerpt":"After an impressive start to the season, the Palo Alto High School girls’ soccer team (12-0-1, 7-0-1) continues to dominate opponents with stellar offense and defense maintaining their undefeated record.\r\n","date":"2016-02-05 10:40:21","author":"Ethan Kao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/Homestead-vs-PALY.png","categories":["Sports"],"tags":["CCS","dominate","girls","girls soccer","moeser","pederson","seedman","Soccer","undefeated","vikings"]},{"id":115733,"title":"New clubs debut at Club Day Two","permalink":"http:\/\/palyvoice.com\/2016\/02\/04\/new-clubs-debut-at-club-day-two\/","content":"<span style=\"font-weight: 400;\">Palo Alto High School Associated Student Body will host its second Club Day of the school year at lunch tomorrow on the Quad.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The event provides an opportunity for new clubs to gain publicity, and gives a chance for both new and old clubs to recruit members.<\/span>\r\n\r\n<span class=\"_5yl5\">\"Club Day [Two] is a really great way for people to join clubs that weren't originally chartered first semester,\" ASB Vice President Anmol Nagar said. \"Clubs from first semester are also able to advertise their club.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Nagar, unlike Club Day One, this Club Day will run on a regular B schedule and will feature a smaller number of clubs.<\/span>\r\n\r\nThis semester, ASB added nine new clubs: Neuroscience Club, Tapout Club, Beat Club, Polynesian Club, Curling Club, Science Research Club, Unity Club, Disney Club and PALY Teams Club. D<span style=\"font-weight: 400;\">uring the fall of 2015, there were a total of 75 clubs on campus, according to the Paly ASB <a href=\"https:\/\/sites.google.com\/site\/pahsasb\/clubs\">website<\/a>.\r\n<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Paly Voice spoke with five club founders to learn more about their clubs.<\/span>\r\n\r\n<iframe style=\"overflow-y: hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/10782689-club-day-2\" width=\"620\" height=\"3488\" frameborder=\"0\" scrolling=\"no\"><\/iframe>","excerpt":"The Associated Student Body will host its second Club Day of the school year at lunch tomorrow on the Quad.","date":"2016-02-04 22:09:56","author":"Annika Behal","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/0000\/00\/DSC_0226_0.jpg","categories":["News"],"tags":["ASB","Beat Club","club day","clubs","Curling Club","Disney Club","lunch","nagar","Neuroscience Club","Paly TEAM Club","Polynesian Club","quad","Science Research Club","Tapout Club","unity club"]},{"id":115628,"title":"Stanford Blood Center in urgent need of donations","permalink":"http:\/\/palyvoice.com\/2016\/02\/04\/stanford-blood-center-in-urgent-need-of-donations\/","content":"Stanford Blood Center is encouraging Palo Alto High School students who are 16 years or older to donate their blood to prepare for the unexpected, as an influx of visitors is coming to the Bay Area for the Super Bowl on Sunday in Santa Clara.\r\n\r\n<span style=\"font-weight: 400;\">With Super Bowl 50 just around the corner, an estimated <a href=\"http:\/\/ww2.kqed.org\/news\/2016\/01\/22\/how-to-get-around-the-bay-area-during-super-bowl-50\">one million people<\/a> are <a href=\"http:\/\/palyvoice.com\/2016\/02\/02\/school-gears-up-for-super-bowl-traffic\/\">expected to visit the Bay Area<\/a>, according to KQED News. To prepare for any mass casualties that could occur as a result of the Super Bowl, Stanford Health Care — one of the two level one trauma centers in the Santa Clara County — hopes to keep its blood inventory at 20 percent above its usual stock, according to Loren Magana, head of public affairs and communications at Stanford Blood Center, where Stanford Health Care's blood supply comes from.<\/span>\r\n\r\n[caption id=\"attachment_115653\" align=\"alignright\" width=\"329\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/hv3-1.jpg\"><img class=\" wp-image-115653\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/hv3-1.jpg\" alt=\"The Stanford Blood Center donation facility, equipped with cozy chairs and DVD players. Courtesy of Stanford Blood Center.\" width=\"329\" height=\"247\" \/><\/a> The Stanford Blood Center is in critical need of blood donations due to the upcoming Super Bowl. The blood center is equipped with cozy chairs and DVD players. Photo: Stanford Blood Center.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The blood center is in critical need of donations as it is currently short on blood inventory. According to Magana, the b<\/span>lood center often experiences a shortage in donations during the winter season because many regular donors are sick with colds or the flu. In addition, recent medical procedures have used up a significant amount of blood, making the blood center's shortage even worse. Magana explains that while the blood center is in dire need of -AB, -B and -O blood donations, all blood types are needed and welcomed.\r\n\r\n<span style=\"font-weight: 400;\">As it takes up to three days after donation to get blood ready for transfusion, it is imperative that people donate their blood soon in order for it to be ready in time for the Super Bowl, according to Magana.<\/span>\r\n\r\nJunior Sophie Pedersen encourages all eligible Paly students to donate their blood.\r\n\r\n\"The reason I want to donate blood is that it just seems like an easy way to help people and I think I have the blood type the donation center is looking for,\" Pedersen said. \"I would encourage anybody who has the time to do it because [the blood center] is experiencing a blood shortage.\"\r\n\r\n<span style=\"font-weight: 400;\">According to Magana, donations take approximately one hour, and students who wish to donate must be at least 16 years old with parental consent or 17 years old or older without parental consent. Donors must also be in good health, eat well and drink plenty of fluids before donating their blood. For more information regarding donor eligibility, visit this <a href=\"http:\/\/bloodcenter.stanford.edu\/donate\/EligibilityMedHisDeferral.html\">web page<\/a>. <\/span><span style=\"font-weight: 400;\">The blood center also asks that eligible students bring legal photo identification to the donation center, and if only 16 years old, either bring this <a href=\"http:\/\/bloodcenter.stanford.edu\/donate\/PDFs\/05-F%20X1%20Form%20Consent%20for%20Minor%20to%20Donate%20updated%20061815.pdf\">form<\/a> or have their parents accompany them. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">To schedule an appointment, students can call the blood center at <\/span><span style=\"font-weight: 400;\">888-723-7831, or visit its <a href=\"https:\/\/www.sbcdonor.org\/index.cfm?group=op&amp;expand=15371&amp;zc=94304\">website<\/a>. Donations can be made at the donor center, which is open on weekdays from 7 a.m. to 7:15 p.m. and located at <\/span><span style=\"font-weight: 400;\">3373 Hillview Ave.<\/span>","excerpt":"Stanford Blood Center is encouraging Palo Alto High School students who are 16 years or older to donate their blood to prepare for the unexpected, as an influx of visitors is coming to the Bay Area for the Super Bowl on Sunday in Santa Clara.","date":"2016-02-04 11:53:41","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/hv3-1.jpg","categories":["News"],"tags":["Blood","blood center","stanford"]},{"id":115584,"title":"Boys&#8217; soccer remains undefeated, rocks De Anza League","permalink":"http:\/\/palyvoice.com\/2016\/02\/04\/boys-soccer-remains-undefeated-rocks-de-anza-league\/","content":"[caption id=\"attachment_115585\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_80871.jpg\"><img class=\"size-full wp-image-115585\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_80871.jpg\" alt=\"Junior center defender Neil Verwillow passes the ball upline. The Vikings continue undefeated in their season in league and overall. Photo by Emma van der Veen.\" width=\"600\" height=\"400\" \/><\/a> Junior center defender Neil Verwillow passes the ball upline. The Vikings continue their undefeated season (12-0-4, 7-0-2) in the De Anza League and overall. Photo by Emma van der Veen.[\/caption]\r\n\r\nThe Palo Alto High School boys’ soccer team (12-0-3, 7-0-2) continues undefeated in its De Anza League season and leads its league division with 23 points, over second place Homestead High School (8-2-7, 4-1-4) with 16 points.\r\n\r\nPaly currently has 42 goals for and nine goals scored against them in its season. Leading the second place team, Homestead, in league by seven points has given the team a high guarantee of winning the league, a clear goal for the team. According to head coach Don Briggs, Paly has not won two consecutive league contests, so a league win to follow last year’s success would be monumental for the team.\r\n\r\n“In at least the last seven years, we haven’t won two consecutive league contests,” Briggs said. “It’s hard to win league here. It’s hard to even just stay up in the De Anza League sometimes, as it’s very competitive. That would be huge.”\r\n\r\nAccording to <a href=\"http:\/\/www.maxpreps.com\/high-schools\/palo-alto-vikings-(palo-alto,ca)\/soccer-winter\/home.htm\">maxpreps.com<\/a>, the Vikings are currently ranked 18th in the state and 61st in the nation.\r\n\r\nThe Vikings have had great potential since the beginning of the season, but learning to work cohesively as the season progressed has contributed to their success, according to senior captain and goalkeeper Eli Friedlander.\r\n\r\n“On some level, I thought that we would be good, but I didn’t know that we would be this good,” Friedlander said. “At the beginning of the year, we started off a little shaky, but in league we’ve really proved that we can play together pretty well and that we deserve the success we’ve been having.”\r\n\r\nAccording to Briggs, the team needs to work on staying focused during games and communicating on defense, as that has been a significant contributor to getting scored on in recent games.\r\n\r\n“We need to tighten up our defense,” Briggs said. “We’ve had two [recent] games where we’ve made mistakes in the defense. That [two goals from Los Gatos High School and Homestead each] is four goals in the last two games, and we’ve given up six goals in the whole [league] season. That’s an issue. That’s not a trend we want, and a lot of that [comes from] a lack of focus.”\r\n\r\nWinning league this year would favor the Vikings in seeding for the Central Coast Section playoffs, which would allow them to face less difficult competition early on, according to junior captain and center defender Neil Verwillow.\r\n\r\n“It’s great as far as CCS seeding goes, as that would pretty much guarantee us a top three spot and would give us an easier run in CCS,” Verwillow said. “Last year, I know that they had a tough run in CCS as they played Bellarmine [College Preparatory] pretty early on and Bellarmine is tough competition, but I think this year will be better.”\r\n\r\nPaly will face off Mountain View High School (7-4-5, 3-3-2) at 3:30 p.m. Friday at Mountain View.","excerpt":"The Palo Alto High School boys’ soccer team (12-0-3, 7-0-2) continues to remain undefeated in its De Anza League season and leads its league division with 21 points, over second place Homestead High School (7-2-7, 3-1-4) with 13 points.","date":"2016-02-04 10:40:38","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_80871.jpg","categories":["Sports","Spotlight"],"tags":["Bellarmine","boys soccer","don briggs","eli friedlander","gunn titans","homestead high school","los gatos high school","neil verwillow","palo alto high school","Soccer","sports"]},{"id":115677,"title":"ASB announces joint Gunn-Paly dance details","permalink":"http:\/\/palyvoice.com\/2016\/02\/03\/asb-announces-joint-gunn-paly-dance-details\/","content":"<span style=\"font-weight: 400;\">The Palo Alto and Gunn high school student governments released more information about the combined Gunn-Paly dance on Feb. 26 at the Mitchell Park Community Center in a <a href=\"https:\/\/youtu.be\/V4bEf3TQLuI\">promotional video<\/a>.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The dance’s official theme is “Highlight of the Night,” and students should dress casually in all-white with elements of neon, said organizers, who will also provide body paint to color clothing.\r\n<\/span>\r\n\r\nAccording to Paly junior Social Commissioner Maryland Valdez-Gonzalez, student officers hope to bolster unity between the schools.\r\n\r\n<span style=\"font-weight: 400;\">“Both the Paly and Gunn student bodies decided to create and combine a dance ... for the purpose of creating a stronger bond between both high schools in the Palo Alto community,” Valdez-Gonzalez said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Paly's Associated Student Body and Gunn's Student Executive Council first began developing combined dance plans in November and December, according to Gunn Dance Commissioner Radhika Ranganathan. Ranganathan says that they originally focused on <\/span><span style=\"font-weight: 400;\">improving community relations and familiarizing themselves with the Paly ASB.<\/span>\r\n\r\nBeyond the joint school aspect, this dance will also be unique to students as it will have a greater number of activities, such as air hockey, football and pool, and food, including catered desserts.\r\n<div class=\"conversation\">\r\n<div data-reactroot=\"\">\r\n<div class=\"_4tdt\">\r\n<div class=\"_4tdv\">\r\n<div class=\"_5wd4 _1nc7 direction_ltr\">\r\n<div class=\"_3ry4\">\r\n\r\n <span style=\"font-weight: 400;\">“<\/span><span style=\"font-weight: 400;\">We're hoping to reach a wider audience,\" Ranganathan said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">In addition, the dance’s location provides a different dynamic compared to past dances, according to junior Oracle-SEC Liaison Shannon Yang. <\/span><span style=\"font-weight: 400;\">In the past, students from both schools have complained about the DJs and music choices at dances. According to Ranganathan, the organizers have hired a completely new DJ to help solve the problem.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">In addition, some Paly students say the dance may be awkward at first due to prominent differences between traditional Gunn and Paly dances. <\/span><span style=\"font-weight: 400;\">However, any tensions between students will dissolve within a few minutes, according to Paly sophomore Marissa Ludwig.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“If it [the dance] is awkward, it will only be at first, because once everyone starts dancing no one will care,\" Ludwig said. \"Overall, I don't think it will be awkward, many people have friends between the schools.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Tickets are $10 without an ASB card or $5 with one and can be <a href=\"https:\/\/palywebstore.myschoolcentral.com\/asbworks\/(S(oivacebacoixzieenw420yb4))\/WebStore.aspx?org=6028\">purchased online<\/a>. Supplies are limited and door sales may be eliminated if pre-sale meet event site capacity. <\/span>\r\n\r\n\r\n\r\n\r\n\r\n\r\n","excerpt":"The Palo Alto High School and Gunn High School Associated Student Bodies will host a combined Gunn-Paly dance on Feb. 26 at the Mitchell Park Community Center.","date":"2016-02-03 20:12:10","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/library.jpg","categories":["News"],"tags":["Alto","ASB","center","Community","dance","DJ","Food","gunn","High","kevin sharp","mitchell","Palo","paly","park","School"]},{"id":115571,"title":"ASB to host International Lunch","permalink":"http:\/\/palyvoice.com\/2016\/02\/03\/asb-to-host-international-lunch\/","content":"[caption id=\"attachment_115611\" align=\"alignnone\" width=\"613\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/thumb_IMG_9010_10241.jpg\"><img class=\"wp-image-115611\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/thumb_IMG_9010_10241.jpg\" alt=\"\" width=\"613\" height=\"460\" \/><\/a> Members of The K-Pop Dance Club practice their routine for tomorrow's International Lunch. \"These sorts of events help promote diversity and show all the different cultures that make up Paly,\" sophomore K-Pop Dance Club president Vivian Nguyen said. Photo by Julia Qiao.[\/caption]\r\n\r\nThe Palo Alto High School Associated Student Body will hold an International Lunch tomorrow on the Quad, featuring foods and performances representing cultures from around the world, according to ASB Vice President Anmol Nagar.\r\n\r\nBoth Paly clubs and professionals will be participating in the dances and activities, Nagar said.\r\n\r\n“Students can expect to watch dance performances, as well as participate in activities lead by clubs on the Quad,” Nagar said. “ASB organized this event to give clubs the opportunity to be more involved on Paly campus. It's also to celebrate the multitude of amazing cultures that we have at Paly.”\r\n\r\nClubs that will be performing include K-Pop Dance Club, which will be performing a dance routine and the American Sign Language Club, which will be signing a song.\r\n\r\n“The ASL club will be signing the song 'What a Wonderful World',\" senior ASL club president Zoe Lung said. “Although it might be a little strange that the ASL club is participating in the International Day ... the idea of International Day is to expose Paly students to different cultures and languages. ASL embodies not only a way to communicate, but also bringing together the Deaf culture.”\r\n\r\nStudents can also purchase different foods from around the world provided by the Global Citizens Collaborative club. According to senior GCC Club president Mabel Furutsuki, for under $5, the club will be selling Japanese juice popsicles, Valentine’s day cookies, polvorones (shortbread) from the Philippines, Chinese almond cookies and Japanese veggie crackers.\r\n\r\nAside from performances and food, the Model United Nations Club will also be setting up a booth to teach students more information about the United Nations. According to senior MUN club president Eli Frankel, the club will also provide information  about the current European refugee crisis and what Paly students can do to help and how they can be involved.\r\n\r\n“These sorts of events help promote diversity and shows all the different cultures that make up Paly,” said Vivian Nguyen, sophomore K-Pop Dance Club president.","excerpt":"The Palo Alto High School Associated Student Body will hold an International Lunch tomorrow on the Quad, featuring foods and performances representing cultures from around the world, according to ASB Vice President Anmol Nagar.","date":"2016-02-03 19:50:46","author":"Julia Qiao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/thumb_IMG_9010_10241.jpg","categories":["News"],"tags":["anmol nagar","ASB","ASL Club","Furutsuki","Global Citizens Collaborative Club","International Lunch","K-Pop","lunch","Lung","model un club","paly"]},{"id":114483,"title":"Opinion: Low-flying planes are just the tip of the iceberg","permalink":"http:\/\/palyvoice.com\/2016\/02\/03\/opinion-low-flying-planes-are-just-the-tip-of-the-iceberg\/","content":"<span style=\"font-weight: 400;\">Airplanes continue to soar over Palo Alto in droves due to changes made by the Federal Aviation Association, despite many <a href=\"http:\/\/palyvoice.com\/2016\/01\/15\/residents-protest-airplane-noise-at-sky-posse-meeting\/\">residents' protests<\/a> to end the noise.<\/span><span style=\"font-weight: 400;\"> Through petitions, plane noise reports and emails to city officials, local group \"Sky Posse\" aims to reduce the number of planes overhead by redesigning the Bay Area’s airspace and collaborating with both the City of Palo Alto and the FAA.<\/span>\r\n\r\nSky Posse has outlined two major problems with by FAA's Next Generation Air Transportation System, a new arrangement that decreases wasted fuel and plane flight times while simultaneously increasing flights over urban areas. These issues are noise and environmental pollution. <span style=\"font-weight: 400;\">Sky Posse’s actions and intentions in both of these cases are superb, but analysis of Palo Alto's air quality has garnered mix results. And<\/span><span style=\"font-weight: 400;\"> while airplane noise can be annoying, Palo Alto should do more than reroute planes if we wish to limit sound pollution.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Sky Posse’s <a href=\"http:\/\/www.skypossepaloalto.org\/\">website<\/a>, airplanes flying over Palo Alto have increased nearly 200% since NextGen's implementation. To better understand the effects of these changes on the community, I spoke with Phil Martien, air quality engineering manager from the Bay Area Air Quality Management District. According to Martien, <\/span><span style=\"font-weight: 400;\">these flights do not have a large environmental impact on the Bay Area.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“<\/span><span style=\"font-weight: 400;\">Commercial aircrafts do contribute to the Bay Area's inventory of air pollution emissions for compounds that have direct health impacts, but compared to the region's total, they are not a major source,” Martien said. “Because the jet flights are above the immediate layer of air where people live and breathe, the direct impact of these flights and changes to flight paths won't have a big impact on air quality.”<\/span>\r\n\r\nIn addition, Martien says that the Bay Area’s air quality is good compared to other urban American cities, and is improving.\r\n\r\nOur air may not appear to be greatly affected by NextGen's redirected flights, but the City of Palo Alto should study the long-term effects of airborne transportation on the environment.\r\n\r\n\"I would say that even if the impact on air quality is not a 'big impact' ... it is still an impact  and I would like our air quality analyzed in the most up to date way possible,\" Sky Posse co-leader Rachel Kellerman said.\r\n\r\n[caption id=\"attachment_114501\" align=\"alignright\" width=\"403\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/air-traffic-control-baytracon-sfo.jpg\"><img class=\"wp-image-114501\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/air-traffic-control-baytracon-sfo.jpg\" alt=\"air-traffic-control-baytracon-sfo\" width=\"403\" height=\"307\" \/><\/a> Increased air traffic above the Bay Area has led to numerous noise complaints since early 2014. Sky Posse co-leader Jennifer Landesmann says she hopes to work with the FAA to redesign Bay Area airplane routes. \"We need the FAA ... to give us some immediate relief,\" Landessman said. Photo courtesy of SFO Noise Abatement Office.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Despite little cause for alarm with regards to air quality, Sky Posse is correct that resulting sound pollution is an issue.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“They [new flight routes] could have significant impacts on noise levels,\" Martien said. \"And noise itself can have health impacts.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The airplane noise itself is not generally bothersome compared to other forms of transportation in Palo Alto. After all, over 25 trains pass parallel to Palo Alto High School each day, and its cacophonous horns are far more likely to disturb my daily life than a plane thousands of feet in the air. In addition, Palo Alto’s population nearly <\/span><a href=\"http:\/\/www.paloaltoonline.com\/news\/2010\/02\/02\/palo-alto-neighborhoods\"><span style=\"font-weight: 400;\">triples <\/span><\/a><span style=\"font-weight: 400;\">each day due to commuters entering and leaving for work. The resulting traffic, from buses to honking cars, largely outweighs any noise pollution from planes.<\/span>\r\n\r\nHowever, some residents claim the planes’ noise has negatively impacted their overall well-being.\r\n\r\n<span style=\"font-weight: 400;\">“I don’t mind complaining. I just mind the planes and the noise,” one woman at a Sky Posse meeting said.<\/span>\r\n\r\nLow-flying planes may be irritating to some Palo Altans, but this newfound noise is only the tip of the iceberg. If we wish to limit noise pollution, we should not restrict ourselves to focusing solely on that of airplanes. Traffic congestion and trains’ blaring horns are issues that are just as important to address. If we want a happier and quieter community, collaborating with both the FAA and local city councils is a vital step on limiting all unneeded noise, regardless of the source.","excerpt":"New flight routes above Palo Alto have limited environmental effects and only represent the tip of the iceberg of Bay Area noise pollution.","date":"2016-02-03 16:07:17","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/air-traffic-control-baytracon-sfo.jpg","categories":["Opinion","Spotlight"],"tags":["airplane noise","annoying","association","aviation","Bay Area","environment","faa","federal","martien","nextgen","noise","palo alto","paly","peninsula","phil","plane","pollution","sky posse","transportation"]}]