[{"id":119322,"title":"Campus defaced with racist, pro-Trump graffiti","permalink":"http:\/\/palyvoice.com\/2016\/04\/18\/campus-defaced-with-racist-pro-trump-graffiti\/","content":"[caption id=\"attachment_119339\" align=\"alignright\" width=\"341\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/13046219_1718988074981178_1740350271_n1.jpg\"><img class=\"wp-image-119339\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/13046219_1718988074981178_1740350271_n1.jpg\" alt=\"13046219_1718988074981178_1740350271_n\" width=\"341\" height=\"255\" \/><\/a> The custodial staff discovered graffiti on a bench near the science building at Palo Alto High School this morning. Photo: Bianca Al-Shamari.[\/caption]\r\n\r\nThe Palo Alto High School administration is investigating racist and pro-Donald Trump graffiti messages discovered on campus this morning.\r\n\r\nPerpetrators scrawled \"Black Lives Suck\" and \"Trump 1237\" with black marker in at least three locations on campus, including the boys' bathroom door in the 800 building and the benches directly in front of the custodial offices.\r\n\r\n\"Trump 1237\" coincides with the number of delegates needed to capture the Republican nomination for the national presidential election, and \"Black Lives Suck\" is a perversion of the slogan \"Black Lives Matter,\" which became a rallying cry for civil rights activists following several police brutality incidents.\r\n\r\nPaly is the latest addition to the growing number of high schools and colleges across the nation that have been defaced with similar hateful, Trump-related messages.\r\n\r\nThe custodial staff discovered the majority of the graffiti this morning at 8:20 a.m., and the vandalism was concealed shortly afterward, according to Assistant Principal Jerry Berkson.\r\n\r\n\"We take pictures and get rid of it as soon as possible,\" Berkson said. \"Unless we have a lead, we are limited in action. We clean it up right away, so the person responsible doesn't get the attention they want.\"\r\n\r\nAccording to Berkson, the Palo Alto Police Department has been contacted to aid in the investigation.\r\n\r\nIn an email to The Paly Voice, Supt. Max McGee stated that he encourages students to stand against bigotry.\r\n\r\n\"Hate speech is a serious matter, and those who defaced our campus will suffer serious consequences,\" McGee said. \"We are immediately removing the graffiti, but more importantly, I trust that our Paly students will not tolerate any expression of racial, ethnic or gender disparagement and will take positive steps to assure that our campus is kind, safe and welcoming for every individual.\"\r\n\r\n[caption id=\"attachment_119340\" align=\"alignright\" width=\"254\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/13059324_1718987974981188_33468229_n1.jpg\"><img class=\"wp-image-119340\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/13059324_1718987974981188_33468229_n1.jpg\" alt=\"13059324_1718987974981188_33468229_n\" width=\"254\" height=\"339\" \/><\/a> The boys' restroom in the 800 building was one of several locations on campus vandalized with a pro-Trump message. Administration covered up \"Black Lives Suck\" underneath a piece of paper, according to secretary Carolyn Benfield. Photo: Bianca Al-Shamari.[\/caption]\r\n\r\nCampus Supervisor Carl Hubenthal said he felt upset after seeing the messages.\r\n\r\n\"I don't think this kind of hate has any place on this campus,\" Hubenthal said. \"This should be an inclusive space for everybody, and I think whoever did that needs to come forward and have some sensitivity training. The person who did it clearly doesn't understand the hate that they're projecting and what damage they can do.\"\r\n\r\nThe graffiti appeared just as Paly began its <a href=\"http:\/\/palyvoice.com\/2016\/04\/17\/change-in-our-schools-week-cultivating-a-positive-community\/\">first annual Change In Our Schools Week<\/a>, intended to celebrate student diversity and promote respect. Junior Cezanne Lane, an organizer of CIOS Week and Associated Student Body spirit commissioner, was also taken aback by the hateful comments.\r\n\r\n\"This is really shocking for a community that I thought was so progressive,\" Lane said. \"Hopefully the person who did it didn't mean it, but those words are harmful.\"\r\n\r\nSenior Dami Bolarinwa said he is disappointed by the graffiti. According to Bolarinwa, the Black Lives Matter movement carries an important message that people need to hear.\r\n\r\n\"That's truly heartbreaking to see that people have reverted to such disgrace of integrity,\" Bolarinwa said. \"Black lives and many minority lives are targeted, so it saddens me to know students at Paly feel that way and are continuing to target students on campus with vandalism as this.\"\r\n\r\nSenior Sergio Valente said he believes the messages do not represent the values of the Paly student body.\r\n\r\n“When I saw the graffiti I assumed that the people who created it were just doing so as a joke and thought it was funny,” Valente said. “I think there are many better ways to express juvenile fun and it’s sad that they chose to do so in a way that can be offensive. I also don’t think that it is something that needs to be blown out of proportion as it was the actions of presumably a few individuals and need not reflect on the school as a whole.”\r\n\r\nJunior Maya Lathi said she thinks that people have the right to express political opinions, but personal beliefs should be shared in ways other than graffiti.\r\n\r\n\"With regards to the 'Black Lives Suck' graffiti, I think it is sad to see that this is a view a fellow student has, but it shouldn't be considered representative of our tolerant student body,\" Lathi said. \"In regards to the 'Trump 1237' graffiti, while I disagree with the politics of Donald Trump, I respect each citizen's right to believe in whatever politics they'd like to. There are more respectful, less destructive, ways to express one's opinion than vandalism.\"\r\n\r\n<span style=\"font-weight: 400;\">Senior Reuben Kramer said he hopes people learn to value respect and tolerance.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"I think that it's embarrassing that someone would do a hate crime, especially on campus,\" Kramer said. \"I would encourage people to stand up to racism whenever they see it, because it has no place in this world.\"<\/span>\r\n\r\nTrump is scheduled to appear at the California Republican Party convention on Friday, April 29, in Burlingame. A protest to his speech is being <a href=\"https:\/\/www.facebook.com\/events\/1524102991231738\/\" target=\"_blank\">organized through Facebook<\/a>, encouraging people to \"show him [Trump] a real Bay Area welcome by peacefully protesting outside.\" Several Paly students marked that they are planning to attend the protest. The Trump campaign, when contacted by The Paly Voice, indicated it would respond to news of the graffiti but had not done so as of 9:45 p.m. Monday night.\r\n\r\nComparable graffiti has defaced other schools outside of Palo Alto, including <a href=\"http:\/\/www.latimes.com\/local\/education\/higher-ed\/la-me-ln-lmu-graffiti-20160406-story.html\">Loyola Marymount University<\/a>, <a href=\"http:\/\/www.mercurynews.com\/politics-government\/ci_29675931\/trump-graffiti-scares-emory-students-we-are-pain\">Emory University<\/a>, <a href=\"http:\/\/www.bostonherald.com\/news\/local_coverage\/2016\/03\/judge_s_son_charged_with_spray_painting_trump_and_racist_graffiti\">Northwestern University, <\/a><a href=\"http:\/\/www.dispatch.com\/content\/stories\/local\/2016\/04\/16\/pro-trump-message-on-wall-sparks-discourse-at-ou.html\" target=\"_blank\">Ohio University<\/a> and <a href=\"http:\/\/laist.com\/2016\/03\/14\/pacific_palisades_racist_graffiti.php\">Pacific Palisades Charter High School<\/a>.\r\n\r\n<em>Additional reporting and writing by Emily Hwang.<\/em>\r\n\r\n<em>Editor’s Note: For a few minutes, an extension on one of our editors' browser changed all mentions of “Trump” to “Drumpf.” We apologize for this brief departure from correct spelling.<\/em>","excerpt":"The Palo Alto High School administration is investigating racist and pro-Donald Trump graffiti messages discovered on campus this morning.","date":"2016-04-18 21:48:09","author":"Bianca Al-Shamari","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/trump-graffiti.jpg","categories":["News","Spotlight"],"tags":["graffiti","messages","racist","Trump","vandalism"]},{"id":118754,"title":"Library to provide finals studying for students","permalink":"http:\/\/palyvoice.com\/2016\/04\/18\/library-to-provide-finals-studying-for-students\/","content":"[caption id=\"attachment_73571\" align=\"aligncenter\" width=\"503\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_0783.jpg\"><img class=\"wp-image-73571\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_0783.jpg\" alt=\"People will have plenty of room to experience the Mitchell Park Library’s new features thanks to the building’s massive size. According to the library website(link), the facility will be approximately four times larger than its predecessor, with a collection nearly twice its previous size. Its children’s area alone is nearly as large as the Children’s Library on Harriet Street. http:\/\/www.cityofpaloalto.org\/gov\/depts\/csd\/my_mitchell.asp Photo by William Zhou.\" width=\"503\" height=\"377\" \/><\/a> The Mitchell Park Library and Community Center is a popular place for students to study for finals. This year, the library is hoping to help Palo Alto high school students study for finals by providing various new activities and resources for teens during its ‘Finals Cram Slam’ from May 25 to May 26. Photo by William Zhou.[\/caption]\r\n\r\nThe Mitchell Park Library and Community Center hopes to help Palo Alto high school students study for finals by providing various activities and resources for teens during its ‘Finals Cram Slam’ from May 25 to May 26.\r\n\r\nThe main purpose of the Finals Cram Slam is to provide students with study space, according to Teen Services Librarian Gina Martinez.\r\n\r\n“We want high school students to have a place to study for finals,” Martinez said. “ The Mitchell Park Library and Community Center has plenty of table space for students to finish a group project and collaborate with others. We’ll be open until 10 p.m. on May 25 and 26.”\r\n\r\nOne new feature the library will be offering this year is a special quiet study room, according to Martinez.\r\n\r\n“This year, we are planning to have the Adobe Room be an extra large designated quiet room for those who study best solo,” Martinez said.\r\n\r\nIn addition to study space, the Mitchell Park Library will be providing teens with other resources, according to Martinez.\r\n\r\n“We will also be offering snacks and free games during your breaks from studying,” Martinez said. “Students can take a break in the Teen Center to play on the WiiU, Xbox One, board games, air hockey and ping-pong tables. Therapy dogs will be visiting the library to de-stress, too.”\r\n\r\nBrining in therapy dogs have been successful in the past, according to Martinez.\r\n\r\n“I had a request from one teen back in December who told me she had been looking forward to Finals Cram Slam just so she could see and get a visit from our therapy dogs,” Martinez said. “From the moment she saw one of our pups she was smiling from ear to ear, and it is a good feeling to know we are helping students de-stress. The Mitchell Park Library and Community Center care a lot about our youth, and we are always striving to keep them happy, even while studying, when they are here.”\r\n\r\n[caption id=\"attachment_119329\" align=\"alignright\" width=\"387\"]<img class=\"wp-image-119329\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/photo.jpg\" alt=\"photo\" width=\"387\" height=\"290\" \/> This year, the library and its student leadership team, the Teen Library Advisory Board, are hoping to increase student wellness during finals through their 'Post-its for Positivity' project, according to Martinez. Submission boxes like these are located at Gunn and Palo Alto High School and at the city libraries. Photo by William Zhou.[\/caption]\r\n\r\nThis year, the library and its student leadership team, the Teen Library Advisory Board, are hoping to increase student wellness during finals through a new project, according to Martinez.\r\n\r\n“TLAB and Mitchell Park Library are starting a movement, called 'Post-its for Positivity' for students during finals week,” Martinez said. “We are asking all adults-teachers, parents, school librarians, and library patrons during the month of April and May to a write messages for high school students on post-it notes as encouragement for students during f\r\ninals week. My goal is to show teens that they are cared about and valued in their community.”\r\n\r\nPeople\u0010 who wish to write a Post-it of encouragement can stop by the Mitchell Park, Rinconada or Children’s Library locations to write a handwritten message on a post-it during the months of April and May or send your typed note to paloaltoTLAB@gmail.com.","excerpt":"The Mitchell Park Library and Community Center hopes to help Palo Alto high school students study for finals by providing various activities and resources for teens during its ‘Finals Cram Slam’ from May 25 to 26.   ","date":"2016-04-18 11:59:15","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/photo.jpg","categories":["News","Spotlight"],"tags":["dogs","finals cram","Gina","gunn high school","Library","mitchell park","palo alto high school","Stress","TLAB"]},{"id":118907,"title":"Robotics team to compete at World Championship","permalink":"http:\/\/palyvoice.com\/2016\/04\/18\/robotics-team-to-compete-at-world-championship\/","content":"[caption id=\"attachment_119023\" align=\"aligncenter\" width=\"560\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/Screen-Shot-2016-04-14-at-10.29.01-AM.png\"><img class=\"wp-image-119023\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/Screen-Shot-2016-04-14-at-10.29.01-AM.png\" alt=\"Screen Shot 2016-04-14 at 10.29.01 AM\" width=\"560\" height=\"432\" \/><\/a> After recently qualifing to compete at the For Inspiration and Recognition of Science and Technology Robotics Competition in St. Louis Missouri, the Palo Alto High School Robotics team is working hard and making adjustments to its robots to prepare for the championships, according to senior project manager Peter Turnbull. Photos by William Zhou.[\/caption]\r\n\r\nWheels are racing and screws are turning as the Palo Alto High School Robotics team is preparing to compete at the For Inspiration and Recognition of Science and Technology Robotics Competition from April 26 to May 1 in St. Louis.\r\n\r\nThe FRC is the culminating event of the robotics season, according to senior project manager Peter Turnbull.\r\n\r\n“I believe over 600 robotics teams will attend,” Turnbull said. “Teams get invited if they win a regional or district event or if they win certain awards at said regionals or districts.”\r\n\r\nThe Paly robotics team did not win the Central Valley Regional, according to Turnbull.\r\n\r\n“CVR was a bit rocky due to several issues with the robot,” Turnbull said. “Most of those problems were actually not in our control because we had a faulty computer. At CVR, we did our best, but did not win the finals as we were up against Team 254 from Bellarmine and Team 1678 from Davis, who are both good teams.”\r\n\r\nHowever, the Paly team still qualified for the FRC through a series of wildcards, according to Turnbull.\r\n\r\n<span style=\"font-weight: 400;\">“Team 254 is a Hall of Fame team and get to go to Champs every year no matter what so they generated a wildcard spot for Team 1678,” Turnbull said. “Team 1678 was on the alliance that won championships last year, so they already qualified and generated another wildcard spot for Team 167, which had already qualified previously, leading to another wildcard spot, meaning that all of the teams on the finalist alliance, including Paly, were invited to championships.”  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The robotics team is working hard to prepare for the championship competition, according to Turnbull. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It's [qualifying for the championships] is really exciting,” Turnbull said. “We have not been in some time and the entire team is working really hard to prepare for the championships. Despite build season being over, we're still in the lab a lot, making modifications and generally preparing for competition. There's so much to do.”<\/span>","excerpt":"Wheels are racing and screws are turning as the Palo Alto High School Robotics team is preparing to compete at the For Inspiration and Recognition of Science and Technology Robotics Competition from April 26 to May 1 in St. Louis.","date":"2016-04-18 11:58:19","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/Screen-Shot-2016-04-14-at-10.29.01-AM.png","categories":["News","Spotlight"],"tags":["Central Valley Regional robotics competition","championship","competition","FIRST","FRC","robotics"]},{"id":119311,"title":"&#8220;Taste of Unity&#8221; event to take place at 6:30 p.m. on Thursday, April 21 in the MAC","permalink":"http:\/\/palyvoice.com\/2016\/04\/17\/taste-of-unity-event-to-take-place-at-630-p-m-on-thursday-april-21-in-the-mac\/","content":"","excerpt":"","date":"2016-04-17 19:06:01","author":"Chirag Akella","categories":["Ticker"],"tags":[]},{"id":119122,"title":"Change In Our Schools Week: Cultivating a positive community","permalink":"http:\/\/palyvoice.com\/2016\/04\/17\/change-in-our-schools-week-cultivating-a-positive-community\/","content":"[caption id=\"attachment_119126\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/DSC_0551.jpeg\"><img class=\"size-full wp-image-119126\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/DSC_0551.jpeg\" alt=\"Senior ASB Treasurer Courtney Hall places a handprint onto the 'These Hands Don't Harm' poster set up in the Quad during lunch on Wednesday for Sexual Assault Awareness Day during Not In Our Schools Week 2015. This year, the focus will be on the positive aspects instead. Photo by Liana Pickrell.\" width=\"600\" height=\"399\" \/><\/a> Graduated Palo Alto High School Associated Student Body Treasurer Courtney Hull places a handprint onto a poster during Not In Our Schools Week 2015. This year, the focus will be on the positive aspects of the Paly community. Photo by Liana Pickrell.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">A group of Palo Alto High School students will debut<\/span><span style=\"font-weight: 400;\"> a week-long initiative <\/span><span style=\"font-weight: 400;\">to address different societal matters to foster a healthier community on Monday at Paly, according to student organizers.<\/span>\r\n\r\nSome students, including junior Anmol Nagar, came together on their own to work on the creation of Change In Our Schools Week to replace the annual Not In Our Schools Week.\r\n\r\n<span style=\"font-weight: 400;\">“Change In Our Schools Week is basically a spinoff of Not in Our Schools Week, which is a national campaign to address various societal issues that are prevalent in schools,” Nagar said. “We changed it a little bit this year in a more positive direction to closely examine ourselves and our identity and how we choose to treat others.”<\/span>\r\n\r\n[caption id=\"attachment_119124\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/13010114_1761646434067670_1104210384_o.jpg\"><img class=\"wp-image-119124\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/13010114_1761646434067670_1104210384_o.jpg\" alt=\"Change In Our Schools Week will debut on April 18 with different themes every day. The themes focus on the positives rather than dwelling on the negative aspects. Photo: Anmol Nagar.\" width=\"300\" height=\"450\" \/><\/a> Change In Our Schools Week will begin on Monday with different themes every day. The different days will feature activities, performances and food. The themes focus on how to improve rather than dwelling on the negative aspects. Photo: Anmol Nagar.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">According to junior Cezanne Lane, another student organizer, each day has a specified theme. Monday focuses on “Paly Is” to recognize who makes up Paly and embrace different communities. CIOS Week encourages students to ask themselves “Who Are We?” on Tuesday to learn about different cultural, sexual and gender identities, as well as students’ different abilities. Wednesday’s focus is “How Do We Treat Each Other?” to investigate and improve relationships regarding sexual assault, bullying and social justice. On Thursday, the recently formed Sources of Strength group will lead an activity under the theme of “What Are Our Sources of Strength?” The last day is themed “How Do I Care For Myself?” to encourage students to self-reflect and change the way they address others and see the world. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Teacher on Special Assignment Eric Bloom, who has been helping the students plan the week, said that the idea came about when discussing the NIOS Week's more negative outlook.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“There had been a discussion before about the negative connotations of 'not' as opposed to what to we want to see,” Bloom said. “The big thing was simply the idea that we wanted to celebrate or talk about what it is we want in our schools, not what it is that we don’t want.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">As well as agreeing with Bloom’s sentiments, Lane also pointed out the redundancy of NIOS Week over the years.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We’ve been doing the same bullying activity since elementary school,” Lane said. “Instead of ‘Don’t bully, don’t do this,’ it’s more, ‘Let’s get excited about caring for each other and caring for ourselves and being kind human beings and being proud of Paly.’”<\/span>","excerpt":"A group of Palo Alto High School students will debut a week-long initiative to address different societal matters to foster a healthier community on Monday at Paly, according to student organizers.","date":"2016-04-17 12:54:15","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/DSC_0551.jpeg","categories":["News","Spotlight"],"tags":["anmol nagar","Cezanne lane","Change In Our Schools Week","Community","eric bloom","NIOS Week","not in our schools week","positive","sources of strength"]},{"id":119220,"title":"Baseball falls to Los Gatos for second league loss","permalink":"http:\/\/palyvoice.com\/2016\/04\/17\/baseball-falls-to-los-gatos-for-second-league-loss\/","content":"[caption id=\"attachment_119282\" align=\"alignnone\" width=\"507\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/I9P85544.jpg\"><img src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/I9P85544.jpg\" alt=\"Senior Alec Olmsted throws a fastball to a Los Gatos batter during a De Anza League game on Friday at home. Olmstead pitched four innings and gave up three earned runs. Photo by Cooper Lou.\" width=\"507\" height=\"510\" class=\"size-full wp-image-119282\" \/><\/a> Senior Alec Olmsted throws a fastball to a Los Gatos batter during a De Anza League game on Friday at home. Olmstead pitched four innings and gave up three earned runs. Photo by Cooper Lou.[\/caption]\r\n\r\nThe Palo Alto High School baseball team (13-3-1, 8-2) suffered its second De Anza League loss, 7-4, to the Los Gatos High School Wildcats (13-8, 9-1) on Friday at home. \r\n\r\nThe Vikings defeated the Wildcats earlier in the week, 4-0, but were unable to best Los Gatos a second time.\r\n\r\nThe Wildcats jumped out to an early, 1-0, lead, but the Vikings came back with a run of their own in the bottom of the first. \r\n\r\nLos Gatos scored three runs over the next three innings and led Palo Alto until the bottom of the fourth inning when the Vikings mounted a three run rally.  The Vikings finally tied the game, 4-4, after a double from junior shortstop Ethan Stern which scored junior center fielder Ben Cleasby from second base.\r\n\r\nCleasby led the Vikings with three hits and two runs batted in. \r\n\r\nIn the sixth inning, the Wildcats were able to pound out two runs, putting the game out of reach for the Vikings. \r\n\r\nThe Vikings' starting pitcher, senior Alec Olmstead, said the Los Gatos pitchers did a great job of controlling the pace of the game, and the team is looking forward to facing the Wildcats again later  in the season.\r\n\r\n\"They [Los Gatos] didn't really mess around, they got their outs quick,\" Olmstead said. \"They are a great team and I'm excited to face them again.\"\r\n\r\nAccording to junior right fielder Angus Stayte, mental errors cost the Vikings the game.\r\n\r\n\"We made a lot of mental mistakes, myself included,\" Stayte said. \"But now we just have to stay focused and bounce back during our game on Monday.\"\r\n\r\n The Vikings have now dropped to second place behind the Wildcats in the De Anza League standings. \r\n\r\nThe Vikings will face Leland High School at 4 p.m. Monday at Leland High School.\r\n\r\n\r\n","excerpt":"The Palo Alto High School Vikings baseball team suffered it's second De Anza League loss to the Los Gatos High School Wildcats on Friday. ","date":"2016-04-17 12:08:35","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/I9P85544.jpg","categories":["Baseball","Sports","Uncategorized"],"tags":["Baseball","los gatos","Olmstead","palo alto","stayte","vikings","wildcats"]},{"id":119116,"title":"Liveblog: Girls&#8217; lacrosse vs. Gunn","permalink":"http:\/\/palyvoice.com\/2016\/04\/15\/liveblog-girls-lacrosse-vs-gunn\/","content":"Check back in beginning at 7 p.m. as the Palo Alto High School girls' lacrosse team (8-3, 7-0) looks to preserve it's undefeated Santa Clara Valley League record in a rivalry game against the Gunn Titans (4-6, 3-2) at the Paly lacrosse field.\r\n\r\n[liveblog] ","excerpt":"Check back in beginning at 7 p.m. as the Palo Alto High School girls' lacrosse team (8-3, 7-0) looks to preserve it's undefeated Santa Clara Valley League record in a rivalry game against the Gunn Titans (4-6, 3-2) at the Paly lacrosse field. ","date":"2016-04-15 17:53:24","author":"Josh Yuen","categories":["Sports"],"tags":["girls' lacrosse","liveblog","titan","viking"]},{"id":118921,"title":"Students to paint mural on Student Activities Center, replacing James Franco mural","permalink":"http:\/\/palyvoice.com\/2016\/04\/15\/students-to-paint-mural-on-student-activities-center-replacing-james-franco-mural\/","content":"[caption id=\"attachment_118981\" align=\"alignnone\" width=\"543\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_0313.jpg\"><img class=\"wp-image-118981\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_0313.jpg\" alt=\"IMG_0313\" width=\"543\" height=\"407\" \/><\/a> A new student-designed mural is being painted on the wall of the Student Activities Center. A rough sketch has been drawn and students have started painting a scene from a Spirit Week rally. Art teacher Kate McKenzie says she believes that this mural will help the community grow and heal from the recent string of suicides. \"There was this call for this kind of mural to be painted,\" McKenzie said. \"People all over campus were asking for art.\" Photo: Julia Qiao.[\/caption]\r\n\r\nStudents in the Advanced Drawing and Painting class are painting a mural on the wall of the Student Activities Center at Palo Alto High School after a James Franco mural was <a href=\"http:\/\/palyvoice.com\/2016\/02\/11\/admin-removes-james-franco-mural-from-student-center\/\">removed early this year<\/a>.\r\n\r\nAccording to art teacher Kate McKenzie, who is overseeing the student-designed project, the overarching theme of the new mural will be “We are Paly.\"\r\n\r\nThe mural will feature 10 different panels, nine of which will have their own theme. Each panel is designed to convey a different aspect of Paly, including “We are creative,” “We have spirit,” “We struggle” and “We learn.”\r\n\r\nArtists working on the mural hope that it will allow students to reflect on their own lives at Paly.\r\n\r\n“We [the students] wanted to create a mural that embodies the entire spirit of Paly,” says junior Grace Zhao, who d<span class=\"_5yl5\">esigned the Spirit Week scene in the bottom left corner<\/span>. “The mural does not just depict the happy aspects of Paly, but everything about it. We wanted to have an accurate depiction of the student life at Paly.”\r\n\r\nMcKenzie echoes these sentiments, stating that this mural's primary purpose is to bring something different to the community.\r\n\r\n“We have had a really tough last couple of years, emotionally, and people from outside have wanted to come on campus to do art,” McKenzie said. “It felt like it was a really good time now to have students do art. It is like there is this call throughout the campus for art that was healing and uplifting and reflective of our lives.”\r\n\r\nAccording to McKenzie, the current plan is to have at least half the mural completed by the end of this school year.\r\n\r\nZhao says that the artists are in no rush to complete the mural, as the painting is still a learning process. Painters will work in groups that rotate on different days, thereby allowing participants to work on the mural and still cover class material.\r\n\r\nMcKenzie hopes that this mural will spark a conversation about art on campus.\r\n\r\n“The reason why we are doing this is because the James Franco mural made people talk about art on campus,\" McKenzie said. \"One of the things that the art department is trying to do is to get more artistic experiences, whether it’s art or music out on campus.\"\r\n\r\nAdministrators also want this mural to exhibit the works of Paly's art community.\r\n\r\n\"I think that the mural will display the talented artists that go to school here,\" Assistant Principal of Operations Jerry Berkson said. \"We really just want to show off our talented artists.\"\r\n\r\nArtists are excited to be working on the mural, as they believe they are adding their piece to the Paly legacy.\r\n\r\n“I think that being able to paint the mural is really cool because it is a student-designed and created mural,” Zhao said. “I feel like it is something that was worth doing, and worth committing time to, as I am helping my school.”","excerpt":"Students in the Advanced Drawing and Painting class are painting a mural on the wall of the Student Activities Center at Palo Alto High School after a James Franco mural was removed early this year.","date":"2016-04-15 16:04:15","author":"Julia Qiao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_0313.jpg","categories":["News","Spotlight"],"tags":["Advanced Drawing and Painting Class","art","grace zhao","james franco","jerry berkson","Kate McKenzie","mural","Student Activities Center"]},{"id":119019,"title":"Liveblog: Baseball faces off against Los Gatos","permalink":"http:\/\/palyvoice.com\/2016\/04\/15\/liveblog-baseball-faces-off-against-los-gatos\/","content":"Check back in at 4p.m. as the Palo Alto High School baseball team (13-2-1, 8-1) looks to maintain their first place position against the Los Gatos High School Wildcats (11-8, 7-1) at 4 p.m. Friday at home. The Vikings defeated the Wildcats, 4-0, thanks to a strong pitching performance by senior Justin Hull on Wednesday. Los Gatos currently sits second behind Palo Alto in the De Anza League standings.\r\n\r\n[liveblog]","excerpt":"The Palo Alto High School boys baseball team (13-2-1, 8-1) looks to maintain the team's first place position against the Los Gatos High School Eagles (11-8, 7-1) at 4 p.m. Friday at home. The Vikings defeated the Eagles, 4-0, thanks to a strong pitching performance by senior Justin Hull on Wednesday.","date":"2016-04-15 11:00:10","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/rain-rain-rain21.jpg","categories":["Uncategorized"],"tags":["Baseball","eagles","los gatos","palo alto","vikings"]},{"id":119034,"title":"Band to perform Pops Concert","permalink":"http:\/\/palyvoice.com\/2016\/04\/14\/band-to-perform-pops-concert\/","content":"[caption id=\"attachment_72720\" align=\"aligncenter\" width=\"573\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/IMG_9970.jpg\"><img class=\" wp-image-72720\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/IMG_9970.jpg\" alt=\"Paly's Symphonic and Concert bands performed during the dinner. Photo by Lizzie Chun.\" width=\"573\" height=\"382\" \/><\/a> Paly's Symphonic and Concert bands perform during the back to school dinner last year. Photo by Lizzie Chun.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Palo Alto High School’s symphonic and concert band is performing a Pop Concert in the Haymarket Theater tonight at 7 p.m.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The concert will feature an assortment of lively songs true to the pop genre, including the symphonic band's medley's for Aladdin and Overture to the Opera Orpheus. The concert band will perform soul music medleys as well.<\/span>\r\n\r\nThe music picked out for the performance has special meaning to the band, according to band member junior Celia Willner.\r\n\r\n<span style=\"font-weight: 400;\">“Aladdin is really fun [to play] because on our New York trip this year, we saw Aladdin on Broadway,” Willner said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Even though the symphonic band is performing separately from the concert band, there will be a collaboration at the end of the concert for a surprise combined performance, according to Willner.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Paly’s band has been preparing for this concert since the middle of March. Practicing was quicker and easier than normal because of the previous preparation for the New York trip, Willner said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I am so happy with the results of the month of work,” Willner said.  “It really is amazing because Orpheus is kind of a difficult piece to put together.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The band has one more concert this school year in May, as well as the California Music Education Association Festival and the May Fete parade.  The pop concert might be the last concert performed in the Haymarket theater by the band since they are expecting to be moved into the new performing arts theater by then, according to Willner.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Paly's band is excited to be able to perform pop music in a concert. <\/span>\r\n\r\n\"We are all having fun with this music,\" Willner said.","excerpt":"Palo Alto High School’s band is performing a pop concert in the Haymarket Theater tonight at 7 p.m.","date":"2016-04-14 18:22:16","author":"Morgan Keller","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/IMG_9970.jpg","categories":["News","Spotlight"],"tags":["band","concert","haymarket theater","paly","pop"]}]