[{"id":119311,"title":"&#8220;Taste of Unity&#8221; event to take place at 6:30 p.m. on Thursday, April 21 in the MAC","permalink":"http:\/\/palyvoice.com\/2016\/04\/17\/taste-of-unity-event-to-take-place-at-630-p-m-on-thursday-april-21-in-the-mac\/","content":"","excerpt":"","date":"2016-04-17 19:06:01","author":"Chirag Akella","categories":["Ticker"],"tags":[]},{"id":119122,"title":"Change In Our Schools Week: Cultivating a positive community","permalink":"http:\/\/palyvoice.com\/2016\/04\/17\/change-in-our-schools-week-cultivating-a-positive-community\/","content":"[caption id=\"attachment_119126\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/DSC_0551.jpeg\"><img class=\"size-full wp-image-119126\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/DSC_0551.jpeg\" alt=\"Senior ASB Treasurer Courtney Hall places a handprint onto the 'These Hands Don't Harm' poster set up in the Quad during lunch on Wednesday for Sexual Assault Awareness Day during Not In Our Schools Week 2015. This year, the focus will be on the positive aspects instead. Photo by Liana Pickrell.\" width=\"600\" height=\"399\" \/><\/a> Graduated Palo Alto High School Associated Student Body Treasurer Courtney Hull places a handprint onto a poster during Not In Our Schools Week 2015. This year, the focus will be on the positive aspects of the Paly community. Photo by Liana Pickrell.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">A group of Palo Alto High School students will debut<\/span><span style=\"font-weight: 400;\"> a week-long initiative <\/span><span style=\"font-weight: 400;\">to address different societal matters to foster a healthier community on Monday at Paly, according to student organizers.<\/span>\r\n\r\nSome students, including junior Anmol Nagar, came together on their own to work on the creation of Change In Our Schools Week to replace the annual Not In Our Schools Week.\r\n\r\n<span style=\"font-weight: 400;\">“Change In Our Schools Week is basically a spinoff of Not in Our Schools Week, which is a national campaign to address various societal issues that are prevalent in schools,” Nagar said. “We changed it a little bit this year in a more positive direction to closely examine ourselves and our identity and how we choose to treat others.”<\/span>\r\n\r\n[caption id=\"attachment_119124\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/13010114_1761646434067670_1104210384_o.jpg\"><img class=\"wp-image-119124\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/13010114_1761646434067670_1104210384_o.jpg\" alt=\"Change In Our Schools Week will debut on April 18 with different themes every day. The themes focus on the positives rather than dwelling on the negative aspects. Photo: Anmol Nagar.\" width=\"300\" height=\"450\" \/><\/a> Change In Our Schools Week will begin on Monday with different themes every day. The different days will feature activities, performances and food. The themes focus on how to improve rather than dwelling on the negative aspects. Photo: Anmol Nagar.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">According to junior Cezanne Lane, another student organizer, each day has a specified theme. Monday focuses on “Paly Is” to recognize who makes up Paly and embrace different communities. CIOS Week encourages students to ask themselves “Who Are We?” on Tuesday to learn about different cultural, sexual and gender identities, as well as students’ different abilities. Wednesday’s focus is “How Do We Treat Each Other?” to investigate and improve relationships regarding sexual assault, bullying and social justice. On Thursday, the recently formed Sources of Strength group will lead an activity under the theme of “What Are Our Sources of Strength?” The last day is themed “How Do I Care For Myself?” to encourage students to self-reflect and change the way they address others and see the world. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Teacher on Special Assignment Eric Bloom, who has been helping the students plan the week, said that the idea came about when discussing the NIOS Week's more negative outlook.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“There had been a discussion before about the negative connotations of 'not' as opposed to what to we want to see,” Bloom said. “The big thing was simply the idea that we wanted to celebrate or talk about what it is we want in our schools, not what it is that we don’t want.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">As well as agreeing with Bloom’s sentiments, Lane also pointed out the redundancy of NIOS Week over the years.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We’ve been doing the same bullying activity since elementary school,” Lane said. “Instead of ‘Don’t bully, don’t do this,’ it’s more, ‘Let’s get excited about caring for each other and caring for ourselves and being kind human beings and being proud of Paly.’”<\/span>","excerpt":"A group of Palo Alto High School students will debut a week-long initiative to address different societal matters to foster a healthier community on Monday at Paly, according to student organizers.","date":"2016-04-17 12:54:15","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/DSC_0551.jpeg","categories":["News","Spotlight"],"tags":["anmol nagar","Cezanne lane","Change In Our Schools Week","Community","eric bloom","NIOS Week","not in our schools week","positive","sources of strength"]},{"id":119220,"title":"Baseball falls to Los Gatos for second league loss","permalink":"http:\/\/palyvoice.com\/2016\/04\/17\/baseball-falls-to-los-gatos-for-second-league-loss\/","content":"[caption id=\"attachment_119282\" align=\"alignnone\" width=\"507\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/I9P85544.jpg\"><img src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/I9P85544.jpg\" alt=\"Senior Alec Olmsted throws a fastball to a Los Gatos batter during a De Anza League game on Friday at home. Olmstead pitched four innings and gave up three earned runs. Photo by Cooper Lou.\" width=\"507\" height=\"510\" class=\"size-full wp-image-119282\" \/><\/a> Senior Alec Olmsted throws a fastball to a Los Gatos batter during a De Anza League game on Friday at home. Olmstead pitched four innings and gave up three earned runs. Photo by Cooper Lou.[\/caption]\r\n\r\nThe Palo Alto High School baseball team (13-3-1, 8-2) suffered its second De Anza League loss, 7-4, to the Los Gatos High School Wildcats (13-8, 9-1) on Friday at home. \r\n\r\nThe Vikings defeated the Wildcats earlier in the week, 4-0, but were unable to best Los Gatos a second time.\r\n\r\nThe Wildcats jumped out to an early, 1-0, lead, but the Vikings came back with a run of their own in the bottom of the first. \r\n\r\nLos Gatos scored three runs over the next three innings and led Palo Alto until the bottom of the fourth inning when the Vikings mounted a three run rally.  The Vikings finally tied the game, 4-4, after a double from junior shortstop Ethan Stern which scored junior center fielder Ben Cleasby from second base.\r\n\r\nCleasby led the Vikings with three hits and two runs batted in. \r\n\r\nIn the sixth inning, the Wildcats were able to pound out two runs, putting the game out of reach for the Vikings. \r\n\r\nThe Vikings' starting pitcher, senior Alec Olmstead, said the Los Gatos pitchers did a great job of controlling the pace of the game, and the team is looking forward to facing the Wildcats again later  in the season.\r\n\r\n\"They [Los Gatos] didn't really mess around, they got their outs quick,\" Olmstead said. \"They are a great team and I'm excited to face them again.\"\r\n\r\nAccording to junior right fielder Angus Stayte, mental errors cost the Vikings the game.\r\n\r\n\"We made a lot of mental mistakes, myself included,\" Stayte said. \"But now we just have to stay focused and bounce back during our game on Monday.\"\r\n\r\n The Vikings have now dropped to second place behind the Wildcats in the De Anza League standings. \r\n\r\nThe Vikings will face Leland High School at 4 p.m. Monday at Leland High School.\r\n\r\n\r\n","excerpt":"The Palo Alto High School Vikings baseball team suffered it's second De Anza League loss to the Los Gatos High School Wildcats on Friday. ","date":"2016-04-17 12:08:35","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/I9P85544.jpg","categories":["Baseball","Sports","Uncategorized"],"tags":["Baseball","los gatos","Olmstead","palo alto","stayte","vikings","wildcats"]},{"id":119116,"title":"Liveblog: Girls&#8217; lacrosse vs. Gunn","permalink":"http:\/\/palyvoice.com\/2016\/04\/15\/liveblog-girls-lacrosse-vs-gunn\/","content":"Check back in beginning at 7 p.m. as the Palo Alto High School girls' lacrosse team (8-3, 7-0) looks to preserve it's undefeated Santa Clara Valley League record in a rivalry game against the Gunn Titans (4-6, 3-2) at the Paly lacrosse field.\r\n\r\n[liveblog] ","excerpt":"Check back in beginning at 7 p.m. as the Palo Alto High School girls' lacrosse team (8-3, 7-0) looks to preserve it's undefeated Santa Clara Valley League record in a rivalry game against the Gunn Titans (4-6, 3-2) at the Paly lacrosse field. ","date":"2016-04-15 17:53:24","author":"Josh Yuen","categories":["Sports"],"tags":["girls' lacrosse","liveblog","titan","viking"]},{"id":118921,"title":"Students to paint mural on Student Activities Center, replacing James Franco mural","permalink":"http:\/\/palyvoice.com\/2016\/04\/15\/students-to-paint-mural-on-student-activities-center-replacing-james-franco-mural\/","content":"[caption id=\"attachment_118981\" align=\"alignnone\" width=\"543\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_0313.jpg\"><img class=\"wp-image-118981\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_0313.jpg\" alt=\"IMG_0313\" width=\"543\" height=\"407\" \/><\/a> A new student-designed mural is being painted on the wall of the Student Activities Center. A rough sketch has been drawn and students have started painting a scene from a Spirit Week rally. Art teacher Kate McKenzie says she believes that this mural will help the community grow and heal from the recent string of suicides. \"There was this call for this kind of mural to be painted,\" McKenzie said. \"People all over campus were asking for art.\" Photo: Julia Qiao.[\/caption]\r\n\r\nStudents in the Advanced Drawing and Painting class are painting a mural on the wall of the Student Activities Center at Palo Alto High School after a James Franco mural was <a href=\"http:\/\/palyvoice.com\/2016\/02\/11\/admin-removes-james-franco-mural-from-student-center\/\">removed early this year<\/a>.\r\n\r\nAccording to art teacher Kate McKenzie, who is overseeing the student-designed project, the overarching theme of the new mural will be “We are Paly.\"\r\n\r\nThe mural will feature 10 different panels, nine of which will have their own theme. Each panel is designed to convey a different aspect of Paly, including “We are creative,” “We have spirit,” “We struggle” and “We learn.”\r\n\r\nArtists working on the mural hope that it will allow students to reflect on their own lives at Paly.\r\n\r\n“We [the students] wanted to create a mural that embodies the entire spirit of Paly,” says junior Grace Zhao, who d<span class=\"_5yl5\">esigned the Spirit Week scene in the bottom left corner<\/span>. “The mural does not just depict the happy aspects of Paly, but everything about it. We wanted to have an accurate depiction of the student life at Paly.”\r\n\r\nMcKenzie echoes these sentiments, stating that this mural's primary purpose is to bring something different to the community.\r\n\r\n“We have had a really tough last couple of years, emotionally, and people from outside have wanted to come on campus to do art,” McKenzie said. “It felt like it was a really good time now to have students do art. It is like there is this call throughout the campus for art that was healing and uplifting and reflective of our lives.”\r\n\r\nAccording to McKenzie, the current plan is to have at least half the mural completed by the end of this school year.\r\n\r\nZhao says that the artists are in no rush to complete the mural, as the painting is still a learning process. Painters will work in groups that rotate on different days, thereby allowing participants to work on the mural and still cover class material.\r\n\r\nMcKenzie hopes that this mural will spark a conversation about art on campus.\r\n\r\n“The reason why we are doing this is because the James Franco mural made people talk about art on campus,\" McKenzie said. \"One of the things that the art department is trying to do is to get more artistic experiences, whether it’s art or music out on campus.\"\r\n\r\nAdministrators also want this mural to exhibit the works of Paly's art community.\r\n\r\n\"I think that the mural will display the talented artists that go to school here,\" Assistant Principal of Operations Jerry Berkson said. \"We really just want to show off our talented artists.\"\r\n\r\nArtists are excited to be working on the mural, as they believe they are adding their piece to the Paly legacy.\r\n\r\n“I think that being able to paint the mural is really cool because it is a student-designed and created mural,” Zhao said. “I feel like it is something that was worth doing, and worth committing time to, as I am helping my school.”","excerpt":"Students in the Advanced Drawing and Painting class are painting a mural on the wall of the Student Activities Center at Palo Alto High School after a James Franco mural was removed early this year.","date":"2016-04-15 16:04:15","author":"Julia Qiao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_0313.jpg","categories":["News","Spotlight"],"tags":["Advanced Drawing and Painting Class","art","grace zhao","james franco","jerry berkson","Kate McKenzie","mural","Student Activities Center"]},{"id":119019,"title":"Liveblog: Baseball faces off against Los Gatos","permalink":"http:\/\/palyvoice.com\/2016\/04\/15\/liveblog-baseball-faces-off-against-los-gatos\/","content":"Check back in at 4p.m. as the Palo Alto High School baseball team (13-2-1, 8-1) looks to maintain their first place position against the Los Gatos High School Wildcats (11-8, 7-1) at 4 p.m. Friday at home. The Vikings defeated the Wildcats, 4-0, thanks to a strong pitching performance by senior Justin Hull on Wednesday. Los Gatos currently sits second behind Palo Alto in the De Anza League standings.\r\n\r\n[liveblog]","excerpt":"The Palo Alto High School boys baseball team (13-2-1, 8-1) looks to maintain the team's first place position against the Los Gatos High School Eagles (11-8, 7-1) at 4 p.m. Friday at home. The Vikings defeated the Eagles, 4-0, thanks to a strong pitching performance by senior Justin Hull on Wednesday.","date":"2016-04-15 11:00:10","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/rain-rain-rain21.jpg","categories":["Uncategorized"],"tags":["Baseball","eagles","los gatos","palo alto","vikings"]},{"id":119034,"title":"Band to perform Pops Concert","permalink":"http:\/\/palyvoice.com\/2016\/04\/14\/band-to-perform-pops-concert\/","content":"[caption id=\"attachment_72720\" align=\"aligncenter\" width=\"573\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/IMG_9970.jpg\"><img class=\" wp-image-72720\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/IMG_9970.jpg\" alt=\"Paly's Symphonic and Concert bands performed during the dinner. Photo by Lizzie Chun.\" width=\"573\" height=\"382\" \/><\/a> Paly's Symphonic and Concert bands perform during the back to school dinner last year. Photo by Lizzie Chun.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Palo Alto High School’s symphonic and concert band is performing a Pop Concert in the Haymarket Theater tonight at 7 p.m.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The concert will feature an assortment of lively songs true to the pop genre, including the symphonic band's medley's for Aladdin and Overture to the Opera Orpheus. The concert band will perform soul music medleys as well.<\/span>\r\n\r\nThe music picked out for the performance has special meaning to the band, according to band member junior Celia Willner.\r\n\r\n<span style=\"font-weight: 400;\">“Aladdin is really fun [to play] because on our New York trip this year, we saw Aladdin on Broadway,” Willner said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Even though the symphonic band is performing separately from the concert band, there will be a collaboration at the end of the concert for a surprise combined performance, according to Willner.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Paly’s band has been preparing for this concert since the middle of March. Practicing was quicker and easier than normal because of the previous preparation for the New York trip, Willner said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I am so happy with the results of the month of work,” Willner said.  “It really is amazing because Orpheus is kind of a difficult piece to put together.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The band has one more concert this school year in May, as well as the California Music Education Association Festival and the May Fete parade.  The pop concert might be the last concert performed in the Haymarket theater by the band since they are expecting to be moved into the new performing arts theater by then, according to Willner.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Paly's band is excited to be able to perform pop music in a concert. <\/span>\r\n\r\n\"We are all having fun with this music,\" Willner said.","excerpt":"Palo Alto High School’s band is performing a pop concert in the Haymarket Theater tonight at 7 p.m.","date":"2016-04-14 18:22:16","author":"Morgan Keller","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/IMG_9970.jpg","categories":["News","Spotlight"],"tags":["band","concert","haymarket theater","paly","pop"]},{"id":118886,"title":"Preview: Girls&#8217; lacrosse to face rival Gunn","permalink":"http:\/\/palyvoice.com\/2016\/04\/14\/preview-girls-lacrosse-to-face-rival-gunn\/","content":"The Palo Alto High School girls' lacrosse team (8-3, 7-0) will take on rival Gunn High School (4-6, 3-2) at 7 p.m. on Friday at the Paly lacrosse field, hoping to defeat the Titans for the second time this season.\r\n\r\nThe Vikings are currently undefeated in the Santa Clara Valley Athletic League and hope to maintain their seven-game winning streak on Friday. Senior goalkeeper Meredith Kinnaman attributes the team's recent success to talented newcomers.\r\n\r\n\"We have a lot of young talent this season, which has contributed to us doing so well in the season so far,\" Kinnaman said.\r\n\r\nThe Vikings head into Friday's matchup fresh off of a 16-6 victory against league opponent Saratoga High School (5-4, 2-3) on Wednesday. According to senior midfielder Maya Benatar, the upcoming game with the Titans will be a challenge, but Wednesday's victory provided the team with momentum.\r\n\r\n\"Last time we played [Gunn] we were losing 6-1 at the half and came through with an 8-7 win,\" Benatar said. \"I think we are going into Friday with our main goal being to maintain the momentum and energy we gained during Wednesday's game against Saratoga.\"\r\n\r\nThe Titans, who have struggled to a 4-6 overall record on the season, lost on their home turf to the Vikings, 8-7, in a close match on March 23.\r\n\r\nAccording to Titan senior attacker Yui Sasajima, the rivalry between the two schools has been a motivational boost for her team.\r\n\r\n\"I think we're pretty lucky to be each other's rivals,\" Sasajima said. \"In the past, our scores have always been pretty close, so I think both schools motivate each other to work hard for this game.\"\r\n\r\nDespite the last match between the two teams resulting in a victory for Vikings, Kinnaman still feels the team can improve its level of play against its crosstown rivals.\r\n\r\n\"Although we ended up winning the game, one thing that we need to work on is starting the game off strong and really setting ourselves up to have a good game,\" Kinnaman said.\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School girls' lacrosse team (8-3, 7-0) will take on rival Gunn High School (4-6, 3-2) at 7 p.m. this Friday at the Paly lacrosse field, hoping to defeat the Titans for the second time this season.","date":"2016-04-14 17:54:46","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/03\/mce_030213_0193.jpg","categories":["Sports","Spotlight"],"tags":["gunn","Lacrosse","maya benatar","meredith kinnaman","paly","rivalry","yui sasajima"]},{"id":119093,"title":"Elevator malfunctions, trapping students inside","permalink":"http:\/\/palyvoice.com\/2016\/04\/14\/elevator-malfunctions-trapping-students-inside\/","content":"Three students were trapped in the elevator of Palo Alto High School’s 800 building at brunch today after an unexplained malfunction.\r\n\r\n<span style=\"font-weight: 400;\">According to sophomore Rebecca Yao, one of the students who was in the elevator, she and her friends entered the elevator at the end of brunch and discovered that the buttons weren’t working.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I tore ligaments [in my knee] so I’ve been scootering around and using the elevator to get to class,” Yao said. “Me and two other friends realized that we weren’t moving up and initially thought that maybe we didn't press the button. And then we realized that the second floor button wasn't working. We tried to open the door and get out but the door shuttered and then wouldn't open.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Despite the potentially frightening situation, Yao and her friends stayed calm. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It was actually kind of funny,” Yao said. “When we first went in one of my friends was like ‘Wouldn’t it be funny if we got stuck in here’ and then we got stuck.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Yao, other students heard her friends and her in the elevator and called for help.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Luckily, another one of my classmates also needs the elevator to get up the stairs,” Yao said. “He and his friends were outside and they were able to hear us and go get help.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Assistant Principal Jerry Berkson was one of the first people alerted about the situation.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I was happy to hear that there wasn’t a student in there that was claustrophobic,” Berkson said. “I was also happy that we could take care of it right and the girls inside were good sports about it. They sounded calm the whole time, that was the key.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Berkson, the elevator door opened after it was turned off.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We first turned off the power and opened the outer door,” Berkson said. “After we hit the big switch, we were able to open the front door.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Yao says she believes the administration handled the situation well. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Administration had someone talking to us through us the door and telling us to be patient and that  getting more people to come help,” Yao said. “They weren't sure how long it would be so we ate snacks and did homework. We were in there for around 20 - 25 minutes.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Administration is looking to repair the elevator, according to Berkson. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The repair guy is coming to see why the elevator stopped working,” Berkson said. “First we have to find out why it happened then move on from there. The elevator will be off until the repair guys comes to check it out.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">This wasn’t the first incident of the elevator malfunctioning, according to Yao. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“A couple weeks ago it [the elevator] broke,” Yao said. “But I was outside so somebody carried my scooter and I hopped up. That’s what I ended up doing today after I got out of the elevator.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Berkson, if students find themselves trapped in a broken elevator they should remain calm and seek help. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“If something like that does ever happen again, admin will know what to do,” Berkson said. “There is also a phone in the elevator that you can use to call someone from.”  <\/span>","excerpt":"Three students were trapped in the elevator of Palo Alto High School’s 800 building at brunch today after an unexplained malfunction.","date":"2016-04-14 17:20:30","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/photo-18.jpg","categories":["Editor's Pick","News","Spotlight"],"tags":["Berkson","broken","elevator","fixed","high school","palo alto","paly","trapped"]},{"id":118895,"title":"Track and Field struggles to keep up with Los Gatos","permalink":"http:\/\/palyvoice.com\/2016\/04\/14\/track-and-field-struggles-to-keep-up-with-los-gatos\/","content":"[caption id=\"attachment_119084\" align=\"alignnone\" width=\"613\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/I9P81991.jpg\"><img class=\"size-full wp-image-119084\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/I9P81991.jpg\" alt=\"Palo Alto High School senior Kelly Branson competes in the 100-meter race at the Paly vs. Los Gatos track and field meet. Both the boys and the girls team fell to the Wildcats on Tuesday at home. Photo by Cooper Lou.\" width=\"613\" height=\"369\" \/><\/a> Palo Alto High School senior Kelly Branson competes in the 100-meter race at the Paly vs. Los Gatos track and field meet. Both the boys and the girls team fell to the Wildcats on Tuesday at home. Photo by Cooper Lou.[\/caption]\r\n\r\nThe Palo Alto High School track and field team hopes to improve after suffering a tough loss to Los Gatos High School  on Tuesday at home.\r\n\r\nDespite the Viking boys' team placing first in eight out of 15 events, Los Gatos  gained more points overall by winning just seven events but placing  second and third more often than Paly.\r\n\r\nThe Viking girls' team fared even worse, winning only two out of 15 events.\r\n\r\nTrack standouts senior Eli Givens and junior Kent Slaney set new personal records. Givens ran the 100-meter race with a time of 10.87 seconds and Slaney ran the 800-meter race with a time of 1.57.72 minutes.\r\n\r\nAccording to sophomore Reed Foster, the team was unable to capitalize on specific events.\r\n\r\n\"We lost a lot of points on several of the races,\" Foster said. \"That made it really hard to come back in the end. With the two-mile we really needed to sweep that and we were only able to get first and third.\"\r\n\r\nFoster said that Los Gatos is one of the toughest teams that Paly will face during the season.\r\n\r\n\"In dual meets they [Los Gatos] will be the toughest one,\" Foster said. \"I don't think that Gunn will be as hard.\"\r\n\r\nPaly's next meet is against Gunn High School, at 3:15 p.m. on Tuesday at Gunn.\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School track and field team hopes to improve after suffering a tough loss to the Los Gatos High School  on Tuesday at home.","date":"2016-04-14 15:24:51","author":"Jackson Doerr","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/I9P8199.jpg","categories":["Sports","Sports Recap","Track and Field"],"tags":["2016","eli givens","kent slaney","los gatos","paly","track and field"]}]