[{"id":115733,"title":"New clubs debut at Club Day Two","permalink":"http:\/\/palyvoice.com\/2016\/02\/04\/new-clubs-debut-at-club-day-two\/","content":"<span style=\"font-weight: 400;\">Palo Alto High School Associated Student Body will host its second Club Day of the school year at lunch tomorrow on the Quad.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The event provides an opportunity for new clubs to gain publicity, and gives a chance for both new and old clubs to recruit members.<\/span>\r\n\r\n<span class=\"_5yl5\">\"Club Day [Two] is a really great way for people to join clubs that weren't originally chartered first semester,\" ASB Vice President Anmol Nagar said. \"Clubs from first semester are also able to advertise their club.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Nagar, unlike Club Day One, this Club Day will run on a regular B schedule and will feature a smaller number of clubs.<\/span>\r\n\r\nThis semester, ASB added nine new clubs: Neuroscience Club, Tapout Club, Beat Club, Polynesian Club, Curling Club, Science Research Club, Unity Club, Disney Club and PALY Teams Club. D<span style=\"font-weight: 400;\">uring the fall of 2015, there were a total of 75 clubs on campus, according to the Paly ASB <a href=\"https:\/\/sites.google.com\/site\/pahsasb\/clubs\">website<\/a>.\r\n<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Paly Voice spoke with five club founders to learn more about their clubs.<\/span>\r\n\r\n<iframe style=\"overflow-y: hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/10782689-club-day-2\" width=\"620\" height=\"3488\" frameborder=\"0\" scrolling=\"no\"><\/iframe>","excerpt":"The Associated Student Body will host its second Club Day of the school year at lunch tomorrow on the Quad.","date":"2016-02-04 22:09:56","author":"Annika Behal","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/0000\/00\/DSC_0226_0.jpg","categories":["News"],"tags":["ASB","Beat Club","club day","clubs","Curling Club","Disney Club","lunch","nagar","Neuroscience Club","Paly TEAM Club","Polynesian Club","quad","Science Research Club","Tapout Club","unity club"]},{"id":115628,"title":"Stanford Blood Center in urgent need of donations","permalink":"http:\/\/palyvoice.com\/2016\/02\/04\/stanford-blood-center-in-urgent-need-of-donations\/","content":"Stanford Blood Center is encouraging Palo Alto High School students who are 16 years or older to donate their blood to prepare for the unexpected, as an influx of visitors is coming to the Bay Area for the Super Bowl on Sunday in Santa Clara.\r\n\r\n<span style=\"font-weight: 400;\">With Super Bowl 50 just around the corner, an estimated <a href=\"http:\/\/ww2.kqed.org\/news\/2016\/01\/22\/how-to-get-around-the-bay-area-during-super-bowl-50\">one million people<\/a> are <a href=\"http:\/\/palyvoice.com\/2016\/02\/02\/school-gears-up-for-super-bowl-traffic\/\">expected to visit the Bay Area<\/a>, according to KQED News. To prepare for any mass casualties that could occur as a result of the Super Bowl, Stanford Health Care — one of the two level one trauma centers in the Santa Clara County — hopes to keep its blood inventory at 20 percent above its usual stock, according to Loren Magana, head of public affairs and communications at Stanford Blood Center, where Stanford Health Care's blood supply comes from.<\/span>\r\n\r\n[caption id=\"attachment_115653\" align=\"alignright\" width=\"329\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/hv3-1.jpg\"><img class=\" wp-image-115653\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/hv3-1.jpg\" alt=\"The Stanford Blood Center donation facility, equipped with cozy chairs and DVD players. Courtesy of Stanford Blood Center.\" width=\"329\" height=\"247\" \/><\/a> The Stanford Blood Center is in critical need of blood donations due to the upcoming Super Bowl. The blood center is equipped with cozy chairs and DVD players. Photo: Stanford Blood Center.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The blood center is in critical need of donations as it is currently short on blood inventory. According to Magana, the b<\/span>lood center often experiences a shortage in donations during the winter season because many regular donors are sick with colds or the flu. In addition, recent medical procedures have used up a significant amount of blood, making the blood center's shortage even worse. Magana explains that while the blood center is in dire need of -AB, -B and -O blood donations, all blood types are needed and welcomed.\r\n\r\n<span style=\"font-weight: 400;\">As it takes up to three days after donation to get blood ready for transfusion, it is imperative that people donate their blood soon in order for it to be ready in time for the Super Bowl, according to Magana.<\/span>\r\n\r\nJunior Sophie Pedersen encourages all eligible Paly students to donate their blood.\r\n\r\n\"The reason I want to donate blood is that it just seems like an easy way to help people and I think I have the blood type the donation center is looking for,\" Pedersen said. \"I would encourage anybody who has the time to do it because [the blood center] is experiencing a blood shortage.\"\r\n\r\n<span style=\"font-weight: 400;\">According to Magana, donations take approximately one hour, and students who wish to donate must be at least 16 years old with parental consent or 17 years old or older without parental consent. Donors must also be in good health, eat well and drink plenty of fluids before donating their blood. For more information regarding donor eligibility, visit this <a href=\"http:\/\/bloodcenter.stanford.edu\/donate\/EligibilityMedHisDeferral.html\">web page<\/a>. <\/span><span style=\"font-weight: 400;\">The blood center also asks that eligible students bring legal photo identification to the donation center, and if only 16 years old, either bring this <a href=\"http:\/\/bloodcenter.stanford.edu\/donate\/PDFs\/05-F%20X1%20Form%20Consent%20for%20Minor%20to%20Donate%20updated%20061815.pdf\">form<\/a> or have their parents accompany them. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">To schedule an appointment, students can call the blood center at <\/span><span style=\"font-weight: 400;\">888-723-7831, or visit its <a href=\"https:\/\/www.sbcdonor.org\/index.cfm?group=op&amp;expand=15371&amp;zc=94304\">website<\/a>. Donations can be made at the donor center, which is open on weekdays from 7 a.m. to 7:15 p.m. and located at <\/span><span style=\"font-weight: 400;\">3373 Hillview Ave.<\/span>","excerpt":"Stanford Blood Center is encouraging Palo Alto High School students who are 16 years or older to donate their blood to prepare for the unexpected, as an influx of visitors is coming to the Bay Area for the Super Bowl on Sunday in Santa Clara.","date":"2016-02-04 11:53:41","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/hv3-1.jpg","categories":["News"],"tags":["Blood","blood center","stanford"]},{"id":115584,"title":"Boys&#8217; soccer remains undefeated, rocks De Anza League","permalink":"http:\/\/palyvoice.com\/2016\/02\/04\/boys-soccer-remains-undefeated-rocks-de-anza-league\/","content":"[caption id=\"attachment_115585\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_80871.jpg\"><img class=\"size-full wp-image-115585\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_80871.jpg\" alt=\"Junior center defender Neil Verwillow passes the ball upline. The Vikings continue undefeated in their season in league and overall. Photo by Emma van der Veen.\" width=\"600\" height=\"400\" \/><\/a> Junior center defender Neil Verwillow passes the ball upline. The Vikings continue their undefeated season (12-0-4, 7-0-2) in the De Anza League and overall. Photo by Emma van der Veen.[\/caption]\r\n\r\nThe Palo Alto High School boys’ soccer team (12-0-3, 7-0-2) continues undefeated in its De Anza League season and leads its league division with 23 points, over second place Homestead High School (8-2-7, 4-1-4) with 16 points.\r\n\r\nPaly currently has 42 goals for and nine goals scored against them in its season. Leading the second place team, Homestead, in league by seven points has given the team a high guarantee of winning the league, a clear goal for the team. According to head coach Don Briggs, Paly has not won two consecutive league contests, so a league win to follow last year’s success would be monumental for the team.\r\n\r\n“In at least the last seven years, we haven’t won two consecutive league contests,” Briggs said. “It’s hard to win league here. It’s hard to even just stay up in the De Anza League sometimes, as it’s very competitive. That would be huge.”\r\n\r\nAccording to <a href=\"http:\/\/www.maxpreps.com\/high-schools\/palo-alto-vikings-(palo-alto,ca)\/soccer-winter\/home.htm\">maxpreps.com<\/a>, the Vikings are currently ranked 18th in the state and 61st in the nation.\r\n\r\nThe Vikings have had great potential since the beginning of the season, but learning to work cohesively as the season progressed has contributed to their success, according to senior captain and goalkeeper Eli Friedlander.\r\n\r\n“On some level, I thought that we would be good, but I didn’t know that we would be this good,” Friedlander said. “At the beginning of the year, we started off a little shaky, but in league we’ve really proved that we can play together pretty well and that we deserve the success we’ve been having.”\r\n\r\nAccording to Briggs, the team needs to work on staying focused during games and communicating on defense, as that has been a significant contributor to getting scored on in recent games.\r\n\r\n“We need to tighten up our defense,” Briggs said. “We’ve had two [recent] games where we’ve made mistakes in the defense. That [two goals from Los Gatos High School and Homestead each] is four goals in the last two games, and we’ve given up six goals in the whole [league] season. That’s an issue. That’s not a trend we want, and a lot of that [comes from] a lack of focus.”\r\n\r\nWinning league this year would favor the Vikings in seeding for the Central Coast Section playoffs, which would allow them to face less difficult competition early on, according to junior captain and center defender Neil Verwillow.\r\n\r\n“It’s great as far as CCS seeding goes, as that would pretty much guarantee us a top three spot and would give us an easier run in CCS,” Verwillow said. “Last year, I know that they had a tough run in CCS as they played Bellarmine [College Preparatory] pretty early on and Bellarmine is tough competition, but I think this year will be better.”\r\n\r\nPaly will face off Mountain View High School (7-4-5, 3-3-2) at 3:30 p.m. Friday at Mountain View.","excerpt":"The Palo Alto High School boys’ soccer team (12-0-3, 7-0-2) continues to remain undefeated in its De Anza League season and leads its league division with 21 points, over second place Homestead High School (7-2-7, 3-1-4) with 13 points.","date":"2016-02-04 10:40:38","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_80871.jpg","categories":["Sports","Spotlight"],"tags":["Bellarmine","boys soccer","don briggs","eli friedlander","gunn titans","homestead high school","los gatos high school","neil verwillow","palo alto high school","Soccer","sports"]},{"id":115677,"title":"ASB announces joint Gunn-Paly dance details","permalink":"http:\/\/palyvoice.com\/2016\/02\/03\/asb-announces-joint-gunn-paly-dance-details\/","content":"<span style=\"font-weight: 400;\">The Palo Alto and Gunn high school student governments released more information about the combined Gunn-Paly dance on Feb. 26 at the Mitchell Park Community Center in a <a href=\"https:\/\/youtu.be\/V4bEf3TQLuI\">promotional video<\/a>.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The dance’s official theme is “Highlight of the Night,” and students should dress casually in all-white with elements of neon, said organizers, who will also provide body paint to color clothing.\r\n<\/span>\r\n\r\nAccording to Paly junior Social Commissioner Maryland Valdez-Gonzalez, student officers hope to bolster unity between the schools.\r\n\r\n<span style=\"font-weight: 400;\">“Both the Paly and Gunn student bodies decided to create and combine a dance ... for the purpose of creating a stronger bond between both high schools in the Palo Alto community,” Valdez-Gonzalez said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Paly's Associated Student Body and Gunn's Student Executive Council first began developing combined dance plans in November and December, according to Gunn Dance Commissioner Radhika Ranganathan. Ranganathan says that they originally focused on <\/span><span style=\"font-weight: 400;\">improving community relations and familiarizing themselves with the Paly ASB.<\/span>\r\n\r\nBeyond the joint school aspect, this dance will also be unique to students as it will have a greater number of activities, such as air hockey, football and pool, and food, including catered desserts.\r\n<div class=\"conversation\">\r\n<div data-reactroot=\"\">\r\n<div class=\"_4tdt\">\r\n<div class=\"_4tdv\">\r\n<div class=\"_5wd4 _1nc7 direction_ltr\">\r\n<div class=\"_3ry4\">\r\n\r\n <span style=\"font-weight: 400;\">“<\/span><span style=\"font-weight: 400;\">We're hoping to reach a wider audience,\" Ranganathan said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">In addition, the dance’s location provides a different dynamic compared to past dances, according to junior Oracle-SEC Liaison Shannon Yang. <\/span><span style=\"font-weight: 400;\">In the past, students from both schools have complained about the DJs and music choices at dances. According to Ranganathan, the organizers have hired a completely new DJ to help solve the problem.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">In addition, some Paly students say the dance may be awkward at first due to prominent differences between traditional Gunn and Paly dances. <\/span><span style=\"font-weight: 400;\">However, any tensions between students will dissolve within a few minutes, according to Paly sophomore Marissa Ludwig.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“If it [the dance] is awkward, it will only be at first, because once everyone starts dancing no one will care,\" Ludwig said. \"Overall, I don't think it will be awkward, many people have friends between the schools.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Tickets are $10 without an ASB card or $5 with one and can be <a href=\"https:\/\/palywebstore.myschoolcentral.com\/asbworks\/(S(oivacebacoixzieenw420yb4))\/WebStore.aspx?org=6028\">purchased online<\/a>. Supplies are limited and door sales may be eliminated if pre-sale meet event site capacity. <\/span>\r\n\r\n\r\n\r\n\r\n\r\n\r\n","excerpt":"The Palo Alto High School and Gunn High School Associated Student Bodies will host a combined Gunn-Paly dance on Feb. 26 at the Mitchell Park Community Center.","date":"2016-02-03 20:12:10","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/library.jpg","categories":["News"],"tags":["Alto","ASB","center","Community","dance","DJ","Food","gunn","High","kevin sharp","mitchell","Palo","paly","park","School"]},{"id":115571,"title":"ASB to host International Lunch","permalink":"http:\/\/palyvoice.com\/2016\/02\/03\/asb-to-host-international-lunch\/","content":"[caption id=\"attachment_115611\" align=\"alignnone\" width=\"613\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/thumb_IMG_9010_10241.jpg\"><img class=\"wp-image-115611\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/thumb_IMG_9010_10241.jpg\" alt=\"\" width=\"613\" height=\"460\" \/><\/a> Members of The K-Pop Dance Club practice their routine for tomorrow's International Lunch. \"These sorts of events help promote diversity and show all the different cultures that make up Paly,\" sophomore K-Pop Dance Club president Vivian Nguyen said. Photo by Julia Qiao.[\/caption]\r\n\r\nThe Palo Alto High School Associated Student Body will hold an International Lunch tomorrow on the Quad, featuring foods and performances representing cultures from around the world, according to ASB Vice President Anmol Nagar.\r\n\r\nBoth Paly clubs and professionals will be participating in the dances and activities, Nagar said.\r\n\r\n“Students can expect to watch dance performances, as well as participate in activities lead by clubs on the Quad,” Nagar said. “ASB organized this event to give clubs the opportunity to be more involved on Paly campus. It's also to celebrate the multitude of amazing cultures that we have at Paly.”\r\n\r\nClubs that will be performing include K-Pop Dance Club, which will be performing a dance routine and the American Sign Language Club, which will be signing a song.\r\n\r\n“The ASL club will be signing the song 'What a Wonderful World',\" senior ASL club president Zoe Lung said. “Although it might be a little strange that the ASL club is participating in the International Day ... the idea of International Day is to expose Paly students to different cultures and languages. ASL embodies not only a way to communicate, but also bringing together the Deaf culture.”\r\n\r\nStudents can also purchase different foods from around the world provided by the Global Citizens Collaborative club. According to senior GCC Club president Mabel Furutsuki, for under $5, the club will be selling Japanese juice popsicles, Valentine’s day cookies, polvorones (shortbread) from the Philippines, Chinese almond cookies and Japanese veggie crackers.\r\n\r\nAside from performances and food, the Model United Nations Club will also be setting up a booth to teach students more information about the United Nations. According to senior MUN club president Eli Frankel, the club will also provide information  about the current European refugee crisis and what Paly students can do to help and how they can be involved.\r\n\r\n“These sorts of events help promote diversity and shows all the different cultures that make up Paly,” said Vivian Nguyen, sophomore K-Pop Dance Club president.","excerpt":"The Palo Alto High School Associated Student Body will hold an International Lunch tomorrow on the Quad, featuring foods and performances representing cultures from around the world, according to ASB Vice President Anmol Nagar.","date":"2016-02-03 19:50:46","author":"Julia Qiao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/thumb_IMG_9010_10241.jpg","categories":["News"],"tags":["anmol nagar","ASB","ASL Club","Furutsuki","Global Citizens Collaborative Club","International Lunch","K-Pop","lunch","Lung","model un club","paly"]},{"id":114483,"title":"Opinion: Low-flying planes are just the tip of the iceberg","permalink":"http:\/\/palyvoice.com\/2016\/02\/03\/opinion-low-flying-planes-are-just-the-tip-of-the-iceberg\/","content":"<span style=\"font-weight: 400;\">Airplanes continue to soar over Palo Alto in droves due to changes made by the Federal Aviation Association, despite many <a href=\"http:\/\/palyvoice.com\/2016\/01\/15\/residents-protest-airplane-noise-at-sky-posse-meeting\/\">residents' protests<\/a> to end the noise.<\/span><span style=\"font-weight: 400;\"> Through petitions, plane noise reports and emails to city officials, local group \"Sky Posse\" aims to reduce the number of planes overhead by redesigning the Bay Area’s airspace and collaborating with both the City of Palo Alto and the FAA.<\/span>\r\n\r\nSky Posse has outlined two major problems with by FAA's Next Generation Air Transportation System, a new arrangement that decreases wasted fuel and plane flight times while simultaneously increasing flights over urban areas. These issues are noise and environmental pollution. <span style=\"font-weight: 400;\">Sky Posse’s actions and intentions in both of these cases are superb, but analysis of Palo Alto's air quality has garnered mix results. And<\/span><span style=\"font-weight: 400;\"> while airplane noise can be annoying, Palo Alto should do more than reroute planes if we wish to limit sound pollution.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Sky Posse’s <a href=\"http:\/\/www.skypossepaloalto.org\/\">website<\/a>, airplanes flying over Palo Alto have increased nearly 200% since NextGen's implementation. To better understand the effects of these changes on the community, I spoke with Phil Martien, air quality engineering manager from the Bay Area Air Quality Management District. According to Martien, <\/span><span style=\"font-weight: 400;\">these flights do not have a large environmental impact on the Bay Area.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“<\/span><span style=\"font-weight: 400;\">Commercial aircrafts do contribute to the Bay Area's inventory of air pollution emissions for compounds that have direct health impacts, but compared to the region's total, they are not a major source,” Martien said. “Because the jet flights are above the immediate layer of air where people live and breathe, the direct impact of these flights and changes to flight paths won't have a big impact on air quality.”<\/span>\r\n\r\nIn addition, Martien says that the Bay Area’s air quality is good compared to other urban American cities, and is improving.\r\n\r\nOur air may not appear to be greatly affected by NextGen's redirected flights, but the City of Palo Alto should study the long-term effects of airborne transportation on the environment.\r\n\r\n\"I would say that even if the impact on air quality is not a 'big impact' ... it is still an impact  and I would like our air quality analyzed in the most up to date way possible,\" Sky Posse co-leader Rachel Kellerman said.\r\n\r\n[caption id=\"attachment_114501\" align=\"alignright\" width=\"403\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/air-traffic-control-baytracon-sfo.jpg\"><img class=\"wp-image-114501\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/air-traffic-control-baytracon-sfo.jpg\" alt=\"air-traffic-control-baytracon-sfo\" width=\"403\" height=\"307\" \/><\/a> Increased air traffic above the Bay Area has led to numerous noise complaints since early 2014. Sky Posse co-leader Jennifer Landesmann says she hopes to work with the FAA to redesign Bay Area airplane routes. \"We need the FAA ... to give us some immediate relief,\" Landessman said. Photo courtesy of SFO Noise Abatement Office.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Despite little cause for alarm with regards to air quality, Sky Posse is correct that resulting sound pollution is an issue.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“They [new flight routes] could have significant impacts on noise levels,\" Martien said. \"And noise itself can have health impacts.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The airplane noise itself is not generally bothersome compared to other forms of transportation in Palo Alto. After all, over 25 trains pass parallel to Palo Alto High School each day, and its cacophonous horns are far more likely to disturb my daily life than a plane thousands of feet in the air. In addition, Palo Alto’s population nearly <\/span><a href=\"http:\/\/www.paloaltoonline.com\/news\/2010\/02\/02\/palo-alto-neighborhoods\"><span style=\"font-weight: 400;\">triples <\/span><\/a><span style=\"font-weight: 400;\">each day due to commuters entering and leaving for work. The resulting traffic, from buses to honking cars, largely outweighs any noise pollution from planes.<\/span>\r\n\r\nHowever, some residents claim the planes’ noise has negatively impacted their overall well-being.\r\n\r\n<span style=\"font-weight: 400;\">“I don’t mind complaining. I just mind the planes and the noise,” one woman at a Sky Posse meeting said.<\/span>\r\n\r\nLow-flying planes may be irritating to some Palo Altans, but this newfound noise is only the tip of the iceberg. If we wish to limit noise pollution, we should not restrict ourselves to focusing solely on that of airplanes. Traffic congestion and trains’ blaring horns are issues that are just as important to address. If we want a happier and quieter community, collaborating with both the FAA and local city councils is a vital step on limiting all unneeded noise, regardless of the source.","excerpt":"New flight routes above Palo Alto have limited environmental effects and only represent the tip of the iceberg of Bay Area noise pollution.","date":"2016-02-03 16:07:17","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/air-traffic-control-baytracon-sfo.jpg","categories":["Opinion","Spotlight"],"tags":["airplane noise","annoying","association","aviation","Bay Area","environment","faa","federal","martien","nextgen","noise","palo alto","paly","peninsula","phil","plane","pollution","sky posse","transportation"]},{"id":114947,"title":"Girls&#8217; soccer dominates Homestead","permalink":"http:\/\/palyvoice.com\/2016\/02\/02\/girls-soccer-dominates-homestead\/","content":"[caption id=\"attachment_115393\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/GIRLS-SOCCER-Season-recap.png\"><img class=\"size-full wp-image-115393\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/GIRLS-SOCCER-Season-recap.png\" alt=\"Senior Alison Lu cuts past Homestead defense after shutting down a goal attempt by Homestead sophomore holding mid Laura Salvaggio. Photo by Ethan Kao.\" width=\"800\" height=\"600\" \/><\/a> Senior Alison Lu cuts past Homestead defense after shutting down a goal attempt by Homestead sophomore holding midfielder Laura Salvaggio. Photo by Ethan Kao.[\/caption]\r\n\r\nThe Palo Alto High School girls' soccer team (12-0-1, 7-0-1) shut down the Homestead High School Mustangs (6-8, 2-6) last Friday with an impressive final score of 5-0.\r\n\r\nThe Vikings demonstrated their deft performance in defense and inter-team communication with three assists from senior center-midfielder Ansley Queen throughout the game and another assist from senior forward Nika Woodfill to center midfielder Emily Tomz who then scored the first goal of the match. Seemingly in a continuous streak of back-to-back goals the Paly girls' went on to score a second goal 15 minutes in by Junior defender Talia Malchin and a third and fourth goal, both by Woodfill, within the first 35 minutes. By the 36 minute mark Alison Lu finished with the fifth goal, setting the score to an impressive 5-0.\r\n\r\n\"We have been really successful so far this year, our defense is phenomenal\" Tomz said in an interview following the match. \"Our team communication on the field has been pretty good this season, and has greatly improved by being positive and motivational. A lot of that is because of our captains, Jacey Pederson and Heidi Moeser, who are extremely nice, funny and bring the team together on and off the field.\"\r\n\r\nSenior Captain Moeser described some initial difficulty given the team already had two games previously in the week, leaving little energy for the Friday match.\r\n\r\n\"We came off two games this week, so it was initially difficult given we were so tired, but we really battled and stayed strong,\" Moeser said. \"I would say this was one of our better games, and morale is high given our undefeated status.\"\r\n\r\nHomestead players,junior forward Christina Klariss and sophomore left-mid Laura Salvaggio shared their thoughts on their teams performance during the match.\r\n\r\n\"Palo Alto is a really good team, and it was difficult to keep up with their speed,\" said Klariss, \"We've hadn't played our best the first half and Palo Alto definitely took advantage of that, but for the second half we really showed what we are capable of. Paly didn't score on us in the second half at all, and I think that really demonstrated how we can rise above a previously negative situation.\"\r\n\r\n\"We came into the game preparing for defeat,\" said Salvaggio. \"But we still kept in mind that we needed to prove our skill, which we really did during the second half.\"\r\n\r\nThe Paly girls' will have their next match at 3:30pm this coming Wednesday at Milpitas.","excerpt":"Palo Alto High School girls' soccer defeats Homestead Mustangs 5-0, continuing undefeated streak.","date":"2016-02-02 22:37:42","author":"Bianca Al-Shamari","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Screen-Shot-2016-01-09-at-8.58.40-PM.png","categories":["Sports"],"tags":["girls soccer","heidi moeser","homestead","paly","Soccer"]},{"id":115403,"title":"Preview: Boys&#8217; basketball to take on Milpitas tomorrow","permalink":"http:\/\/palyvoice.com\/2016\/02\/02\/preview-boys-basketball-to-take-on-milpitas-tomorrow\/","content":"[caption id=\"attachment_115475\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_58031-1.jpg\"><img class=\" wp-image-115475\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_58031-1.jpg\" alt=\"Junior guard Miles Tention rises up to take a outside three in the third quarter against Gunn High School at Gunn. Photo by Victor Carlsson.\" width=\"600\" height=\"400\" \/><\/a> Junior guard Miles Tention rises up to take an outside three during the Vikings' 74-56 victory over Gunn High School on Jan. 8. Photo by Victor Carlsson.[\/caption]\r\n\r\nThe Palo Alto High School boys' basketball team (12-7, 3-4) will play Milpitas High School (8-10, 2-5) at 7 p.m. tomorrow at Gunn High School.\r\n\r\nThe Vikings are currently on a four-league-game losing streak, after a disappointing 72-59 loss to Gunn High School on Friday. Junior guard Jack Simison believes that the key for success against Milpitas is the team's energy.\r\n\r\nThe Vikings have five games left in their regular season and are currently sitting in fifth place in the De Anza League. The Vikings should make it to playoffs as long as they win one of the five games left this season.\r\n\r\n\"We are on a four-league-game losing streak and we seriously need to turn that around,\" Simison said. \"We need to be able to play unselfishly and as a team.\"\r\n\r\nMilpitas is coming off of a 57-38 loss to Fremont High School.\r\n\r\nSimison says that the Vikings have the upper edge, but still believes Milpitas has a chance.\r\n\r\n\"We've beaten them before so we should have the upper hand when it comes to confidence,\" Simison said. \"We just need to come out strong and carry that throughout the game. My expectations would be that we would win but with how we've been playing I think it'll be anyone's game.\"","excerpt":"The Palo Alto High School boys' basketball team (12-7, 3-4) will play Milpitas High School (8-10, 2-5) at 7 p.m. tomorrow at Gunn High School.","date":"2016-02-02 20:37:18","author":"Victor Carlsson","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_5822.jpg","categories":["Sports"],"tags":["2015","2016","basketball","Boys","Jack Simison","milpitas","Mipitas"]},{"id":115280,"title":"School gears up for Super Bowl traffic","permalink":"http:\/\/palyvoice.com\/2016\/02\/02\/school-gears-up-for-super-bowl-traffic\/","content":"[caption id=\"attachment_115412\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/DSC00202.jpg\"><img class=\" wp-image-115412\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/DSC00202.jpg\" alt=\"A hired security officer examines a student's parking permit. The Paly administration has upped security measures in light of Super Bowl 50 traffic.\" width=\"600\" height=\"400\" \/><\/a> A hired security officer examines a student's parking permit in the Embarcadero parking lot of Palo Alto High School. The Paly administration has upped security measures in light of Super Bowl 50 traffic. Photo by Cooper Lou.[\/caption]\r\n\r\nIn anticipation of increased traffic due to Super Bowl 50 this Sunday at Levi's Stadium in Santa Clara, local law enforcement and the Palo Alto High School administration are taking additional measures to ensure public safety.\r\n\r\nAccording to Lt. Zachary Perron of the Palo Alto Police Department, law enforcement has extended police officers' hours and is working in conjunction with other agencies to deal with the influx of visitors.\r\n\r\n\"We’ve moved all field personnel to 12-hour shifts this week, as opposed to their normal 11-hour shifts,\" Perron said. \"They’ll be supplemented by our SWAT team personnel and downtown officers. Other personnel will be on standby if needed, but at this point, we don’t anticipate any problems.\"\r\n\r\nThroughout this week, the Paly parking lots are being monitored due to predicted congestion, as the Denver Broncos, one of the teams competing in the Super Bowl, are practicing at Stanford University. According to Assistant Principal Jerry Berkson, the school has anticipated increased traffic around the Palo Alto area and possible attempts to gain access to parking space in the Paly and Palo Alto Unified School District office parking lots.\r\n\r\n“Because the Denver Broncos are practicing at Stanford, there’s probably going to be a lot of people here,” Berkson said.\r\n\r\nTo combat this, the PAUSD has hired security personnel to monitor cars entering parking lots from Monday through Friday, according to Berkson.\r\n\r\n“To prevent them [non-Paly students, faculty and visitors] from parking in our lots and prevent riff raff, hopefully, from coming through, the district has hired security at all the entrances to all the lots,” Berkson said. “They will be here just for the week, through Friday. They are making sure people have parking permits.”\r\n\r\nAccording to Berkson, the security’s presence should not affect students, staff or parents dropping off or picking up students.\r\n\r\n“I’m hoping that they [security personnel] use enough common sense [to tell] that between 7:45 [a.m.] to 8:15 [a.m.] that that’s probably people dropping off their kids,” Berkson said. “If someone drives in wearing a Broncos beanie and jersey, those are the people that are probably not dropping off their kids. This should not affect students.”\r\n\r\nDespite the effort to avoid traffic, these measures have made entrance into the Paly parking lots much more time-consuming, according to senior Kelly Branson.\r\n\r\n“There's more traffic,” Branson said. “Today there was a ton of traffic because we [the cars] couldn't get in [to the lots] as fast, so I was 15 minutes late to class.”","excerpt":"In anticipation of increased traffic due to Super Bowl 50 this Sunday at Levi Stadium in Santa Clara, local law enforcement and the Palo Alto High School administration will be taking additional measures to ensure public safety. ","date":"2016-02-02 18:04:24","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/resized.jpg","categories":["News","Spotlight"],"tags":["Berkson","denver broncos","palo alto high school","paly","parking","permits","security","stanford","stanford university","super bowl","vice principal"]},{"id":114757,"title":"The truth behind GMOs","permalink":"http:\/\/palyvoice.com\/2016\/02\/02\/the-truth-behind-gmos\/","content":"[caption id=\"attachment_115482\" align=\"alignnone\" width=\"662\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/DSC00208.jpg\"><img class=\"wp-image-115482\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/DSC00208.jpg\" alt=\"DSC00208\" width=\"662\" height=\"441\" \/><\/a> Trader Joe's sells non-genetically modified limes across the street from Palo Alto High School. Trader Joe's is one of many supermarkets and food distributors that takes part in the anti-GMO movement. Photo by Cooper Lou.[\/caption]\r\n\r\nWhen over 50 percent of Americans believe that it is “unsafe to eat genetically modified foods,” you would think they would know what genetically modified foods are. Shockingly, they don’t. This is evident by the fact that 70 to 80 percent of U.S. foods are considered to contain GM products in them, and yet 60 percent of Americans think that they have never eaten a GM food before. How is it that so many people are uneducated about a topic they speak so strongly about?\r\n\r\n<span style=\"font-weight: 400;\">The term GMO often refers to an organism that contains recombinant DNA, meaning an organism that has DNA from other species inserted into their genome. This addition of recombinant DNA can cause a modified organism to display new traits and characteristics, which often contribute to the organism’s survival and\/or nutritional value. Some common examples of GM foods are corn, canola oil and soybeans. Despite the high percentage of U.S. foods with GM products in them, the general public remains wary of them, largely because of false advertising, misinterpretation of GMO studies and a disconnect between everyday people and scientists.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">When biotech crops first hit the market in the late '90s, they were not a major concern to most people, and the topic remained under the radar for many years. What truly brought the public’s attention to GMOs were the sellers of natural foods and organic products, who took advantage of the public’s lack of education about GMOs and began labeling foods as “Non-GMO” in order to scare consumers into buying their organic products. Today, the anti-GMO movement is continuing to grow stronger, with large supermarkets and food distributors such as Trader Joe's and Chipotle swearing off GMOs. These food distributors are incredibly popular among the general public, and their actions have influenced millions of people to blindly reject genetically modified foods. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">As the general public’s negative views on genetically modified organisms grow stronger, anti-GMO websites are starting to pop up all over the Internet. These sites spread false information and misinterpreted studies, many of which end up going viral and causing the development of concerns about the safety of GMOs. Despite the World Health Organization and the U.S. Food and Drug Administration (FDA) both declaring GM foods as safe to eat, almost 90 percent of American Association for the Advancement of Science scientists believing GMOs are safe, and hundreds of published studies that back up that conclusion, many people still believe that genetically modified organisms are unsafe for consumption. People point to fraudulent and\/or misinterpreted studies, and claim that Monsanto (an agriculture company that profits from GMOs) is trying to cover up their negative side effects. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">One such example of a misinterpreted study is when multiple anti-GMO sites wrote <a href=\"http:\/\/articles.mercola.com\/sites\/articles\/archive\/2011\/10\/06\/dangerous-toxins-from-gmo-foods.aspx\" target=\"_blank\">articles<\/a> that described a 2010 study in which traces of the Bt protein Cry1Ab were found in fetal and maternal blood. At first glance, these results seem alarming, as they seem to imply that GMOs are harming fetuses. However, the articles failed to mention many key points, the most important ones being that<\/span><span style=\"font-weight: 400;\"> there was no proof the Cry1AB protein came from the GM food (Cry1AB is used in \"natural insecticide\" formulations and so the protein could have also come from eating other organic foods), and that mammals lack the receptor for the Cry1Ab protein, meaning that Bt does not affect humans in <\/span><i><span style=\"font-weight: 400;\">any<\/span><\/i><span style=\"font-weight: 400;\"> way. Despite the study’s obvious flaws and the fact that the U.S. Environmental Protection Agency had already approved Bt potatoes, corn and cotton in 1995, the article went viral and caused an outpouring of public outcry. <\/span><span style=\"font-weight: 400;\">Hundreds of these types of articles exist, most of which can be completely discredited if the time is taken to dissect them properly. However, most people do not do further research on the scientific articles they read, and so the information spreads throughout the Internet, misinforming thousands of people and causing an irrational fear of GMOs. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">There is no doubt that the issue of GMOs is a complicated one; however, at this moment in time, it is abundantly clear that the GMOs in question have both been determined safe by the FDA and can be used to help millions of people worldwide. For example, “Golden Rice,” rice that has been engineered to contain more Vitamin A, has been shown to help prevent people from going blind due to Vitamin A deficiency, a common occurrence among kids in Southeast Asia. At the time of its invention, even Bill Clinton supported “Golden Rice,” exclaiming: “If we could get more of this Golden Rice … out to the develop[ing] world ... It could save 40,000 lives a day.” However, 16 years after the invention that has the potential to save millions of kids’ lives, \"Golden Rice\" still is not commercially available due to the ludicrous claims made by big companies. It is evident that genetically modified foods have the potential to help millions of people around the world, yet the public outcry and big business interference has stalled the development of life-saving technology.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">You may be wondering, \"Why should I care about anti-GMO activists? <\/span><i><span style=\"font-weight: 400;\">This doesn’t affect me<\/span><\/i><span style=\"font-weight: 400;\">.” Palo Alto is in the heart of Silicon Valley and is leading the way in scientific and technological advancement.<\/span><span style=\"font-weight: 400;\"> It is our job to stay educated on the matter, and to encourage the development of genetically modified organisms. The acceptance of GM foods will take a long time, but it will happen in <\/span>our<span style=\"font-weight: 400;\"> generation. It is our<\/span><span style=\"font-weight: 400;\"> responsibility to not only hold pro-GMO stances, but to actively promote scientific advancements such as GMOs, so that we create an environment in which life-saving scientific and technological advancements that hold the potential to save millions of lives worldwide, can continue to be developed.<\/span>","excerpt":"When over 50 percent of Americans believe that it is “unsafe to eat genetically modified foods,\" you would think they would know what genetically modified foods are. Shockingly, they don’t. ","date":"2016-02-02 13:43:56","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Screen-Shot-2016-01-30-at-5.57.07-PM.png","categories":["Opinion"],"tags":["50 percent","affect","americans","anti","articles","bt protein","canola oil","chipotle","corn","develop","dna","genetically","genetically modified foods","gmo","joesp","limes","lives","millions","modified","non gmo","organism","palo alto","soybeans","statistics","studies","study","trader","trader joes","worldwide"]}]