[{"id":126329,"title":"Season Recap: Football&#8217;s future looks bright with young talent","permalink":"http:\/\/palyvoice.com\/2016\/11\/21\/season-recap-footballs-future-looks-bright-with-young-talent\/","content":"<span style=\"font-weight: 400;\">The Palo Alto High School Football team wrapped up its season with a 4-7 overall record and 3-3 league record after a loss to the Los Gatos High School Wildcats (8-3, 6-0) in the first round of the Central Coast Section playoffs.<\/span>\r\n\r\nThe Vikings were carried throughout the season by junior running back Paul Jackson III who accumulated 1266 rushing yards on 222 carries, along with a team leading 12 rushing touchdowns.\r\n\r\nThe season looked promising for the Vikings, who who started off with a 25-12, victory over Patterson High School in the first game of the year.\r\n\r\nSophomore quarterback Jackson Chryst took over at the head of the offense following a concussion to senior starting quarterback Jordan Schilling in the Vikings' week two loss to San Benito High School.\r\n\r\nAccording to head coach Danny Sullivan, the future of the team was set forth from this years' graduating seniors.\r\n\r\n\"We are going to miss some key senior talent and leadership,\" Sullivan said. \"The examples that this year's senior class set is something that I will remember forever. They had to deal with change and they bought into what we are trying to accomplish.\"\r\n\r\nA highlight of the season included defeating the Wilcox Chargers (5-6, 4-2) during a regular season league matchup. The Chargers went on to finish second in the De Anza League.\r\n\r\n\"They were the No. 1 team in the league at the time and we won,\" Schilling said. \"That was one of the best games in my playing career.\"\r\n\r\nThe Vikings' finished fourth in the De Anza League, which secured them a spot in CCS playoffs.\r\n\r\nDespite the early CCS loss, Vikings' first year head coach Danny Sullivan looks forward to next season.\r\n\r\n\"In my first year at Paly, there were some definite challenges by being a new face to the area,\" Sullivan said. \"I am thankful that the school and the players that stuck it out through the season welcomed me to be a part of the program. There were some lows, along with some very big highs for our team this season. Definitely some things that the kids coming up through the ranks can build on for next season.\"\r\n\r\nThe Vikings look to make a mark next year by starting preparation for the 2017 season soon.\r\n\r\n\"Workouts in the weight room to build strength and conditioning are going to begin in late January,\" Sullivan said. \"We have a goal to show people how much we can improve from one season to the next. In talking with many other coaches around the area, the word is out about how we do things here at Paly. They all know that if the work gets put in, we are a team to be reckoned with in 2017.\"\r\n\r\nAccording the Schilling, the future of Paly football looks promising.\r\n\r\n\"I really think the team as whole improved week to week,\" Schilling said. \"This year was tough because we had to learn a whole new offense and adjust to a new system.\"\r\n\r\nThe team will depend on the talents of sophomore quarterback Jackson Chryst, junior running back Paul Jackson III and junior lineman Bryant Jefferson for leadership in the coming season.\r\n\r\n\"Our program can take drastic strides next season if junior Bryant Jefferson can continue to improve and if sophomore Jackson Chryst can grow as a player on the field,\" Sullivan said. \"If those two have a successful offseason, the rest of the team will follow their lead.\"","excerpt":"The Palo Alto High School Football team wrapped up its season with a 4-7 overall record and 3-3 league record after a loss to the Los Gatos High School Wildcats (8-3, 6-0) in the first round of the Central Coast Section playoffs.","date":"2016-11-21 21:27:46","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/los-altos-v-pa.jpg","categories":["Football","Sports"],"tags":["CCS","danny sullivan","football","jackson chryst","jordan schilling","palo alto","Paly football","recap","season","Sullivan","vikings"]},{"id":126113,"title":"Season Preview: Girls basketball seeks to avenge last season&#8217;s early NorCal exit","permalink":"http:\/\/palyvoice.com\/2016\/11\/21\/season-preview-girls-basketball-seeks-to-avenge-last-seasons-early-norcal-exit\/","content":"[caption id=\"attachment_115295\" align=\"alignright\" width=\"386\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/julie-jumpman.jpg\"><img class=\" wp-image-115295\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/julie-jumpman.jpg\" alt=\"Junior forward Julie Chandler leaps in the air as she goes up for an acrobatic layup against Gunn late in the fourth quarter on Friday at Gunn. The Vikings beat the Titans, 40-28. Photo by Sam Lee.\" width=\"386\" height=\"352\" \/><\/a> Senior forward Julie Chandler leaps in the air as she goes up for an acrobatic layup against Gunn late in the fourth quarter last year at Gunn. The Vikings beat the Titans, 40-28, on January 29th, 2016. Photo by Sam Lee.[\/caption]\r\n\r\nAfter a 1st place finish in the CCS playoffs and a first round NorCal loss, the Palo Alto High School girls' basketball team hopes to return to CCS finals.\r\n\r\nThe girls' team dominated leagues last year, posting an overall record of 19-8, en route to winning CCS. The girls team fell to Dublin High School Gaels, 55-49, in the first round of NorCals.\r\n\r\nSenior and fourth year guard Lauren Koyama hopes to put last year's early NorCal exit behind her, and is ready to start the season this winter.\r\n\r\n\"Getting eliminated early definitely hurt last year, but right now we are focused on getting through preseason and league.\" Koyama said. \"We want to peak in February, and we just have to take it one game at a time.\"\r\n\r\nLed by seniors Koyama and Skylar Burris, the team is looking to fill the gaps left by last year's seniors: Maddy Atwater, Alexis Harris, and Courtney Lovely.\r\n\r\n\"We lost three starters last year, one of them being our main source of height on the court. In order to adapt we need to work hard for every rebound and bring the energy that our seniors last year brought [to] every game,\" Burris said.\r\n\r\nThe loss of Harris will have the largest impact on the team, as she led the team in both scoring and rebounding last year, according to Maxpreps.\r\n\r\n\"We have a lot of guards who are capable of making threes, which can make up for the loss of our post scoring.\" junior guard Carly Leong said. \"We need to be more physical when it comes to rebounding, because we are a smaller team, and physicality will make up for it.\"\r\n\r\nDespite the loss, the girls team  maintain their dominance, having eight of the eleven players returning to the team.\r\n\r\n\"<span style=\"font-weight: 400;\">The only major change to the program is how many new players we're bringing in. The past couple years we've been playing with basically the same team, and I think bringing some players up from JV and new underclassmen trying out will give us a new dynamic.\" Leong said. \"So far, every practice has been so much fun, and I can't wait for season to start.\"<\/span>\r\n\r\nThe season starts at 7 p.m tonight, with the Vikings traveling to St. Ignatius.","excerpt":"After a 1st place finish in the Central Coast Section (CCS) playoffs and a first round NorCal loss, the Palo Alto High School girls' basketball team looks to return to CCS finals.","date":"2016-11-21 17:20:28","author":"Kasra Orumchian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/julie-jumpman.jpg","categories":["Basketball","Sports","Spotlight"],"tags":["2016","basketball","girls","girls basketball","gunn","palo alto","palo alto high school","paly","season preview","sports","vikings"]},{"id":126411,"title":"TEDx club to hold student speaker auditions","permalink":"http:\/\/palyvoice.com\/2016\/11\/21\/tedx-club-to-hold-student-speaker-auditions\/","content":"[caption id=\"attachment_126417\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/10922448_334598283407783_150521601487457039_n.jpg\"><img class=\"size-full wp-image-126417\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/10922448_334598283407783_150521601487457039_n.jpg\" alt=\"TEDx's 2015 conference. Photo: Adele Bloch\" width=\"800\" height=\"533\" \/><\/a> Palo Alto High School students and faculty gather in Paly's Media Arts Center to listen to a TEDx talk during the 2015 conference. Photo: Adele Bloch[\/caption]\r\n\r\nThe TEDxPaloAltoHighSchool club will be holding speaker auditions for Palo Alto High School students on Tuesday, Nov. 29 and Thursday, Dec. 1 for its fourth annual TEDx event in March.\r\n\r\n\"TEDx is a program of local, self-organized events that bring people together to share a TED-like experience,\" according to TEDxPaloAltoHighSchool's <a href=\"https:\/\/www.facebook.com\/tedxpaloaltohighschool\/\">Facebook Page<\/a>. \"At a TEDx event, TEDTalks video and live speakers combine to spark deep discussion and connection in a small group.\"\r\n\r\n<span style=\"font-weight: 400;\">According to the Audition’s <a href=\"https:\/\/www.facebook.com\/events\/1810928752516697\/\">Facebook [[delete facebook]] Event Page<\/a><\/span><span style=\"font-weight: 400;\">, this year's conference has a theme of “Uncharted Waters” and TEDx is looking for students with “confidence, enunciation and comfort [in] public speaking” to “present a risky new idea, a personal story or a radical approach.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Students will need to bring two copies of their speech, and will have to perform a run-through of their speech to the TEDx speaker team,” junior Iris Yuan, one of TEDx’s speaker administrators, said. “The two biggest things we are looking for in prospective speakers is that they have a speech that relates to our theme and are confident when speaking.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior Claire Eberhart, who spoke at last year's TEDx conference, encourages students to give presentations about topics that are important to them.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“When it came to me writing my talk about poetry in schools, the words flowed naturally,” Eberhart said. “When you have a plan of what you want to say and truly want to make a difference in your community, doing a Ted Talk is a great way to bring attention to issues and topics that are meaningful to you.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to senior Gaby Pelayo, one of TEDx's presidents, Tuesday's audition will run from 2:45 p.m. to 4 p.m. and Thursday's audition will run from 1:55 p.m. to 3 p.m. Both will be held in Room 863. Students can sign-up to audition <a href=\"https:\/\/docs.google.com\/forms\/d\/e\/1FAIpQLSf-_4P0EUvLhkM14AvGjdT3u5GqTrxwQDYIazyBrgf-vFjxBA\/viewform?c=0&amp;w=1\">here<\/a>.<\/span>","excerpt":"The TEDxPaloAltoHighSchool club will be holding speaker auditions for Palo Alto High School students on Tuesday, Nov. 29 and Thursday, Dec. 1 for its fourth annual TEDx event in March.","date":"2016-11-21 16:58:34","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/10922448_334598283407783_150521601487457039_n.jpg","categories":["News"],"tags":["auditions","speakers","students","TEDx"]},{"id":126439,"title":"Breaking News: School board meeting now to re-address weighted GPAs","permalink":"http:\/\/palyvoice.com\/2016\/11\/21\/breaking-news-school-board-meeting-now-to-re-adress-weighted-gpas\/","content":"<span style=\"font-weight: 400;\">The Palo Alto Unified School District school board is focusing again today on the controversial and highly debated decision to post weighted GPAs for colleges. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Last Tuesday, the school board met to discuss whether another meeting should be held to talk about weighted GPAs, a topic that has sparked great contention over whether this will benefit or hinder the graduating Class of 2017.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">School Board member Ken Dauber challenged the consensus by motioning to delay the decision until after the newly elected board members replace Camille Townsend and Heidi Emberling.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Are we expected to make decisions?” Dauber said. “<\/span><span style=\"font-weight: 400;\">I would prefer to wait until new board members are seated if we are going to be making decisions.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Emberling reiterated that the board was discussing a time-sensitive issue and their resolution should come within the following week. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I think the board gave guidance to make sure that weighted GPA would be offered for this year's seniors,\" Emberling said. \"The questions are what does that mean and why is it meaningful,” Emberling said. This year’s seniors need clarifications before the due dates of Dec. 1.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Superintendent Max McGee came out in favor of waiting, saying this was a decision that couldn’t be rushed and needed consultation from other experienced advisers.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We have yet to hear from the college counselors and our teachers and our administrators,\" McGee said. \"They know the colleges better than anyone else in this room and we cannot make this decision without them.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The board eventually came to the consensus that the meeting would be held the following Monday to explicitly come to an agreement on whether to put a cap on the amount of unweighted credited classes to be included in a students' weighted GPA.<\/span>\r\n\r\nWhile the decision to post weighted GPAs is still confirmed, the meeting may give an opportunity for people to voice their concerns over this impactful policy, directly with the school board.","excerpt":"The Palo Alto Unified School District school board is focusing again today on the controversial and highly debated decision to post weighted GPAs for colleges.","date":"2016-11-21 16:03:31","author":"Donnesh Farmanfarmaian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/schoolboard051016.jpg","categories":["News","Schoolboard","Spotlight"],"tags":[]},{"id":126271,"title":"Local high schools erupt in protests and peace marches","permalink":"http:\/\/palyvoice.com\/2016\/11\/19\/local-high-schools-erupt-in-protests-and-peace-marches\/","content":"Students from various Bay Area high schools have exercised their constitutional rights over the past week as protests and peace marches have erupted in response to the results of the national election. While many emphasized anti-Trump rhetoric, others avoided making political statements and promoted unity and acceptance. Read on to view a timeline and map of local protests.\r\n\r\n<iframe src=\"https:\/\/www.google.com\/maps\/d\/embed?mid=1YgQQV8fhtegxzT4_01CQ7JhdLRI\" width=\"640\" height=\"480\"><\/iframe>\r\n\r\n<iframe src=\"https:\/\/cdn.knightlab.com\/libs\/timeline3\/latest\/embed\/index.html?source=1k1XP1cZ2i6Q3T9G6ZEUEeQDqVhgF-Lcd_ZPSCZclTEE&amp;font=Default&amp;lang=en&amp;initial_zoom=2&amp;height=650\" width=\"100%\" height=\"650\" frameborder=\"0\"><\/iframe>","excerpt":"In light of recent events many high school students have taken to the streets to protest and promote peace and unity among their peers. Read on to learn more about how local students have come together to organize their high school communities.","date":"2016-11-19 13:51:28","author":"Zahra Muzaffar","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/IMG_7500.jpg","categories":["Election 2016","Spotlight"],"tags":["2016","castilleja","city hall","constitution","election","gunn","high schools","march","oakland","paly","peace","peaceful protest","protest","redwood","rights","San Francisco","Trump","unity"]},{"id":126352,"title":"Turkey Trot by numbers","permalink":"http:\/\/palyvoice.com\/2016\/11\/18\/turkey-trot-by-numbers\/","content":"Student are returning to home with full bellies today after Palo Alto High School's 12th annual <a href=\"http:\/\/palyvoice.com\/2016\/11\/17\/tradition-to-continue-with-12th-turkey-trot-tomorrow\/\">Turkey Trot<\/a>, a feast in honor of Thanksgiving, took place at lunch on the Quad.\r\n\r\nThe feast costs either five dollars in cash or two dollars plus three cans of non-perishable foods. According to Anderson and the <a href=\"http:\/\/www.ehpcares.org\/about-us.html\">Ecumenical Hunger Program website<\/a>, the money and cans raised by the Turkey Trot are donated to the EHP in East Palo Alto, a non-profit organization who's mission is \"to sustain our neighbors through immediate crises and to help them regain stability and independence\".\r\n\r\nAccording to Paly parent and event organizer Melissa Anderson, this year's Turkey Trot will offered more options for students with dietary restrictions. The feast will provided options for vegetarians and gluten-free students, such as baked potatoes and vegetarian stuffing, along with gluten free pies, stuffing and gravy.\r\n\r\nAnderson, who has been organizing the Turkey Trot for seven years, finds the event to be her favorite Paly tradition.\r\n\r\n\"I love seeing all the kids come out,\" Anderson said. \"They all come out in mass. If you pick your head up at about noon, it's like 'Oh my goodness! I hope we have enough food', and then there's always seconds, everyone gets fed.\"\r\n\r\n\"At the end of this, we give five big barrels of canned goods to [The] Ecumenical Hunger [Program],\" Anderson said. \"I come over with anywhere from $2,000 to $4,000, and that helps their food and gift drive for their clients. We're a really major part of their offerings for their families.\"\r\n\r\nBelow is the breakdown of this years Turkey Trot feast statistics.\r\n\r\n<iframe style=\"overflow-y: hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/18235253-new-piktochart\" width=\"800\" height=\"1547\" frameborder=\"0\" scrolling=\"no\"><\/iframe>","excerpt":"Student are returning to home with full bellies today after Palo Alto High School's 12th annual Turkey Trot, a feast in honor of Thanksgiving, took place at lunch on the Quad. ","date":"2016-11-18 18:40:21","author":"Maya Akkaraju","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/15128655_569222469931377_283696749_n.jpg","categories":["News","Spotlight"],"tags":["anderson","gluten-free","palo alto high school","paly","pie","stuffing","thanksgiving","turkey","turkey feast","turkey trot","turkey trot 2016","vegetarian"]},{"id":126204,"title":"Video: Students march for peace","permalink":"http:\/\/palyvoice.com\/2016\/11\/18\/video-palo-alto-peace-march\/","content":"Students chanted and cheered during a peace march Tuesday intended to show support for students after a divisive election. Gunn High School and Castilleja School students also came out to support the march.\r\n\r\n<iframe src=\"https:\/\/www.youtube.com\/embed\/01oTKbAjXfA\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"Watch a video of students chanting and cheering during a peace march Tuesday intended to show support for students after a divisive election. ","date":"2016-11-18 09:27:16","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/IMG_7748.jpg","categories":["Multimedia","Spotlight","Video"],"tags":["march","peace","video"]},{"id":126269,"title":"Tradition to continue with 12th Turkey Trot tomorrow","permalink":"http:\/\/palyvoice.com\/2016\/11\/17\/tradition-to-continue-with-12th-turkey-trot-tomorrow\/","content":"In celebration of Thanksgiving, Palo Alto High School’s 12th annual Turkey Trot will take place during an extended lunch tomorrow from 11:45 a.m. to 1 p.m. on the quad.\r\n\r\nAt this school-wide event, students will share a full Thanksgiving meal, including turkey and stuffing, and other traditional holiday foods. Vegetarian and gluten free options will be provided.\r\n\r\n[caption id=\"attachment_112264\" align=\"alignright\" width=\"431\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/IMG_9465.jpg\"><img class=\" wp-image-112264\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/IMG_9465.jpg\" alt=\"Students swarm food tables during the 2015 Turkey Trot. Photo by Sherwin Amsbaugh\" width=\"431\" height=\"322\" \/><\/a> Students anxiously await their meals during the 2015 Turkey Trot. Photo by Sherwin Amsbaugh.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Those who wish to purchase lunch must bring either five dollars in cash, or two dollars and three cans of nonperishable food. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Melissa Anderson, a parent volunteer who helps organize the feast annually, cans will be donated to the Ecumenical Hunger Program in East Palo Alto. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It [The <\/span><span style=\"font-weight: 400;\">Ecumenical Hunger Program] has been the recipient of the proceeds and food collection from the Paly feast since before I was first involved in 2010,” Anderson said. “We donate the canned goods that students and staff bring on Friday, [which is] usually five large full barrels.\"<\/span>\r\n\r\nAs stated by Anderson, cash proceeds will be put towards the feast, and all excess money will be donated as well.\r\n\r\n<span style=\"font-weight: 400;\"> \"We purchase the stuffing, gravy, salad fixings and rolls,\" Anderson said. \"Everything else is donated. In the last several years, that’s been anywhere from $2,000-$4,000.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Anderson, the Turkey Trot tradition began at Gunn High School in 2004, before it was brought to Paly the following year, with the hope of spreading Thanksgiving spirit to the Paly community. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"It [The Turkey Trot] is intended to be a community event, giving us all the opportunity to be together, be grateful for our blessings and generous to others,\" Anderson said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Due to the extended lunch, tomorrow will feature a modified C-day schedule. Class periods will be 45 minutes long, with lunch beginning at 11:45 a.m. and ending at 1 p.m.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Junior Ellen Goncher is especially excited for this year's trot.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I love the Turkey Trot,” Goncher said. “I didn’t get to go last year, so I’m very excited.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">For those who are not as keen on the classic holiday meal, many still enjoy the extra 35 minutes by treating themselves to lunch off campus. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior Mack Saitz will be taking advantage of the special schedule and making the trek to San Francisco.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"During the extended lunch, I'll take advantage of my extra free time,\" Saitz said. \"I might go to SF  [San Francisco] and go to lunch at CPK [California Pizza Kitchen] with some friends.\"<\/span>","excerpt":"In celebration of Thanksgiving, Palo Alto High School’s 12th annual Turkey Trot will take place during an extended lunch tomorrow from 11:45 a.m. to 1 p.m. on the quad.","date":"2016-11-17 20:39:42","author":"Maya Reuven","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/IMG_9465.jpg","categories":["News","Spotlight"],"tags":["cday","extended","feast","Food","lunch","schedule","stuffing","thanksgiving","trot","turkey","turkey trot"]},{"id":126052,"title":"&#8216;Dr. Strange&#8217; is a strangely enticing, supernatural adventure","permalink":"http:\/\/palyvoice.com\/2016\/11\/17\/dr-strange-is-a-strangely-enticing-supernatural-adventure\/","content":"[caption id=\"attachment_126292\" align=\"alignnone\" width=\"615\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/MV5BNjgwNzAzNjk1Nl5BMl5BanBnXkFtZTgwMzQ2NjI1OTE@._V1_SY1000_CR006741000_AL_.jpg\"><img class=\"wp-image-126292 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/MV5BNjgwNzAzNjk1Nl5BMl5BanBnXkFtZTgwMzQ2NjI1OTE@._V1_SY1000_CR006741000_AL_.jpg\" alt=\"\" width=\"615\" height=\"560\" \/><\/a> With a mix of wry wit and cool composure, Benedict Cumberbatch perfectly plays the role of the movie's titular character. Photo from Imdb.com[\/caption]\r\n\r\nIn the production of its most recent film, \"Dr. Strange,\" Marvel brings a new side of superheroes to life, one that goes beyond the classic confines of conventional superpowers to introduce themes of mysticism and the occult. In the tradition of superhero movies, \"Dr. Strange\" is action packed, fast paced and pushes the envelope of visual effects to make a fantastical and unreal world come to life.\r\n\r\n<span style=\"font-weight: 400;\">While all Marvel movies may emphasize mesmerizing imagery and exciting battle choreography, to the point of cookie-cutting plots and sacrificing dialogue, \"Dr. Strange\" doesn’t quite fit the mold as closely as some of the previous installments. Superhero movies may be as Hollywood as it gets, but the film, along with Benedict Cumberbatch's performance as the titular character are distinguished with wittier lines, clever plot tricks and an eclectic musical score that give the audience more food for thought as it takes a surreal detour from Marvel's usual path.<\/span>\r\n\r\nThe concept of an astral body, different dimensions and the ability for the mind to heal the body are explored with \"Dr. Strange,\" replacing the conventional superpowers in previous installments. The movie’s depiction of these spiritual ideas is unfortunately shallow, as the thin layer of eastern-inspired practices covers up a lot of mystical mumbo-jumbo. That being said, the theme of humility and respect to a universal power is a repeating theme in the movie where egotistical Dr. Strange is humbled by its might, in a way that may allude back to eastern religious themes.\r\n\r\n<span style=\"font-weight: 400;\">The movie starts by introducing Dr. Stephen Strange (Benedict Cumberbatch),  a brilliant and dexterous neurosurgeon from New York who's as arrogant as he is meticulous. The doctor’s life is suddenly met with tragedy when he is victim to a car accident that leaves him severely damaged in both his hands. With his surgical career hanging on the line, Strange desperately seeks a cure, eventually traveling to Kathmandu, Nepal, after hearing of a miraculous case where a man overcame paralysis in the mysterious, secret compound of Kamar-Taj. What he finds there he cannot fully accept.<\/span>\r\n\r\n<span style=\"font-weight: 400;\"> When the mysterious overseer of the compound, the Ancient One (Tilda Swinton), introduces Kamar-Taj as a magic academy, both audiences and Dr. Strange are skeptical of what to expect, only to be literally blown away by her demonstration of mystical ability. The producer’s decision to embrace the original story’s eastern notion of sorcery created the opportunity to depict vivid Kaleidoscopic scenes of morphing buildings and psychedelically changing landscapes, breathtakingly bewitching when watched on an 80-foot screen. In the compound, Dr. Strange is taught how to manipulate and distort reality, the power of teleportation and altering time, in scenes that are reminiscent of classic sci-fis like \"<\/span><span style=\"font-weight: 400;\">The Matrix\"<\/span><span style=\"font-weight: 400;\"> and \"<\/span><span style=\"font-weight: 400;\">Inception.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Behind the whimsy and excitement of the wondrous powers, an evil is emerging that threatens Kamar-Taj and the whole world. Dr. Strange and the compound’s guardians, Karl Mordo (Chiwetel Ejiofor) and Wong (Benedict Wong) must defend humanity from the evil ex-student, Kaecilius (Mads Mikkelsen), who seeks revenge on the Ancient One by opening a gate to the “Dark Dimension”. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Dr. Strange’s own past unfolds as his journey returns him to his home city of New York and the very hospital he used to perform in. He rekindles things with his former romantic partner, Christine Palmer (Rachel McAdams) who desperately tries keeping him alive as Strange’s ghostly, astral body does dimensional battle with a dark sorcerer. The relationship between Strange and Christine develops throughout the course of the movie, as dynamically as the warping environments so expertly created through special effects.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The most important criteria for a good superhero flick is the wow factor of the battle scenes. The fighting sequences are less destructive than the usual arena-like melee duels of previous superhero movies, and more focused on disorienting and out-maneuvering the enemy. Dr. Strange may fight in or out of his body while the battlefield may jump from different corners of the Earth to different dimensions. Viewing the characters contest the streets of New York and Hong Kong to other dimensions was especially spellbinding up-close in theaters with an intense original soundtrack adding to our immersion.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">This is certainly one movie worth seeing on a big-screen in theaters. The storyline was fast paced and engaging while the action was dazzling. Watching formulaic brawl scenes where opponents always use brawn can become very repetitive and tiresome, but \"Dr. Strange\" was a refreshing new breathe from Marvel’s predictable past. <\/span>\r\n\r\nRunning Time: 115 minutes\r\n\r\nDirector: Scott Derrickson\r\n\r\nCast: Benedict Cumberbatch-Stephen Strange &amp; Dormammu\r\n\r\nRachel McAdams-Christine Palmer\r\n\r\nTilda Swinton-The Ancient One\r\n\r\nMads Mikkelsen-Kaecilius\r\n\r\nChiwetel Ejiofor-Karl Mordo\r\n\r\nBenedict Wong-Wong\r\n\r\nMusic Composer: Michael Giacchino\r\n\r\n&nbsp;","excerpt":"In the production of its most recent film, &#8220;Dr. Strange,&#8221; Marvel brings a new side of superheroes to life, one that goes beyond the classic <a href=\"http:\/\/palyvoice.com\/2016\/11\/17\/dr-strange-is-a-strangely-enticing-supernatural-adventure\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2016-11-17 18:22:51","author":"Donnesh Farmanfarmaian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/doctor-strange-cumberbatch-magic-powers.jpg","categories":["Entertainment","Spotlight"],"tags":["Dr. Strange","film","marvel","movie review"]},{"id":126248,"title":"Verbatim: Vikings share motivations for attending peace march","permalink":"http:\/\/palyvoice.com\/2016\/11\/17\/verbatim-vikings-share-motivations-for-attending-peace-march\/","content":"Palo Alto High School students joined others from around the Bay Area in a peaceful demonstration Tuesday afternoon at downtown Palo Alto.\r\n\r\nThe demonstration was intended to spread messages of love and acceptance, and was inspired by the unrest that many students felt because of derogatory comments made during the 2016 presidential election.\r\n\r\nThe Paly Voice asked students why they decided to attend the march.\r\n\r\n<iframe src=\"\/\/www.thinglink.com\/card\/855323001644646402\" width=\"700\" height=\"800\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"Palo Alto High School students joined others from around the bay area in a peaceful demonstration Tuesday afternoon at downtown Palo Alto. The Paly Voice asked students why they decided to attend the march.","date":"2016-11-17 09:38:54","author":"William Sallomi","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/Verbatim1.jpg","categories":["Features","Verbatims"],"tags":["darrow hornik","march","nani tupou","peace rally","richy islas","tyler marik","verbatim","zoe stedman"]}]