[{"id":124529,"title":"Video: Caesar dressing tops the salad on Day Two","permalink":"http:\/\/palyvoice.com\/2016\/10\/18\/video-caesar-dressing-tops-the-salad-on-day-two\/","content":"The Paly Voice documented the <a href=\"http:\/\/palyvoice.com\/2016\/10\/18\/recap-seniors-maintain-their-reign-on-day-two\/\" target=\"_blank\">second day<\/a> of Palo Alto High School's Spirit Week 2016 which featured a thrilling tug of war tournament during the lunch rally.\r\n\r\nMake to sure to check Associated Student Body’s <a href=\"https:\/\/sites.google.com\/site\/pahsasb\/sw2016\">master schedule<\/a> for information on daily events as well as <a href=\"http:\/\/palyvoice.com\/2016\/10\/18\/spirit-week-day-two-results-3\/\" target=\"_blank\">scoring<\/a>. Check the Paly Voice for more updates on Spirit Week 2016 under the new <a href=\"http:\/\/paly.io\/spiritweek16\" target=\"_blank\">Spirit Week tab<\/a>.\r\n\r\n<iframe src=\"https:\/\/www.youtube.com\/embed\/MuE34Q5n-cM\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Paly Voice documented the second day of Palo Alto High School&#8217;s Spirit Week 2016 which featured a thrilling tug of war tournament during the lunch rally. <a href=\"http:\/\/palyvoice.com\/2016\/10\/18\/video-caesar-dressing-tops-the-salad-on-day-two\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2016-10-18 22:08:17","author":"Kasra Orumchian","categories":["Spirit Week 2016"],"tags":["2016","freshmen","juniors","paly","salad dressing","seniors","Sophomores","Spirit Week","tug of war","video","voice"]},{"id":124562,"title":"Spirit Week Day Two results","permalink":"http:\/\/palyvoice.com\/2016\/10\/18\/spirit-week-day-two-results-3\/","content":"<span style=\"font-weight: 400;\">Spirit Day Two results are in, and seniors remain in the lead with 4900 <\/span>points with 750 ahead of the juniors. Despite the freshman upset in tug of war, freshmen still remain in last place.\r\n\r\n<span style=\"font-weight: 400;\">Check back tomorrow as The Paly Voice recaps Day Three of Spirit Week, where students will participate in the Night Rally dressed in their neon class colors.<\/span>\r\n\r\n<iframe width=\"800\" height=\"1896\" frameborder=\"0\" scrolling=\"no\" style=\"overflow-y:hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/17214602-spirit-week-2016-day-1\"><\/iframe>","excerpt":"Spirit Day Two results are in, and seniors remain in the lead with 4900 points with 750 ahead of the juniors.  Despite the freshman upset in tug of war, freshmen still remain in last place.","date":"2016-10-18 21:55:58","author":"Morgan Keller","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Screen-Shot-2016-10-18-at-9.44.12-PM.png","categories":["News","Spirit Week 2016","Spotlight"],"tags":["2016","paly","scores","Spirit Week","stats"]},{"id":124173,"title":"Preview: ASB launches second annual Night Rally","permalink":"http:\/\/palyvoice.com\/2016\/10\/18\/preview-asb-launches-second-annual-night-rally\/","content":"[caption id=\"attachment_110477\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/I9P4076.jpg\"><img class=\"wp-image-110477 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/I9P4076.jpg\" alt=\"\" width=\"800\" height=\"533\" \/><\/a> Paly students, decked out in neon clothing, cheer for their separate classes during a relay race during the 2015 spirit night rally. Photo by Cooper Lou.[\/caption]\r\n\r\nDay three of Spirit Week will kick off with a night rally from 7 p.m. to 9 p.m. tomorrow at the Palo Alto High School football field. There will be no school for students tomorrow, except for juniors taking the PSAT at 8 a.m.\r\n\r\nWith the absence of a lunch rally due to junior PSAT testing, the night rally will include \"Best Dressed\" and cheers. All activities will count in the Spirit Week scoring, according to Spirit Commissioner junior Michaela Fogarty.\r\n\r\nThis will be the second consecutive year in which Spirit Week will include a night rally.  According to Spirit Commissioner junior Claire Billman, students should be decked out in their class colors, and suggests that students \"strive for neon\" as the majority of the rally will happen after sundown.\r\n\r\n[embed]https:\/\/youtu.be\/4s1R8Hr3GNk[\/embed]\r\n\r\n“The night rally is going to be filled with a lot of fun activities,\" Fogarty said. \"We hope to have a large turn out like we did last year.”","excerpt":"Day three of Spirit Week will kick off with a night rally from 7 p.m. to 9 p.m. tomorrow at the Palo Alto High School football field. There will be no school for students tomorrow, except for juniors taking the PSAT at 8 a.m.","date":"2016-10-18 21:32:54","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/imageedit_4_3212801292.jpg","categories":["Spirit Week 2016","Spotlight"],"tags":["2016","Billman","Fogarty","night","night rally","palo alto high school","rally","spirit","Spirit Week","week"]},{"id":124540,"title":"Recap: Seniors maintain their reign on Day Two","permalink":"http:\/\/palyvoice.com\/2016\/10\/18\/recap-seniors-maintain-their-reign-on-day-two\/","content":"The competition heats up as seniors performed strongly in today’s lunchtime rally, fueling the rivalry between the upperclassmen.\r\n\r\nAs part of today’s salad dressing theme, the seniors dressed up in togas, juniors in Hawaiian gear, sophomores in cowboy attire and freshmen in athletic apparel. The lunchtime rally featured a tug-of-war contest, as well as the usual cheers and a best dressed competition.\r\n\r\nFor the first time, Palo Alto High School's Associated Student Body strayed from tradition and allowed judges to randomly pull the order in which grades would participate in the tug of war from a hat.\r\n\r\nThe seniors quickly defeated the freshmen in the first round of tug of war, while the juniors were victorious over the sophomores. In the consolation round, the freshmen pulled an upset victory over the sophomores.\r\n\r\n“I was impressed and surprised by the fact that the freshmen took third place in tug of war and beat the sophomores,” freshman Griffin Kemp said.\r\n\r\nAfter a hard-fought battle in the championship round, the seniors prevailed over the juniors to claim the win.\r\n\r\n“Our whole team was really pumped because we [the Class of 2017] have never made it to the championship round before,” tug-of-war participant senior Lauren Koyama said. “We all knew we had to redeem ourselves for the past years.”\r\n\r\nLast year, the Class of 2018 claimed victory while facing the Class of 2017 in the first round. Its win forced the Class of 2017 to compete for third place, rather than the anticipated junior versus senior tug-of-war championship round.\r\n\r\nDespite the loss, the juniors are still optimistic about their Spirit Week chances.\r\n\r\n“Although we lost to the seniors this year, I think our class has a lot of spirit and we can definitely can make a comeback in the next couple days,” junior Xander Sherer said.\r\n\r\nTotal points will be posted at the end of float building on the ASB website at 9:30 p.m. Spirit Week will continue tomorrow with the Night Rally from 7 to 9 p.m. Check The Paly Voice for more updates on Spirit Week 2016 under the new <a href=\"http:\/\/paly.io\/spiritweek16\" target=\"_blank\">Spirit Week tab<\/a>.\r\n\r\n<iframe src=\"https:\/\/docs.google.com\/presentation\/d\/1Qf8Ne0o_uW_nyTNSZOXEJSvSB0ChMy8mXl11kOWuAGo\/embed?start=true&amp;loop=false&amp;delayms=3000\" width=\"700\" height=\"495\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The competition heats up as seniors performed strongly in today’s lunchtime rally, fueling the feud amongst the upperclassmen.\r\n","date":"2016-10-18 18:24:58","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/DSC_0238.jpg","categories":["News","Spirit Week 2016","Spotlight"],"tags":["day 2","griffin","griffin kemp","hawaiian","healthy choice","kemp","koyama","lauren","palo alto high school","paly","ranch","recap","sherer","spirit","Spirit Week","toga","tug of war","victory","week","xander"]},{"id":124433,"title":"Spirit Week Day One results","permalink":"http:\/\/palyvoice.com\/2016\/10\/17\/spirit-week-day-one-results-3\/","content":"<a href=\"http:\/\/palyvoice.com\/2016\/10\/17\/recap-spirit-week-day-one\/\" target=\"_blank\">Spirit Week Day One<\/a> results are in, and the seniors are <a href=\"http:\/\/palyvoice.com\/2016\/10\/17\/video-paly-launches-spirit-week-2016\/\" target=\"_blank\">narrowly in the lead<\/a> with 100 points ahead of the second-place sophomores. The freshmen remain in last place by a large margin of 1050 points behind the juniors.\r\n\r\nCheck back tomorrow as The Paly Voice summarizes Day Two of Spirit Week, where students and staff will dress up for the Salad Dressing theme.\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/spirit-week-201_17214602_df8fcc92aad2b37d3bc758aa59833a41ceae560c.png\"><img class=\"alignnone wp-image-124520\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/spirit-week-201_17214602_df8fcc92aad2b37d3bc758aa59833a41ceae560c.png\" alt=\"spirit-week-201_17214602_df8fcc92aad2b37d3bc758aa59833a41ceae560c\" width=\"621\" height=\"1472\" \/><\/a>\r\n\r\n&nbsp;","excerpt":"Spirit Week Day One results are in, and seniors take the lead with 2200 points with sophomores close behind. Stay tuned this week as The Paly Voice summarizes this year's Spirit Week scores.","date":"2016-10-17 23:10:45","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Spirit-Week-2016-Featured-Images-2.png","categories":["Multimedia","Spirit Week 2016"],"tags":["2016","classes","Fall","freshmen","juniors","piktochart","results","seniors","Sophomores","spirit","statistics","stats","week","win"]},{"id":124429,"title":"Recap: Spirit Week Day One","permalink":"http:\/\/palyvoice.com\/2016\/10\/17\/recap-spirit-week-day-one\/","content":"The first day of Spirit Week saw the debut of several new activities in addition to some old classics, creating a level playing field for both veteran and rookie competitors.\r\n\r\nAs usual, Spirit Week started off with “Theme Day,” where each class (except for seniors) dressed up for its respective themes. The freshman theme is \"Eye of the Tiger,\"  the sophomores, \"Firefighters,\" and the juniors, \"Boxing.\"  As per tradition, the senior class dressed up in 90’s attire instead of its theme, “Game Over.”\r\n\r\nClear skies and temperate weather enabled a large student turnout to watch the lunchtime activities.\r\n\r\nThe sophomores managed to take first place in “Knee Trembler” after barely edging out the seniors, while the junior class won “Pass the Water.”\r\n\r\nDespite losing both of the new events, the senior class was able to get a win in the “Banana Bump” activity.\r\n\r\nAccording to senior Jackson Dahl, who won the event, the trick was to get some momentum going.\r\n\r\nDahl came from behind to get the win for the senior class.\r\n\r\n“Well, I was practicing last night and I knew that it was hard to get started,” Dahl said. “But once I got going, I knew I was unstoppable.”\r\n\r\nDespite not winning an event, members of the freshman class still had a good time.\r\n\r\n“We weren't exactly experienced, but it was fun nevertheless and I like dressing up,” freshman Lanie Germain said. “The seniors helped us out a bit.”\r\n\r\nThere was a minor disruption during a break between activities when several junior boys ran out onto the field holding a sign containing profanity targeted at the senior class. According to senior Vice President Natalie Maloney, the junior class as a whole will lose sportsmanship points.\r\n\r\nTotal points will be posted at the end of float building on the <a href=\"https:\/\/sites.google.com\/site\/pahsasb\/\">ASB website<\/a>. Spirit Week continues tomorrow with <a href=\"http:\/\/palyvoice.com\/2016\/10\/17\/preview-spirit-week-excitement-to-continue-with-salad-dressing-day\/\" target=\"_blank\">Salad Dressing Day<\/a>. Continue to check the Paly Voice for more updates on Spirit Week 2016.\r\n\r\n<iframe src=\"https:\/\/docs.google.com\/presentation\/d\/1gF2wRG8TPC9ATMY_CrQos30CQENyswcRouy8RXtJKrY\/embed?start=false&amp;loop=false&amp;delayms=3000\" width=\"620\" height=\"620\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The first day of Spirit Week saw the debut of several new activities in addition to some old classics, creating a level playing field for both veteran and rookie competitors. ","date":"2016-10-17 22:07:31","author":"Jackson Doerr","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/DSC_00272.jpg","categories":["News","Spirit Week 2016"],"tags":["90s","boxing","day 1","day one","eye of the tiger","firefighters","spirit week 2016","theme day"]},{"id":124441,"title":"Video: Paly launches Spirit Week 2016","permalink":"http:\/\/palyvoice.com\/2016\/10\/17\/video-paly-launches-spirit-week-2016\/","content":"The Paly Voice documented the first day of Palo Alto High School's Spirit Week 2016. After an exciting brunch, the classes participated in “minute to win it” games including “Banana Bump,” \"Knee Trembler\" and “Pass the Water.”\r\n\r\nMake to sure to check Associated Student Body’s <a href=\"https:\/\/sites.google.com\/site\/pahsasb\/sw2016\">master schedule<\/a> for information on daily events as well as scoring and keep checking the Paly Voice for more <a href=\"http:\/\/palyvoice.com\/category\/spirit-week-2016\/\">Spirit Week<\/a> updates.\r\n\r\n<iframe src=\"https:\/\/www.youtube.com\/embed\/WiL_Scsq98o\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Paly Voice documented the first day of Palo Alto High School's Spirit Week 2016. After an exciting brunch, the classes participated in “minute to win it” games including “Banana Bump,” \"Knee Trembler\" and “Pass the Water.”","date":"2016-10-17 21:27:28","author":"Aisha Chabane","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_96391.jpg","categories":["Spirit Week 2016"],"tags":["90s","paly","spirit","spiritweek2016","themeday"]},{"id":124383,"title":"Preview: Spirit Week excitement to continue with &#8216;Salad Dressing&#8217; day","permalink":"http:\/\/palyvoice.com\/2016\/10\/17\/preview-spirit-week-excitement-to-continue-with-salad-dressing-day\/","content":"[caption id=\"attachment_124477\" align=\"alignnone\" width=\"599\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Junior-Photo.jpg\"><img class=\" wp-image-124477\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Junior-Photo.jpg\" alt=\"Palo Alto High School students cheer during a rally at lunch today on the football field. According to junior class president Jaiveer Sandhu, the rally was a success and an omen of victory for the junior class. &quot;My personal highlight today was during pass that water when the Juniors came in first. That was big and I think it's a sign of more first place wins to come throughout the week.&quot; Photo: Rachel Code\" width=\"599\" height=\"399\" \/><\/a> Palo Alto High School students cheer during a rally at lunch today on the football field. According to Junior Class President Jaiveer Sandhu, the rally was a success and an omen of victory for the junior class. \"My personal highlight today was during 'Pass that Water' when the juniors came in first,\" Sandhu said. \"That was big and I think it's a sign of more first place wins to come throughout the week.\" Photo: Rachel Code[\/caption]\r\n\r\nCan the junior class beat the tropical heat? Will the Roman armies of the senior class reign victorious? Tomorrow, Palo Alto High School students will don all their salad dressing garb and compete in a tug-of-war tournament during the second day of Spirit Week.\r\n\r\nEach grade's theme corresponds to a different type of salad dressing. The freshman theme will be \"Healthy Choice,\" the sophomore theme will be \"Ranch,\" the junior theme will be \"Thousand Island\" and the senior theme will be \"Caesar.\"\r\n\r\nIn addition to dressing up, the classes will compete in a tug-of-war tournament. Each grade's team will be made up of 10 girls and 10 boys, and the first class to pull a flag tied to the rope past a line in the middle will win.\r\n\r\nThe participating grades for the first two rounds will be drawn out of a hat, and the third round will be a match between the two losing classes. The stakes are high, as the winning class will receive 1,500 points, second place will receive 1,200 points, third place will receive 1,000 points and fourth place will receive 800 points.\r\n\r\nJunior class president Jaiveer Sandhu said that he is very excited for the event.\r\n\r\n\"It [Tug-of-war] is one of my favorite events because it's really visual to the crowd,\" Sandhu said. \"It's really in-your-face to the other classes too.\"\r\n\r\nAccording to Sandhu, Paly football players may be unable to participate in the event because of a scheduling conflict.\r\n\r\n\"The football players have film on Monday and Tuesday, so me and Noa [senior class president] went to talk with the football coach today,\" Sandhu said. \"He [Coach Danny Sullivan] said he would talk to other football coaches [about rescheduling film]. ... So there's a chance that we may not have the football players.\"\r\n\r\nMake sure to tag all of your Spirit Week social media posts with #palyspirit for a chance to be featured on The Paly Voice website.","excerpt":"Can the junior class beat the tropical heat? Will the Roman armies of the senior class reign victorious? Tomorrow, Palo Alto High School students will dawn all their salad dressing garb and compete in a tug-of-war tournament during the second day of Spirit Week.","date":"2016-10-17 21:03:57","author":"William Sallomi","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Junior-Photo.jpg","categories":["News","Spirit Week 2016","Spotlight"],"tags":["freshmen","juniors","rally","seniors","Sophomores","Spirit Week","tug of war"]},{"id":124404,"title":"Preview: Spirit Week to kick off with Theme Day","permalink":"http:\/\/palyvoice.com\/2016\/10\/16\/preview-spirit-week-to-kick-off-with-theme-day\/","content":"The most anticipated week of the year, Spirit Week, kicks off this Monday at Palo Alto High School with Theme Day.\r\n\r\nOn Theme Day, students from each grade dress up based on a theme voted on by their class. Each theme corresponds with each class’ color: orange for freshmen, red for sophomores, yellow for juniors and green for seniors.\r\n\r\nThis year, the freshman theme is “Eye of the Tiger,” the sophomore theme is “Firefighters,” the junior theme is “Boxing” and the senior theme is “Game Over.” Rather than wearing clothes that correspond to their theme, due to Paly tradition, seniors instead wear 90s apparel on Monday.\r\n\r\nThis year, Spirit Week festivities open at lunch on the football field with the lunchtime rally, which will feature three main events: Knee Trembler, Banana Bump and Pass the Water.\r\n\r\nKnee Trembler, a new event to Paly Spirit Week, is a mini relay race consisting of three students from each grade. Using only their knees, students must pick up an orange and hop over to a hula hoop placed on the ground. Whoever has placed the most oranges in the hoop at the end of a minute will win.\r\n\r\nFollowing the Knee Trembler game, the Banana Bump event will take place. This time, only one student from each grade will participate. The student will have a banana tied around his or her waist and must bump an orange, using the banana, past the finish line.\r\n\r\n\"The other new game is Pass the Water,\" ASB Spirit Commissioner Michaela Fogarty said. \"Participants line up and transfer water from one bucket to another by passing it to each other over their heads with cups. The grade with the most water in the final bucket wins.\"\r\n\r\nAccording to Fogarty, the results of the events are unpredictable.\r\n\r\n\"None of the grades are projected to win any of the games,\" Fogarty said. \"It should be very competitive and exciting to watch.\"\r\n\r\nIn addition to the points awarded for the events, class cheers and scores for best dressed will award each grade with extra points. Cheers at each rally can earn up to 800 points for first place and up to 500 points for the best dressed contest.\r\n\r\nUp to 150 points of deductions are possible for sportsmanship and cleanliness.\r\n\r\nFor more information on lunchtime rallies and the Spirit Week scoring system, refer to the <a href=\"https:\/\/sites.google.com\/site\/pahsasb\/sw2016\" target=\"_blank\">ASB master schedule<\/a>. And don't forget to use #palyspirit on all of your social media posts for a chance to have it featured on the Paly Voice website.","excerpt":"The most anticipated week of the year, Spirit Week, kicks off this Monday at Palo Alto High School with Theme Day.","date":"2016-10-16 21:28:00","author":"Isabella Marcus","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/10\/DSC_0197.jpg","categories":["News","Spirit Week 2016","Spotlight"],"tags":["#palyspirit","#spiritweek","90s","boxing","eye of the tiger","firefighters","palo alto high school","paly","paly spirit week","Spirit Week"]},{"id":124407,"title":"Use the hashtag #palyspirit to have your Spirit Week photos featured on the Paly Voice","permalink":"http:\/\/palyvoice.com\/2016\/10\/16\/use-the-hashtag-palyspirit-to-have-your-spirit-week-photos-featured-on-the-paly-voice\/","content":"","excerpt":"","date":"2016-10-16 15:59:14","author":"Chirag Akella","categories":["Ticker"],"tags":[]}]