[{"id":124801,"title":"Football falls to Los Gatos in Homecoming game","permalink":"http:\/\/palyvoice.com\/2016\/10\/22\/football-falls-to-los-gatos-in-homecoming-game\/","content":"[caption id=\"attachment_124938\" align=\"alignnone\" width=\"750\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/los-altos-v-pa.jpg\"><img class=\"size-full wp-image-124938\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/los-altos-v-pa.jpg\" alt=\"Senior wide receiver Nick Smallwood prepares for the snap. Paly would go on to lose to Los Gatos 35-6. Photo: Jackson Doerr\" width=\"750\" height=\"499\" \/><\/a> Palo Alto High School senior wide receiver Nick Smallwood prepares for the snap. Paly would go on to lose to Los Gatos High School, 35-6 on Friday night at home. Photo: Jackson Doerr.[\/caption]\r\n\r\nThe Palo Alto High School Vikings football team (3-5, 2-2) is fighting for a spot in the De Anza league playoffs after losing its homecoming game against the Los Gatos Wildcats (4-3, 3-0), 35-6, last night on the Paly football field.\r\n\r\nThe game was an ordeal for the Vikings, who struggled to put the Wildcats' strong offense on hold, throughout the entirety of the game.\r\n\r\nJust five minutes into the game, the Wildcats broke through the Paly defense to score the first touchdown of the game. The rest of the first quarter was a scoreless standoff, and the ball did not leave Paly's half.\r\n\r\nIn the second quarter, Los Gatos gained 96 yards in ten plays over the course of two minutes and 12 seconds, and added another Wildcat touchdown to the scoreboard.\r\n\r\nOn the very next play, a player from each team was ejected for personal fouls, including Paly junior offensive lineman Bryant Jefferson.\r\n\r\nSullivan said he disagrees with the call and he believes that the skirmish was not grounds for ejection of either player.\r\n\r\n\"It was just an overreaction to the play,\" Sullivan said. \"I was looking at it the whole time and I don't think anybody should have gotten ejected, including their kid.\"\r\n\r\nLos Gatos would go on to score twice in the 3rd and once in the 4th, bringing the score to 35-0. But with three minutes left in the game, Paly was able to get a touchdown, preventing the Wildcats from securing a shutout win.\r\n\r\nAccording to Sullivan, Paly struggled with performing smaller plays.\r\n\r\n\"We started moving the ball but we hit a wall,\" Sullivan said. \"Simple execution on little things is the difference between the two scores so we've got to get better at doing that.\"\r\n\r\nAccording to Sullivan, the Vikings will continue to focus on working the kinks out of their play.\r\n\r\n\"It's just doing the fine tuning that we really have to focus on,\" Sullivan said. \"We've gotten so much better over the course of the season and we're only going to keep getting better.\"\r\n\r\nSullivan said the season is far from over, and the Vikings are in competition for a spot in the playoffs.\r\n\r\n\"We're playing for a playoff spot in these next two weeks,\" Sullivan said. \"Next week is a bye week. We need to get a couple things neatened up and then it's off to Mountain View.\"\r\n\r\nAccording to Sullivan, the Week Nine bye is a blessing in disguise.\r\n\r\n\"We were looking at it and Week Nine looks like the worst time for a bye,\" Sullivan said. \"[However,] It comes at a perfect time because we need to jump back on the horse.\"\r\n\r\nThe Vikings will fight for a spot in the playoffs against the Mountain View High School Spartans (6-3, 3-2) at 7:00pm on Nov. 4 at Mountain View.","excerpt":"The Palo Alto High School Vikings football team (3-5, 2-2) are fighting for a spot in the De Anza league playoffs after losing their homecoming game against the Los Gatos Wildcats (4-3, 3-0) 35-6 last night on the Paly football field.","date":"2016-10-22 16:56:02","author":"William Sallomi","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/los-altos-v-pa.jpg","categories":["Football","Sports"],"tags":["danny sullivan","football","paul jackson iii","sports"]},{"id":124911,"title":"Video: Spirit Week Day 5 ends with dazzling performances","permalink":"http:\/\/palyvoice.com\/2016\/10\/22\/video-spirit-week-day-5-ends-with-dazzling-performances\/","content":"The Paly Voice documented the fifth and final day of Palo Alto High School's Spirit Week. \"Paly Spirit Day\" featured the exciting \"Hula Hoop\" race at the lunch rally, as well as the unveiling of class floats and class dance performances after school\r\n\r\nFinal scores for Spirit Week will be released today during the Homecoming dance at Gunn High School. Check The Paly Voice for more updates on Spirit Week 2016 under the new <a href=\"http:\/\/paly.io\/spiritweek16\" target=\"_blank\">Spirit Week tab<\/a>.\r\n\r\nhttps:\/\/www.youtube.com\/watch?v=2mTWglu122M&feature=youtu.be\r\n\r\n&nbsp;","excerpt":"The Paly Voice documented the fifth and final day of Palo Alto High School's Spirit Week. \"Paly Spirit Day\" featured the exciting \"Hula Hoop\" race at the lunch rally, as well as the unveiling of class floats and class dance performances after school","date":"2016-10-22 15:09:58","author":"Julia Qiao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Screen-Shot-2016-10-22-at-1.35.30-PM.png","categories":["Multimedia","Spirit Week 2016","Video"],"tags":["2016","day 5","paly","paly spirit week 2016","Spirit Week"]},{"id":124859,"title":"Seniors end final day of Spirit Week strong","permalink":"http:\/\/palyvoice.com\/2016\/10\/22\/seniors-end-final-day-of-spirit-week-strong\/","content":"<iframe src=\"https:\/\/docs.google.com\/presentation\/d\/1UUiFKcxomE6tZZ0IZIFTc8SkKQQfBwlz3BEhXVKkdTs\/embed?start=false&amp;loop=false&amp;delayms=5000\" width=\"650\" height=\"400\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\nPalo Alto High School students await the final results for Spirit Week 2016, after the last day featured both a lunch and after school rally.\r\n\r\nDuring this final day of Spirit Week, freshmen, sophomores and juniors all sported Paly colors and Viking gear while the seniors wore camouflage as part of a Paly tradition.\r\n\r\nToday's lunch rally featured the Hula Hoop Chain race, where participants stood in a line holding hands in an attempt to maneuver a hula hoop from one side of the line to the other.\r\n\r\nIn the first round, the seniors easily beat the freshman team, and the juniors triumphed over the sophomores. The final round between the two upperclassmen teams came down to the last second, but a last minute error from the juniors led to seniors to victory.\r\n\r\nJunior and Hula Hoop Chain participant Will Schmutz, though content with his team's overall performance, discussed what went wrong in the final round.\r\n\r\n“If we had better executed our game plan, we would have beaten the seniors,\" Schmutz said.\r\n\r\nThe lunch rally ended with teachers breaking it down with their own prepared spirit dance. During their dance, however, a <a href=\"http:\/\/palyvoice.com\/2016\/10\/21\/streaker-disrupts-friday-lunch-rally\/\">streaker<\/a> ran across the football field and escaped into a getaway car.\r\n\r\nPer Paly tradition, Spirit Week concluded with an after school rally, where each grade presented a float and a spirit dance.\r\n\r\nSenior Tanner Newell expressed his pride in both his float and his class.\r\n\r\n“It was a lot of hard work, but I'm proud of how my class pulled together and made this amazing float,” Newell said.\r\n\r\nWhile the final standings for the four floats are still to be determined, the senior class performed its winning dance during halftime of the <a href=\"http:\/\/palyvoice.com\/2016\/10\/21\/liveblog-homecoming-football-game-against-los-gatos\/\" target=\"_blank\">homecoming game<\/a>. The dance results for the remaining freshmen, sophomores and juniors have not yet been announced.\r\n\r\nAs of now, the current overall standings remain in grade order. The seniors are in lead with 10800 points, the juniors in second with 10050, followed by sophomores and freshmen with 9595 and 6595, respectively.\r\n\r\nFinal overall results and the winning class of Spirit Week 2016 will be announced tonight at the homecoming dance.","excerpt":"Palo Alto High School students await the final results for Spirit Week 2016, after the last day featured both a lunch and after school rally.","date":"2016-10-22 14:31:29","author":"Maya Reuven","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/14812839_593287490876233_1083444871_o.jpg","categories":["News","Spirit Week 2016","Spotlight"],"tags":["final rally","floats","newell","spirit dance","Spirit Week","spirit week 2016"]},{"id":124737,"title":"Spirit Week Day Four results","permalink":"http:\/\/palyvoice.com\/2016\/10\/21\/spirit-week-day-four-results-3\/","content":"With one more day of Spirit Week left remaining, the seniors are in the lead with 9,200 points and the juniors are in second place, 650 points behind. Despite scoring higher than the seniors in both the Pool Ring Toss and Name That Tune,  the sophomore class is still in third place, leaving the freshmen in last.\r\n\r\nThe theme for Day Four was \"Generations,\" and the senior class won best dressed for its senior citizen dress-up. Cheers remained a competition between the juniors and seniors, with the seniors emerging victorious.\r\n\r\nCheck back later today as The Paly Voice continues its coverage for the last day of Spirit Week.\r\n<div class=\"piktowrapper-embed\" style=\"height: 300px; position: relative;\">\r\n<div class=\"embed-loading-overlay\" style=\"width: 100%; height: 100%; position: absolute; text-align: center;\">\r\n\r\n<img style=\"margin-top: 100px;\" src=\"https:\/\/magic.piktochart.com\/loading.gif\" alt=\"Loading...\" width=\"60px\" \/>\r\n<p style=\"margin: 0; padding: 0; font-family: Lato, Helvetica, Arial, sans-serif; font-weight: 600; font-size: 16px;\">Loading...<\/p>\r\n\r\n<div class=\"pikto-canvas-wrap\">\r\n\r\n<script>\/\/ <![CDATA[\r\n(function(d){var js, id=\"pikto-embed-js\", ref=d.getElementsByTagName(\"script\")[0];if (d.getElementById(id)) { return;}js=d.createElement(\"script\"); js.id=id; js.async=true;js.src=\"https:\/\/magic.piktochart.com\/assets\/embedding\/embed.js\";ref.parentNode.insertBefore(js, ref);}(document));\r\n\/\/ ]]><\/script>\r\n\r\n\r\n\r\n","excerpt":"With one more day of Spirit Week left remaining, the seniors are in the lead with 9,200 points and the juniors are in second place, <a href=\"http:\/\/palyvoice.com\/2016\/10\/21\/spirit-week-day-four-results-3\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2016-10-21 18:16:20","author":"Maya Akkaraju","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/DSC_0105.jpg","categories":["Uncategorized"],"tags":[]},{"id":124786,"title":"Streaker disrupts Friday lunch rally","permalink":"http:\/\/palyvoice.com\/2016\/10\/21\/streaker-disrupts-friday-lunch-rally\/","content":"Amid the craze of the final lunch rally of Palo Alto High School’s Spirit Week, a student streaked across the football field during the teacher dance.\r\n\r\nThe student ran from the north side of the football field toward Churchill Avenue and hopped the fence. Assistant Principal Jerry Berkson, Assistant Principal Adam Paulsen and Campus Supervisor Scott Reese chased the streaker into the Southgate neighborhood.\r\n\r\n“The streaker came to the fence, had to make an adjustment because I was right there, made an adjustment, and took off down Castilleja,” Berkson said. “There was a getaway car waiting.”\r\n\r\nThe streaker was not caught in the act, but the administrators in pursuit wrote down the getaway car’s license plate number, according to Berkson.\r\n\r\n“We have to run the license plate,” Berkson said. “Whether we got it accurately [or not] is another story. We’ll go from there.”\r\n\r\nAccording to Student Activities Director Matt Hall, streaking is inadmissible.\r\n\r\n“It was regrettable,” Hall said. “I disagree with that type of behavior [streaking] during Spirit Week.”\r\n\r\nThe incident was distracting and detracted from the teacher dance, according to junior Spirit Commissioner Claire Billman.\r\n\r\n“It was unfortunate timing because it was the staff’s chance to show what they’ve been working so hard on, so it kind of took away from that,” Billman said.\r\n\r\nSome students, such as freshman Miranda Wiener, find streaking to be disruptive, especially considering the illegality of the act.\r\n\r\n“It’s really disturbing,” Wiener said. “It is counted as sexual harassment, so it’s really not a good thing to do, especially if people came out here to have a good time.\"\r\n\r\n&nbsp;","excerpt":"Amid the craze of the final lunch rally of Palo Alto High School’s Spirit Week, a student streaked across the football field during the teacher dance.","date":"2016-10-21 14:29:43","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/DSC_0123.jpg","categories":["News","Spirit Week 2016","Spotlight"],"tags":["Berkson","Billman","friday","hall","kamarei","lunch rally","paulsen","Spirit Week","spirit week 2016","streaker","streaking"]},{"id":124695,"title":"Committee to address bell schedule, C-days","permalink":"http:\/\/palyvoice.com\/2016\/10\/21\/committee-to-address-bell-schedule-c-days\/","content":"The Palo Alto High School administration is forming a new Bell Schedule Review Committee, which will consider changing the current bell schedule for the 2017-18 school year.\r\n\r\nAccording to Principal Kim Diorio, the administration created this committee to deal with the stress that goes along with C-days.\r\n\r\n\"On C-days there is no consistency,\" Diorio said. \"There is still this issue of test stacking and homework load and students say that block days are better because at least on a block day you only have a few classes.\"\r\n\r\nAccording to Diorio, the committee will consist of parents, students and teachers from different backgrounds in order to create a balanced decision-making process. In the coming days, Diorio will send out an email detailing the application process to be on the committee.\r\n\r\n“The email will have a quick application about the committee,\" Diorio said. \"We want to have students on the committee, about five to six parents, a staff member representing each department and maybe someone from the counseling department and one administrator so it will be fairly balanced. I also want a facilitator who will be neutral to help the process.”\r\n\r\n<span style=\"font-weight: 400;\">The idea for such a committee came about two years ago as a response to the <\/span><span style=\"font-weight: 400;\"><a href=\"http:\/\/www.paly.net\/sites\/default\/files\/PalyWASC1415_Feb23.pdf\">Western Association of Schools and Colleges Visiting Committee<\/a>’s recommendation to reevaluate the C-day bell schedule.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“<\/span><span style=\"font-weight: 400;\">We [Paly Admin] were doing a lot of surveys and focus groups and hearing from students about C-days and realizing that some things don't work for kids,” Diorio said. <\/span>\r\n\r\nPaly students are encouraged to fill out an application and apply to be a part of the committee. The <a href=\"https:\/\/docs.google.com\/forms\/d\/e\/1FAIpQLScY61XPGmUcwLAUeWHd9ZqVWODy3lC2Cn3aE_69FUi2H0dgPw\/viewform?c=0&amp;w=1\">application<\/a> is due on Nov. 4.\r\n\r\n\"We will choose applicants who can commit to dates and times,\" Diorio said. \"We want to make sure to represent different types of students to have a good cross representation.”","excerpt":"Palo Alto High School Administration is forming a new Bell Schedule Review Committee which will consider changing the current bell schedule.","date":"2016-10-21 13:40:25","author":"Aisha Chabane","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/12\/Screen-shot-2013-12-20-at-12.59.22-PM.png","categories":["News","Spotlight"],"tags":["c day","diorio","paly","schedule","WASC"]},{"id":124753,"title":"Video: Senior citizens keep youngsters in check","permalink":"http:\/\/palyvoice.com\/2016\/10\/21\/video-senior-citizens-keep-youngsters-in-check\/","content":"The Paly Voice filmed the fourth day of Palo Alto High School’s Spirit Week 2016 which consisted of the tube toss competition and a \"Name that Tune\" game during the lunch rally.\r\n\r\nMake to sure to check Associated Student Body’s <a href=\"https:\/\/sites.google.com\/site\/pahsasb\/sw2016\">master schedule<\/a> for information on daily events as well as <a href=\"http:\/\/palyvoice.com\/2016\/10\/18\/spirit-week-day-two-results-3\/\" target=\"_blank\">scoring<\/a>. Check the Paly Voice for more updates on Spirit Week 2016 under the new <a href=\"http:\/\/paly.io\/spiritweek16\" target=\"_blank\">Spirit Week tab<\/a>.\r\n\r\nhttps:\/\/youtu.be\/PPLlMWtf4Us","excerpt":"The Paly Voice filmed the fourth day of Palo Alto High School’s Spirit Week 2016 which consisted of the tube toss competition and a \"Name that Tune\" game during the lunch rally.\r\n","date":"2016-10-21 09:31:58","author":"Sam Lee","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Screen-Shot-2016-10-20-at-7.31.48-PM.png","categories":["Multimedia","Spirit Week 2016","Spotlight","Video"],"tags":["2016","day 4","Generations day","lunch rally","name that tune","paly","seniors","Spirit Week","tube toss","video","vikings"]},{"id":124756,"title":"Liveblog: Homecoming football game against Los Gatos","permalink":"http:\/\/palyvoice.com\/2016\/10\/21\/liveblog-homecoming-football-game-against-los-gatos\/","content":"Check back here at 7 p.m as the Palo Alto High School Vikings take on the Los Gatos Wildcats for both their homecoming and senior night football game.\r\n\r\n[liveblog]","excerpt":"Check back here at 7 p.m as the Palo Alto High School Vikings take on the Los Gatos Wildcats for both their homecoming and senior night football game.","date":"2016-10-21 09:31:19","author":"Jackson Doerr","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/DSC_0115.jpg","categories":["Football","Spirit Week 2016","Sports","Spotlight"],"tags":["football game","homecoming","liveblog","Senior Night","spirit week 2016"]},{"id":124684,"title":"Preview: Spirit Week to conclude with Paly Pride Day","permalink":"http:\/\/palyvoice.com\/2016\/10\/20\/preview-spirit-week-to-conclude-with-paly-pride-day\/","content":"Students will show off their school pride on the last day of Palo Alto High School’s Spirit Week 2016 this Friday. The last day will feature school-wide unity with freshmen, sophomores and juniors dressing in green and white while seniors will wear camouflage attire.\r\n\r\nAccording to the Paly Associated Student Body<a href=\"https:\/\/sites.google.com\/site\/pahsasb\/sw2016\"> website<\/a>, rallies will be held during lunch and after school on the football field.\r\n\r\nThe teacher dance will kick off the lunch rally followed by the lunch activity where the grades will face off in the “Hula Hoop” competition.\r\n\r\nThe lunch activity, “Hula Hoop,” will consist of teams passing a hula hoop through a line of people holding hands. There will be four rounds and the first class to sit down after every round will win the event, according to the ASB website.\r\n\r\nThe final Spirit Week rally will kick off after school, and will feature spirit dances and floats, according to the ASB website. The floats will be judged on their stuffing, theme, creativity and overall look. The class with the best float will be awarded 1,000 points.\r\n\r\nAccording to the ASB website, the spirit dances will be judged on artistry, execution, theme and overall look. The class with the best dance will also be awarded 1,000 points. Each team must have at least five girls and five boys, and grades will be awarded five points for every dancer.\r\n\r\nThe Paly Voice spoke with junior Mattie Orloff about her thoughts on the junior's float and spirit dance chances.\r\n\r\n\"I think that both the float and dance are going well. The dance looks really cool, we have good music and boxing moves,\" Orloff said.\r\n\r\nScores from the week will be added up on Friday by ASB officers and the final tally will be revealed at the Homecoming Dance.\r\n\r\nAccording to senior Annalise Wang, the last day of Spirit Week is a great way to unify the grades.\r\n\r\n\"I'm really excited because Friday is the day that all of the grades come together and I know that there is a lot of competition but the last day is all about all the grades coming together,\" Wang said.","excerpt":"Students will show off their school pride in the last day of Palo Alto High School’s Spirit Week 2016 this Friday. The last day will feature school-wide unity with freshmen, sophomores and juniors dressing in green and white. Seniors will wear camouflage attire.","date":"2016-10-20 20:45:28","author":"Bradley Smith","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Screen-Shot-2016-10-20-at-8.36.20-PM.png","categories":["News","Spirit Week 2016","Spotlight"],"tags":["#day5","#palyspirit","#spiritdance","floats"]},{"id":124698,"title":"Recap: Juniors, sophomores claim victory at Thursday rally","permalink":"http:\/\/palyvoice.com\/2016\/10\/20\/recap-juniors-sophomores-claim-victory-at-thursday-rally\/","content":"Palo Alto High School sophomores and juniors are celebrating after success today in the lunchtime rally events.\r\n\r\nAs today was Generation Day, the seniors arrived with canes in hand and dressed as senior citizens, the juniors dressed as sophisticates in suits, the sophomores as teeny boppers, and finally the freshmen in oversized onesies as babies.\r\n\r\nThe rally featured two games, “Pool Ring Toss” and “Name That Tune.” In the first game, students attempted to land a pool ring over the head of their partners standing opposite of them without letting the rings touch their hands. In the second event, groups of four students from each grade attempted to guess songs playing on a loudspeaker and run ran their answers to the judges in the center of the football field.\r\n\r\nJuniors trounced the seniors in the first round of the ring toss, while the sophomores defeated the freshmen. The seniors then narrowly beat the freshmen in the final round of the ring toss to place 3rd, while the juniors defeated the sophomores and placed 1st in a tight race.\r\n\r\nSenior Fe Hmelar said she was disappointed with the outcome of the ring toss, but is confident that the seniors will come out on top in the end.\r\n\r\n“People tried their best and we still had a lot of fun in the stands,” Hmelar said. “I am confident that we will make a comeback tomorrow.”\r\n\r\nFor the event “Name that Tune,” each grade energetically sent representatives running to the judges, the quick thinking juniors and sophomores came out on top.\r\n\r\nSophomore Zharit Brand says she hopes her grade can continue to perform well at rallies.\r\n\r\n“I think we did pretty well today but we need to be a little louder for sure,” Brand said.\r\n\r\nSenior Dalia van Zyll, who competed in Name That Tune, says that is was difficult for the seniors to return at full force after the Night Rally last night.\r\n\r\n“There were no communication issues, but we were just not able to write down the songs quickly enough,” van Zyll said. “We knew all of the songs but one, we just couldn’t get it down.”\r\n\r\nVan Zyll remains confident that the seniors will win Spirit Week overall, but highlights the importance of unity between all grades.\r\n\r\n“We’re definitely going to come back from out our losses today,\" van Zyll said. \"I think Spirit Week is about unity and having a good time so even if we can’t win everything, I think in the end we’re all winners.”\r\n\r\n<iframe src=\"https:\/\/docs.google.com\/presentation\/d\/1erGiJw1Sgb05Dix8n3JMy_F2cA2PFWjd8wmx_PruQUo\/embed?start=false&amp;loop=false&amp;delayms=3000\" width=\"900\" height=\"629\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School sophomores and juniors are celebrating after success today in the lunchtime rally events.\r\n","date":"2016-10-20 19:49:43","author":"Emilia Diaz-Magaloni","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Screen-Shot-2016-10-20-at-7.31.48-PM.png","categories":["News","Spirit Week 2016"],"tags":["fun","game","palo alto high school","paly","pool ring","rally","spirit","Thursday","week","wild thornberries"]}]