[{"id":126598,"title":"New journalism app to feature Paly publications","permalink":"http:\/\/palyvoice.com\/2016\/11\/28\/new-journalism-app-to-feature-paly-publications\/","content":"Students are now able to download a new Palo Alto High School journalism iOS application released Monday called \"Paly Journalism\". The app was developed by Stanford University's Transformative Learning Technologies Lab in conjunction with the Paly journalism program.\r\n\r\nAccording to a press release from study leader Chris Proctor, the app will allow students to contribute to a student-only online forum where articles from The Paly Voice, Verde Magazine, Viking Magazine and The Campanile can be discussed.\r\n\r\nProctor, a former Paly English teacher and current PhD student in education at Stanford, says that the app will be part of a field study, and that the app will be donated to the Paly journalism program if it is found successful.\r\n\r\n\"The field trial will run through winter break; during this time we hope to gain a large base of users reading Paly journalism content on the app and discussing the stories through comments,\" Proctor said.\r\n\r\nProctor worked on developing the app with Paly seniors Daniel Li and Adrienne Kwok and juniors Norman Karr, Saurin Holdheim, Julia Qiao and Stephanie Lee. Journalism advisers Paul Kandell and Esther Wojcicki provided additional support.\r\n\r\n\"I chose to get involved because I was interested in helping to develop a real app,\" Karr said. \"It was pretty cool as it brought together all the Paly Publications [that gave permission] into one place.\"\r\n\r\nThe development of the app was fueled by a Stanford research study on schools' relations to their \"digital campuses,\" according to the press release. The release statement adds that while these spaces are important for learning and allowing students to express their own opinions, they are often discouraged by schools as they are feared as distractions from learning in the classroom.\r\n\r\n\"My hypothesis is that supporting powerful student identities in those spaces will be one way schools can structure them as safe and effective spaces for learning,\" Proctor said. \"I see Paly's student journalism program as potentially an excellent example of this dynamic; the app is designed to increase the impact of Paly's student journalism on the school community by increasing readership and reader engagement.\"\r\n\r\n&nbsp;","excerpt":"Students are now able to download a new Palo Alto High School journalism iOS application released Monday called \"Paly Journalism\". The app was developed by Stanford University's Transformative Learning Technologies Lab in conjunction with the Paly journalism program.","date":"2016-11-28 22:14:14","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/DSC_0006.jpg","categories":["News","Spotlight","Uncategorized"],"tags":["app","campanile","cmag","forum","journalism","paly","proctor","stanford","study","verde","viking","voice"]},{"id":126505,"title":"Verbatim: What are you thankful for?","permalink":"http:\/\/palyvoice.com\/2016\/11\/25\/verbatim-what-are-you-thankful-for\/","content":"Palo Alto High School students and staff are celebrating Thanksgiving break during these few days off. The Paly Voice asked various students and staff what they have come to appreciate most this year.\r\n<img class=\"alwaysThinglink\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/857670744019042306\/1024\/10\/scaletowidth#tl-857670744019042306;1043138249'\" alt=\"\" width=\"667\" height=\"667\" \/>\r\n\r\n<script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script>","excerpt":"Palo Alto High School students and staff are celebrating Thanksgiving break during these days off. The Paly Voice asked various students and staff what they have come to appreciate most this year.\r\n","date":"2016-11-25 16:16:40","author":"Zahra Muzaffar","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/15146685_10210235704545753_1042279418_o.jpg","categories":["Multimedia","Spotlight","Uncategorized","Verbatims"],"tags":["2016","give thanks","paly","Staff","students","thanful","thanksgiving","turkey","verbatim"]},{"id":126437,"title":"Boys&#8217; basketball seeks improvement with familiar faces","permalink":"http:\/\/palyvoice.com\/2016\/11\/23\/boys-basketball-seeks-improvement-with-familiar-faces\/","content":"[caption id=\"attachment_115475\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_58031-1.jpg\"><img class=\"size-full wp-image-115475\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_58031-1.jpg\" alt=\"Senior guard Miles Tention rises up to take a outside three in the third quarter against Gunn High School at Gunn during the 2015-2016 season. The Vikings went on to win 74-56. Photo by Jack Stoksik.\" width=\"800\" height=\"533\" \/><\/a> Senior guard Miles Tention rises up to take a outside three in the third quarter against Gunn High School at Gunn. The Vikings went on to win 74-56. Photo by Jack Stoksik.[\/caption]\r\n\r\nThe Palo Alto High School boys' varsity basketball team expects to bounce back from a disappointing Central Coast Section (CCS) playoff quarterfinal exit during the 2015-16 season.\r\n\r\nSeniors Miles Tention and Jack Simison are returning to the starting lineup along with juniors Max Dorward and William Schlemmer. Replacing last year's sole senior, Justin Hull, is junior guard Jared Wulbrun.\r\n\r\nExperienced head coach Peter Diepenbrock says the team will thrive off of its returning core players.\r\n\r\n\"The nucleus of the team is largely the same from last year,\" Diepenbrock said. \"But we are one year more experienced.\"\r\n\r\nAfter an unexpected, 54-50, loss to Cupertino High School in the quarter finals of CCS last year, junior guard and three year veteran Max Dorward is fired up to make a deep CCS playoff run.\r\n\r\n\"Last year was disappointing when we lost to Cupertino because they were a very beatable team,\" Doward said. \"We knew we were the better team and knew we had a chance to win it all. I'm very excited to be playing with almost all the same guys this year and to make a deep playoff run.\"\r\n\r\nDorward said the team has gelled over the years, and is ready to leave it all on the court.\r\n\r\n\"We've definitely improved on the aspect of playing with each other,\" Dorward said. \"We've played together for a while now so things seem to be clicking on the court.\"\r\n\r\nSimison said he is pumped for his final year of Paly basketball, and believes that the team's depth will give the Vikings a better shot at the league title and beyond.\r\n\r\n\"I'm excited for the entire season, every single game,\" Simison said. \"We have more players this year that give us a deeper bench and more rest for our starters. This year we plan to win league and get into the open division for CCS.\"\r\n\r\nSchlemmer said he wants to see the stands filled, as this year's team is guaranteed to impress.\r\n\r\n\"Everyone should come watch the games this year because I think this is the best Paly basketball team there has been in a long time,\" Schlemmer said.\r\n\r\nWith one of the top point guards in the De Anza League in Tention, an experienced lineup and the leadership of Diepenbrock, the Vikings are primed to kick off their league season on Jan. 3 against Milpitas High School at Gunn High Schoo","excerpt":"The Palo Alto High School boys' varsity basketball team looks to bounce back from a disappointing Central Coast Section (CCS) playoff quarterfinal exit during the 2015-16 season.","date":"2016-11-23 22:48:53","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_58031-1.jpg","categories":["Basketball","Sports","Spotlight","Uncategorized"],"tags":["basketball","cupertino","diepenbrock","dorward","palo alto","preview","schlemmer","season","simison","tention","vikings"]},{"id":126329,"title":"Season Recap: Football&#8217;s future looks bright with young talent","permalink":"http:\/\/palyvoice.com\/2016\/11\/21\/season-recap-footballs-future-looks-bright-with-young-talent\/","content":"<span style=\"font-weight: 400;\">The Palo Alto High School Football team wrapped up its season with a 4-7 overall record and 3-3 league record after a loss to the Los Gatos High School Wildcats (8-3, 6-0) in the first round of the Central Coast Section playoffs.<\/span>\r\n\r\nThe Vikings were carried throughout the season by junior running back Paul Jackson III who accumulated 1266 rushing yards on 222 carries, along with a team leading 12 rushing touchdowns.\r\n\r\nThe season looked promising for the Vikings, who who started off with a 25-12, victory over Patterson High School in the first game of the year.\r\n\r\nSophomore quarterback Jackson Chryst took over at the head of the offense following a concussion to senior starting quarterback Jordan Schilling in the Vikings' week two loss to San Benito High School.\r\n\r\nAccording to head coach Danny Sullivan, the future of the team was set forth from this years' graduating seniors.\r\n\r\n\"We are going to miss some key senior talent and leadership,\" Sullivan said. \"The examples that this year's senior class set is something that I will remember forever. They had to deal with change and they bought into what we are trying to accomplish.\"\r\n\r\nA highlight of the season included defeating the Wilcox Chargers (5-6, 4-2) during a regular season league matchup. The Chargers went on to finish second in the De Anza League.\r\n\r\n\"They were the No. 1 team in the league at the time and we won,\" Schilling said. \"That was one of the best games in my playing career.\"\r\n\r\nThe Vikings' finished fourth in the De Anza League, which secured them a spot in CCS playoffs.\r\n\r\nDespite the early CCS loss, Vikings' first year head coach Danny Sullivan looks forward to next season.\r\n\r\n\"In my first year at Paly, there were some definite challenges by being a new face to the area,\" Sullivan said. \"I am thankful that the school and the players that stuck it out through the season welcomed me to be a part of the program. There were some lows, along with some very big highs for our team this season. Definitely some things that the kids coming up through the ranks can build on for next season.\"\r\n\r\nThe Vikings look to make a mark next year by starting preparation for the 2017 season soon.\r\n\r\n\"Workouts in the weight room to build strength and conditioning are going to begin in late January,\" Sullivan said. \"We have a goal to show people how much we can improve from one season to the next. In talking with many other coaches around the area, the word is out about how we do things here at Paly. They all know that if the work gets put in, we are a team to be reckoned with in 2017.\"\r\n\r\nAccording the Schilling, the future of Paly football looks promising.\r\n\r\n\"I really think the team as whole improved week to week,\" Schilling said. \"This year was tough because we had to learn a whole new offense and adjust to a new system.\"\r\n\r\nThe team will depend on the talents of sophomore quarterback Jackson Chryst, junior running back Paul Jackson III and junior lineman Bryant Jefferson for leadership in the coming season.\r\n\r\n\"Our program can take drastic strides next season if junior Bryant Jefferson can continue to improve and if sophomore Jackson Chryst can grow as a player on the field,\" Sullivan said. \"If those two have a successful offseason, the rest of the team will follow their lead.\"","excerpt":"The Palo Alto High School Football team wrapped up its season with a 4-7 overall record and 3-3 league record after a loss to the Los Gatos High School Wildcats (8-3, 6-0) in the first round of the Central Coast Section playoffs.","date":"2016-11-21 21:27:46","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/los-altos-v-pa.jpg","categories":["Football","Sports"],"tags":["CCS","danny sullivan","football","jackson chryst","jordan schilling","palo alto","Paly football","recap","season","Sullivan","vikings"]},{"id":126113,"title":"Season Preview: Girls basketball seeks to avenge last season&#8217;s early NorCal exit","permalink":"http:\/\/palyvoice.com\/2016\/11\/21\/season-preview-girls-basketball-seeks-to-avenge-last-seasons-early-norcal-exit\/","content":"[caption id=\"attachment_115295\" align=\"alignright\" width=\"386\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/julie-jumpman.jpg\"><img class=\" wp-image-115295\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/julie-jumpman.jpg\" alt=\"Junior forward Julie Chandler leaps in the air as she goes up for an acrobatic layup against Gunn late in the fourth quarter on Friday at Gunn. The Vikings beat the Titans, 40-28. Photo by Sam Lee.\" width=\"386\" height=\"352\" \/><\/a> Senior forward Julie Chandler leaps in the air as she goes up for an acrobatic layup against Gunn late in the fourth quarter last year at Gunn. The Vikings beat the Titans, 40-28, on January 29th, 2016. Photo by Sam Lee.[\/caption]\r\n\r\nAfter a 1st place finish in the CCS playoffs and a first round NorCal loss, the Palo Alto High School girls' basketball team hopes to return to CCS finals.\r\n\r\nThe girls' team dominated leagues last year, posting an overall record of 19-8, en route to winning CCS. The girls team fell to Dublin High School Gaels, 55-49, in the first round of NorCals.\r\n\r\nSenior and fourth year guard Lauren Koyama hopes to put last year's early NorCal exit behind her, and is ready to start the season this winter.\r\n\r\n\"Getting eliminated early definitely hurt last year, but right now we are focused on getting through preseason and league.\" Koyama said. \"We want to peak in February, and we just have to take it one game at a time.\"\r\n\r\nLed by seniors Koyama and Skylar Burris, the team is looking to fill the gaps left by last year's seniors: Maddy Atwater, Alexis Harris, and Courtney Lovely.\r\n\r\n\"We lost three starters last year, one of them being our main source of height on the court. In order to adapt we need to work hard for every rebound and bring the energy that our seniors last year brought [to] every game,\" Burris said.\r\n\r\nThe loss of Harris will have the largest impact on the team, as she led the team in both scoring and rebounding last year, according to Maxpreps.\r\n\r\n\"We have a lot of guards who are capable of making threes, which can make up for the loss of our post scoring.\" junior guard Carly Leong said. \"We need to be more physical when it comes to rebounding, because we are a smaller team, and physicality will make up for it.\"\r\n\r\nDespite the loss, the girls team  maintain their dominance, having eight of the eleven players returning to the team.\r\n\r\n\"<span style=\"font-weight: 400;\">The only major change to the program is how many new players we're bringing in. The past couple years we've been playing with basically the same team, and I think bringing some players up from JV and new underclassmen trying out will give us a new dynamic.\" Leong said. \"So far, every practice has been so much fun, and I can't wait for season to start.\"<\/span>\r\n\r\nThe season starts at 7 p.m tonight, with the Vikings traveling to St. Ignatius.","excerpt":"After a 1st place finish in the Central Coast Section (CCS) playoffs and a first round NorCal loss, the Palo Alto High School girls' basketball team looks to return to CCS finals.","date":"2016-11-21 17:20:28","author":"Kasra Orumchian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/julie-jumpman.jpg","categories":["Basketball","Sports","Spotlight"],"tags":["2016","basketball","girls","girls basketball","gunn","palo alto","palo alto high school","paly","season preview","sports","vikings"]},{"id":126411,"title":"TEDx club to hold student speaker auditions","permalink":"http:\/\/palyvoice.com\/2016\/11\/21\/tedx-club-to-hold-student-speaker-auditions\/","content":"[caption id=\"attachment_126417\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/10922448_334598283407783_150521601487457039_n.jpg\"><img class=\"size-full wp-image-126417\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/10922448_334598283407783_150521601487457039_n.jpg\" alt=\"TEDx's 2015 conference. Photo: Adele Bloch\" width=\"800\" height=\"533\" \/><\/a> Palo Alto High School students and faculty gather in Paly's Media Arts Center to listen to a TEDx talk during the 2015 conference. Photo: Adele Bloch[\/caption]\r\n\r\nThe TEDxPaloAltoHighSchool club will be holding speaker auditions for Palo Alto High School students on Tuesday, Nov. 29 and Thursday, Dec. 1 for its fourth annual TEDx event in March.\r\n\r\n\"TEDx is a program of local, self-organized events that bring people together to share a TED-like experience,\" according to TEDxPaloAltoHighSchool's <a href=\"https:\/\/www.facebook.com\/tedxpaloaltohighschool\/\">Facebook Page<\/a>. \"At a TEDx event, TEDTalks video and live speakers combine to spark deep discussion and connection in a small group.\"\r\n\r\n<span style=\"font-weight: 400;\">According to the Audition’s <a href=\"https:\/\/www.facebook.com\/events\/1810928752516697\/\">Facebook [[delete facebook]] Event Page<\/a><\/span><span style=\"font-weight: 400;\">, this year's conference has a theme of “Uncharted Waters” and TEDx is looking for students with “confidence, enunciation and comfort [in] public speaking” to “present a risky new idea, a personal story or a radical approach.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Students will need to bring two copies of their speech, and will have to perform a run-through of their speech to the TEDx speaker team,” junior Iris Yuan, one of TEDx’s speaker administrators, said. “The two biggest things we are looking for in prospective speakers is that they have a speech that relates to our theme and are confident when speaking.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior Claire Eberhart, who spoke at last year's TEDx conference, encourages students to give presentations about topics that are important to them.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“When it came to me writing my talk about poetry in schools, the words flowed naturally,” Eberhart said. “When you have a plan of what you want to say and truly want to make a difference in your community, doing a Ted Talk is a great way to bring attention to issues and topics that are meaningful to you.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to senior Gaby Pelayo, one of TEDx's presidents, Tuesday's audition will run from 2:45 p.m. to 4 p.m. and Thursday's audition will run from 1:55 p.m. to 3 p.m. Both will be held in Room 863. Students can sign-up to audition <a href=\"https:\/\/docs.google.com\/forms\/d\/e\/1FAIpQLSf-_4P0EUvLhkM14AvGjdT3u5GqTrxwQDYIazyBrgf-vFjxBA\/viewform?c=0&amp;w=1\">here<\/a>.<\/span>","excerpt":"The TEDxPaloAltoHighSchool club will be holding speaker auditions for Palo Alto High School students on Tuesday, Nov. 29 and Thursday, Dec. 1 for its fourth annual TEDx event in March.","date":"2016-11-21 16:58:34","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/10922448_334598283407783_150521601487457039_n.jpg","categories":["News"],"tags":["auditions","speakers","students","TEDx"]},{"id":126439,"title":"Breaking News: School board meeting now to re-address weighted GPAs","permalink":"http:\/\/palyvoice.com\/2016\/11\/21\/breaking-news-school-board-meeting-now-to-re-adress-weighted-gpas\/","content":"<span style=\"font-weight: 400;\">The Palo Alto Unified School District school board is focusing again today on the controversial and highly debated decision to post weighted GPAs for colleges. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Last Tuesday, the school board met to discuss whether another meeting should be held to talk about weighted GPAs, a topic that has sparked great contention over whether this will benefit or hinder the graduating Class of 2017.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">School Board member Ken Dauber challenged the consensus by motioning to delay the decision until after the newly elected board members replace Camille Townsend and Heidi Emberling.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Are we expected to make decisions?” Dauber said. “<\/span><span style=\"font-weight: 400;\">I would prefer to wait until new board members are seated if we are going to be making decisions.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Emberling reiterated that the board was discussing a time-sensitive issue and their resolution should come within the following week. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I think the board gave guidance to make sure that weighted GPA would be offered for this year's seniors,\" Emberling said. \"The questions are what does that mean and why is it meaningful,” Emberling said. This year’s seniors need clarifications before the due dates of Dec. 1.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Superintendent Max McGee came out in favor of waiting, saying this was a decision that couldn’t be rushed and needed consultation from other experienced advisers.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We have yet to hear from the college counselors and our teachers and our administrators,\" McGee said. \"They know the colleges better than anyone else in this room and we cannot make this decision without them.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The board eventually came to the consensus that the meeting would be held the following Monday to explicitly come to an agreement on whether to put a cap on the amount of unweighted credited classes to be included in a students' weighted GPA.<\/span>\r\n\r\nWhile the decision to post weighted GPAs is still confirmed, the meeting may give an opportunity for people to voice their concerns over this impactful policy, directly with the school board.","excerpt":"The Palo Alto Unified School District school board is focusing again today on the controversial and highly debated decision to post weighted GPAs for colleges.","date":"2016-11-21 16:03:31","author":"Donnesh Farmanfarmaian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/schoolboard051016.jpg","categories":["News","Schoolboard","Spotlight"],"tags":[]},{"id":126271,"title":"Local high schools erupt in protests and peace marches","permalink":"http:\/\/palyvoice.com\/2016\/11\/19\/local-high-schools-erupt-in-protests-and-peace-marches\/","content":"Students from various Bay Area high schools have exercised their constitutional rights over the past week as protests and peace marches have erupted in response to the results of the national election. While many emphasized anti-Trump rhetoric, others avoided making political statements and promoted unity and acceptance. Read on to view a timeline and map of local protests.\r\n\r\n<iframe src=\"https:\/\/www.google.com\/maps\/d\/embed?mid=1YgQQV8fhtegxzT4_01CQ7JhdLRI\" width=\"640\" height=\"480\"><\/iframe>\r\n\r\n<iframe src=\"https:\/\/cdn.knightlab.com\/libs\/timeline3\/latest\/embed\/index.html?source=1k1XP1cZ2i6Q3T9G6ZEUEeQDqVhgF-Lcd_ZPSCZclTEE&amp;font=Default&amp;lang=en&amp;initial_zoom=2&amp;height=650\" width=\"100%\" height=\"650\" frameborder=\"0\"><\/iframe>","excerpt":"In light of recent events many high school students have taken to the streets to protest and promote peace and unity among their peers. Read on to learn more about how local students have come together to organize their high school communities.","date":"2016-11-19 13:51:28","author":"Zahra Muzaffar","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/IMG_7500.jpg","categories":["Election 2016","Spotlight"],"tags":["2016","castilleja","city hall","constitution","election","gunn","high schools","march","oakland","paly","peace","peaceful protest","protest","redwood","rights","San Francisco","Trump","unity"]},{"id":126352,"title":"Turkey Trot by numbers","permalink":"http:\/\/palyvoice.com\/2016\/11\/18\/turkey-trot-by-numbers\/","content":"Student are returning to home with full bellies today after Palo Alto High School's 12th annual <a href=\"http:\/\/palyvoice.com\/2016\/11\/17\/tradition-to-continue-with-12th-turkey-trot-tomorrow\/\">Turkey Trot<\/a>, a feast in honor of Thanksgiving, took place at lunch on the Quad.\r\n\r\nThe feast costs either five dollars in cash or two dollars plus three cans of non-perishable foods. According to Anderson and the <a href=\"http:\/\/www.ehpcares.org\/about-us.html\">Ecumenical Hunger Program website<\/a>, the money and cans raised by the Turkey Trot are donated to the EHP in East Palo Alto, a non-profit organization who's mission is \"to sustain our neighbors through immediate crises and to help them regain stability and independence\".\r\n\r\nAccording to Paly parent and event organizer Melissa Anderson, this year's Turkey Trot will offered more options for students with dietary restrictions. The feast will provided options for vegetarians and gluten-free students, such as baked potatoes and vegetarian stuffing, along with gluten free pies, stuffing and gravy.\r\n\r\nAnderson, who has been organizing the Turkey Trot for seven years, finds the event to be her favorite Paly tradition.\r\n\r\n\"I love seeing all the kids come out,\" Anderson said. \"They all come out in mass. If you pick your head up at about noon, it's like 'Oh my goodness! I hope we have enough food', and then there's always seconds, everyone gets fed.\"\r\n\r\n\"At the end of this, we give five big barrels of canned goods to [The] Ecumenical Hunger [Program],\" Anderson said. \"I come over with anywhere from $2,000 to $4,000, and that helps their food and gift drive for their clients. We're a really major part of their offerings for their families.\"\r\n\r\nBelow is the breakdown of this years Turkey Trot feast statistics.\r\n\r\n<iframe style=\"overflow-y: hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/18235253-new-piktochart\" width=\"800\" height=\"1547\" frameborder=\"0\" scrolling=\"no\"><\/iframe>","excerpt":"Student are returning to home with full bellies today after Palo Alto High School's 12th annual Turkey Trot, a feast in honor of Thanksgiving, took place at lunch on the Quad. ","date":"2016-11-18 18:40:21","author":"Maya Akkaraju","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/15128655_569222469931377_283696749_n.jpg","categories":["News","Spotlight"],"tags":["anderson","gluten-free","palo alto high school","paly","pie","stuffing","thanksgiving","turkey","turkey feast","turkey trot","turkey trot 2016","vegetarian"]},{"id":126204,"title":"Video: Students march for peace","permalink":"http:\/\/palyvoice.com\/2016\/11\/18\/video-palo-alto-peace-march\/","content":"Students chanted and cheered during a peace march Tuesday intended to show support for students after a divisive election. Gunn High School and Castilleja School students also came out to support the march.\r\n\r\n<iframe src=\"https:\/\/www.youtube.com\/embed\/01oTKbAjXfA\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"Watch a video of students chanting and cheering during a peace march Tuesday intended to show support for students after a divisive election. ","date":"2016-11-18 09:27:16","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/IMG_7748.jpg","categories":["Multimedia","Spotlight","Video"],"tags":["march","peace","video"]}]