[{"id":125256,"title":"Verbatim: Students weigh in on combined homecoming dance","permalink":"http:\/\/palyvoice.com\/2016\/11\/02\/verbatim-students-weigh-in-on-combined-homecoming-dance\/","content":"Palo Alto High School recently held its first-ever joint homecoming dance with Gunn High School. The Paly Voice asked students what their thoughts were about this event.\r\n\r\n<img class=\"alwaysThinglink\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/850045450458234880\/1024\/10\/scaletowidth#tl-850045450458234880;1043138249'\" alt=\"\" \/>\r\n\r\n&nbsp;\r\n\r\n<script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script>","excerpt":"Palo Alto High School recently held its first ever joint homecoming dance with Gunn High School. The Paly Voice asked students what their thoughts were about this event.","date":"2016-11-02 19:58:54","author":"Katie Cox","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/Screen-Shot-2016-11-01-at-7.12.24-PM.png","categories":["Multimedia","Verbatims"],"tags":["2016","gunn","homecoming","opinions","paly","verbatim"]},{"id":125280,"title":"Board votes for weighted GPAs on mid-year reports for Class of 2017","permalink":"http:\/\/palyvoice.com\/2016\/11\/02\/board-votes-for-weighted-on-mid-year-transcripts-for-class-of-2017\/","content":"[caption id=\"attachment_125289\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/DSC_0001.jpg\"><img class=\" wp-image-125289\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/DSC_0001.jpg\" alt=\"The school board makes preliminary recommendations before allowing community input on the weighted GPAs. The school board voted unanimously to move towards a weighted GPA on mid year transcripts. Photo : Sid Sharma\" width=\"600\" height=\"400\" \/><\/a> Palo Alto Unified School District Supt. Max McGee makes preliminary recommendations before allowing community input on the topic of weighted GPAs. The school board voted unanimously to move to include a weighted GPA on mid-year transcripts, starting in January for the Class of 2017, with further discussion pending for a longer term policy. Photo: Sid Sharma[\/caption]\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">Before a packed and impassioned audience, the Palo Alto Unified School District Board of Education during a lengthy meeting last night voted unanimously to include both weighted Grade Point Averages on mid-year reports to be sent to colleges for the current senior class.<\/span><\/p>\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">Already-uploaded transcripts will not be amended to include the weighted GPA, but if students need accommodations before the mid-year transcript, the board directed staff at the high schools “to do their best to accommodate those students.”<\/span><\/p>\r\n<p style=\"text-align: left;\">The board members left unresolved whether they would give students the option to choose between weighted and unweighted GPAs or to include both automatically.<\/p>\r\n<p style=\"text-align: left;\">There are several weighted GPA options currently being considered. Paly Principal Kim Diorio clearly supports only including unweighted GPAs, but forced to choose, she recommended including the UC-weighted GPA.<\/p>\r\n<p style=\"text-align: left;\">Diorio also said that she knows that at least 50 students will be negatively affected by this decision. Those students, according to Diorio, tend to be low-income, historically underrepresented, and students with Individual Education Programs.<\/p>\r\n<p style=\"text-align: left;\">The decision came less than an hour before the Early Decision deadline for college applications, effectively changing how students are assessed for all high school classes they have already completed.<\/p>\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">Last night's debate revolved mainly around the issue of reporting weighted versus unweighted GPAs on transcripts for students. <\/span><span style=\"font-weight: 400;\">This topic recently arose due to a Palo Alto High School senior voicing concerns about the disparities between how Gunn High School and Paly report GPAs.<\/span><\/p>\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\"> The student, Maya Katz, asserted that because Paly does not currently report weighted GPAs, she is disadvantaged for certain merit scholarships that consider GPA as the primary criteria, most notably scholarships at the University of Oregon. The current practice at Paly is that, if a student would benefit in the scholarship consideration process from having his or her weighted GPA reported, the Guidance Office will contact the specific universities and vouch for the student's weighted GPA.<\/span><\/p>\r\n<p style=\"text-align: left;\">The board essentially overruled a more tempered proposal from Supt. Max McGee that called for a committee to explore the implications of a weighted GPA.<\/p>\r\n\r\n\r\n[caption id=\"attachment_125291\" align=\"alignleft\" width=\"323\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/DSC_0023.jpg\"><img class=\" wp-image-125291\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/DSC_0023.jpg\" alt=\"Palo Alto High School senior Maya Katz speaks out in support of having a weighted GPA reported on transcripts. Katz is one of the most vocal students in support of weighted GPAs. Photo: Sid Sharma \" width=\"323\" height=\"215\" \/><\/a> Palo Alto High School senior Maya Katz speaks out in support of having a weighted GPA reported on transcripts. Katz is one of the most vocal students in support of weighted GPAs. Photo: Sid Sharma[\/caption]\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">Gunn currently reports weighted GPAs in the Common Application — but not on transcripts — and contacts specific colleges if necessary, as Paly does.<\/span><\/p>\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">The school board meeting, which was extended until 11:30 p.m. to focus more deeply on this issue, featured 35 speakers, the majority of whom were parents, although three students did speak. The speakers voiced unanimous support for reporting weighted GPAs.<\/span><\/p>\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">Katz, who spoke at the meeting, said she believes that the problem stems from students not being fully informed about how the GPAs are reported. <\/span><\/p>\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">“I just feel that other students don’t necessarily have the information that they needed,” Katz said.  “There’s a lot of things that the teachers are saying, that the admin is saying. There is just so much information. It’s all so complicated, and I just don’t know why it should be that complicated, but it is. I don't think students have access to the right sources, from the right people.\"<\/span><\/p>\r\n\r\n\r\n[caption id=\"attachment_125287\" align=\"alignright\" width=\"238\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/DSC_00731.jpg\"><img class=\" wp-image-125287\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/DSC_00731.jpg\" alt=\"Terry Godfrey expressed the strongest reservations about the current plan. She ended up voting yes on the final proposition. Photo by Sid Sharma.\" width=\"238\" height=\"158\" \/><\/a> Board member Terry Godfrey expressed the strongest reservations about the current plan. She ended up voting yes on the final proposition. Photo: Sid Sharma.[\/caption]\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">A <\/span><a href=\"https:\/\/www.change.org\/p\/palo-alto-school-board-members-and-superintendent-petition-pausd-students-for-keeping-weighted-gpa\"><span style=\"font-weight: 400;\">petition<\/span><\/a><span style=\"font-weight: 400;\"> to move towards reporting weighted GPAs that has been circulating among the Palo Alto community reached 430 signatures as of Wednesday morning.<\/span><\/p>\r\n<p style=\"text-align: left;\">A dissenting petition by tenured Paly teachers has reached 68 signatures. There are only 100 tenured teachers on the campus.<\/p>\r\n<p style=\"text-align: left;\">Part of the rushed decision-making hinged on school board candidate Todd Collins' impassioned denunciation of the slower committee approach supported by McGee. Collins voiced strong support for reporting weighted GPAs on transcripts.<\/p>\r\n<p style=\"text-align: left;\">School Board member Terry Godfrey, who has a senior at Paly, tearfully expressed reservations about the decision regarding weighted GPAs.<\/p>\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">“I want to be sure the voices of the students who aren’t comfortable coming to the board to speak are included,” Godfrey said. “If changing the way we report GPAs is going to change behaviors we should know what those changes are and make a conscious decision.”<\/span><\/p>\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">The board agreed to hash out the details of a long-term solution at a later point. <\/span><span style=\"font-weight: 400;\">More details will be published soon. You can read the full board report <\/span><a href=\"https:\/\/www.pausd.org\/explore-pausd\/news\/board-report-nov-1-2016\"><span style=\"font-weight: 400;\">here<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/p>","excerpt":"Before a packed and impassioned audience, the Palo Alto Unified School District Board of Education during a lengthy meeting last night voted unanimously to include both weighted Grade Point Averages on mid-year reports to be sent to colleges for the current senior class.","date":"2016-11-02 13:58:18","author":"Jackson Doerr","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/DSC_0001.jpg","categories":["News","Schoolboard","Spotlight"],"tags":["gpas","gunn","maya katz","november 1st","paly","PAUSD","School Board","terry godfrey","unweighted","weighted"]},{"id":125235,"title":"Boys&#8217; water polo falls short in overtime championship thriller","permalink":"http:\/\/palyvoice.com\/2016\/11\/01\/boys-water-polo-falls-short-in-overtime-championship-thriller\/","content":"[caption id=\"attachment_125237\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/candid1.jpg\"><img class=\"size-full wp-image-125237\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/candid1.jpg\" alt=\"Senior field player Tommy Smale passes down the pool during the league championship against Gunn on Oct. 29 at Los Altos High School. Photo by Sam Lee\" width=\"600\" height=\"527\" \/><\/a> Senior field player Tommy Smale passes down the pool during the league championship against Gunn on Oct. 29 at Los Altos High School. Photo by Sam Lee.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto High School boys’ water polo team (16-9, 12-2) came up short in a four overtime thriller with a 10-9 loss to the Gunn High School Titans (16-6, 11-o) in the Santa Clara Valley Athletic League finals on Oct. 29 at Los Altos High School.<\/span>\r\n\r\nThe two teams traded goals for the majority of the match, with neither Paly nor Gunn able to break away with a significant lead.\r\n\r\nWith senior field player Andrew Jozefov leading the team in points with three goals, the Vikings fought hard until the end of the fourth overtime, during which the Titans scored the game-winning golden goal to take the championship trophy.\r\n\r\n<span style=\"font-weight: 400;\">Gunn was able to take a slight advantage by eliminating Paly’s senior star player, Jared Stanley, from the game in the second quarter by frustrating him into three ejections, disqualifying him from the game. Despite having to watch from the bench, Stanley said he was still proud of how his team performed.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I got majored in the second quarter, but the team did a good job stepping up and this is honestly the best game of water polo we have ever played,” Stanley said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Although the match ended in a loss, the quadruple overtime thriller displayed the Viking’s intensity and heart, according to Stanley. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We played our absolute hardest throughout the entire match,” Stanley said. “We fought on every possession and our defense really connected forcing four overtimes.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior Tommy Smale was pleased with the team’s performance, but felt they could have capitalized on key opportunities. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It was a very hard fought game on both sides all the way to the end,” Smale said. “It was really frustrating because we got their two best players Patrick [Zhao] and Quinn [Hamilton] out and we should’ve capitalized on that. We thought we could definitely put it away at that point but we never did.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior field player Andrew Jozefov, who scored with less than a minute left in regulation to tie the game at 8-8, describes the Viking’s game plan.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I matched up with their team's best players and ended up getting them out of the game,” Jozefov said. “I forced them to take ejections and eventually getting a major.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Stanley also acknowledged the Paly student section's for the increased intensity of the game.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Without the student section, we definitely would not have played as well as we did today,\" Stanley said. \"The energy in this pool arena really helped us.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Despite the loss, the team is looking forward to a rematch versus Gunn in Central Coast Section, according to Stanley.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We are building up momentum and character for CCS and we’re gonna come out fighting harder than we ever have,” Stanley said. “We are definitely going to beat Gunn in CCS.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Vikings' next match will be in the CCS playoffs. The date and location are TBA. <\/span>\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School boys’ water polo team (16-9, 12-2) came out short with a 10-9 loss to Gunn High School (16-6, 11-o) in the Santa Clara Valley Athletic League finals on Saturday at Los Altos High School.","date":"2016-11-01 22:59:13","author":"Sam Lee","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/candid1.jpg","categories":["Sports","water polo"],"tags":["Andrew Jozefov","championship","gunn","jared stanley","league","los altos","paly","scvals","senior","sports","titans","Tommy Smale","vikings","water polo"]},{"id":125091,"title":"Slideshow: Girls’ tennis plays Los Altos on Senior Night","permalink":"http:\/\/palyvoice.com\/2016\/10\/29\/slideshow-girls-tennis-plays-los-altos-on-senior-night\/","content":"The Palo Alto High School girls' tennis team (7-0) defeated the Los Altos High School Eagles (16-4), 4-3, on senior night. The team will compete in the Central Coast Section (CCS) championship tournament.\r\n\r\n<iframe src=\"https:\/\/docs.google.com\/presentation\/d\/1vSbAQU6zVVC_niZlQADVfpY55BiRfwJY5GMRxMiMZnU\/embed?start=false&amp;loop=false&amp;delayms=3000\" width=\"960\" height=\"569\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Palo Alto High School girls' tennis team (7-0) defeated the Los Altos High School Eagles (16-4), 4-3, on senior night. The team will compete in the Central Coast Section (CCS) championship tournament.","date":"2016-10-29 12:39:25","author":"Ethan Kao","categories":["Uncategorized"],"tags":["Boys","boys tennis","girls","girls tennis","paly","Soccer","sports","tennis","VIKES"]},{"id":125082,"title":"Girls&#8217;s tennis advances to CCS","permalink":"http:\/\/palyvoice.com\/2016\/10\/29\/girlss-tennis-advances-to-ccs\/","content":"[caption id=\"attachment_125083\" align=\"aligncenter\" width=\"620\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_7063.jpg\"><img class=\"size-full wp-image-125083\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMG_7063.jpg\" alt=\"Freshman Anuva Banwasi serves the ball in a doubles match with senior captain Meredith Cummings. The undefeated Vikings went on to win the game 4-3 on senior night. Photo by Ethan Kao\" width=\"620\" height=\"457\" \/><\/a> Freshman Anuva Banwasi serves the ball in a doubles match with senior captain Meredith Cummings.  The undefeated Vikings went on to win the game 4-3 on senior night. Photo by Ethan Kao.[\/caption]\r\n\r\nThe Palo Alto High School girls’ tennis team (12-0) routed Los Altos High School (14-6) 4-3, in an El Camino League match on Tuesday at home.\r\n\r\nPer tradition, the last home game coincided with senior night. Before the game, parents took photos and gave flowers to the girls. The team's seniors include Cummings, Pearson, Alice Zhang, Brin Elliott, and Mayerly Grace Short.\r\n\r\n<span style=\"font-weight: 400;\">The team’s last regular season win helps seal their undefeated record and finish the season in first place in the ECL, giving them a chance to the Central Coast Section (CCS) championship tournament. Only the top team from the El Camino League gets to compete in the championship tournament, which is predominantly reserved for the De Anza League.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Vikings played in the De Anza League last year before Coach Andy Harader dropped the team down. Buoyed by young talent and solid leadership, the team has enjoyed a breakout season, according to Harader. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to senior doubles player, Avery Pearson, the Vikings won with perseverance. Pearson and her doubles partner, senior Alice Zhang, clinched the deciding match in a game that went to the third set. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Los Altos is a tough team and a lot of the matches went into a third set,\" Pearson said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior captain Meredith Cummings acknowledged some weakness in today’s game.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"Today was a tough match,” Cummings said. \"We played well at the baseline overall, but on my court and the others that I could see, our volleys were mainly going into the net. We needed to improve on our net play, as well as moving our feet to the ball.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">With the regular season over, the team has shifted its focus to CCS. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Cummings feels that a focused exercise regimen will be  a key aspect to winning the championship. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I have the feeling that if we train hard in practice, eat healthy, and exercise on the weekend, we will be in great shape to try and win it all,” Cummings said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Additionally, Pearson feels the team needs to focus on mental stamina to win. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“To win CCS, I think we all need to be in the right mindset the day of the tournament.  Tennis is a mind game as much as it is a physical sport,” Pearson said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">After the undefeated regular season, Harader is confident that the girls can win the league CCS championship. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The only thing keeping us from winning the championship will be ourselves this season,” Harader said in September — a day before the season started.  <\/span>\r\n\r\n[caption id=\"attachment_125085\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/DSC_01232.jpg\"><img class=\"size-full wp-image-125085\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/DSC_01232.jpg\" alt=\"The team's seniors (in the back) line up to take a photo with their younger counterparts. Photo by Ethan Kao. \" width=\"600\" height=\"400\" \/><\/a> The team's seniors (in the back) line up to take a photo with their younger counterparts on senior night held on Tuesday. Photo by Rachel Code.[\/caption]\r\n\r\n&nbsp;\r\n\r\n<span style=\"font-weight: 400;\">The team’s first game in the playoff series will come next Tuesday with the date, location, and opponent currently listed as “TBA.”<\/span>\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School girls’ tennis team (12-0) routed Los Altos High School, 4-3, in an El Camino League match on Tuesday at home.","date":"2016-10-29 12:38:29","author":"Siddarth Sharma","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/DSC_01232.jpg","categories":["Tennis"],"tags":["CCS","de anza","el camino","girls","league final","tennis 2016","undefeated season"]},{"id":122247,"title":"Coffee Chats: Biology teacher Tara Verekyen","permalink":"http:\/\/palyvoice.com\/2016\/10\/29\/coffee-chats-biology-teacher-tara-verekyen\/","content":"&nbsp;\r\n\r\n[caption id=\"attachment_123615\" align=\"alignnone\" width=\"601\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Tara-Verekyen.jpg\"><img class=\" wp-image-123615\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Tara-Verekyen.jpg\" alt=\"Biology teacher Tara Verekyen in her classroom. Photo: Daniella Maydan\" width=\"601\" height=\"451\" \/><\/a> Biology teacher Tara Verekyen sits in her classroom full of students during Flex. Photo: Daniella Maydan.[\/caption]\r\n\r\n<i>This is the sixth installment of Coffee Chats, where The Paly Voice gets to know staff members over a cup of coffee.<\/i>\r\n\r\nThe Paly Voice sat down with new Palo Alto High School biology teacher Tara Verekyen, and discussed her interests and her journey to becoming a teacher over a medium iced coffee.\r\n\r\nWhile this is Verekyen’s 7th year teaching biology, she began her academic journey with an interest in anthropology and was fascinated by evolution and the way in which organs evolve over time.\r\n\r\n“I wanted to pursue anthropology because I like having a deeper insight into the biology behind human evolution and human origins,\" Verekyen said. \"However, I found through volunteering as a tutor and volunteering at a museum that I enjoyed working in science education. When I graduated, I decided to put my interest of science together with my interest of teaching, and start a post-bachelor teaching program.\"\r\n\r\nVerekyen moved to the Bay Area from Arizona in search of a change, as well as a way to be closer to family. She currently enjoys working with her stepmother, AP Statistics teacher Misha Stempel, at Paly.\r\n\r\n\"It's awesome, but it's kind of crazy,\" Verekyen said. \"We [Verekyen and Stempel] drive in to work together and we wave to each other in meetings. It's great!\"\r\n\r\nAccording to Stempel, it's great to see her stepdaughter at Paly because she is able to reconnect with her as well as reminisce about old times.\r\n\r\n\"It's just kind of cool because when she was younger and she and her sister would get out of school they would come to Paly and draw on the chalkboards,\" Stempel said.  \"I still have those pictures they drew for me back then so having  her here now is really cool. It's fun catching up with her and being a part of her life.\"\r\n\r\nAccording to Verekyen, she appreciates the environment at Paly and enjoys interacting with the students.\r\n\r\n“It's awesome, there is so much support here and so many great things going on on campus that I didn't see at my other schools,” Verekyen said.\r\n\r\nVerekyen believes that biology is an important class to take in high school.\r\n\r\n\"I love teaching freshman biology because I think it sets a really good foundation for what students are going to need later on in high school and in college\" Verekyen said.\r\n\r\nOther than teaching, Verekyen enjoys traveling and advises her students to consider studying abroad when in college.\r\n\r\n\"It really gives unique perspective and helps you to see how your major connects to the world in a more authentic way,\" Verkeyen said.\r\n\r\nTo students planning on pursuing biology, Verekyen encourages curiosity.\r\n\r\n“My advice for students that pursue biology is to find a topic that you really love and start exploring it, see how you can use that passion to solve modern day challenges or help people,\" Verekyen said. \"And question everything. Ask a lot of questions. Question it all.\"","excerpt":"The Paly Voice sat down with Palo Alto High School Biology teacher Tara Verekyen, and discussed her interests and her journey to becoming a teacher over a medium iced coffee.","date":"2016-10-29 12:06:55","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Tara-Verekyen.jpg","categories":["Coffee chats","Features","Spotlight"],"tags":["anthropology","biology","coffee chat","freshman","freshman biology","misha stempel","new teacher","tara verekyen","Teacher"]},{"id":125001,"title":"Groundbreaking Homecoming dance is groundbreakingly average","permalink":"http:\/\/palyvoice.com\/2016\/10\/28\/groundbreaking-homecoming-dance-is-groundbreakingly-average\/","content":"Palo Alto Homecoming traditions continue to be formed and broken: After a <a href=\"http:\/\/palyvoice.com\/2015\/10\/15\/asb-breaks-tradition-with-new-homecoming-plans\/\">historical<\/a> dance last year, the Paly Associated Student Body and Gunn Student Executive Council hosted the first-ever joint Homecoming dance last Saturday. Despite the exciting intermingling between Paly and Gunn students, this year’s dance was also plagued with lengthy lines, minimal food and general confusion.\r\n\r\n<span style=\"font-weight: 400;\">The dance took place in two gyms at Henry M. Gunn High School, and students were free to walk from one building to another to dance or play games such as ping pong or foosball with friends. While the buildings provided ample space, the hallway between the two had a bottleneck effect due to its small width and the large number of students constantly passing through. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The real trouble, however, began outside the front door. Several lines of roughly 2,100 students wound their way down to the parking lot, blocking cars. Many students were confused as to which line they had to stand in, and the process took over an hour for some. According to Paly Assistant Principal Kathleen Laurence, ticket takers aimed to spend five seconds admitting each student into the dance.<\/span>\r\n\r\n“We actually finished getting kids in seven minutes faster than we thought possible,” Laurence said.\r\n\r\n[caption id=\"attachment_125027\" align=\"alignright\" width=\"438\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMAG0068.jpg\"><img class=\"wp-image-125027\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMAG0068.jpg\" alt=\"IMAG0068\" width=\"438\" height=\"281\" \/><\/a> Students stand in a line stretching from the gym entrance into the parking lot to enter the dance. \"Waiting in line for nearly an hour ended up taking up a significant portion of the dance itself,\" senior Alix Westgaard said. Photo: Aidan Maese-Czeropski.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">While long waits are understandable, administration breathalyzed every single student, which was a waste of time. An alternative would be to breathalyze one in five or one in 10 students, saving time and still preventing underage drinking. Furthermore, the lack of signs made it so many people were unaware if they were in line to purchase tickets or enter the dance, and administration did little to prevent students from cutting in line. Some students spent over one third of their allotted time standing in line, yet the dance was not extended. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">When I finally entered the gymnasium one hour after I arrived, I was eager to eat. Unfortunately, nearly all the food had been consumed by the time I arrived, save for a bowl of colorful chips and salsa. Attendants occasionally brought out stacks of cookies or chocolate covered strawberries, and while they were delicious, they rarely lasted long. With thousands of students attending the dance, ASB and SEC should have expected the food to be quickly devoured and prepared accordingly.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The long lines and minimal food were partially compensated by enjoyable music and dancing: the most anticipated part of Homecoming was, as always, the dance floor. The DJ accepted student song requests and played a large variety of genres that were generally danceable. Iridescent lights and images of stars flashed across the walls, and most students were receptive to the music. Reconnecting with friends from other schools and meeting new people was both easy and encouraged, on and off the dance floor.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The dance featured entertaining games, including ping pong and foosball, as well as photo booths and a caricature artist. However, these areas remained extremely crowded. Increasing the number of ping pong tables from the two present would have allowed more people to take part in the fun. Special effects such as lights and banners outside the dance room were also minimal. This itself was fine, as streamers don’t necessarily entertain; however, students were promised extra amenities in exchange for an inexpensive venue so the rooms felt almost bare.<\/span>\r\n\r\nPaly senior Alix Westgaard says that while Homecoming was an enjoyable experience, it could have been planned much better.\r\n\r\n\"I think the challenge of having so many people attending the same venue needed to be addressed,\" Westgaard said. \"There wasn't enough space for all the cars picking up students and there weren't enough entrances to the dance, causing a very long line. In the future, they could try to stagger the homecomings so they occurred on different weekends or try to find a different location for Paly's homecoming. Leaving the parking lot after the dance also took forty-five minutes.\"\r\n\r\n<span style=\"font-weight: 400;\">Homecoming 2016 wasn’t entirely \"bad.\" But when sprinting to the food table to grab a snickerdoodle or two before they run out is one of the dance’s high points, you know the night didn’t live up to its potential. <\/span>","excerpt":"Despite the exciting intermingling between Paly and Gunn students, this year’s Homecoming dance was plagued with lengthy lines, minimal food and general confusion.","date":"2016-10-28 20:57:57","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/IMAG0068.jpg","categories":["Entertainment","Spotlight"],"tags":["2016","ASB","dance","groundbreaking","gunn","homecoming","joint","palo alto","paly","sec"]},{"id":125105,"title":"Editorial: The Paly Voice endorses Collins, Caswell and DiBrienza","permalink":"http:\/\/palyvoice.com\/2016\/10\/27\/editorial-the-paly-voice-endorses-collins-caswell-and-dibrienza\/","content":"<span style=\"font-weight: 400;\">With the upcoming election, three Palo Alto Unified School District Board of Education seats will be up for grabs. <\/span><a href=\"http:\/\/palyvoice.com\/2016\/09\/29\/school-board-candidates-vie-for-three-opening-seats\/\"><span style=\"font-weight: 400;\">Five candidates<\/span><\/a><span style=\"font-weight: 400;\"> have been competing for the opening positions, two of whom are incumbents Heidi Emberling and Melissa Baten Caswell; the newcomers include Todd Collins, Jay Blas Jacob Cabrera and Jennifer DiBrienza.<\/span>\r\n\r\nThe Paly Voice staff and editors took time to research and evaluate the various candidates and their positions on topics ranging from the homework policy to budget deficit and the conduct of teachers on campus. Additionally, members of staff spent time attending forums with all five candidates present and interviewing the incumbents on current issues.\r\n\r\n<span style=\"font-weight: 400;\">After much deliberation as a staff, The Paly Voice has decided to endorse Todd Collins, incumbent Melissa Baten Caswell and Jennifer DiBrienza. <\/span>\r\n<p style=\"text-align: left;\"><b>Todd Collins: The Fiscally Responsible Candidate<\/b><\/p>\r\n\r\n\r\n[caption id=\"attachment_122806\" align=\"alignleft\" width=\"272\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/DSC_6355-1.jpg\"><img class=\"wp-image-122806\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/DSC_6355-1.jpg\" alt=\"Todd Collins, a candidate for school board, referenced his experiences serving on various committees to voice his perspective. Photo: Zahra Muzaffar\" width=\"272\" height=\"384\" \/><\/a> Todd Collins, a candidate for school board, referenced his experiences serving on various committees to voice his perspective. Photo: Zahra Muzaffar[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Collins, a private investor, has spent time engaged with the board, but brings a new perspective that current conditions warrant. Over the years he has spent time <\/span><span style=\"font-weight: 400;\">involved in various school board committees such as the Citizens’ Oversight Committee of a school bond program and the school board’s <a href=\"http:\/\/palyvoice.com\/2015\/12\/07\/school-board-delays-vote-on-opening-new-secondary-school\/\">Enrollment Management Advisory Committee<\/a> over the 2015-16 school year.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Collins earns our support because of his continued vocal concerns regarding the <a href=\"http:\/\/palyvoice.com\/2016\/08\/28\/principal-no-need-to-panic-about-budget\/\">several <\/a><\/span><a href=\"http:\/\/palyvoice.com\/2016\/08\/28\/principal-no-need-to-panic-about-budget\/\"><span style=\"font-weight: 400;\">million dollar budget deficit<\/span><\/a><span style=\"font-weight: 400;\">. While other candidates have acknowledged the issue, he has been the only one to recognize that innovation is contingent upon the availability of funds. Collins supports new pathways and programs, but doesn’t consider them to be feasible given current financial conditions. Collins not only has the financial background, but is an asset because of his attention to detail and exposure to the board's past finances via various committees.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Additionally, in keeping with his recommendations following his time on EMAC, Collins concurs with The Paly Voice staff in <\/span><a href=\"http:\/\/palyvoice.com\/2016\/01\/25\/editorial-explore-other-avenues-to-counter-overcrowding\/\"><span style=\"font-weight: 400;\">standing against<\/span><\/a><span style=\"font-weight: 400;\"> the creation of new schools within the district due to declining enrollment in elementary schools the past few years.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Collins persistently emphasizes the need for data-driven decision making, whether it be concerning the homework policy or the continuation of the current teacher evaluation system.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Collins values resiliency, an integral part of the learning process, and wants to see PAUSD students “experience and overcome failure.\"<\/span>\r\n\r\n<b>Melissa Baten Caswell: The Experienced Incumbent<\/b>\r\n\r\n<span style=\"font-weight: 400;\">Caswell will be completing her second term, and while outside of the norm, electing her to a third this coming November will benefit the Palo Alto community because of her extensive knowledge regarding administrative procedures. <\/span><span style=\"font-weight: 400;\">She has previously served as board president and has experience serving on various school specific Parent Teacher Association councils.<\/span>\r\n\r\n[caption id=\"attachment_122810\" align=\"alignright\" width=\"302\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/DSC_6360-1.jpg\"><img class=\" wp-image-122810\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/DSC_6360-1.jpg\" alt=\"Melissa Baten Caswell, who has completed two terms on the school board, acknowledged areas of improvement and strengths of the current school board. Photo: Zahra Muzaffar\" width=\"302\" height=\"328\" \/><\/a> Melissa Baten Caswell, who has completed two terms on the school board, acknowledged areas of improvement and strengths of the current school board. Photo: Zahra Muzaffar[\/caption]\r\n\r\nCaswell is one of few current members to strongly support student voice, recognizing that the zero period controversy at Gunn High School was a top-down decision.\r\n\r\n<span style=\"font-weight: 400;\">Caswell’s focus on garnering the creativity within our teachers and providing ample resources and time to allow them to innovate within the classroom resonates with The Paly Voice. As students we benefit from inventive programs, many of which have been implemented during her time on the board. Flipped classrooms, blended learning and programs such as Social Justice and Advanced Authentic Research allow for individualized learning experiences, enhancing our development as 21st century learners.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Caswell displays some of the best features of the current board. She not only recognizes its shortcomings, but actively works to provide efficient solutions.  During school board forums she has addressed that the mission of the district is to educate its students and that the \"quality of the teachers preempts everything.\" A pragmatic decision maker, Caswell advocates for an improved system of mental health services while acknowledging<\/span> the district’s limitations.\r\n\r\nIncumbents, including Caswell, have been criticized for their lack of transparency and mismanagement in regards to finances and dealing with the Office of Civil Rights over the past few years. However, Caswell has remained consistent in her stances and takes the time to deliberate before outlining her position. Although she voiced her <a href=\"http:\/\/palyvoice.com\/2016\/05\/26\/board-approves-raise-for-teachers\/\">support for the teacher pay raise<\/a>, Caswell is in favor of aggressive measures to reduce the deficit.\r\n\r\n<b>Jennifer DiBrienza: The Needed Educator<\/b>\r\n\r\n[caption id=\"attachment_122799\" align=\"alignleft\" width=\"263\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/DSC_6351-1.jpg\"><img class=\" wp-image-122799\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/DSC_6351-1.jpg\" alt=\"Jennifer Dibrienza relied on her experiences as a Educational Consultant to provide explanations for her various stances. Photo: Zahra Muzaffar\" width=\"263\" height=\"302\" \/><\/a> Jennifer Dibrienza relied on her experiences as an Educational Consultant to provide explanations for her various stances. Photo: Zahra Muzaffar[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">DiBrienza, a teacher and staff developer for primary schools, embodies the necessary background for a seat on the school board. <\/span><span style=\"font-weight: 400;\">Previously, DiBrienza was an educational consultant and has served on Ohlone Elementary School’s site council.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">While the achievement gap and inequity in education have recently become synonymous with PAUSD, DiBrienza was one of few to continuously reference the importance of equitable access to the choices available at our schools.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">DiBrienza’s experience within the classroom will provide an integral perspective that the school board has been lacking. Hopefully, she will help the board as a whole to recognize how each decision truly impacts the experience of a student.<\/span>\r\n\r\n<strong>Acknowledging the Competition<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">Cabrera and Emberling have put up valiant efforts and their desire to aid the district’s students should be recognized. Cabrera offers the grass-roots perspective and should be applauded for his campaign based entirely upon small donations. He offers bold ideas that would add value to innovations within any district. Similarly, Emberling’s efforts over the past years have not been forgotten. Her emphasis on the best practices for each individual school is worth noting.<\/span>\r\n\r\nCabrera, despite his ingenuity, has drawbacks; he has focused his efforts on emphasizing respectable beliefs against the current system of politics reliant upon money. He strays away from providing adequate solutions to the specific problems faced by our community.\r\n\r\nEmberling, despite her time on the board, does not have a consistent stance on issues that we feel are pertinent. She has contributed to the ambiguous statements that prevent the current board from efficiently making decisions.\r\n\r\nWhile many of us as minors cannot express our support via an actual vote, our hope is to garner support for those who we believe will serve our best interests as students and community members. Their actions and decisions will outlive our legacies as Palo Alto High School students, but the election of Collins, Caswell and DiBrienza will ensure the best experience for future PAUSD students.","excerpt":"After much deliberation as a staff, The Paly Voice has decided to endorse Todd Collins, incumbent Melissa Baten Caswell and Jennifer DiBrienza. ","date":"2016-10-27 21:17:42","author":"The Paly Voice","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/schoolboard051016.jpg","categories":["Editorial","Election 2016","Opinion","Opinion Editor's Pick","Spotlight"],"tags":["2016","2016 election","Baten Caswell","collins","DiBirenza","elect","election","melissa","opening","PAUSD","School Board","seats","todd","vote"]},{"id":125051,"title":"Spirit Week 2016 in review","permalink":"http:\/\/palyvoice.com\/2016\/10\/27\/spirit-week-2016-in-review\/","content":"Spirit Week at Palo Alto High School is nothing short of spectacular. From thunderous rallies that can be heard from Stanford University, to awe-inspiring floats put together in a short week's time, each year brings something new and exciting to the famous tradition. With outrageous outfits and tight competitions, Spirit Week is regarded by many students as their favorite week of the school year. The Paly Voice takes a look at what made Spirit Week 2016 so memorable.\r\n\r\n<iframe src=\"https:\/\/cdn.knightlab.com\/libs\/timeline3\/latest\/embed\/index.html?source=1Ox71NOoGxroDm0MNZ9P4UyeOlBJ3pdDolM1hBEcLn6A&amp;font=Default&amp;lang=en&amp;initial_zoom=2&amp;height=750\" width=\"125%\" height=\"750\" frameborder=\"0\"><\/iframe>","excerpt":"Spirit Week at Palo Alto High School is nothing short of spectacular. The Paly Voice takes a look at what made Spirit Week 2016 so memorable.","date":"2016-10-27 08:29:35","author":"Maya Reuven","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/DSC_0107-1.jpg","categories":["Spirit Week 2016","Spotlight"],"tags":["review","Spirit Week","spirit week 2016","timeline"]},{"id":124954,"title":"Spirit Dances 2016","permalink":"http:\/\/palyvoice.com\/2016\/10\/23\/spirit-dances-2016\/","content":"Palo Alto High School Spirit Week came to a close with the after school rally on Friday. Per Paly tradition, the rally featured a Float and Spirit Dance from each grade. Additionally, several teachers performed an encore to the annual Teacher Spirit Dance.\r\n\r\nClick on the link to view the full dances and photos of each float.\r\n\r\n<iframe style=\"border: none;\" src=\"https:\/\/social.shorthand.com\/thepalyvoice\/embed\/jgdHli1J1T\" width=\"100%\" height=\"500px\"><\/iframe>","excerpt":"Palo Alto High School Spirit Week came to a close with the after school rally on Friday. Per Paly tradition, the rally featured a Float and Spirit Dance from each grade. Additionally, several teachers performed an encore to the annual Teacher Spirit Dance.","date":"2016-10-23 14:38:32","author":"Zahra Muzaffar","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/DSC_0440.jpg","categories":["Multimedia","Spirit Week 2016","Spotlight","Video"],"tags":["#palyspirit","2016","after school","afterschoolrally","dance","dances","day 5","float","float building","frehman","juniors","rally","seniors","Sophomores","spirit","spiritweek","themes","week"]}]