[{"id":114860,"title":"Student film &#8220;Unmasked&#8221; wins Student Filmmaker Tournament","permalink":"http:\/\/palyvoice.com\/2016\/01\/26\/student-film-unmasked-wins-student-filmmaker-tournament\/","content":"[caption id=\"attachment_114879\" align=\"aligncenter\" width=\"690\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/11782424_1610903165833677_814416713129292984_o.jpg\"><img class=\" wp-image-114879\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/11782424_1610903165833677_814416713129292984_o.jpg\" alt=\"Unmasked, is a student film created to uncover Palo Alto's mental health issues and the ways to overcome them. Photo: Docx Films\" width=\"690\" height=\"388\" \/><\/a> \"Unmasked\" is a student film created to uncover Palo Alto's mental health issues and the ways to overcome them.  The film premiered on <a href=\"http:\/\/studentfilmmakerawards.com\/matchup\/1538\/\" target=\"_blank\">Sept 12<\/a>.  Photo courtesy of DocX films.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">\"<span style=\"font-weight: 400;\"><a href=\"https:\/\/www.youtube.com\/watch?v=s3b6Lh6gixw\" target=\"_blank\">Unmasked<\/a>,<i>\"<\/i><\/span> a Palo Alto student-produced film, earned first place for the audience choice category of the Student Filmmaking Awards Tournament, according to an announcement on the organization's <a href=\"http:\/\/studentfilmmakerawards.com\/matchup\/1538\/\" target=\"_blank\">website<\/a> Sunday night.<\/span>\r\n\r\n<i>\"<\/i><span style=\"font-weight: 400;\">Unmasked<\/span><i>\"<\/i><span style=\"font-weight: 400;\"> competed against 31 other colleges and high schools from around the country in December and January. T<\/span><span style=\"font-weight: 400;\">he public supported the film through four rounds of voting, taking the Palo Alto production to the finals round against the <a href=\"https:\/\/www.youtube.com\/watch?v=ZJo-gGTudGM\" target=\"_blank\">University of Nebraska<\/a>. \"<\/span><span style=\"font-weight: 400;\">Unmasked<\/span><i>\"<\/i><span style=\"font-weight: 400;\"> won by 145 votes, with the final voting to be 1488-1343, according the the organization's website.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Although the <a href=\"http:\/\/palyvoice.com\/2015\/08\/27\/students-unmask-teen-mental-health-discussion-through-documentary\/\" target=\"_blank\">film<\/a> was created for the  purpose of aiding and supporting Palo Alto’s community, \"<\/span><span style=\"font-weight: 400;\">Unmasked<\/span><i>\" <\/i><span style=\"font-weight: 400;\">has been involved in two film tournaments, including the Student Filmmaker Awards Tournament since its release. The film also took home the award for the Best Short Film in November 2015 from the Big Asian Festival in Los Angeles.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It's nice to have the film recognized at the competition,” film co-director and Paly senior Christian Leong said.  “But the real sense of accomplishment was getting a film out to impact the Palo Alto community in a positive way.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">In the future, Leong and his co-director Andrew Baer look forward to continuing supporting students dealing with mental health issues.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It [the award] doesn’t mean much in terms of the future for the film,” Leong said.  “One benefit from entering into this contest, though, was that with each audience member viewing the film, we were able to spread our messages and awareness of the rising issue of teen suicide.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"<\/span><span style=\"font-weight: 400;\">Unmasked\"<\/span><span style=\"font-weight: 400;\"> was produced by DocX Films and created by 13 students: Palo Alto High School seniors Baer, Leong, Josh Yuen, Joseph Kao, Daniel Cottrell, Leslie Garcia, Natalie Snyder and Stas Ilyasov; Paly junior Zack Gibson; and Gunn High School seniors Yui Sasajima, Lydia Sun, Tanner Kerrins and Rachel Rothberg. <\/span>\r\n\r\n\"The message of the film was to encourage conversation between youth and adults and throughout the community, reduce the stigma surrounding mental health,\" Baer said.\r\n\r\n<span style=\"font-weight: 400;\">Both Leong and Baer are passionate about helping teens realize that there is always hope. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We want teens to realize that there is a lot to live for and that if problems do arise, many adults in the community are open to talking to them,” Leong said. <\/span>","excerpt":"\"Unmasked,\" a Palo Alto student produced film, earned first place for the audience choice category of the Student Filmmaking Awards Tournament last night at 11 p.m.","date":"2016-01-26 15:40:52","author":"Morgan Keller","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/11782424_1610903165833677_814416713129292984_o.jpg","categories":["News","Spotlight"],"tags":["baer","gunn","leong","mental health","paly","student film","student filmmaker tournament","unmasked"]},{"id":114851,"title":"New school or not? School board to debate Cubberley question","permalink":"http:\/\/palyvoice.com\/2016\/01\/26\/new-school-or-not-school-board-to-debate-cubberley-question\/","content":"<span style=\"font-weight: 400;\">Will a new school re-open at Cubberley Community Center? The Palo Alto Unified School District Board of Education will discuss plans for a possible new school at Cubberley and future investments into schools at the board meeting at 6:30 p.m. today. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to the <\/span><a href=\"https:\/\/www.pausd.org\/sites\/default\/files\/pdm-meeting\/agenda\/160126_agenda.pdf\"><span style=\"font-weight: 400;\">meeting agenda<\/span><\/a><span style=\"font-weight: 400;\">, the board will talk about the goals for a task force to be commissioned to “explore educational models for the Cubberley site and contiguous school properties.” Possible foci for the task force include a proposal to build an innovative secondary school and to create better education opportunities for the district as a whole. Since it is only a discussion item on the agenda, there will be no voting involved. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to board member Melissa Baten-Caswell, it might be too ambitious for one task force to tackle all the issues that concern the Cubberley site.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I personally feel like this is a lot of stuff for one task force to do,\" Baten-Caswell said. \"I feel like it would be easier if we could parse this out.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Baten-Caswell says the opinions of the board members are split on enrollment issues and the possibility of building new schools. Supt. Max McGee and Baten-Caswell both say they expect ample discussion on these topics.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“<\/span><span style=\"font-weight: 400;\">My expectation is that we will have a good discussion and that the outcome would be for the Feb. 9 meeting to have some actionable recommendations,” McGee said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">McGee supports the formation of a new K-12 campus, while Baten-Caswell says she feels that it would be more worthwhile to expand current programs.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Rather than to invest in a new secondary school, [I’d like] to put our investment into our current secondary schools so that we can invest in innovative programs,” Baten-Caswell said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Baten-Caswell predicts there will be several community members who will speak during the open forum portion of the meeting on both sides of the issue.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I think there's going to be a lot [of open forum speakers],” Baten-Caswell said. “I think there's some very strong feelings both ways, particularly about the high schools, about whether we should use our time, talent and money to invest in our existing schools or whether we should split that investment and invest in a brand new school as well as existing schools.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Baten-Caswell, the school board reviewed a survey that found the majority of students and teachers at the high school and middle school levels, along with parents from the elementary through high school levels, said that they would like to see smaller class sizes. However, Baten-Caswell says that based on enrollment data, she is not convinced that a new school is needed to fix overcrowding issues.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“If we don't need a new school, do we want a new school?” Baten-Caswell said. “I think that's really the question we need to ask at this point is do we want a new school, not whether we need it. But there are some people, including the committee [Enrollment Management Advisory Committee], that <\/span><a href=\"https:\/\/www.pausd.org\/sites\/default\/files\/pdf-faqs\/attachments\/EMACSecondarySubcommitteeFinalReport.pdf\"><span style=\"font-weight: 400;\">think our schools are too big<\/span><\/a><span style=\"font-weight: 400;\">.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Baten-Caswell notes that at the elementary school level, one solution could be shifting the flow of students so it’s spread evenly throughout all the elementary schools. The board will discuss elementary school boundary lines at the meeting.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I'd say I don't believe we do [need to open another elementary school], but I do believe we need to rejigger boundaries so we're not overflowing kids from the same school,” Baten-Caswell said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The decision to create a new school will require a lot of thought and contemplation of the consequences, including the impact on the community center aspect “<\/span><span style=\"font-weight: 400;\">because Cubberley really belongs to the community<\/span><span style=\"font-weight: 400;\">,” according to Baten-Caswell.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Conceptually, I think starting something new is fun,” Baten-Caswell said. “Are you willing to use some of your money and some of your people's time to do it? That means that they won't be able to spend that same time and money on existing programs. You have to decide if that's the most important thing.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">McGee aims to be mindful of the district’s mission: to improve the preparedness of students and enrich their educational opportunities.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I think that even more importantly they [EMAC] pointed out to really think about student connectedness, about opportunities and access, about how to make our schools even better than the excellent schools they already are,” McGee said.<\/span>","excerpt":"The Palo Alto Unified School District Board of Education will discuss plans for a possible new school at Cubberley and future investments into schools at the board meeting at 6:30 p.m. today. ","date":"2016-01-26 15:39:09","author":"Ana Caklovic","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/12346906_939036946172394_37820261_n.jpg","categories":["News","Spotlight"],"tags":["class sizes","discussion","elementary school","future investments","high school","innovative programs","McGee","meeting","melissa baten-caswell","middle school","new school","overcrowding","School Board","secondary school","superintendent"]},{"id":114546,"title":"Robotics team prepares for upcoming season","permalink":"http:\/\/palyvoice.com\/2016\/01\/26\/robotics-team-prepares-for-upcoming-season\/","content":"[caption id=\"attachment_114550\" align=\"alignnone\" width=\"549\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12544195_197840773898480_611464048_o.jpg\"><img class=\" wp-image-114550\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12544195_197840773898480_611464048_o.jpg\" alt=\"Senior and team captain Claire Kokontis leads the strategy meeting for the Palo Alto High School robotics team. \" width=\"549\" height=\"366\" \/><\/a> Senior and Team Captain Claire Kokontis says she leads a strategy meeting for the Palo Alto High School robotics team. Kokontis hopes that the team's increased focus will help them win its upcoming competitions. Photo by Chirag Akella.[\/caption]\r\n\r\nThe Palo Alto High School robotics team is starting to prepare for its upcoming season after learning of this year's challenge.\r\n\r\nThe team started the season off by focusing on strategic planning, according to team captain Claire Kokontis.\r\n\r\n“One of the things we’re working on this year is focusing on strategy first instead of robot design,” Kokontis said. “Last year we got wrapped into a robot design without thinking what we wanted our robot to do. After you get into one design, you’re stuck with what your robot can do with that design, so by thinking about strategy first, we want to open ourselves up and be creative.\"\r\n\r\nAccording to junior Build Captain Kenneth Cheung, this year's challenge has a medieval theme where the robot has to fire dodgeballs into towers. The robot also has to be able to navigate through several obstacles in order to reach said towers.\r\n\r\nAccording to Cheung, the strategy talk involved a myriad of topics that the team has to address.\r\n\r\n“We just watched the video this morning and focused on strategy,” Cheung said. “We split up into three groups and went into these individual classrooms and wrote down on a whiteboard all the reasons we could score, all the reasons we could defend and all the restrictions we might have. After that we brainstormed game strategy--do we want to focus on weaker defenses, or do we want to focus on rough terrain, or do we want to focus on shooting balls?\"\r\n\r\nKokontis says she hopes the increased emphasis on strategy can help the team improve on last year’s performance, where they placed 38th place out of 49 and 53rd place out of 57 at the Central Valley and Silicon Valley tournaments respectively.\r\n\r\n“Last year we didn’t do super great,” Kokontis said. “But this year we know how to do a lot more than we did last year. I am hoping to get in the top 15 [in the First Stronghold tournament] somewhere or go to the elimination rounds.”\r\n\r\nThe season officially kicks off with the Central Valley Regional tournament on March 10.","excerpt":"The Palo Alto High School robotics team has started its preparations for its upcoming season after learning of this year's challenge.","date":"2016-01-26 11:34:38","author":"Chirag Akella","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12544195_197840773898480_611464048_o.jpg","categories":["News"],"tags":["cheung","FirstStronghold","kokontis","paly","robotics"]},{"id":114927,"title":"International lunch is on Thursday, Feb. 4","permalink":"http:\/\/palyvoice.com\/2016\/01\/26\/international-lunch-is-on-thursday-feb-4\/","content":"","excerpt":"","date":"2016-01-26 10:43:13","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":114925,"title":"AMC testing is on Tuesday, Feb. 2","permalink":"http:\/\/palyvoice.com\/2016\/01\/26\/amc-testing-is-on-tuesday-feb-2\/","content":"","excerpt":"","date":"2016-01-26 10:41:25","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":114923,"title":"National counseling week is from Monday, Feb. 1 through Friday, Feb. 5","permalink":"http:\/\/palyvoice.com\/2016\/01\/26\/national-counseling-week-is-from-monday-feb-1-through-friday-feb-5\/","content":"","excerpt":"","date":"2016-01-26 10:40:31","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":114730,"title":"Editorial: Explore other avenues to counter overcrowding","permalink":"http:\/\/palyvoice.com\/2016\/01\/25\/editorial-explore-other-avenues-to-counter-overcrowding\/","content":"[caption id=\"attachment_114838\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/unnamed1.jpg\"><img class=\"wp-image-114838\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/unnamed1.jpg\" alt=\"Sophomores Sam Guernsey, and Michaela Fogarty work on a project in Social Justice Pathway. According to the Palo Alto High School course catalog, &quot;The Social Justice Pathway is a three-year program featuring self-direction and project-based learning in an interdisciplinary model rooted in community action and collaboration.&quot; Photo by Cooper Lou.\" width=\"600\" height=\"450\" \/><\/a> Sophomores Sam Guernsey, Gabe Cohen and Michaela Fogarty work on a project in the Social Justice Pathway. According to the Palo Alto High School course catalog, \"The Social Justice Pathway is a three-year program featuring self-direction and project-based learning in an interdisciplinary model rooted in community action and collaboration.\" Photo by Cooper Lou.[\/caption]\r\n\r\nAnticipating an influx in the number of students enrolled in the district, the Palo Alto Unified School District Board of Education has been contemplating a series of proposals to build new schools to accommodate a larger student population. At the school board meeting on Jan. 6, the Enrollment and Management Advisory Committee, created to conduct research on school sizes and overcrowding, recommended further exploration of <a href=\"https:\/\/www.pausd.org\/sites\/default\/files\/pdf-faqs\/attachments\/EMACSecondarySubcommitteeFinalReport.pdf\">five different proposals<\/a>, one of which calls for building a new high school that emphasizes project-based learning at the Cubberley Community Center. While we appreciate the effort that has gone into researching solutions to the problem, we believe that the district should not adopt the plan to transform Cubberley into an “innovative school” that will benefit only a relative few. Instead, it ought to focus its attention on expanding project-based learning opportunities at existing high schools.\r\n\r\nProject-based learning is a hands-on classroom approach in which students actively explore real-world problems in the form of research, projects and presentations. <span style=\"line-height: 1.5;\">Increased access to project-based learning would be a welcome addition to Palo Alto schools, but the more pressing issue is overcrowding, and the board should be directing its time and resources accordingly. All of the five EMAC recommendations included a provision to build another school, but not one suggested focusing on expanding the physical capacity of Gunn and Palo Alto High School or hiring more instructors. The reality is that district funding is finite, and the millions of dollars of annual operational costs for the proposed high school would best be spent improving the current high schools. In fact, the city has already taken steps to increase funds for existing schools — last year, Palo Alto passed <\/span><a style=\"line-height: 1.5;\" href=\"http:\/\/pausd-web.pausd.org\/community\/2015MeasureA\/index.shtml\">Measure A<\/a><span style=\"line-height: 1.5;\">, which established a parcel tax. The revenue will be used to hire more teachers and keep class sizes small, which is a path we should continue to take.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Furthermore, several problems will arise if Cubberley is to be a transformed into an innovative school — first and foremost is the issue of funding. Providing students at the new school with the smaller class sizes and breadth of course offerings recommended by the EMAC will require spending more dollars per student, which is in direct conflict with <a href=\"http:\/\/pausd-web.pausd.org\/community\/board\/Policies\/downloads\/BP6171_TitleI.pdf\">Board Policy 6171<\/a>. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We have a commitment in the school board for equal funding for students across each of our schools,” said board member Ken Dauber, who agrees that the district should focus on improving the current schools, rather than building another one, in an interview with The Paly Voice. “So it’s not possible for us to spend more money per student. The alternative that I have heard is using private funding to make up the difference and supplement the spending so that we’re not spending more public dollars per student. This is also not possible under our current policies, because we don’t want to create a fundraising arms race between schools where they raise money for their own students, more so than other schools, creating inequity.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Even if the proposal could be modified so that the costs of the new school are in accordance with Board Policy 6171, which is improbable, money and time would still be better directed toward solving the numerous other pressing problems in the district, like Gunn's ineffective advisory system, oversized classes, limited access to project-based learning and the <a href=\"http:\/\/palyvoice.com\/2015\/10\/29\/school-board-discusses-achievement-gap-solutions\/\">achievement gap<\/a> — the discrepancy in academic performance between socio-economically advantaged and disadvantaged students. Overcrowding is certainly an issue, but it is not the only one. The district needs to prioritize.<\/span>\r\n\r\nAlthough it may not seem so, the opening of a new high school with the lottery system could create a socio-economic inequality that we see in the district's other lottery schools, Ohlone Elementary and Hoover Elementary Schools. On average, 8.95% of students in the district's elementary schools are socio-economically disadvantaged, according to the most <a href=\"http:\/\/pausd-web.pausd.org\/community\/about\/sar.shtml\">recent School Accountability Report Cards<\/a>, compared to the significantly lower 3.5% at Ohlone, and 5.1% at Hoover. A lottery system theoretically ensures equal opportunity for all students, but realistically speaking, current and past trends show that less socio-economically disadvantaged students will apply than what should be considered equal. The district should avoid pursuing a project that could potentially exacerbate the achievement gap.\r\n\r\n<span style=\"font-weight: 400;\">Additionally, the proposed high school would be able to hold about 400-600 students, which, considering the amount of money that would have to be spent, is a negligible dent in the projected maximum of 4100 high school students districtwide. Since the school would be so much smaller than both Paly and Gunn, enrollment would likely have to be determined through a lottery system. It seems contrary to the goals of the district to spend disproportionate amounts of money on a venture that only stands to benefit a select few. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Building a new high school entirely is impractical at this point in time, but it is possible that in the next several years, the increase in student population necessitates opening another campus. If the district goes down this path, the new school should be similar to Paly and Gunn in regards to its structure and course offerings, rather than an exclusively project-based learning school.<\/span>\r\n\r\nProponents for the new school argue that many students feel disconnected from their learning, and are looking for a more personal education experience which can be provided at a new school. Although it is true that 5% of students at <a href=\"https:\/\/drive.google.com\/file\/d\/0B0Te89oAASzOTU9wZjdrTkJ3X0U\/view\">Paly <\/a>and 9% of students at <a href=\"https:\/\/drive.google.com\/file\/d\/0B0Te89oAASzOZHQtbFBGZ05vSXc\/view\">Gunn <\/a>have little to no engagement in learning according to a survey by the school board in cooperation with Stanford, it would be significantly more cost efficient to create more non-traditional, project-based learning opportunities at the current schools. The district can explore creating additional programs similar to the Social Justice Pathway or the Sports Career Pathway that provide students with a more personalized learning experience, while increasing innovative educational opportunities for all students. At the same time, creating more of such pathways would draw students out of traditional classes, and effectively lessen class sizes.\r\n\r\n<span style=\"font-weight: 400;\">We should be directing our time and energy toward enhancing the learning experience for the entire student body, rather than getting swept up in the novelty of a specialty school that will serve only a small sector of the population.<\/span>","excerpt":"We believe that the district should focus its attention on expanding project-based learning opportunities at existing high schools, rather than adopting the plan to transform Cubberley into an “innovative school” that will benefit only a relative few.","date":"2016-01-25 19:11:00","author":"The Paly Voice","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/unnamed1.jpg\nmodel rooted in community action and collaboration.&quot; Photo by Cooper Lou.\" \/>","categories":["Editorial","Opinion","Opinion Editor's Pick","Spotlight"],"tags":[]},{"id":114855,"title":"Recap: Boys&#8217; soccer defeats Santa Clara 2-0 and continues streak","permalink":"http:\/\/palyvoice.com\/2016\/01\/25\/recap-boys-soccer-defeats-santa-clara-2-0-and-continues-streak\/","content":"[caption id=\"attachment_114916\" align=\"alignright\" width=\"273\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Screen-Shot-2016-01-25-at-11.22.45-PM.png\"><img class=\"wp-image-114916 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Screen-Shot-2016-01-25-at-11.22.45-PM.png\" alt=\"The Vikings went on to win 2-0, maintaining an undefeated league record today after school at Palo Alto High School in a game against Santa Clara High School. Photo by Mary McNamara.\" width=\"273\" height=\"268\" \/><\/a> Senior right and left winger Siddharth Srinivasan is met by a Bruins defender before he attempts to score. The Vikings went on to win 2-0, maintaining an undefeated league record today after school at Palo Alto High School in a game against Santa Clara High School. Photo by Mary McNamara.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto High School boys’ soccer team (10-0-1, 3-0-0) dominated the Santa Clara High School Bruins (5-3-1, 2-2-0) at home in a tight match where the Vikings won 2-0 and continued their undefeated season.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Vikings maintained a lead throughout the game.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I think we had a good game,” head coach Don Briggs said. “We controlled the ball most of <\/span><span style=\"font-weight: 400;\">the time.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Throughout the game, the Vikings showed stronger communication than the Bruins as they were constantly talking to each other and organizing their positions. However the Bruins led in physicality often leading to fouls; luckily no serious injuries were inflicted.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">A first half goal by senior right and left winger Siddharth Srinivasan gave the Vikings a lead. Shortly after, senior striker Alessandro Reale scored an impressive goal with an assist from striker junior Michel Ange Siaba. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“They are a tough team but I think having home-court advantage is going to help us win this game if we have good supporters cheering us on,” Siaba said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Vikings remain undefeated and will face off against Los Gatos (5-2-5, 1-1-1) on Wednesday at 3:30 p.m. at Paly.<\/span>","excerpt":"The Palo Alto High School boys’ soccer team (10-0-1, 3-0-0) dominated the Santa Clara High School Bruins (5-3-1, 2-2-0) at home in a tight match where the Vikings won 2-0 and continued their undefeated season.","date":"2016-01-25 18:32:33","author":"Emilia Diaz-Magaloni","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Screen-Shot-2016-01-25-at-11.22.45-PM.png","categories":["Sports","Sports Recap"],"tags":[]},{"id":114728,"title":"Ceremony honors science teacher Kenyon Scott","permalink":"http:\/\/palyvoice.com\/2016\/01\/24\/ceremony-honors-science-teacher-kenyon-scott\/","content":"Palo Alto High School <a href=\"http:\/\/palyvoice.com\/2016\/01\/07\/storify-in-memory-of-kenyon-scott\/\">students, faculty and parents<\/a> celebrated the life of AP Environmental Science teacher Kenyon Scott at a ceremony yesterday afternoon in the Media Arts Center.\r\n\r\n[caption id=\"attachment_114739\" align=\"alignright\" width=\"415\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12575980_10203938839430225_1781577378_n.jpg\"><img class=\"wp-image-114739\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12575980_10203938839430225_1781577378_n.jpg\" alt=\"12575980_10203938839430225_1781577378_n\" width=\"415\" height=\"277\" \/><\/a> Kenyon Scott's friends, family and students gather in the MAC to celebrate his life. \"I thought it [the ceremony] was terrific,\" his brother, Joe Scott said. \"He would've loved it. ... It was somber but at the same time, upbeat.\" Photo by Aidan Maese-Czeropski.[\/caption]Hundreds attended the ceremony, which included speeches from Mr. Scott's friends, family and principal Kim Diorio.\r\n\r\n\"It [the ceremony] was really heartwarming and I am proud of our Paly family for doing such a great job with this and coming together,\" Diorio said.\r\n\r\nA common theme throughout the event was <a href=\"http:\/\/palyvoice.com\/2016\/01\/22\/community-shares-memories-amid-teachers-passing\/\">Mr. Scott's love for teaching at Paly<\/a>.\r\n\r\n\"He loved the school and he was proud to be a part of it,\" his brother Joe Scott said.\r\n\r\nThe celebration commenced with the song \"What I Got\" by Sublime, performed by senior Jer Samos, choir teacher Michael Najar and juniors Emily Read and Spencer Wycoff.\r\n\r\n\"His family chose it [the song] for us,\" Read said.\r\n\r\n[caption id=\"attachment_114738\" align=\"alignright\" width=\"402\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12607298_10203938840310247_141374175_n.jpg\"><img class=\"wp-image-114738\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12607298_10203938840310247_141374175_n.jpg\" alt=\"12607298_10203938840310247_141374175_n\" width=\"402\" height=\"261\" \/><\/a> Choir teacher Michael Najar, juniors Emily Read and Spencer Wycoff and senior Jer Samos perform \"What I Got\" by Sublime to commence the ceremony. \"We were given the song because it's his favorite song, or his favorite song by Sublime,\" Read said. Photo by Aidan Maese-Czeropski.[\/caption]\r\n\r\nSenior Kevin Bowers led the audience in a hand-clapping exercise to commemorate one of Mr. Scott's classroom traditions before a series of speakers told anecdotes about the veteran teacher's life.\r\n\r\n\"I will always remember his hearty laugh and eye-to-eye smile,\" math teacher Arne Lim said. \"He represented everything about teaching. ... He conducted his classes with power and energy.\"\r\n\r\n<span style=\"font-weight: 400;\">Several of Mr. Scott’s friends related personal stories about playing golf, as well as spoke about his passions for the University of California Berkeley’s football team, geology and the Earth.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"Each of you [students] made a very big difference in his life,\" one friend said.<\/span>\r\n\r\nFamily members also took the stage to reminisce on childhood memories. Joe Scott discussed a backpacking trip in which Mr. Scott saved his brother, Jon, from a rattlesnake bite by finding help in the wilderness.\r\n\r\n\"Ken was everyone's hero,\" Joe Scott said.\r\n\r\nMr. Scott's sister, Laurie Burmeister, shared letters she received after his passing.\r\n\r\n\"He was a witty, smart, sensitive, passionate man,\" Burmeister said.\r\n\r\nEmily Scott honored her father with a performance art piece that depicted the struggles a girl faces due to being \"different.\" Emily Scott said her father had enjoyed the piece.\r\n\r\nTo conclude the ceremony, Paly's symphonic band performed three UC Berkeley songs to honor his enthusiasm for Cal's football team, the Golden Bears.","excerpt":"Palo Alto High School students, parents and faculty are celebrating Advanced Placement Environmental Science teacher Kenyon Scott's life after a ceremony yesterday afternoon in the Media Arts Center.","date":"2016-01-24 14:09:13","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12575980_10203938839430225_1781577378_n.jpg","categories":["News","Spotlight"],"tags":["ap","apes","Arne Lim","diorio","environment","environmental science","Kenyon","Kenyon Scott","lim","mac","media","media arts center","michael najar","najar","science","Scott","uc berkeley","what I got"]},{"id":114763,"title":"All spring sports begin on Monday, Feb. 1","permalink":"http:\/\/palyvoice.com\/2016\/01\/23\/all-spring-sports-begin-on-monday-feb-1\/","content":"","excerpt":"","date":"2016-01-23 22:28:33","author":"Josh Yuen","categories":["Ticker"],"tags":[]}]