[{"id":113735,"title":"Coming Soon: Weekly Newsletters from The Paly Voice!","permalink":"http:\/\/palyvoice.com\/2015\/12\/30\/coming-soon-weekly-newsletters-from-the-paly-voice\/","content":"","excerpt":"","date":"2015-12-30 22:17:47","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":113101,"title":"Blogger without borders: Refugee stories, Part 2","permalink":"http:\/\/palyvoice.com\/2015\/12\/21\/blogger-without-borders-refugee-stories-part-2\/","content":"<em>The second installment of \"Blogger without borders: Refugee stories,\" where <span class=\"Apple-style-span\">junior Bianca Al-Shamari shares refugees' stories that are translated from Arabic. <\/span><\/em>\r\n\r\n<span style=\"text-decoration: underline;\"><strong>Interview #1<\/strong><\/span>\r\n\r\n[audio m4a=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/Arabic-7.m4a\"][\/audio]\r\n\r\n<em> Odai Al-Ayed and his family are currently learning German in hopes of finding jobs and attending school. Al-Ayed describes himself and his family as \"very fortunate given the circumstances\" and is one of the most optimistic people that I spoke with during these interview series.<\/em>\r\n\r\n\"My journey took 15 days to get to Austria. The situation in Austria is secure, very good and blessed from God. I want to stay in Austria. I do not want to go anywhere else since the life here is good and really, really nice, unlike how it is in my country. In my country, we were hurt by war, killings, and homelessness. Here, we are really relaxed. If God wills, life is becoming better. ... If God wills, life will be better in the next 6 months. Here, there are good people. I don’t have family left in Iraq, I took them all with me. If God wills, we will only see good things from these people. God bless them.\"\r\n\r\n<span style=\"text-decoration: underline;\"><strong>Interview #2<\/strong><\/span><strong>,<\/strong><span style=\"text-decoration: underline;\"><strong> Interview #3<\/strong><\/span>\r\n\r\n<em>While many refugees were open to share their experiences, many still live in fear of their past in their home countries. For this reason, the two following interviewees have agreed to answer questions and share backstories in anonymity. Both have asked for their names to be changed to <em>Hassan<\/em><\/em><em>.<\/em>\r\n\r\n<span style=\"text-decoration: underline;\">Interview #2<\/span>\r\n\r\n<em>Hassan lost his family in Iraq during a series of suicide bombings. He fled to Austria in early October and is currently building a new life. His goal is \"to speak German by the same day next year\" since his initial arrival.<\/em>\r\n\r\n[audio m4a=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/Arabic-4.m4a\"][\/audio]\r\n\r\n\"I do not have a family and I am living alone; therefore my situation is private.\"\r\n\r\n<span style=\"text-decoration: underline;\">Interview #3<\/span>\r\n\r\n[audio m4a=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/Arabic-5.m4a\"][\/audio]\r\n\r\n\"I cannot speak because my situation does not allow me to talk about my story.\"","excerpt":"The second installment of \"Blogger without borders: Refugee stories,\" where junior Bianca Al-Shamari shares refugees' stories that are translated from Arabic. ","date":"2015-12-21 12:05:15","author":"Bianca Al-Shamari","categories":["Blog","Blogger without borders"],"tags":["al shamari","arabic","attacks","Austria","bianca","blogger","blogger without borders","bombardment","german","isis","refugee crisis","syria","vienna"]},{"id":113722,"title":"Second semester begins on Tuesday, Jan. 5. Enjoy Winter Break!","permalink":"http:\/\/palyvoice.com\/2015\/12\/19\/second-semester-begins-on-tuesday-jan-5-enjoy-winter-break\/","content":"","excerpt":"","date":"2015-12-19 17:32:33","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":113694,"title":"District pilots course evaluation survey, receives mixed reviews","permalink":"http:\/\/palyvoice.com\/2015\/12\/17\/district-pilots-course-evaluation-survey-receives-mixed-reviews\/","content":"[caption id=\"attachment_113697\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/DSC_0006.jpg\"><img class=\"size-full wp-image-113697\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/DSC_0006.jpg\" alt=\"captionnnnnnn\" width=\"600\" height=\"400\" \/><\/a> Sophomore Nikki Merkle-Raymond participates in the student feedback survey issued by PAUSD last week on her phone for her math class. Many students used mobile phones to take the survey, though iPads and computers were available. Photo by Emma van der Veen.[\/caption]\r\n\r\nThe Palo Alto Unified School District has issued a new district-wide student input survey to collect data and give students a chance to provide feedback for their teachers and courses.\r\n\r\nAccording to Principal Kim Diorio, the survey was created to gain insight into student opinion on courses and course alignment, one of the <a href=\"http:\/\/palyvoice.com\/2014\/10\/23\/wasc-releases-goals-for-new-accreditation-cycle\/\">three Western Association of Schools and Colleges (WASC) committee's goals<\/a> as of last year.\r\n\r\n“The district wanted to be able to create a system for some uniform questions across teachers and across courses so that it would be easier compare the different student input in the different courses as we work on our goal of alignment and consistency,” Diorio said.\r\n\r\nAccording to Diorio, although many teachers have administered their own surveys in the past, this survey gives the district, departments and teachers more consistent feedback.\r\n\r\n“It [the survey] is to get some feedback from students and to make sure we have a systemic process of doing that,” Diorio said. “In the past, many teachers have developed their own surveys that they’ve used with students and they’re welcome to continue to do that, but they still have to administer these questions as well.”\r\n\r\nSome teachers, such as English teacher George Vuong, expressed concern with the misleading requirement to enter student IDs prior to survey completion, despite the survey being anonymous.\r\n\r\n“In the fine print, it says something like ‘confidential,’ so I was worried about that for the students,” Vuong said. “I wasn’t sure what confidential meant. Hopefully it will be anonymous when the feedback is released. I didn’t want the students to say something and then get tracked down for it, so I was worried for them.”\r\n\r\nAccording to Diorio, the student ID login is to prevent a single user from filling out multiple surveys.\r\n\r\n“I won’t and teachers won’t have access to who said what,” Diorio said. “It’s more used on the back end with IT [Information Technology] and the software company that it’s run through. I think they were worried that without having some way for students to identify that it would invalidate some of the results. They wanted to make sure that it was a single sign-on.”\r\n\r\nThe survey was generally well-received by students, as it gave them a chance to say what might not otherwise be said, according to sophomore Tanay Krishna.\r\n\r\n“The survey is useful because it gives students an opportunity to directly critique things that they think are going well and things that are not going well in their classes,” Krishna said. “If students don’t feel comfortable telling their teachers something, it gives them a way to say what could be improved in their classes.”\r\n\r\nThe survey consists of 12 questions and is administered in all classes, according to Diorio.\r\n\r\n“It’s 10 questions that are all on the likert scale, so strongly disagree to strongly agree,” Diorio said. “Then, there are two open-ended questions. The questions were negotiated between the district and the Palo Alto Education Association, PAEA, last spring as part of the collective bargaining that takes place every year with the annual teacher’s contract.”\r\n\r\nAccording to science teacher Ashwini Avadhani, the survey is an effective way to give feedback to teachers, which is important for improving learning environments.\r\n\r\n“The questions are fair and I think that students should have their opinions and should have a right to give a teacher feedback,” Avadhani said. “Teachers also need to get feedback. They need to know what they’re doing right and what they’re doing wrong.”","excerpt":"The Palo Alto Unified School District has issued a new district-wide student input survey to collect data and give students a chance to provide feedback for their teachers and courses.","date":"2015-12-17 20:11:24","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/DSC_0006.jpg","categories":["News","Spotlight"],"tags":["avadhani","diorio","paea","palo alto high school","paly","PAUSD","student","survey","Vuong"]},{"id":113666,"title":"Robotics Team fighting to win competition tomorrow","permalink":"http:\/\/palyvoice.com\/2015\/12\/16\/robotics-team-fighting-to-win-competition-tomorrow\/","content":"Palo Alto High School’s Zero Robotics Team is in first place among the semifinalist bracket of the 2015 Zero Robotics High School Tournament and has a chance of becoming a finalist if they keep their position after tomorrow's game.\r\n\r\nIf the Vikings compete successfully against other groups tomorrow, the team will keep its first place title in the \"losing\" bracket and advance to compete in the finalist round. The teams are competing for a chance to operate their code on a robot in the International Space Station, according to robotics head coach Christopher Kuszmaul.\r\n\r\nIn the contest, robots compete with each other in a series of one-on-one online simulations, Kuszmaul said. The robot with the most points moves forward in the competition. Zero Robotics is unique in that its robots are controlled by programming; during competitions, the robots run autonomously by code.\r\n\r\nThe Paly Zero Robotics team, with approximately eighty students, started this year as a subdepartment of the school’s larger Robotics Team. Zero Robotics is a worldwide robotics competition oriented completely on software, according to Kuszmaul. Paly’s team is working in conjunction with robotics groups in Italy and Southern California.\r\n\r\n“Zero Robotics was created at Paly in part by students having so much interest in the Robotics Team,” Kuszmaul said. “We needed a way to accommodate all the students interested but didn’t have the lab room.”\r\n\r\nThe results from tomorrow’s competition will be available on the <a href=\"http:\/\/zerorobotics.mit.edu\/tournaments\/\">Zero Robotics website<\/a>.","excerpt":"Paly's Zero Robotics Team is in first place among the semifinalist bracket of the 2015 Zero Robotics High School Tournament and has a chance of becoming a finalist if they keep their position after tomorrow's game.","date":"2015-12-16 23:03:10","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/Screen-Shot-2015-12-16-at-7.54.01-PM.png","categories":["News"],"tags":["chris","code","competition","finalist","international space station","kuszmaul","paly","programming","robot","robotics","semi finalist","zero"]},{"id":113635,"title":"Coffee chats: History teacher Adam Yonkers","permalink":"http:\/\/palyvoice.com\/2015\/12\/15\/coffee-chats-history-teacher-adam-yonkers\/","content":"[caption id=\"attachment_113641\" align=\"alignleft\" width=\"283\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/photo1.jpg\"><img class=\" wp-image-113641\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/photo1.jpg\" alt=\"History teacher Adam Yonkers shares his career change story with The Paly Voice. Photo by Aisha Chabane. \" width=\"283\" height=\"319\" \/><\/a> History teacher Adam Yonkers shares his career change story with The Paly Voice. Photo by Aisha Chabane.[\/caption]\r\n\r\n<em>This is the second installment of <a href=\"http:\/\/palyvoice.com\/2015\/11\/15\/coffee-chats-english-teacher-alanna-williamson\/\">Coffee Chats,<\/a> where The Paly Voice gets to know staff members over a cup of coffee.<\/em>\r\n\r\n<span style=\"font-weight: 400;\">The Paly Voice sat down with history teacher Adam Yonkers over a cup of Americano coffee to discuss the impact of switching careers and his experience teaching at Palo Alto High School.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Yonkers has been teaching at Paly for 10 years. He teaches U.S. Government and Contemporary World History for 10th grade, as well as Foreign Policy, an elective for upperclassmen.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Yonkers grew up in Washington, D.C., and majored in marketing communications and public relations at Colorado College. According to Yonkers, he pursued those majors along with law until his early 30s when he realized it wasn’t what he wanted to do in life. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“<\/span><span style=\"font-weight: 400;\">I was really unhappy because I didn’t like the nature of the work,” Yonkers said. “I kept on going to bed reading these big history books and I was like, 'I want to coach and do something I’m more interested in.'”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">After this realization, Yonkers applied to Stanford for a masters program while working across the street at Paly. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Yonkers, the transition from business to teaching was somewhat smooth because of his past employment experiences. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“For my marketing communications background, I was writing publications and internal memos for businesses,” Yonkers said. “That’s what I do all day long [now]; read students' work and the news, and try to synthesize that information and then try to teach it.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">However, Yonkers was surprised by how different teaching was from an office job. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“There’s a lot of other parts of teaching that I was not prepared for,\" Yonkers said. \"I mean, I don't think you can be prepared for it until you teach. The cool part is this, you guys [students], the human factor. But the hard part is all the preparation and the grading and then the performance.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Yonkers, Paly has positively changed since he arrived 10 years ago. When he first began teaching, Paly started at 7:50 a.m. and there were only two block days a week. Since then, Paly implemented four block days that start 25 minutes later and eliminated the zero period. Yonkers says that this and other new administrative policies have helped to improve students' mental health.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“<\/span><span style=\"font-weight: 400;\">I think that there are a lot more outlets for kids that are in trouble and the mental awareness are available and that administration is a lot more open to that dialogue, so I think it's better,” Yonkers said.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">He also said that most issues students currently face are associated with the competitive environment.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“You're a talented group of teenagers and you don't realize that you're in an actually really good position,” Yonkers said. “Once you're out of Palo Alto, you'll realize that you're totally well prepared. But it's hard not to get caught up in getting compared to others within Palo Alto.”<\/span>\r\n\r\nOne of Yonkers' favorite parts of teaching is when former students visit after high school and have gained a whole new perspective on their lives because of new experiences.\r\n\r\n“You can have people tell you it's this way and that way,\" Yonkers said. \"But you won't know exactly until you really go through it and go out into the world and start to see that you'll be well prepared,\" Yonkers said.","excerpt":"The Paly Voice sat down with history teacher Adam Yonkers over a cup of Americano coffee to discuss the impact of switching careers and his experience teaching at Palo Alto High School for 10 years.","date":"2015-12-15 11:23:28","author":"Aisha Chabane","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/Screen-Shot-2015-12-15-at-11.07.58-AM.png","categories":["Coffee chats"],"tags":["10th grade","coffee","coffee chat","foreign policy","history","Teacher","Yonkers"]},{"id":113453,"title":"Art classes present glass purple hearts to veterans","permalink":"http:\/\/palyvoice.com\/2015\/12\/15\/art-classes-present-glass-purple-hearts-to-veterans\/","content":"[caption id=\"attachment_113469\" align=\"aligncenter\" width=\"237\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/12387870_455010471350196_1082091635_n.jpg\"><img class=\"size-full wp-image-113469\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/12387870_455010471350196_1082091635_n.jpg\" alt=\"Senior [[[[do you know who the senior is?]]]]... writes and signs a card that will be presented with the artwork. Photo by Morgan Keller.\" width=\"237\" height=\"291\" \/><\/a> Senior Emmanuelle Poivet writes and signs a card that will be presented with glass purple hearts to Palo Alto veterans. Photo by Morgan Keller.[\/caption]<span style=\"font-weight: 400;\">Palo Alto High School’s intermediate ceramics classes have been making hand-blown glass jewelry and paperweights to distribute to <\/span><span style=\"font-weight: 400;\">Palo Alto veterans during finals week. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to art teacher Steve Ferrera, his students have for the past few weeks been designing glass Purple Heart heart bracelets and necklaces, as well as glass Purple Heart paperweights in honor of the veterans’ services. Purple Hearts are often given as a military decoration to veterans who have been wounded or killed while serving the country. The students are also gift wrapping the art pieces and making cards to deliver to the Palo Alto Veterans Administration.<\/span>\r\n\r\nThis is the first year the art department has worked with the Purple Heart idea, but art teachers have collaborated on other projects with organizations such as the Traumatic Brain Injury Center during the Halloween season in the past. <span style=\"font-weight: 400;\">This year, t<\/span><span style=\"font-weight: 400;\">he students learned how to make glass paperweights and beads in class, and decided to use their new skills to give to veteran patients that are away from friends and families over holidays, Ferrera said, adding, \"I<\/span>t's just a little gesture to lift everyone's spirits.\"\r\n\r\nJunior Cassandra Fong, a ceramics student, said she appreciates the ability to learn new skills while simultaneously giving to the community.\r\n\r\n\"I love the opportunity to use our glass blowing equipment to make Purple Hearts to show our appreciation for our veterans,\" Fong said.\r\n\r\n<span style=\"font-weight: 400;\">The project shows students that art is important and useful in many ways, including helping to improve the common good, according to Ferrera.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“You always hear kids and other people asking what art is good for, and this puts that question into perspective,” Ferrera said. <\/span>","excerpt":"Palo Alto High School’s intermediate ceramic classes are giving handblown glass jewelry and paperweights to Palo Alto veterans during finals week.  ","date":"2015-12-15 10:44:08","author":"Morgan Keller","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/IMG_5669.jpg","categories":["News"],"tags":["art","ceramics","class","jewelry","paly","purple hearts","veterans"]},{"id":113258,"title":"Before and after: Boys&#8217; soccer show off new haircuts","permalink":"http:\/\/palyvoice.com\/2015\/12\/14\/before-and-after-boys-soccer-show-off-new-haircuts\/","content":"<span style=\"font-weight: 400;\">The Palo Alto High School boys’ soccer team (5-0, 0-0) is sporting new haircuts this winter for its upcoming season. The tradition of giving first-year varsity players especially notable haircuts is regarded by some as hazing, but by others as a fun team-bonding exercise.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to senior goalkeeper Eli Friedlander, the tradition of giving team haircuts originated from the team's former preseason schedule full of Catholic private schools.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The idea is that we would have crazy haircuts to play them,” Friedlander said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Creative measures are taken by the haircut givers, usually upperclassmen on the team, according to junior outside defender Neil Verwillow. First-year varsity players are given especially memorable haircuts, though no one is forced to get a haircut.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“This year, some people tried to replicate professional players’ haircuts such as Marco Reus,” Verwillow said. “I knew that if it was your first year playing varsity, a really bad haircut was given. No one is forced to get a bad one, and even if they [choose to get a haircut], they could stop and walk away at any point for any reason.” <\/span>\r\n\r\nAccording to Verwillow, the experience was positive and uniting for the team.\r\n\r\n<span style=\"font-weight: 400;\">“It's a very positive team building activity,” Verwillow said. “It's fun to receive one [a haircut], and you can show it off as a token of making the varsity squad. Plus you get to wear a comfy beanie for a while.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Check out some of the first-year varsity players’ haircuts before-and-after gifs below.<\/span>\r\n\r\n[caption id=\"attachment_113477\" align=\"alignright\" width=\"180\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/IMG_5712.gif\"><img class=\"size-full wp-image-113477\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/IMG_5712.gif\" alt=\"Before: Gif by Morgan Keller\" width=\"180\" height=\"320\" \/><\/a> After: Tracy with the \"Bungy\" style. GIF by Morgan Keller[\/caption]\r\n\r\n[caption id=\"attachment_113499\" align=\"alignleft\" width=\"177\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/IMG_5736.gif\"><img class=\" wp-image-113499\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/IMG_5736.gif\" alt=\"Before: Gif by Morgan Keller.\" width=\"177\" height=\"314\" \/><\/a> Before: Junior Brian Tracy. GIF by Morgan Keller.[\/caption]\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n[caption id=\"attachment_113485\" align=\"alignright\" width=\"182\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/IMG_5722.gif\"><img class=\" wp-image-113485\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/IMG_5722.gif\" alt=\"After: Gif by Morgan Keller.\" width=\"182\" height=\"323\" \/><\/a> After: Colchen with the \"Giovanni Simeone\" style. GIF by Morgan Keller.[\/caption]\r\n\r\n[caption id=\"attachment_113493\" align=\"alignnone\" width=\"180\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/IMG_5719-2.gif\"><img class=\"wp-image-113493\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/IMG_5719-2.gif\" alt=\"IMG_5719-2\" width=\"180\" height=\"320\" \/><\/a> Before: Junior Marcel Colchen. GIF by Morgan Keller.[\/caption]\r\n\r\n&nbsp;\r\n\r\n[caption id=\"attachment_113495\" align=\"alignleft\" width=\"181\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/IMG_5720.gif\"><img class=\" wp-image-113495\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/IMG_5720.gif\" alt=\"Before: Gif by Morgan Keller.\" width=\"181\" height=\"322\" \/><\/a> Before: Sophomore Xander Sherer. GIF by Morgan Keller.[\/caption]\r\n\r\n[caption id=\"attachment_113486\" align=\"alignright\" width=\"184\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/IMG_5714-2.gif\"><img class=\" wp-image-113486\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/IMG_5714-2.gif\" alt=\"After: Gif by Morgan Keller.\" width=\"184\" height=\"327\" \/><\/a> After: Sherer with the \"Avatar\" haircut.  GIF by Morgan Keller.[\/caption]\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n[caption id=\"attachment_113498\" align=\"alignleft\" width=\"183\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/IMG_5728.gif\"><img class=\" wp-image-113498\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/IMG_5728.gif\" alt=\"Before: Gif by Morgan Keller.\" width=\"183\" height=\"325\" \/><\/a> Before: Junior Neil Verwillow. GIF by Morgan Keller.[\/caption]\r\n\r\n[caption id=\"attachment_113488\" align=\"alignright\" width=\"185\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/IMG_5715-2.gif\"><img class=\" wp-image-113488\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/IMG_5715-2.gif\" alt=\"After: Gif by Morgan Keller.\" width=\"185\" height=\"329\" \/><\/a> After: Verwillow with the \"Striped Kramer\" style. GIF by Morgan Keller.[\/caption]\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n[caption id=\"attachment_113489\" align=\"alignright\" width=\"180\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/IMG_5717-2.gif\"><img class=\" wp-image-113489\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/IMG_5717-2.gif\" alt=\"After: Gif by Morgan Keller\" width=\"180\" height=\"320\" \/><\/a> After: Knowles with the \"Inverse Mohawk with Chunks\" style.  GIF by Morgan Keller[\/caption]\r\n\r\n[caption id=\"attachment_113500\" align=\"alignnone\" width=\"178\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/IMG_5729.gif\"><img class=\" wp-image-113500\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/IMG_5729.gif\" alt=\"Before: Gif by Morgan Keller.\" width=\"178\" height=\"317\" \/><\/a> Before: Sophomore Matt Knowles. GIF by Morgan Keller.[\/caption]\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School boys’ soccer team (2-0, 0-0) is sporting new haircuts this winter. The tradition of giving first year varsity players especially notable haircuts is regarded by some as hazing, but by others as a fun team-bonding exercise.","date":"2015-12-14 20:16:52","author":"Morgan Keller","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/FullSizeRender-4.jpg","categories":["Sports","Spotlight"],"tags":["before and after","Boys","gifs","haircuts","hairdos","paly","Soccer","tradition"]},{"id":113582,"title":"Alumna involved in sexual allegations speaks out","permalink":"http:\/\/palyvoice.com\/2015\/12\/13\/alumna-involved-in-sexual-allegations-speaks-out\/","content":"<em>Editor's Note: The following piece is about Palo Alto High School alumna “Lauren,\" a pseudonym created by the Palo Alto Weekly to preserve her privacy, and \"Sean,\" Lauren's ex-boyfriend, whose name was also changed by the Weekly. The Paly Voice corresponded with Lauren to ensure that the statement was her own. <\/em>\r\n\r\nPalo Alto High School alumna “Lauren” shared an <a href=\"http:\/\/palygrad2014.tumblr.com\/\">anonymous personal statement on Tumblr today<\/a> regarding her alleged sexual relation with a former Paly English teacher.\r\n<p class=\"p1\">Lauren’s statement, publicized through Facebook, has served to share her side of this story — one that she feels has been ignored thus far. In her statement, Lauren \"denied any inappropriate actions\" with former Paly English teacher Kevin Sharp.<\/p>\r\n<p class=\"p1\">“I have decided to release my own statement detailing what really happened, from my point of view,” she begins.<\/p>\r\nShe said how \"Sean,\" her ex-boyfriend, \"tried to overlay fictitious intentions over innocuous actions,\" specifically with regard to grooming, \"the process by which an individual, usually an adult, becomes close with a victim by connecting over common interests and gaining trust before pushing the relationship into inappropriate sexual territory.\" Lauren addresses grooming in her statement: \"This is a real issue and I don’t mean to discredit it or any of its real victims. I, however, am not one of those victims.\"\r\n\r\nLauren also stated that Sean made sexual advances towards her when the two were not romantically involved, \"<span class=\"_5yl5\">saying he felt he needed to feel close to me or he would want to go to PAUSD administers despite the fact that we were both legal adults and neither of us were students in the district anymore.\"<\/span>\r\n<div id=\"js_8v\" class=\"_5wd4 _1nc6 direction_ltr\" data-hover=\"tooltip\" data-tooltip-position=\"right\">\r\n\r\nShe also indicates communication failures during investigations led by Assistant Supt. for Human Resources Scott Bowers and attorneys from Fagen, Friedman &amp; Fulfrost.\r\n\r\n\"I hope that those in the story don't feel attacked,\" Lauren communicated to The Paly Voice. \"I did my best to tell the story in the least accusatory way I could, trying to focus on simply what happened. I don't want anyone to look bad or feel like this is a blow at them. I don't want to ruin lives or cause drama.\"\r\n\r\nLauren told The Paly Voice that she seeks to tell the community a new perspective, rather than generate discussion.\r\n\r\n“I want people to read and know, and that's it,” she said. “I don't want to inspire discussion, or even shows of support. This is, at its core, an incredibly private thing.”\r\n\r\nIn October, the Weekly published a package, including a <a href=\"http:\/\/paloaltoonline.com\/news\/2015\/10\/09\/timeline-of-the-investigation?utm_campaign=magnet&amp;utm_source=article_page&amp;utm_medium=related_articles\">timeline<\/a>, <a href=\"http:\/\/www.paloaltoonline.com\/news\/2015\/11\/12\/paly-teacher-resigns-following-sexual-harassment-case?utm_campaign=magnet&amp;utm_source=article_page&amp;utm_medium=related_articles\">news piece<\/a> and <a href=\"http:\/\/paloaltoonline.com\/news\/2015\/10\/09\/editorial-a-tortuous-school-inquiry?utm_campaign=magnet&amp;utm_source=article_page&amp;utm_medium=related_articles\">editorial<\/a>, regarding the case against Sharp. The case itself began on Sept. 22, 2014, when Lauren’s parents first spoke with Paly Assistant Principal Kathie Laurence about the allegations, according to the <a href=\"http:\/\/paloaltoonline.com\/news\/2015\/10\/09\/timeline-of-the-investigation?utm_campaign=magnet&amp;utm_source=article_page&amp;utm_medium=related_articles\">Weekly's timeline<\/a>.\r\n\r\nLauren told The Paly Voice she had good intent when publishing her statement.\r\n<div id=\"js_8v\" class=\"_5wd4 _1nc6 direction_ltr\" data-hover=\"tooltip\" data-tooltip-position=\"right\">\r\n\r\n\"This is not a call to arms, nor a war declaration, but rather a simple attempt to express a truth that has yet to be heard,\" Lauren said in her statement.\r\n\r\n\r\n","excerpt":"Palo Alto High School alumna “Lauren” shared an anonymous personal statement on Tumblr today regarding her experience involved in the sexual allegation with a former Paly English teacher.","date":"2015-12-13 20:21:19","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/Screen-Shot-2015-12-13-at-6.48.18-PM.png","categories":["News","Spotlight"],"tags":["alum","alumna","assistant principal","attorneys","boyfriend","fagen","friedman","fulfrost","kathie laurence","kevin","kevin sharp","lauren","palo alto","palo alto high school","palo alto weekly","paly","PAUSD","scott bowers","sean","sexual allegations","sharp","truth","weekly"]},{"id":113520,"title":"APPetite: NYTVR, virtual reality for all","permalink":"http:\/\/palyvoice.com\/2015\/12\/13\/appetite-nytvr-virtual-reality-for-all\/","content":"[caption id=\"attachment_113521\" align=\"aligncenter\" width=\"614\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/IMG_2633.jpg\"><img class=\" wp-image-113521\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/IMG_2633.jpg\" alt=\"In partnership with Google, the New York Times distributed Google Cardboard eyepieces to its mail subscribers. The Google Cardboard produces a stereoscopic effect and makes objects appear 3D. Photo by Dhara Yu.\" width=\"614\" height=\"460\" \/><\/a> In partnership with Google, the New York Times distributed Google Cardboard eyepieces to its mail subscribers. The Google Cardboard induces a stereoscopic effect that makes objects in the NYTVR feature films appear 3D. Photo by Dhara Yu.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Entering the nascent industry of virtual reality, the New York Times has released a free application, New York Times Virtual Reality (NYTVR) that aims to give viewers a fully immersive viewing experience. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">In partnership with Google, the Times distributed more than a million Google Cardboard viewing headsets to all its mail subscribers last month, and to this date has released three virtual reality features, along with some additional promotional and behind-the-scenes content.<\/span>\r\n\r\n[caption id=\"attachment_113569\" align=\"alignleft\" width=\"391\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/IMG_2646.jpg\"><img class=\" wp-image-113569\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/IMG_2646.jpg\" alt=\"NYTVR gives viewers a unique\" width=\"391\" height=\"293\" \/><\/a> NYTVR provides viewers a unique and broadly accessible smartphone virtual reality experience. Photo by Dhara Yu.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">In “The Displaced,” which chronicles the lives of three refugee children, viewers meet Oleg, a Ukrainian boy whose village has been reduced to rubble; Chuol, who has fled with his grandmother in order to escape the strife in South Sudan; and Hana, a Syrian refugee seeking asylum across the border in Lebanon. “Vigils in Paris” captures the mourning in the wake of the Paris terror attacks. And in the most recent feature film, “Take Flight,” you float above a city skyline, coming face to face with the year's most noteworthy actors while suspended in the clouds. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">While apps compatible with Cardboard are already available on Google Play and the App Store, most of these involve video gaming. The NYTVR app, on the other hand, is marketed as a kind of journalistic supplement<\/span><span style=\"font-weight: 400;\">. In reality, there is not that much content on the app (each feature film is less than 12 minutes long), but I thought it was worth downloading just to get a taste of the virtual reality experience.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Though it is certainly not the first large-scale foray into this kind of technology, the Times’ VR experiment is unique because of its accessibility — all that’s required is a smartphone, and if desired, an inexpensive cardboard apparatus. <\/span>\r\n\r\nThe Google Cardboard itself looks like a boxy pair of binoculars. To use it, you simply insert your phone in the front flap of the Cardboard and peer through the plastic convex lenses. You can actually watch content from the NYTVR without Cardboard, but naturally, it’s a lot more immersive with the eyepiece.\r\n\r\n[caption id=\"attachment_113524\" align=\"alignright\" width=\"402\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/IMG_2642.png\"><img class=\" wp-image-113524\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/IMG_2642.png\" alt=\"A screenshot from &quot;The Displaced,&quot; the NYTVR feature film that follows the lives of three refugee children. Photo by Dhara Yu.\" width=\"402\" height=\"226\" \/><\/a> A screenshot from \"The Displaced,\" the NYTVR feature film that follows the lives of three refugee children. Photo by Dhara Yu.[\/caption]\r\n\r\nThe experience is truly remarkable. You hear the refugee children give harrowing testimonies of struggle and loss — yet manage to find fleeting moments of happiness — as you look around and survey the desolate landscape. The emotion is palpable when you witness the somber gatherings at the scenes of the attacks. And there is something exhilarating (albeit maybe a bit nauseating) about drifting away into the sky.\r\n\r\nThat being said, the app does have some technological issues. For the Cardboard viewing setting, the stereoscopic effect is somewhat finicky, so you end up having double vision if your screen isn’t perfectly aligned with the eyepiece. Also, the screen quality is disappointingly low, so the films appear somewhat grainy and pixelated. It's marginally better in non-Cardboard mode.\r\n\r\n<span style=\"font-weight: 400;\">For now, at least, virtual reality technology for the masses remains in an inchoate stage, and practically speaking, NYTVR is more of a novelty than a journalism staple. But there’s something enticing, even transcendent, about the notion of experiencing life through an entirely different lens — and that is the value in the app. <\/span>","excerpt":"In another installment of The Paly Voice's APPetite blog, Opinion Editor Dhara Yu reviews NYTVR, the New York Times app that aims to transform the journalistic experience as well as make virtual reality technology more accessible. ","date":"2015-12-13 17:30:39","author":"Dhara Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/12\/IMG_2633.jpg","categories":["APPetite","Blog","Spotlight"],"tags":["google cardboard","new york times","nytvr","refugees","take flight","the displaced","vigils in paris","virtual reality"]}]