[{"id":115290,"title":"Girls&#8217; basketball tops Gunn for third straight win","permalink":"http:\/\/palyvoice.com\/2016\/02\/01\/girls-basketball-tops-gunn-for-third-straight-win\/","content":"[caption id=\"attachment_115295\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/julie-jumpman.jpg\"><img class=\"alignnone wp-image-115295\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/julie-jumpman.jpg\" alt=\"Junior forward Julie Chandler leaps in the air as she goes up for an acrobatic layup against Gunn late in the fourth quarter on Friday at Gunn. The Vikings beat the Titans, 40-28. Photo by Sam Lee.\" width=\"600\" height=\"547\" \/><\/a> Junior forward Julie Chandler leaps in the air as she goes up for an acrobatic layup against Gunn late in the fourth quarter on Friday at Gunn. The Vikings beat the Titans, 40-28. Photo by Sam Lee.\r\n\r\nThe Palo Alto High School girls’ basketball team (12-6, 5-2) stretched its winning streak to three after routing crosstown rival Gunn High School (11-7, 2-5) for the second time this season, 40-28, on Friday night at Gunn.\r\n\r\nJunior guard Lauren Koyama led the Vikings with 12 points throughout the game, and senior Alexis Harris added nine points, with eight of them coming from the fourth quarter.\r\n\r\n“We were really motivated to win this game because we were playing our rival Gunn, and that reflected in our play,” Koyama said. “The crowd’s presence was also sensational, and we really wanted to give our fans a win.”\r\n\r\nHead coach Scott Peters praised Harris's phenomenal performance.\r\n\r\n“Harris really wanted this game, and she worked really hard,” Peters said. “She had four fouls, but she played very hard with effort. She wanted it so she went and got that ball and put it in. That was all on her own her effort.”\r\n\r\nThe Vikings overall played very consistently, with eight points in the first quarter, 10 in both of the second and third and 12 in the fourth.\r\n\r\nA key aspect to winning the game was the pressure defense, according to Peters.\r\n\r\n“We put a lot of pressure, made them run around a lot and work for their scores,” Peters said.\r\n\r\nThe Vikings were able to hold the Titans to 10 points or less each quarter.\r\n\r\nDespite the low scoring, the Vikings’ defense was vital to the victory, junior forward Julie Chandler said.\r\n\r\n“Overall I think we played fairly well,\" Chandler said. \"We played good defense and played hard the whole game. Our offense wasn't at its best, but we were able to fight through and pull out the win.”\r\n\r\nThe win against Gunn was also special for the players, especially for the seniors, according to Chandler.\r\n\r\n“Playing against Gunn is always our most exciting game and beating them is a great feeling, no matter what the score is,” Chandler said. “This being the last Gunn game for our seniors made us want to win even more.”\r\n\r\nSenior forward Courtney Lovely shared Chandler's enthusiasm.\r\n\r\n“The win was amazing and a great way to start the second half of the season,” Lovely said.\r\n\r\nThe Vikings hope to extend their winning streak to four at 7 p.m. Tuesday at Gunn against Saratoga High School (12-7, 3-4), who they lost to back in January.","excerpt":"The Palo Alto High School girls’ basketball team (12-6, 5-2) stretched its win streak to three after routing crosstown rival Gunn High School (11-7, 2-5) 40-26 on Friday night at Gunn.","date":"2016-02-01 22:18:59","author":"Sam Lee","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/julie-jumpman.jpg","categories":["Sports"],"tags":["alexis harris","basketball","defense","girls","gunn","hoops","julie chandler","lauren koyama","Quad Night","scott peters","sports","titans","victory","vikings","win"]},{"id":115314,"title":"Fire alarm caused by science class demonstration","permalink":"http:\/\/palyvoice.com\/2016\/02\/01\/fire-alarm-caused-by-science-class-demonstration\/","content":"[caption id=\"attachment_115316\" align=\"alignright\" width=\"341\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_72081.jpg\"><img class=\" wp-image-115316\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_72081.jpg\" alt=\"Chemistry teacher Ron Bowditch holds up a small strip of magnesium, similar to the one ignited today during 7th period that caused the fire alarm to go off. Bowditch has performed the demonstration many times before and has never encountered issues with the fire alarm.\" width=\"341\" height=\"455\" \/><\/a> Chemistry teacher Ron Bowditch holds up a small strip of magnesium, similar to the one ignited today during 7th period that set off the fire alarm. Bowditch says he has performed the demonstration many times before and has never encountered issues with the fire alarm. Photo by Emma van der Veen.[\/caption]\r\n\r\nThe Palo Alto High School fire alarm went off due to a science classroom demonstration today during 7th period, according to Assistant Principal Jerry Berkson.\r\n\r\nAccording to Berkson, room 1704 set off the alarm, the classroom of chemistry teacher Ron Bowditch.\r\n\r\n“Mr. Bowditch says that he lit a small piece of magnesium and the alarm went off,” Berkson said. “Whether it was [caused by] that or not, the control panel said that it was from 1704. We called maintenance just to let them know what happened, and if there is something to look into, they will look into it.”\r\n\r\nAccording to Bowditch, he had been performing a simple experiment, in which a small strip of magnesium is set on fire so students can observe a reaction, a demonstration he says he has performed many times in the past.\r\n\r\n\"That little tiny piece of magnesium set off the alarm, which we have ignited many times in this class,\" Bowditch said. \"I’m not sure how it set it off, but it did. I knew it was me because the second I lit it, the fire alarm went off.”\r\n\r\nStudents evacuated from their classrooms to the football field in the middle of 7th period, disrupting class lessons, tests and other activities. Junior Jackson Kienitz is one of many students to have class plans delayed due to the fire alarm, though the activity was not pertinent to his learning.\r\n\r\n“I was in theater class when the fire alarm went off, and we were supposed to be performing graded scenes,” Kienitz said. “However, with the alarm, we weren’t able to perform all the scenes, forcing us to reschedule class activities. Others have certainly not been as lucky.”","excerpt":"The Palo Alto High School fire alarm went off due to a science classroom demonstration today during 7th period.","date":"2016-02-01 22:13:13","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/IMG_7208-2.jpg","categories":["News"],"tags":["alarm","Berkson","Bowditch","chemistry","fire","fire alarm","jackson","kienitz","magnesium","palo alto high school","science"]},{"id":115278,"title":"Out of state college presentation is at 7 p.m. this Thursday, Feb. 4 in the LCC","permalink":"http:\/\/palyvoice.com\/2016\/02\/01\/out-of-state-college-presentation-is-at-7-p-m-this-thursday-feb-4-in-the-lcc\/","content":"","excerpt":"","date":"2016-02-01 14:49:53","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":115276,"title":"AMC testing is on Tuesday morning, Feb. 2 (alternate schedule)","permalink":"http:\/\/palyvoice.com\/2016\/02\/01\/amc-testing-is-on-tuesday-morning-feb-2-alternate-schedule\/","content":"","excerpt":"","date":"2016-02-01 14:48:26","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":115274,"title":"Club Day 2 is during lunch this Friday, Feb. 5","permalink":"http:\/\/palyvoice.com\/2016\/02\/01\/club-day-2-is-during-lunch-this-friday-feb-5\/","content":"","excerpt":"","date":"2016-02-01 14:47:23","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":115272,"title":"First half of third quarter ends this Friday, Feb. 5","permalink":"http:\/\/palyvoice.com\/2016\/02\/01\/first-half-of-third-quarter-ends-this-friday-feb-5\/","content":"","excerpt":"","date":"2016-02-01 14:46:08","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":115270,"title":"National Counseling Week is from Monday, Feb. 1 through Friday, Feb. 5","permalink":"http:\/\/palyvoice.com\/2016\/02\/01\/national-counseling-week-is-from-monday-feb-1-through-friday-feb-5-2\/","content":"","excerpt":"","date":"2016-02-01 14:45:13","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":115137,"title":"Speech and Debate team triumphs in January tournaments","permalink":"http:\/\/palyvoice.com\/2016\/01\/31\/speech-and-debate-team-triumphs-in-january-tournaments\/","content":"[caption id=\"attachment_115165\" align=\"aligncenter\" width=\"608\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12626178_528900193942710_1193858178_n1.jpg\"><img class=\" wp-image-115165\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12626178_528900193942710_1193858178_n1.jpg\" alt=\"Sophomores Frances Zhuang and Tanay Krishna, junior Candace Wang, and freshman Leyton Ho celebrating with their awards after the LD tournament.\" width=\"608\" height=\"435\" \/><\/a> Sophomore Frances Zhuang, junior Candace Wang, sophomore Tanay Krishna and freshman Letyon Ho celebrating with their awards after participating in the Lincoln-Douglas debate division at the CFL tournament. Photo by Anna Nakai.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Palo Alto High School's Speech and Debate team participated in the 2016 James Logan Martin Luther King invitational and the Coast Forensics League tournament on Jan. 17 and Jan. 24, resulting in a series of student accomplishments.<\/span>\r\n\r\nThe MLK tournament is known for the speech and persuasive debate divisions, according to senior Speech and Debate President Anna Nakai. Many Paly students broke and qualified for further rounds in Lincoln-Douglas debate, including three students that were in the double octafinals, two in the octafinals, two in the quarterfinals and two students in the semifinals.\r\n\r\n<span style=\"font-weight: 400;\">Two Paly students placed in the top 10 of all speakers: Nakai as third speaker and freshman Josh Singh as sixth speaker. Freshman Dominic Thibault ended the competition as a top 10 Congress debater as well. The award is given to the students who are the most persuasive and most informed on current affairs.  <\/span>\r\n\r\n[caption id=\"attachment_115164\" align=\"alignleft\" width=\"276\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12650650_528900200609376_1676569661_n.jpg\"><img class=\" wp-image-115164\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12650650_528900200609376_1676569661_n.jpg\" alt=\"Freshman Dominic thibault and ___Ujwal Srivastava at the CFL\" width=\"276\" height=\"192\" \/><\/a> Freshman Dominic Thibault and Ujwal Srivastava posing after doing well in the Congress debate at the CFL tournament.  Photo by Anna Nakai.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Paly’s Speech and Debate team also participated in the CFL Superdebate Tournament at Milpitas this last weekend.  The competition was a league tournament, so Paly only competed against local schools, according to Nakai. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Paly junior Candace Wang and sophomores Frances Zhuang and Tanay Krishna went 4-0 in the tournament and received a “wildcard,” a guaranteed spot at State Qualifications.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Paly already gets around eight spots [at State Qualifications], but when people ‘wildcard,’ it means we get extra spots,” Nakai said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Paly sophomore Adeline Zhou was a finalist at the CFL tournament this last weekend. She participated in the Original Oratory event, where each speaker gives a 10-minute speech they have been preparing for months, typically about a societal issue, according to Zhou. Zhou gave a presentation on the ego and how it affects people's life decisions.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I was honestly in total shock when they announced I was a finalist,” Zhou said.  “There were 21 semifinalists. After my semifinals round, I thought I was in the 15-17 range because the other competitors were so talented.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Even though Zhou wasn’t prepared to receive the award, she feels good earning it.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“There's always a self-satisfactory feeling when you’re presented with a medal on a platform and you can see your competitors in the crowd,” Zhou said.  “Half of you is like, ‘I shouldn't be up here, you [the other competitors] should be,’ while the other half is like ‘I won? Is this happening right now?’”<\/span>\r\n\r\nThe next Speech and Debate tournament for Paly is on Feb. 20.  Nakai says she thinks that the team is making a lot of accomplishments in the season so far.\r\n\r\n<span style=\"font-weight: 400;\">“I think our team is doing really well this year,” Nakai said.  “We’re definitely expanding our Congress and speech teams, which is great, and we’re continuing to do well in LD.”<\/span>","excerpt":"Palo Alto High School's Speech and Debate team looks forward to the rest of its season after a series of student accomplishments in the 2016 James Logan Martin Luther King invitational and the CFL  tournament on Jan. 17 and Jan. 24.","date":"2016-01-31 14:14:06","author":"Morgan Keller","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12626178_528900193942710_1193858178_n1.jpg","categories":["News"],"tags":["Award","congress","debate","paly","speech","tournament"]},{"id":114960,"title":"Admin implements new athletic clearance requirement","permalink":"http:\/\/palyvoice.com\/2016\/01\/28\/admin-implements-new-athletic-clearance-requirement\/","content":"[caption id=\"attachment_115150\" align=\"alignright\" width=\"331\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/DSCN32352.jpg\"><img class=\"wp-image-115150 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/DSCN32352.jpg\" alt=\"badminton\" width=\"331\" height=\"441\" \/><\/a> Sophomore May Leng prepares to strike a birdie during badminton practice. Students participating in badminton, a spring sport at Palo Alto High School, are one group of many athletes that will be affected by the new clearance requirement. Photo by Adrienne Kwok.[\/caption]\r\n\r\nPalo Alto High School athletes are required to complete a new athletic clearance process for the spring season in an effort to better verify a student's eligibility to play a sport.\r\n\r\nAccording to Athletic Director Kathi Bowers, students who plan on trying out for a spring sport must pick up a Health Clearance Card, in addition to having updated their physical, medical and contact information on Appryse, a system the school uses to verify an athlete’s participation eligibility. On the day of tryouts, athletes will hand the Health Clearance Card to their coaches.\r\n\r\nWhile the application process remains mostly the same, the only change is the new method for coaches to verify that an athlete is cleared to participate, even during tryouts.\r\n\r\n“It puts coaches in a tough position when the student would say ‘I am getting it [my physical clearance] tomorrow’ or ‘I uploaded it to Appryse, I don’t know why you can’t see it,’” Bowers said. “Coaches were having to spend too much time dealing with the physicals instead of working with their athletes, so what would happen is that some coaches would not take the time to verify that the student was cleared to participate.”\r\n\r\nStudents may pick up the Health Clearance Card in person on Friday from 2 to 4 p.m., and on Monday from 11:30 to 4 p.m. in Room 725.","excerpt":"Palo Alto High School athletes are required to complete a new athletic clearance process for the spring season in an effort to better verify a student's eligibility to play a sport.","date":"2016-01-28 22:22:56","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/DSCN3235.jpg","categories":["News"],"tags":["appryse","bowers","card","clearance","kathi","new","physical","requirement","sports","spring"]},{"id":115117,"title":"Newseum CEO to discuss freedom of expression at MAC","permalink":"http:\/\/palyvoice.com\/2016\/01\/28\/newseum-ceo-to-discuss-freedom-of-expression-at-mac\/","content":"[caption id=\"attachment_115118\" align=\"aligncenter\" width=\"466\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/mac.jpg\"><img class=\"wp-image-115118\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/mac.jpg\" alt=\"The school’s Media Arts Center will host Newseum CEO, Jeffery Herbst as part of the Media Arts Center’s Speaker Series.“There will be two more later this spring,” Event Organizer and Palo Alto High School Journalism teacher Esther Wojcicki said. Photo William Zhou.\" width=\"466\" height=\"349\" \/><\/a> Palo Alto High School's Media Arts Center will host Newseum CEO Jeffery Herbst as part of the Media Arts Center’s Speaker Series on Feb. 3. “Herbst is the CEO of the Newseum and is going to be talking about freedom of speech and the age of terrorism,” event organizer and Palo Alto High School journalism teacher Esther Wojcicki said. Photo by William Zhou.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">CEO of the Newseum, Jeffrey Herbst, will speak about the new dangers of freedom to expression at 7 p.m. on Wednesday in the Palo Alto High School Media Arts Center. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Newseum is a museum centered around the First Amendment, according to Newseum Board of Trustee member, Paly journalism teacher, and event organizer Esther Wojcicki.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The Newseum is the largest museum in the world about freedom of the press, First Amendment rights and news media,” Wojcicki said. “It’s located in Washington D.C. and is a non-profit that’s  home to a lot of retired famous journalists.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Wojcicki hopes Herbst can bring his experience and knowledge to the Palo Alto community. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Jeffery is the CEO of the Newseum and the former president of Colgate University,” Wojcicki said “He’s a very learned guy and has written several books, so I’d say we should listen to his thoughts. He would be great at leading this discussion.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">During his presentation, titled “The New Dangers for Freedom of Expression,” Herbst will focus on how freedom of expression is utilized in today's digital world. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Herbst is going to be talking about freedom of speech and the age of terrorism,” Wojcicki said. “Do we allow all hate speech online and in our media? Traditionally there hasn’t been a limit, but now the question is that is there a limit?\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Wojcicki wants audience members to leave thinking about ways to address this problem.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I want audience members to think of possible solutions,” Wojcicki said. “The solution has to be something that comes from the community, because you don’t want to do something to people, you want to do something with them.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The talk is sponsored by the school’s Media Arts Boosters and is part of the the MAC Speaker Series, which launched last year. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The purpose of these events  are to bring the community into the MAC building so they can enjoy some intellectually stimulating talks,” Wojcicki said.  “It [the speaker series] was really successful last year and there will be two more this year.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to the<\/span><a href=\"https:\/\/www.eventbrite.com\/e\/the-new-dangers-for-freedom-of-expression-by-newseum-ceo-jeffrey-herbst-tickets-20773684650\"><span style=\"font-weight: 400;\"> event page<\/span><\/a><span style=\"font-weight: 400;\">, student and adult tickets are available for purchase online at $5 and $10 respectively, and proceeds will benefit the Media Arts Center Boosters. <\/span>","excerpt":"CEO of the Newseum, Jeffrey Herbst, will speak about the new dangers of freedom to expression at 7 p.m. on Wednesday in the Palo Alto High School Media Arts Center. ","date":"2016-01-28 22:19:37","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/mac.jpg","categories":["News"],"tags":["ceo","ester","first amendment","freedom of speech","journalism","mac","Newseum","palo alto high school","wojcicki"]}]