[{"id":114730,"title":"Editorial: Explore other avenues to counter overcrowding","permalink":"http:\/\/palyvoice.com\/2016\/01\/25\/editorial-explore-other-avenues-to-counter-overcrowding\/","content":"[caption id=\"attachment_114838\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/unnamed1.jpg\"><img class=\"wp-image-114838\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/unnamed1.jpg\" alt=\"Sophomores Sam Guernsey, and Michaela Fogarty work on a project in Social Justice Pathway. According to the Palo Alto High School course catalog, &quot;The Social Justice Pathway is a three-year program featuring self-direction and project-based learning in an interdisciplinary model rooted in community action and collaboration.&quot; Photo by Cooper Lou.\" width=\"600\" height=\"450\" \/><\/a> Sophomores Sam Guernsey, Gabe Cohen and Michaela Fogarty work on a project in the Social Justice Pathway. According to the Palo Alto High School course catalog, \"The Social Justice Pathway is a three-year program featuring self-direction and project-based learning in an interdisciplinary model rooted in community action and collaboration.\" Photo by Cooper Lou.[\/caption]\r\n\r\nAnticipating an influx in the number of students enrolled in the district, the Palo Alto Unified School District Board of Education has been contemplating a series of proposals to build new schools to accommodate a larger student population. At the school board meeting on Jan. 6, the Enrollment and Management Advisory Committee, created to conduct research on school sizes and overcrowding, recommended further exploration of <a href=\"https:\/\/www.pausd.org\/sites\/default\/files\/pdf-faqs\/attachments\/EMACSecondarySubcommitteeFinalReport.pdf\">five different proposals<\/a>, one of which calls for building a new high school that emphasizes project-based learning at the Cubberley Community Center. While we appreciate the effort that has gone into researching solutions to the problem, we believe that the district should not adopt the plan to transform Cubberley into an “innovative school” that will benefit only a relative few. Instead, it ought to focus its attention on expanding project-based learning opportunities at existing high schools.\r\n\r\nProject-based learning is a hands-on classroom approach in which students actively explore real-world problems in the form of research, projects and presentations. <span style=\"line-height: 1.5;\">Increased access to project-based learning would be a welcome addition to Palo Alto schools, but the more pressing issue is overcrowding, and the board should be directing its time and resources accordingly. All of the five EMAC recommendations included a provision to build another school, but not one suggested focusing on expanding the physical capacity of Gunn and Palo Alto High School or hiring more instructors. The reality is that district funding is finite, and the millions of dollars of annual operational costs for the proposed high school would best be spent improving the current high schools. In fact, the city has already taken steps to increase funds for existing schools — last year, Palo Alto passed <\/span><a style=\"line-height: 1.5;\" href=\"http:\/\/pausd-web.pausd.org\/community\/2015MeasureA\/index.shtml\">Measure A<\/a><span style=\"line-height: 1.5;\">, which established a parcel tax. The revenue will be used to hire more teachers and keep class sizes small, which is a path we should continue to take.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Furthermore, several problems will arise if Cubberley is to be a transformed into an innovative school — first and foremost is the issue of funding. Providing students at the new school with the smaller class sizes and breadth of course offerings recommended by the EMAC will require spending more dollars per student, which is in direct conflict with <a href=\"http:\/\/pausd-web.pausd.org\/community\/board\/Policies\/downloads\/BP6171_TitleI.pdf\">Board Policy 6171<\/a>. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We have a commitment in the school board for equal funding for students across each of our schools,” said board member Ken Dauber, who agrees that the district should focus on improving the current schools, rather than building another one, in an interview with The Paly Voice. “So it’s not possible for us to spend more money per student. The alternative that I have heard is using private funding to make up the difference and supplement the spending so that we’re not spending more public dollars per student. This is also not possible under our current policies, because we don’t want to create a fundraising arms race between schools where they raise money for their own students, more so than other schools, creating inequity.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Even if the proposal could be modified so that the costs of the new school are in accordance with Board Policy 6171, which is improbable, money and time would still be better directed toward solving the numerous other pressing problems in the district, like Gunn's ineffective advisory system, oversized classes, limited access to project-based learning and the <a href=\"http:\/\/palyvoice.com\/2015\/10\/29\/school-board-discusses-achievement-gap-solutions\/\">achievement gap<\/a> — the discrepancy in academic performance between socio-economically advantaged and disadvantaged students. Overcrowding is certainly an issue, but it is not the only one. The district needs to prioritize.<\/span>\r\n\r\nAlthough it may not seem so, the opening of a new high school with the lottery system could create a socio-economic inequality that we see in the district's other lottery schools, Ohlone Elementary and Hoover Elementary Schools. On average, 8.95% of students in the district's elementary schools are socio-economically disadvantaged, according to the most <a href=\"http:\/\/pausd-web.pausd.org\/community\/about\/sar.shtml\">recent School Accountability Report Cards<\/a>, compared to the significantly lower 3.5% at Ohlone, and 5.1% at Hoover. A lottery system theoretically ensures equal opportunity for all students, but realistically speaking, current and past trends show that less socio-economically disadvantaged students will apply than what should be considered equal. The district should avoid pursuing a project that could potentially exacerbate the achievement gap.\r\n\r\n<span style=\"font-weight: 400;\">Additionally, the proposed high school would be able to hold about 400-600 students, which, considering the amount of money that would have to be spent, is a negligible dent in the projected maximum of 4100 high school students districtwide. Since the school would be so much smaller than both Paly and Gunn, enrollment would likely have to be determined through a lottery system. It seems contrary to the goals of the district to spend disproportionate amounts of money on a venture that only stands to benefit a select few. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Building a new high school entirely is impractical at this point in time, but it is possible that in the next several years, the increase in student population necessitates opening another campus. If the district goes down this path, the new school should be similar to Paly and Gunn in regards to its structure and course offerings, rather than an exclusively project-based learning school.<\/span>\r\n\r\nProponents for the new school argue that many students feel disconnected from their learning, and are looking for a more personal education experience which can be provided at a new school. Although it is true that 5% of students at <a href=\"https:\/\/drive.google.com\/file\/d\/0B0Te89oAASzOTU9wZjdrTkJ3X0U\/view\">Paly <\/a>and 9% of students at <a href=\"https:\/\/drive.google.com\/file\/d\/0B0Te89oAASzOZHQtbFBGZ05vSXc\/view\">Gunn <\/a>have little to no engagement in learning according to a survey by the school board in cooperation with Stanford, it would be significantly more cost efficient to create more non-traditional, project-based learning opportunities at the current schools. The district can explore creating additional programs similar to the Social Justice Pathway or the Sports Career Pathway that provide students with a more personalized learning experience, while increasing innovative educational opportunities for all students. At the same time, creating more of such pathways would draw students out of traditional classes, and effectively lessen class sizes.\r\n\r\n<span style=\"font-weight: 400;\">We should be directing our time and energy toward enhancing the learning experience for the entire student body, rather than getting swept up in the novelty of a specialty school that will serve only a small sector of the population.<\/span>","excerpt":"We believe that the district should focus its attention on expanding project-based learning opportunities at existing high schools, rather than adopting the plan to transform Cubberley into an “innovative school” that will benefit only a relative few.","date":"2016-01-25 19:11:00","author":"The Paly Voice","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/unnamed1.jpg\nmodel rooted in community action and collaboration.&quot; Photo by Cooper Lou.\" \/>","categories":["Editorial","Opinion","Opinion Editor's Pick","Spotlight"],"tags":[]},{"id":114855,"title":"Recap: Boys&#8217; soccer defeats Santa Clara 2-0 and continues streak","permalink":"http:\/\/palyvoice.com\/2016\/01\/25\/recap-boys-soccer-defeats-santa-clara-2-0-and-continues-streak\/","content":"[caption id=\"attachment_114916\" align=\"alignright\" width=\"273\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Screen-Shot-2016-01-25-at-11.22.45-PM.png\"><img class=\"wp-image-114916 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Screen-Shot-2016-01-25-at-11.22.45-PM.png\" alt=\"The Vikings went on to win 2-0, maintaining an undefeated league record today after school at Palo Alto High School in a game against Santa Clara High School. Photo by Mary McNamara.\" width=\"273\" height=\"268\" \/><\/a> Senior right and left winger Siddharth Srinivasan is met by a Bruins defender before he attempts to score. The Vikings went on to win 2-0, maintaining an undefeated league record today after school at Palo Alto High School in a game against Santa Clara High School. Photo by Mary McNamara.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto High School boys’ soccer team (10-0-1, 3-0-0) dominated the Santa Clara High School Bruins (5-3-1, 2-2-0) at home in a tight match where the Vikings won 2-0 and continued their undefeated season.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Vikings maintained a lead throughout the game.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I think we had a good game,” head coach Don Briggs said. “We controlled the ball most of <\/span><span style=\"font-weight: 400;\">the time.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Throughout the game, the Vikings showed stronger communication than the Bruins as they were constantly talking to each other and organizing their positions. However the Bruins led in physicality often leading to fouls; luckily no serious injuries were inflicted.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">A first half goal by senior right and left winger Siddharth Srinivasan gave the Vikings a lead. Shortly after, senior striker Alessandro Reale scored an impressive goal with an assist from striker junior Michel Ange Siaba. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“They are a tough team but I think having home-court advantage is going to help us win this game if we have good supporters cheering us on,” Siaba said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Vikings remain undefeated and will face off against Los Gatos (5-2-5, 1-1-1) on Wednesday at 3:30 p.m. at Paly.<\/span>","excerpt":"The Palo Alto High School boys’ soccer team (10-0-1, 3-0-0) dominated the Santa Clara High School Bruins (5-3-1, 2-2-0) at home in a tight match where the Vikings won 2-0 and continued their undefeated season.","date":"2016-01-25 18:32:33","author":"Emilia Diaz-Magaloni","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Screen-Shot-2016-01-25-at-11.22.45-PM.png","categories":["Sports","Sports Recap"],"tags":[]},{"id":114728,"title":"Ceremony honors science teacher Kenyon Scott","permalink":"http:\/\/palyvoice.com\/2016\/01\/24\/ceremony-honors-science-teacher-kenyon-scott\/","content":"Palo Alto High School <a href=\"http:\/\/palyvoice.com\/2016\/01\/07\/storify-in-memory-of-kenyon-scott\/\">students, faculty and parents<\/a> celebrated the life of AP Environmental Science teacher Kenyon Scott at a ceremony yesterday afternoon in the Media Arts Center.\r\n\r\n[caption id=\"attachment_114739\" align=\"alignright\" width=\"415\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12575980_10203938839430225_1781577378_n.jpg\"><img class=\"wp-image-114739\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12575980_10203938839430225_1781577378_n.jpg\" alt=\"12575980_10203938839430225_1781577378_n\" width=\"415\" height=\"277\" \/><\/a> Kenyon Scott's friends, family and students gather in the MAC to celebrate his life. \"I thought it [the ceremony] was terrific,\" his brother, Joe Scott said. \"He would've loved it. ... It was somber but at the same time, upbeat.\" Photo by Aidan Maese-Czeropski.[\/caption]Hundreds attended the ceremony, which included speeches from Mr. Scott's friends, family and principal Kim Diorio.\r\n\r\n\"It [the ceremony] was really heartwarming and I am proud of our Paly family for doing such a great job with this and coming together,\" Diorio said.\r\n\r\nA common theme throughout the event was <a href=\"http:\/\/palyvoice.com\/2016\/01\/22\/community-shares-memories-amid-teachers-passing\/\">Mr. Scott's love for teaching at Paly<\/a>.\r\n\r\n\"He loved the school and he was proud to be a part of it,\" his brother Joe Scott said.\r\n\r\nThe celebration commenced with the song \"What I Got\" by Sublime, performed by senior Jer Samos, choir teacher Michael Najar and juniors Emily Read and Spencer Wycoff.\r\n\r\n\"His family chose it [the song] for us,\" Read said.\r\n\r\n[caption id=\"attachment_114738\" align=\"alignright\" width=\"402\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12607298_10203938840310247_141374175_n.jpg\"><img class=\"wp-image-114738\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12607298_10203938840310247_141374175_n.jpg\" alt=\"12607298_10203938840310247_141374175_n\" width=\"402\" height=\"261\" \/><\/a> Choir teacher Michael Najar, juniors Emily Read and Spencer Wycoff and senior Jer Samos perform \"What I Got\" by Sublime to commence the ceremony. \"We were given the song because it's his favorite song, or his favorite song by Sublime,\" Read said. Photo by Aidan Maese-Czeropski.[\/caption]\r\n\r\nSenior Kevin Bowers led the audience in a hand-clapping exercise to commemorate one of Mr. Scott's classroom traditions before a series of speakers told anecdotes about the veteran teacher's life.\r\n\r\n\"I will always remember his hearty laugh and eye-to-eye smile,\" math teacher Arne Lim said. \"He represented everything about teaching. ... He conducted his classes with power and energy.\"\r\n\r\n<span style=\"font-weight: 400;\">Several of Mr. Scott’s friends related personal stories about playing golf, as well as spoke about his passions for the University of California Berkeley’s football team, geology and the Earth.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"Each of you [students] made a very big difference in his life,\" one friend said.<\/span>\r\n\r\nFamily members also took the stage to reminisce on childhood memories. Joe Scott discussed a backpacking trip in which Mr. Scott saved his brother, Jon, from a rattlesnake bite by finding help in the wilderness.\r\n\r\n\"Ken was everyone's hero,\" Joe Scott said.\r\n\r\nMr. Scott's sister, Laurie Burmeister, shared letters she received after his passing.\r\n\r\n\"He was a witty, smart, sensitive, passionate man,\" Burmeister said.\r\n\r\nEmily Scott honored her father with a performance art piece that depicted the struggles a girl faces due to being \"different.\" Emily Scott said her father had enjoyed the piece.\r\n\r\nTo conclude the ceremony, Paly's symphonic band performed three UC Berkeley songs to honor his enthusiasm for Cal's football team, the Golden Bears.","excerpt":"Palo Alto High School students, parents and faculty are celebrating Advanced Placement Environmental Science teacher Kenyon Scott's life after a ceremony yesterday afternoon in the Media Arts Center.","date":"2016-01-24 14:09:13","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/12575980_10203938839430225_1781577378_n.jpg","categories":["News","Spotlight"],"tags":["ap","apes","Arne Lim","diorio","environment","environmental science","Kenyon","Kenyon Scott","lim","mac","media","media arts center","michael najar","najar","science","Scott","uc berkeley","what I got"]},{"id":114763,"title":"All spring sports begin on Monday, Feb. 1","permalink":"http:\/\/palyvoice.com\/2016\/01\/23\/all-spring-sports-begin-on-monday-feb-1\/","content":"","excerpt":"","date":"2016-01-23 22:28:33","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":114761,"title":"Advisory this week is for all juniors and select freshmen (L-Z)","permalink":"http:\/\/palyvoice.com\/2016\/01\/23\/advisory-this-week-is-for-all-juniors-and-select-freshmen-l-z-2\/","content":"","excerpt":"","date":"2016-01-23 22:26:29","author":"Josh Yuen","categories":["Ticker"],"tags":[]},{"id":114263,"title":"Plan to rename Jordan takes next step forward","permalink":"http:\/\/palyvoice.com\/2016\/01\/23\/plan-to-rename-jordan-takes-next-step-forward\/","content":"<span style=\"font-weight: 400;\">Supporters of the movement to rename David Starr Jordan Middle School are hopeful after the Palo Alto Unified School District Board of Education heard a proposal to create a committee to research David Starr Jordan's deep involvement and leadership in the eugenics movement.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Lars Johnsson, the leading parent behind the movement, requested that the Board vote to form a committee that would investigate whether or not a name change not only for Jordan Middle School, but possibly for Cubberley Community Center and Terman Middle School, both of which are named after other local figures who were eugenicists.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The committee will present its recommendation and information to the Board, which will then vote on January 26 on whether they agree. If the vote passes, the Palo Alto community will be allowed to submit its school name proposals according to <a href=\"http:\/\/pausd-web.pausd.org\/community\/board\/Policies\/downloads\/BP7310_naming.pdf\">Board Policy 7310<\/a>. Once an idea garners significant support, the board can vote to use it as the name for the middle school according the the policy. <\/span>\r\n\r\nJohnsson said he is hopeful that students will play a large role in the renaming process.\r\n\r\n\"I think that student involvement would be very desirable,\" Johnsson said. \"If this committee is to be formed student participation will be a critical aspect to it.\"\r\n\r\n<span style=\"font-weight: 400;\">Board member Ken Dauber was excited that the topic had been brought up during the meeting.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I wholeheartedly support the plan for a committee to see if a name change is warranted here,” Dauber said. “My personal perspective is that David Starr Jordan's deep relationship with eugenics is not the kind of model we want to provide for students and provides a good opportunity to ask our students, 'Who do we want to model?'”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Johnsson, a father of three students attending PAUSD schools, first became inspired to investigate Jordan’s past after his son came home with a research project on the subject. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“As you may know my topic is Mr. David Starr Jordan, he seems to be a good person or else they wouldn’t have named a school after him right? Wrong,” his son wrote. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">An instrumental figure in the early development of Palo Alto, Jordan became the first president of Stanford University in 1891 upon its founding, according to Johnsson's research.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Johnsson emphasized that Jordan's deep involvement and leadership with the eugenics movement vastly overshadows the good he did for the beginning of our community. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Jordan was the chair of America’s first official eugenics association, the American Breeders Association, according to the <a href=\"http:\/\/www.britannica.com\/topic\/American-Breeders-Association\">Encyclopedia Britannica<\/a>. He<\/span><span style=\"font-weight: 400;\"> was also a founding member of the Human Betterment Foundation, a nonprofit dedicated to support eugenics research and policy implementation, according the the <a href=\"https:\/\/embryo.asu.edu\/pages\/human-betterment-foundation-1928-1942\">Embryo Project<\/a>, a National Science Foundation sponsored research group.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Eugenics was a very popular movement in the early 20th century, but Jordan’s leadership in creating the movement, its popularity and its terrible consequences are unquestionable and make him stand out,” Johnsson said.<\/span>","excerpt":"Supporters of the movement to rename David Starr Jordan Middle School are hopeful after the Palo Alto Unified School District Board of Education heard a proposal to create a committee to research David Starr Jordan's deep involvement and leadership in the eugenics movement.","date":"2016-01-23 13:41:46","author":"Sherwin Amsbaugh","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/IMAG0421.jpg","categories":["News"],"tags":["Cubberly","dauber","Eugenics","Jordan Middle School","ken dauber","Lars Johnsson","middle school","palo alto","PASUD","School Board","stanford","Terman","The Palo Alto School Board"]},{"id":113825,"title":"Community shares memories amid teacher&#8217;s passing","permalink":"http:\/\/palyvoice.com\/2016\/01\/22\/community-shares-memories-amid-teachers-passing\/","content":"The Palo Alto community is sharing its memories of Palo Alto High School science teacher Kenyon Scott, <a href=\"http:\/\/palyvoice.com\/2016\/01\/07\/community-mourns-teacher-death\/\">who died of unidentified natural causes on Jan. 6 in his home.<\/a> Photos by William Zhou, Bianca Al-Shamari, Sam Lee and Takaaki Sagawa.\r\n\r\n<iframe src=\"\/\/www.cincopa.com\/media-platform\/iframe.aspx?fid=AILABMtesoWk\" width=\"600\" height=\"430\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n&nbsp;","excerpt":"The Palo Alto community is sharing its memories of Palo Alto High School science teacher Kenyon Scott.","date":"2016-01-22 16:34:16","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Reaction-.jpg","categories":["Multimedia","News"],"tags":["apes","Death","Kenyon Scott","Kenyonn Scott","loss","palo alto high shcool","paly","passing","Scott","Teacher"]},{"id":114077,"title":"Trust and Respect: Remembering Kenyon Scott","permalink":"http:\/\/palyvoice.com\/2016\/01\/22\/trust-and-respect-remembering-kenyon-scott\/","content":"[caption id=\"attachment_113826\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Screen-Shot-2016-01-07-at-2.12.19-PM.png\"><img class=\"wp-image-113826 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/Screen-Shot-2016-01-07-at-2.12.19-PM.png\" alt=\"Screen Shot 2016-01-07 at 2.12.19 PM\" width=\"600\" height=\"453\" \/><\/a> Advanced Placement Environmental Science teacher Kenyon Scott takes a selfie with his fourth period APES class during the final week of classes last year. It was his enthusiasm and personal connections with students that made him a remarkably special teacher. Photo: Bryce Rockwell.[\/caption]\r\n\r\nWhen students, faculty and friends gather in the Media Arts Center at Palo Alto High School on Saturday to mark the passing of science teacher Kenyon Scott, they will be celebrating a man whose passion for teaching impacted many community members' lives.\r\n\r\n<span style=\"font-weight: 400;\">Mr. Scott passed away due to natural causes on the morning of Jan. 6, 2016, at his residence in Palo Alto. He was 60. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to students, colleagues, and family, Scott was an optimistic, energetic man who always maintained a passion for teaching students in a classroom environment filled with infectious laugher. He cared for his students in a uniquely powerful way by celebrating each person as an individual. <\/span>\r\n\r\n\"He was a really nice teacher who respected his students and treated them with patience and respect,\" junior Spencer Wycoff said. \"He was always with a smile and trying to make people happy in his class.\"\r\n\r\n<span style=\"font-weight: 400;\">One of Mr. Scott's well-known and loved mantras,<\/span><span style=\"font-weight: 400;\"> “trust and respect,” emphasized his philosophy of care between students and their teachers. On campus, he could be found actively participating in staff and school-wide events, annually drawing repeated chants of “Mr. Scott!” at the Staff Dance during Spirit Week. When he saw his students outside of the classroom, he never failed to greet them by name and give them a smile.<\/span>\r\n\r\n\"I didn’t think of him as a teacher, but a really close friend,\" senior Dami Bolarinwa said. \"He was someone who I could talk to about problems.\"\r\n\r\n<span style=\"font-weight: 400;\">The Paly Voice sat down and spoke with one of his two daughters, Emily Scott, a special education instructional aide at Paly, about her father's life growing up. Born on June 24, 1955, in San Jose, Mr. Scott’s dream job as a child was to be president of the United States. Rather than sleeping with a pillow, he spent most nights with Jojo,<span style=\"color: #007f00;\"> <\/span>his beloved stuffed animal monkey, the younger Scott said, adding that she recalled that her father's family made an appearance on one of the early episodes of Family Feud; the Scott family was eliminated after his brother Jon Scott was unable to correctly identify a Jewish holiday. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Mr. Scott could be found during his childhood summers working at Bay Meadows, a horse racing track in San Mateo that closed in 2008. He graduated from Pioneer High School in San Jose before attending the University of California at Berkeley, where he majored in Earth Sciences. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Those that were close to him, especially his high school students, know just how attached he was to exploring the outdoors and spreading awareness about environmental issues. He rode his bike to Paly every morning alongside hundreds of students, even during the rainy season when many students would catch a ride with their parents during a downpour. In class, he wouldn’t hesitate to put lessons on hold to discuss and monitor current environmental events going on at a local or even international level. He valued the importance of not just teaching his students about the environment, but encouraging them to apply classroom lessons to the real world. Many of his extra credit assignments involved researching newsworthy environmental topics or going to the Palo Alto Baylands to explore natural habitats. <\/span>\r\n\r\n\"When we would go on trips he would always stop and look at rocks,\" Emily Scott recounted. \"He was very into rocks and fossils.\"\r\n\r\n<span style=\"font-weight: 400;\">His first job teaching was at Charles Armstrong School in Belmont, a school for children with special needs, according to his daughter. It was during this time when he met his wife, Katherine, to whom he was married to for approximately 18 years until their divorce. Outside of teaching, he loved doing crossword puzzles, reading newspapers, discovering new music and playing games with his two daughters. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">At Paly, he taught a variety of subjects including physics, chemistry, and most notably, Advanced Placement Environmental Science, popularly for over 18 years, beginning in 1985. According to his daughter, he left Paly in 1991 to work for Apple in the technology industry before returning to the classroom in 2003. He supervised numerous clubs over the course of his time at Paly, and was the Paly Environmental Club adviser at the time of his passing. He also served as Paly’s student activities director in the late 1980s. <\/span>\r\n\r\n“It’s a huge loss for our community and our school,” Paly principal Kim Diorio said. “He was a great man, great teacher. I’m personally going to miss him tremendously.”\r\n\r\n<span style=\"font-weight: 400;\">In addition to his meaningful lessons in science, Mr. Scott will be widely remembered for his classroom traditions. On Friday afternoons, he would lead his classes in a “TGIF” chant to celebrate the beginning of the weekend. His most beloved teaching tradition is simply known as “The Clap.” To begin class, he would stand up in the front of the room and start clapping in a rhythm that his students would soon replicate in unison. After a few rounds of clapping, he would welcome his class and begin doing what he did best, helping high school students become not just smarter thinkers, but better people.<\/span>\r\n\r\nHe is survived by his parents, Joan and Jerry Scott; sister Laurie Burmeister; brothers Joe and Jon Scott; daughters Emily and Elizabeth Scott; and his partner, Sara Tanous.\r\n\r\n<span style=\"font-weight: 400;\">Students and colleagues say it will be a long time before we come across another teacher who leads the clap, spreads environmental optimism and inspires students the way Mr. Scott did. <\/span>\r\n\r\n\"People loved him, and I don't think he will be forgotten,\" junior Emily Read said. \"[Principal] Kim Diorio came to visit our class, and she was in tears. She was crying so hard, and I could see the connection that he had made being here for so long. He impacted so many people.\"\r\n\r\n<span style=\"font-weight: 400;\"><span class=\"aBn\" tabindex=\"0\" data-term=\"goog_1182669811\"><span class=\"aQJ\">Saturday’s<\/span><\/span> celebration of life event for Mr. Scott, originally scheduled for the Quad but moved to the MAC out of concern for the weather, will begin at <span class=\"aBn\" tabindex=\"0\" data-term=\"goog_1182669812\"><span class=\"aQJ\">2 p.m.<\/span><\/span> Attendees are encouraged to wear blue and gold clothing, the colors of his alma mater, UC Berkeley.<\/span>","excerpt":"Recently, Palo Alto High School lost one of its most beloved teachers, Kenyon Scott. The Paly Voice celebrates and reflects on the life of a motivational man who inspired students and teachers alike with his passionate personality.","date":"2016-01-22 15:34:55","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/0000\/00\/mrscott.jpg","categories":["Editor's Pick","Features","Spotlight"],"tags":["advanced placement","ap","ap environment science","apes","clap","Kenyon","Kenyon Scott","obituary","science","Scott","selfie","tgif","trust and respect"]},{"id":114106,"title":"Parent starts El Niño evacuation program","permalink":"http:\/\/palyvoice.com\/2016\/01\/21\/parent-starts-el-nino-evacuation-program\/","content":"[caption id=\"attachment_114541\" align=\"alignright\" width=\"613\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/2.jpg\"><img class=\"wp-image-114541\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/2.jpg\" alt=\"2\" width=\"613\" height=\"367\" \/><\/a> In the past, extensive periods of rain has caused flooding both at Palo Alto High School and the nearby Town &amp; Country Village where many students go to for lunch. Photo by William Zhou.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">In light of the increase of rain from El Niño, a Palo Alto High School parent is aiming to provide shelter for Paly families at risk of flooding. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Paly parent and founder, Liz Lee, the unofficially named “Paly Matching Program” works to connect families who are willing to provide shelter with those who need it. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Lee started the program because her own house was at risk. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I just started this [program] because my family lives in a flood zone and may need emergency shelter,” Lee said. “I figured that other Paly families may also [be in a flood zone], so that’s how I got the idea.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The matching program will be especially useful as hotels, which could be used as flood shelters, become harder to book, according to Lee. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“<\/span><span style=\"font-weight: 400;\">If it [flooding] happens during Super Bowl weekend on Feb. 7, lodging is expected to booked up as far off as Modesto,” Lee said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Lee believes there are many ways for families to prepare for flooding. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“My husband and I attended some emergency preparedness meetings put on by the San Francisquito Joint Powers Authority (JPA),” Lee said. “They recommend that all families in high flood risk areas have a plan for where to stay with a relative or friend in case they are evacuated. It’s important because if flooding coincides with a Baylands supertide, flooding could be worse.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Additionally, families can gather supplies, according to Lee. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It’s better to have a plan and not need it,” Lee said. “People can prepare if they live in a flood zone by stocking on emergency supplies like flashlights, candles, bottled water, canned food for people and pets, other supplies like a wrench in case they need to turn off their gas and knowing how to turn it off.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Other preparations include purchasing plastic tarps and sandbags, putting things high up off the ground, and arranging for pet care, according to Lee. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Those who are interested in either providing or seeking shelter can contact Lee at <\/span><a href=\"mailto:liz@funghi.com\"><span style=\"font-weight: 400;\">liz@funghi.com<\/span><\/a><span style=\"font-weight: 400;\">. <\/span><span style=\"font-weight: 400;\"> <\/span>","excerpt":"In light of the increase of rain that El Niño brings, a Palo Alto High School parent is aiming to provide shelter for Paly families at risk of flooding.","date":"2016-01-21 18:14:35","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/2.jpg","categories":["News","Spotlight"],"tags":["El nino","evacuation","flood","high school","palo alto","paly"]},{"id":114557,"title":"Teachers defeat students at Winter Rally","permalink":"http:\/\/palyvoice.com\/2016\/01\/21\/teachers-defeat-students-at-winter-rally\/","content":"The teachers defeated the senior class at the first student vs. staff soccer game during the Winter Rally last week. The final score was 3-2.\r\n\r\n<span style=\"font-weight: 400;\">Due to current <a href=\"http:\/\/palyvoice.com\/2015\/09\/02\/video-big-gym\/\">gym renovations<\/a>, this was the first Winter Rally to feature an outdoor event instead of a traditional basketball game inside a gym.<\/span>\r\n\r\n\"I think we adjusted really well to not having our gym,\" Junior Class President Noa Ben-Efraim said.\r\n\r\n<span style=\"font-weight: 400;\">After falling behind in the first half, the teachers took the lead in the closing minutes with a goal. Senior goalie Matt O’Reilly was disappointed with the game's final outcome but thinks the students played well overall. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I don’t think the game went quite as expected,\" O'Reilly said. \"We were hoping to win. But I think our team played really well, we just had a couple defensive miscues and I think the teachers also played really well. They took advantage of their opportunities. I just wish we hadn’t let in that one right in the end.”<\/span>\r\n\r\nTeacher Chris Farina says he enjoyed the game and thought that the staff played well.\r\n\r\n“It was fun to have a back and forth game,\"Farina said. \"We had a good number of goals, kept it pretty exciting. I thought the staff did a good job sticking to our game plan and not doing anything too dumb.”\r\n\r\n<iframe src=\"\/\/www.cincopa.com\/media-platform\/iframe.aspx?fid=A8CAGNtZc-sn\" width=\"600\" height=\"430\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The teachers defeated the senior class at the first student vs. staff soccer game during the Winter Rally on Thursday. The final score was 3-2. ","date":"2016-01-21 18:13:06","author":"Annika Behal","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/unnamed.jpg","categories":["News"],"tags":["chris farina","Matt O'Reily","soccer game","student v.s. staff","students","teachers","teachers v.s. students","winter rally"]}]