[{"id":126352,"title":"Turkey Trot by numbers","permalink":"http:\/\/palyvoice.com\/2016\/11\/18\/turkey-trot-by-numbers\/","content":"Student are returning to home with full bellies today after Palo Alto High School's 12th annual <a href=\"http:\/\/palyvoice.com\/2016\/11\/17\/tradition-to-continue-with-12th-turkey-trot-tomorrow\/\">Turkey Trot<\/a>, a feast in honor of Thanksgiving, took place at lunch on the Quad.\r\n\r\nThe feast costs either five dollars in cash or two dollars plus three cans of non-perishable foods. According to Anderson and the <a href=\"http:\/\/www.ehpcares.org\/about-us.html\">Ecumenical Hunger Program website<\/a>, the money and cans raised by the Turkey Trot are donated to the EHP in East Palo Alto, a non-profit organization who's mission is \"to sustain our neighbors through immediate crises and to help them regain stability and independence\".\r\n\r\nAccording to Paly parent and event organizer Melissa Anderson, this year's Turkey Trot will offered more options for students with dietary restrictions. The feast will provided options for vegetarians and gluten-free students, such as baked potatoes and vegetarian stuffing, along with gluten free pies, stuffing and gravy.\r\n\r\nAnderson, who has been organizing the Turkey Trot for seven years, finds the event to be her favorite Paly tradition.\r\n\r\n\"I love seeing all the kids come out,\" Anderson said. \"They all come out in mass. If you pick your head up at about noon, it's like 'Oh my goodness! I hope we have enough food', and then there's always seconds, everyone gets fed.\"\r\n\r\n\"At the end of this, we give five big barrels of canned goods to [The] Ecumenical Hunger [Program],\" Anderson said. \"I come over with anywhere from $2,000 to $4,000, and that helps their food and gift drive for their clients. We're a really major part of their offerings for their families.\"\r\n\r\nBelow is the breakdown of this years Turkey Trot feast statistics.\r\n\r\n<iframe style=\"overflow-y: hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/18235253-new-piktochart\" width=\"800\" height=\"1547\" frameborder=\"0\" scrolling=\"no\"><\/iframe>","excerpt":"Student are returning to home with full bellies today after Palo Alto High School's 12th annual Turkey Trot, a feast in honor of Thanksgiving, took place at lunch on the Quad. ","date":"2016-11-18 18:40:21","author":"Maya Akkaraju","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/15128655_569222469931377_283696749_n.jpg","categories":["News","Spotlight"],"tags":["anderson","gluten-free","palo alto high school","paly","pie","stuffing","thanksgiving","turkey","turkey feast","turkey trot","turkey trot 2016","vegetarian"]},{"id":126204,"title":"Video: Students march for peace","permalink":"http:\/\/palyvoice.com\/2016\/11\/18\/video-palo-alto-peace-march\/","content":"Students chanted and cheered during a peace march Tuesday intended to show support for students after a divisive election. Gunn High School and Castilleja School students also came out to support the march.\r\n\r\n<iframe src=\"https:\/\/www.youtube.com\/embed\/01oTKbAjXfA\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"Watch a video of students chanting and cheering during a peace march Tuesday intended to show support for students after a divisive election. ","date":"2016-11-18 09:27:16","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/IMG_7748.jpg","categories":["Multimedia","Spotlight","Video"],"tags":["march","peace","video"]},{"id":126269,"title":"Tradition to continue with 12th Turkey Trot tomorrow","permalink":"http:\/\/palyvoice.com\/2016\/11\/17\/tradition-to-continue-with-12th-turkey-trot-tomorrow\/","content":"In celebration of Thanksgiving, Palo Alto High School’s 12th annual Turkey Trot will take place during an extended lunch tomorrow from 11:45 a.m. to 1 p.m. on the quad.\r\n\r\nAt this school-wide event, students will share a full Thanksgiving meal, including turkey and stuffing, and other traditional holiday foods. Vegetarian and gluten free options will be provided.\r\n\r\n[caption id=\"attachment_112264\" align=\"alignright\" width=\"431\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/IMG_9465.jpg\"><img class=\" wp-image-112264\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/IMG_9465.jpg\" alt=\"Students swarm food tables during the 2015 Turkey Trot. Photo by Sherwin Amsbaugh\" width=\"431\" height=\"322\" \/><\/a> Students anxiously await their meals during the 2015 Turkey Trot. Photo by Sherwin Amsbaugh.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Those who wish to purchase lunch must bring either five dollars in cash, or two dollars and three cans of nonperishable food. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Melissa Anderson, a parent volunteer who helps organize the feast annually, cans will be donated to the Ecumenical Hunger Program in East Palo Alto. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It [The <\/span><span style=\"font-weight: 400;\">Ecumenical Hunger Program] has been the recipient of the proceeds and food collection from the Paly feast since before I was first involved in 2010,” Anderson said. “We donate the canned goods that students and staff bring on Friday, [which is] usually five large full barrels.\"<\/span>\r\n\r\nAs stated by Anderson, cash proceeds will be put towards the feast, and all excess money will be donated as well.\r\n\r\n<span style=\"font-weight: 400;\"> \"We purchase the stuffing, gravy, salad fixings and rolls,\" Anderson said. \"Everything else is donated. In the last several years, that’s been anywhere from $2,000-$4,000.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Anderson, the Turkey Trot tradition began at Gunn High School in 2004, before it was brought to Paly the following year, with the hope of spreading Thanksgiving spirit to the Paly community. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"It [The Turkey Trot] is intended to be a community event, giving us all the opportunity to be together, be grateful for our blessings and generous to others,\" Anderson said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Due to the extended lunch, tomorrow will feature a modified C-day schedule. Class periods will be 45 minutes long, with lunch beginning at 11:45 a.m. and ending at 1 p.m.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Junior Ellen Goncher is especially excited for this year's trot.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I love the Turkey Trot,” Goncher said. “I didn’t get to go last year, so I’m very excited.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">For those who are not as keen on the classic holiday meal, many still enjoy the extra 35 minutes by treating themselves to lunch off campus. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior Mack Saitz will be taking advantage of the special schedule and making the trek to San Francisco.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"During the extended lunch, I'll take advantage of my extra free time,\" Saitz said. \"I might go to SF  [San Francisco] and go to lunch at CPK [California Pizza Kitchen] with some friends.\"<\/span>","excerpt":"In celebration of Thanksgiving, Palo Alto High School’s 12th annual Turkey Trot will take place during an extended lunch tomorrow from 11:45 a.m. to 1 p.m. on the quad.","date":"2016-11-17 20:39:42","author":"Maya Reuven","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/11\/IMG_9465.jpg","categories":["News","Spotlight"],"tags":["cday","extended","feast","Food","lunch","schedule","stuffing","thanksgiving","trot","turkey","turkey trot"]},{"id":126052,"title":"&#8216;Dr. Strange&#8217; is a strangely enticing, supernatural adventure","permalink":"http:\/\/palyvoice.com\/2016\/11\/17\/dr-strange-is-a-strangely-enticing-supernatural-adventure\/","content":"[caption id=\"attachment_126292\" align=\"alignnone\" width=\"615\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/MV5BNjgwNzAzNjk1Nl5BMl5BanBnXkFtZTgwMzQ2NjI1OTE@._V1_SY1000_CR006741000_AL_.jpg\"><img class=\"wp-image-126292 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/MV5BNjgwNzAzNjk1Nl5BMl5BanBnXkFtZTgwMzQ2NjI1OTE@._V1_SY1000_CR006741000_AL_.jpg\" alt=\"\" width=\"615\" height=\"560\" \/><\/a> With a mix of wry wit and cool composure, Benedict Cumberbatch perfectly plays the role of the movie's titular character. Photo from Imdb.com[\/caption]\r\n\r\nIn the production of its most recent film, \"Dr. Strange,\" Marvel brings a new side of superheroes to life, one that goes beyond the classic confines of conventional superpowers to introduce themes of mysticism and the occult. In the tradition of superhero movies, \"Dr. Strange\" is action packed, fast paced and pushes the envelope of visual effects to make a fantastical and unreal world come to life.\r\n\r\n<span style=\"font-weight: 400;\">While all Marvel movies may emphasize mesmerizing imagery and exciting battle choreography, to the point of cookie-cutting plots and sacrificing dialogue, \"Dr. Strange\" doesn’t quite fit the mold as closely as some of the previous installments. Superhero movies may be as Hollywood as it gets, but the film, along with Benedict Cumberbatch's performance as the titular character are distinguished with wittier lines, clever plot tricks and an eclectic musical score that give the audience more food for thought as it takes a surreal detour from Marvel's usual path.<\/span>\r\n\r\nThe concept of an astral body, different dimensions and the ability for the mind to heal the body are explored with \"Dr. Strange,\" replacing the conventional superpowers in previous installments. The movie’s depiction of these spiritual ideas is unfortunately shallow, as the thin layer of eastern-inspired practices covers up a lot of mystical mumbo-jumbo. That being said, the theme of humility and respect to a universal power is a repeating theme in the movie where egotistical Dr. Strange is humbled by its might, in a way that may allude back to eastern religious themes.\r\n\r\n<span style=\"font-weight: 400;\">The movie starts by introducing Dr. Stephen Strange (Benedict Cumberbatch),  a brilliant and dexterous neurosurgeon from New York who's as arrogant as he is meticulous. The doctor’s life is suddenly met with tragedy when he is victim to a car accident that leaves him severely damaged in both his hands. With his surgical career hanging on the line, Strange desperately seeks a cure, eventually traveling to Kathmandu, Nepal, after hearing of a miraculous case where a man overcame paralysis in the mysterious, secret compound of Kamar-Taj. What he finds there he cannot fully accept.<\/span>\r\n\r\n<span style=\"font-weight: 400;\"> When the mysterious overseer of the compound, the Ancient One (Tilda Swinton), introduces Kamar-Taj as a magic academy, both audiences and Dr. Strange are skeptical of what to expect, only to be literally blown away by her demonstration of mystical ability. The producer’s decision to embrace the original story’s eastern notion of sorcery created the opportunity to depict vivid Kaleidoscopic scenes of morphing buildings and psychedelically changing landscapes, breathtakingly bewitching when watched on an 80-foot screen. In the compound, Dr. Strange is taught how to manipulate and distort reality, the power of teleportation and altering time, in scenes that are reminiscent of classic sci-fis like \"<\/span><span style=\"font-weight: 400;\">The Matrix\"<\/span><span style=\"font-weight: 400;\"> and \"<\/span><span style=\"font-weight: 400;\">Inception.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Behind the whimsy and excitement of the wondrous powers, an evil is emerging that threatens Kamar-Taj and the whole world. Dr. Strange and the compound’s guardians, Karl Mordo (Chiwetel Ejiofor) and Wong (Benedict Wong) must defend humanity from the evil ex-student, Kaecilius (Mads Mikkelsen), who seeks revenge on the Ancient One by opening a gate to the “Dark Dimension”. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Dr. Strange’s own past unfolds as his journey returns him to his home city of New York and the very hospital he used to perform in. He rekindles things with his former romantic partner, Christine Palmer (Rachel McAdams) who desperately tries keeping him alive as Strange’s ghostly, astral body does dimensional battle with a dark sorcerer. The relationship between Strange and Christine develops throughout the course of the movie, as dynamically as the warping environments so expertly created through special effects.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The most important criteria for a good superhero flick is the wow factor of the battle scenes. The fighting sequences are less destructive than the usual arena-like melee duels of previous superhero movies, and more focused on disorienting and out-maneuvering the enemy. Dr. Strange may fight in or out of his body while the battlefield may jump from different corners of the Earth to different dimensions. Viewing the characters contest the streets of New York and Hong Kong to other dimensions was especially spellbinding up-close in theaters with an intense original soundtrack adding to our immersion.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">This is certainly one movie worth seeing on a big-screen in theaters. The storyline was fast paced and engaging while the action was dazzling. Watching formulaic brawl scenes where opponents always use brawn can become very repetitive and tiresome, but \"Dr. Strange\" was a refreshing new breathe from Marvel’s predictable past. <\/span>\r\n\r\nRunning Time: 115 minutes\r\n\r\nDirector: Scott Derrickson\r\n\r\nCast: Benedict Cumberbatch-Stephen Strange &amp; Dormammu\r\n\r\nRachel McAdams-Christine Palmer\r\n\r\nTilda Swinton-The Ancient One\r\n\r\nMads Mikkelsen-Kaecilius\r\n\r\nChiwetel Ejiofor-Karl Mordo\r\n\r\nBenedict Wong-Wong\r\n\r\nMusic Composer: Michael Giacchino\r\n\r\n&nbsp;","excerpt":"In the production of its most recent film, &#8220;Dr. Strange,&#8221; Marvel brings a new side of superheroes to life, one that goes beyond the classic <a href=\"http:\/\/palyvoice.com\/2016\/11\/17\/dr-strange-is-a-strangely-enticing-supernatural-adventure\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2016-11-17 18:22:51","author":"Donnesh Farmanfarmaian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/doctor-strange-cumberbatch-magic-powers.jpg","categories":["Entertainment","Spotlight"],"tags":["Dr. Strange","film","marvel","movie review"]},{"id":126248,"title":"Verbatim: Vikings share motivations for attending peace march","permalink":"http:\/\/palyvoice.com\/2016\/11\/17\/verbatim-vikings-share-motivations-for-attending-peace-march\/","content":"Palo Alto High School students joined others from around the Bay Area in a peaceful demonstration Tuesday afternoon at downtown Palo Alto.\r\n\r\nThe demonstration was intended to spread messages of love and acceptance, and was inspired by the unrest that many students felt because of derogatory comments made during the 2016 presidential election.\r\n\r\nThe Paly Voice asked students why they decided to attend the march.\r\n\r\n<iframe src=\"\/\/www.thinglink.com\/card\/855323001644646402\" width=\"700\" height=\"800\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"Palo Alto High School students joined others from around the bay area in a peaceful demonstration Tuesday afternoon at downtown Palo Alto. The Paly Voice asked students why they decided to attend the march.","date":"2016-11-17 09:38:54","author":"William Sallomi","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/Verbatim1.jpg","categories":["Features","Verbatims"],"tags":["darrow hornik","march","nani tupou","peace rally","richy islas","tyler marik","verbatim","zoe stedman"]},{"id":125145,"title":"Review: &#8216;The Importance of Being Earnest&#8217; brings Victorian era to life","permalink":"http:\/\/palyvoice.com\/2016\/11\/17\/review-the-importance-of-being-earnest-brings-victorian-era-to-life\/","content":"[caption id=\"attachment_125865\" align=\"aligncenter\" width=\"519\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/importanceofbeingearnest.jpg\"><img class=\" wp-image-125865\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/importanceofbeingearnest.jpg\" alt=\"g\" width=\"519\" height=\"389\" \/><\/a> The set stage for \"The Importance of Being Earnest\" as the audience waits for the play to start. Photo: Katie Cox[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto High School theater department delivered laughter to the new Performing Arts Center with the play, “The Importance of Being Earnest.” The performers entertained the audience earlier this month with clever acting and realistic Victorian English accents.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The Importance of Being Earnest” centers on two young men, Moncrieff and Worthing. Hoping to woo their love interests, Cecily and Gwendolyn, they both adopt the name Earnest. However, when they end up in the country together, their true identities are discovered.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The talented cast delivered the lines with the perfect amount of wit and charm to win the audience over. Both Jackson Kienitz (Moncrieff) and Jason Pollak (Worthing) portrayed their characters in a charming light to show the friendship between the two men perfectly. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The audience was still able to relate and laugh as the characters desperately try to impress their love interests. Nadia Leinhos, alternating with Claire Eberhart, as Lady Bracknell was extraordinary as Moncrieff's aunt; her character brought laughter to the audience with her exaggerated snobbery and patronizing attitude. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Mia Trubelja (Gwendolyn) was nothing short of hilarious acting as a girl who had high expectations and didn’t seem to want to accept any man except for one with the name of Earnest. This humor created a light atmosphere and made the performance enjoyable. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Not only did the brilliant cast help entertain the audience, but the cultured and sophisticated British accents the actors adopted helped transport the viewers to a different place and era. After multiple lessons on these accents, the cast should be proud of the final outcome as every single one of them sounded authentic and believable.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The costumes, makeup and set were extremely well-done, but not over the top.  The set itself was also beautiful and classy. It was very intricately designed and it set the tone for the rest of the play.   <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The performance was fairly long, with three different acts and only two 10 minute breaks. However, the viewers were always engaged and laughing. The play had a bit of a slow start as it took some time for new characters to enter, but once they did, the play was quickly brought to life and entertaining. In addition to the play itself, as people took their seats and the lights dimmed, five talented musicians took to the stage and sang, danced and played the piano to set the mood before the actors revealed themselves.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The Importance of Being Earnest” was the perfect comedy to commence the theater department's year.  The stellar acting and realistic set and costumes made the play both enjoyable and relatable to viewers. This wonderful production augurs well for future PAC performances.<\/span>\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School theater department delivered laughter to the new Performing Arts Center with the play, “The Importance of Being Earnest.” The performers entertained <a href=\"http:\/\/palyvoice.com\/2016\/11\/17\/review-the-importance-of-being-earnest-brings-victorian-era-to-life\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2016-11-17 08:52:36","author":"Katie Cox","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/importanceofbeingearnest.jpg","categories":["Entertainment","Reviews"],"tags":["fall play","pac","theatre department"]},{"id":126263,"title":"Thanksgiving Break will be from Nov. 23 to Nov. 25","permalink":"http:\/\/palyvoice.com\/2016\/11\/17\/thanksgiving-break-will-be-from-nov-23-to-nov-25\/","content":"","excerpt":"","date":"2016-11-17 08:45:32","author":"Chirag Akella","categories":["Ticker"],"tags":[]},{"id":124363,"title":"Paly then and now","permalink":"http:\/\/palyvoice.com\/2016\/11\/17\/paly-then-and-now\/","content":"Since its opening in 1898, Palo Alto High School's campus has undergone multiple transformations and seen the addition of several construction projects. Over the years, Paly has been a second home to thousands of high schoolers, though parts of the campus itself has changed through the generations.\r\n\r\nHowever, a student walking around campus will still discover that parts of Paly have remained unchanged since its establishment over a century ago.\r\n\r\nBelow are comparisons of Paly's campus and student body from the past to now, using pictures from old yearbooks.\r\n\r\n<iframe class=\"juxtapose\" src=\"https:\/\/cdn.knightlab.com\/libs\/juxtapose\/latest\/embed\/index.html?uid=14f6b1c0-a4aa-11e6-a80c-0edaf8f81e27\" width=\"669\" height=\"669\" frameborder=\"0\"><\/iframe>\r\n\r\n<iframe class=\"juxtapose\" src=\"https:\/\/cdn.knightlab.com\/libs\/juxtapose\/latest\/embed\/index.html?uid=50429578-a4aa-11e6-a80c-0edaf8f81e27\" width=\"100%\" height=\"1050\" frameborder=\"0\"><\/iframe>\r\n\r\n<iframe class=\"juxtapose\" src=\"https:\/\/cdn.knightlab.com\/libs\/juxtapose\/latest\/embed\/index.html?uid=903303ac-a4aa-11e6-a80c-0edaf8f81e27\" width=\"100%\" height=\"1050\" frameborder=\"0\"><\/iframe>\r\n\r\n<iframe class=\"juxtapose\" src=\"https:\/\/cdn.knightlab.com\/libs\/juxtapose\/latest\/embed\/index.html?uid=cc856e76-a4aa-11e6-a80c-0edaf8f81e27\" width=\"100%\" height=\"1050\" frameborder=\"0\"><\/iframe>\r\n\r\n<iframe class=\"juxtapose\" src=\"https:\/\/cdn.knightlab.com\/libs\/juxtapose\/latest\/embed\/index.html?uid=047b5c82-a4ab-11e6-a80c-0edaf8f81e27\" width=\"100%\" height=\"700\" frameborder=\"0\"><\/iframe>\r\n\r\n<iframe class=\"juxtapose\" src=\"https:\/\/cdn.knightlab.com\/libs\/juxtapose\/latest\/embed\/index.html?uid=2f672bd8-a4ab-11e6-a80c-0edaf8f81e27\" width=\"100%\" height=\"700\" frameborder=\"0\"><\/iframe>\r\n\r\n<iframe class=\"juxtapose\" src=\"https:\/\/cdn.knightlab.com\/libs\/juxtapose\/latest\/embed\/index.html?uid=52c3bb50-a4ab-11e6-a80c-0edaf8f81e27\" width=\"100%\" height=\"700\" frameborder=\"0\"><\/iframe>\r\n\r\n<iframe class=\"juxtapose\" src=\"https:\/\/cdn.knightlab.com\/libs\/juxtapose\/latest\/embed\/index.html?uid=96633fd4-a4ab-11e6-a80c-0edaf8f81e27\" width=\"100%\" height=\"700\" frameborder=\"0\"><\/iframe><iframe class=\"juxtapose\" src=\"https:\/\/cdn.knightlab.com\/libs\/juxtapose\/latest\/embed\/index.html?uid=b6852516-a4ab-11e6-a80c-0edaf8f81e27\" width=\"100%\" height=\"700\" frameborder=\"0\"><\/iframe>\r\n\r\n<iframe class=\"juxtapose\" src=\"https:\/\/cdn.knightlab.com\/libs\/juxtapose\/latest\/embed\/index.html?uid=dac8836e-a4ab-11e6-a80c-0edaf8f81e27\" width=\"100%\" height=\"700\" frameborder=\"0\"><\/iframe>","excerpt":"Below are comparisons of Paly's campus and student body from the past to now, using pictures from old yearbooks.","date":"2016-11-17 08:30:35","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/paly-then-and-now-tower-building-old.png","categories":["Multimedia"],"tags":["00s","20s","30s","40s","50s","60s","70s","80s","90s","Alto","and","High","now","old","Palo","paly","School","then"]},{"id":126217,"title":"Slideshow: Students march through town","permalink":"http:\/\/palyvoice.com\/2016\/11\/16\/slideshow-students-march-through-town\/","content":"A group of students exercised their rights and organized a peace march during Flex period. The march not only included students from Palo Alto High School, but also from Gunn High School and Castilleja. According to the Palo Alto Peace March Facebook page, \"The goal of this march is to spread messages of love, unity, acceptance and equality.\"\r\n\r\nStudents marched from the Quad to the El Camino intersection which was blocked off with the aid of the Palo Alto Police Department. While walking, the students cheered, chanted and held up signs that were made. The main event was at Lytton Plaza on University Avenue in downtown Palo Alto. Many students gave testimonies that were emotional and personal.\r\n\r\n\"I didn't write anything down, it came from the heart and I felt like I made an impact in the community,\" junior and speaker Richard Islas said after speaking to the crowd.\r\n\r\nPhotos: Rachel Code\r\n\r\n<iframe src=\"https:\/\/docs.google.com\/presentation\/d\/1uia4saWn-AOzmybX1rkU6VhnQh0i4mxR-Vt46BykiEM\/embed?start=false&amp;loop=true&amp;delayms=5000\" width=\"720\" height=\"434\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"A group of students exercised their rights and organized a peace march during Flex period. The march not only included students from Palo Alto High School, but also from Gunn High School and Castilleja. ","date":"2016-11-16 22:05:16","author":"Bradley Smith","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/Screen-Shot-2016-11-16-at-10.04.00-PM.png","categories":["News","Spotlight"],"tags":["march","peace"]},{"id":125332,"title":"Bilingual education restored by Prop 58","permalink":"http:\/\/palyvoice.com\/2016\/11\/16\/bilingual-education-restored-by-prop-58\/","content":"[caption id=\"attachment_126129\" align=\"alignnone\" width=\"614\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/Alonso.jpg\"><img class=\" wp-image-126129\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/Alonso.jpg\" alt=\"Caption caption caption\" width=\"614\" height=\"409\" \/><\/a> Spanish teacher Pilar Alonso teaches her second period class this morning at Palo Alto High School. According to Alonso, a bilingual education helps immigrant students learn English while also preserving the culture of their own languages. \"The goal is that over four years students will still learn about the culture of their own language while becoming proficient in English,\" Alonso said. Photo: William Sallomi[\/caption]\r\n\r\nCalifornia's public schools will provide diverse options for elementary level students seeking proficiency in the English language after a proposition removing the mandate of exclusively English education was passed on the state ballot last week.\r\n\r\nProp. 58 is a legal measure that gives elementary level students who are learning English as a second language the choice of either beginning with  bilingual education, or being immediately integrated into English immersion classes. While students do have more educational options, the proposition -now law- still requires that all students become proficient in English.\r\n\r\nProp. 58 passed with a  remarkable approval rating of approximately 73 percent.\r\n\r\nAccording to Spanish teacher and former instructional supervisor of the Palo Alto High School World Languages department Kevin Duffy, English-only programs are detrimental to a young student's native language.\r\n\r\n\"According to many studies, a single language program will cause students to ignore their native language,\" Duffy said.  \"This is because your goal is just to learn English, and not to maintain your proficiency in your native language.\"\r\n\r\nAccording to Duffy, the proposition's emphasis on preserving students' bilingual status is important for America.\r\n\r\n\"The goal [for the students] should be that upon graduating from high school, they should be a strong group of bilingual students,\" Duffy said. \"In America, we need people who speak more than one language, so why not use the native abilities of immigrant students?\"\r\n\r\nDuffy said that although the proposition has its benefits, for some communities who have diverse immigrant populations, it may be impractical.\r\n\r\n\"Here in California we have a diverse group of students who speak a wide variety of languages, so it wouldn't be very practical to have a program for each native language,\" Duffy said. \"It's unfair to say that we can help students who speak one language over those who speak another, which can make the process difficult.\"\r\n\r\nAccording to Paly Spanish teacher Pilar Alonso, who taught English to young Latino children, a bilingual program is important for helping students learn English while still maintaining their cultural roots.\r\n\r\n\"The bilingual program [at which Alonso worked] was initially started because there was no system to help kindergarten students with no English speaking experience become integrated into a fully English school system,\" Alonso said. \"The goal was that the students would learn English over the course of four years, and during that time they also learned to read in their own language,\"\r\n\r\nAccording to Alonso, each year the classes gradually transitioned from Spanish to English until the students were able to make the leap into standard English classes.\r\n\r\n\"Kindergarten classes were carried out 90 percent in Spanish, and 10 percent in English,\" Alonso said. \"By the time they were in third grade, the students would be enrolled in the fully English courses.\"\r\n\r\nAlonso said that the bilingual education was crucial in preparing the students for success, while helping them draw connections between two languages and cultures.\r\n\r\n\"The program worked phenomenally because the kids left completely prepared, and transitioned what they learned about their own languages to English,\" Alonso said. \"Bilingual students need this kind of support in school.\"\r\n\r\nFollowing the passing of the proposition, the state will now be tasked with implementing these bilingual programs into public schools.","excerpt":"California's public schools will provide diverse options for elementary level students seeking proficiency in the English language after a proposition removing the mandate of exclusively English education was passed on the state ballot last week.","date":"2016-11-16 18:40:53","author":"William Sallomi","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/Alonso.jpg","categories":["Global Outlook","News","Uncategorized"],"tags":["education","election","Jose Ezcurra","Kevin Duffy","language","Pilar Alonso","Prop 58"]}]