[{"id":118866,"title":"Admin investigates window vandalism","permalink":"http:\/\/palyvoice.com\/2016\/04\/12\/admin-investigates-window-vandalism\/","content":"[caption id=\"attachment_118873\" align=\"alignnone\" width=\"596\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_0574-2.jpg\"><img class=\"wp-image-118873 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_0574-2.jpg\" alt=\"window vandalism\" width=\"596\" height=\"447\" \/><\/a> A Palo Alto High School student observes the damage done to her science classroom before entering sixth period yesterday. Room P9 was one of multiple classrooms targeted by a student who shot at windows with a BB gun over Spring Break, according to Assistant Principal Jerry Berkson. Photo: Adrienne Kwok.[\/caption]\r\n\r\nThe Palo Alto High School administration is working to repair damage done to multiple buildings after discovering eight shattered windows last Tuesday, according to Assistant Principal Jerry Berkson.\r\n\r\nBerkson said he received a call during Spring Break indicating an individual had used a BB gun to shoot at classrooms P6A, P9, P12 and 901, which include science portables and an administrative building. Paly is covering the broken windows with plywood while waiting for the out-of-stock replacements to arrive.\r\n\r\nThe administration is analyzing the extent of the damage before deciding on a penalty, according to Berkson. The perpetrators, currently unidentified, could face legal consequences and pay upwards of $1000 in damage. Other repercussions may include suspension, a permanent addition to a student’s record that could affect their college eligibility, says Berkson.\r\n\r\nThe administration may take further legal action, as a BB gun was brought on campus. According to the Paly Student Handbook, weapons, including paint ball and squirt guns, are prohibited on campus and could result in PAUSD expulsion and arrest per the California State Educational Code.\r\n\r\n“Having been a teenager at one time, I understand that kids may sometimes do things that are inappropriate,” Berkson said. “Kids should really think about what they are doing before they do it, because the consequences could be a very big deal.”\r\n\r\nOther than a decrease in natural lighting, science teacher Elizabeth Brimhall, whose classroom suffered a broken window, does not believe the vandalism is significantly affecting her teaching.\r\n\r\n\"It's shocking and I think the students were surprised [at the vandalism]” Brimhall said. “For me, luckily it’s not the only window we have so we have other ways to get light in the room. It [vandalism] has a minor effect except for the fact that it’s a sad thing to have happened.”\r\n\r\nPaly is no new victim to vandalism. In February, a student <a href=\"http:\/\/palyvoice.com\/2016\/02\/16\/admin-investigates-franco-mural-vandalism\/\" target=\"_blank\">spray painted<\/a> over one of two James Franco murals with red words, “How do you vandalize garbage?\"\r\n\r\nStudents responded to the most recent vandalism by expressing their disapproval.\r\n\r\n“I don't think that's okay at all,” junior Aman Mittal said. “Vandalizing the school you learn in is so disrespectful, and we're blessed to go to a beautiful-looking school like Paly.”","excerpt":"Palo Alto High School administration is working to repair damages done to multiple buildings after discovering eight shattered windows on Tuesday.","date":"2016-04-12 11:32:37","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_0574-2.jpg","categories":["News","Spotlight"],"tags":["assistant","bb","Berkson","brimhall","elizabeth","franco","gun","james","Jerry","mural","plywood","principal","science","suspension","vandalism","window"]},{"id":118916,"title":"Paly Orchestra and Band concert at 7:00 p.m. on Thursday, April 14 in Haymarket Theater","permalink":"http:\/\/palyvoice.com\/2016\/04\/12\/paly-orchestra-and-band-concert-at-700-p-m-on-thursday-april-14-in-haymarket-theater\/","content":"","excerpt":"","date":"2016-04-12 11:32:36","author":"Sherwin Amsbaugh","categories":["Ticker"],"tags":[]},{"id":118906,"title":"Paly cheer and dance team tryouts Monday, April 11 to Friday, April 15","permalink":"http:\/\/palyvoice.com\/2016\/04\/12\/cheer-and-dance-tryouts-monday-april-11-to-friday-april-15\/","content":"","excerpt":"","date":"2016-04-12 11:25:52","author":"Sherwin Amsbaugh","categories":["Ticker"],"tags":[]},{"id":118892,"title":"Alternate schedule on Tuesday, April 19 due to sophomore testing","permalink":"http:\/\/palyvoice.com\/2016\/04\/12\/alternate-schedule-on-tuesday-april-19th-due-to-sophomore-testing\/","content":"","excerpt":"","date":"2016-04-12 11:17:37","author":"Sherwin Amsbaugh","categories":["Ticker"],"tags":[]},{"id":118413,"title":"Ohlone teacher expected to enter plea Monday","permalink":"http:\/\/palyvoice.com\/2016\/04\/11\/ohlone-teacher-expected-to-enter-plea-monday\/","content":"An Ohlone Elementary School teacher on unpaid compulsory leave is expected to enter a plea 9 a.m. Monday, April 18 at the Palo Alto Courthouse after postponing his arraignment in a case involving charges of child sexual abuse.\r\n\r\nIn a court presided over by Judge Kenneth P. Barnum on <a href=\"http:\/\/palyvoice.com\/2016\/02\/15\/ohlone-teacher-to-appear-in-court-tuesday\/\" target=\"_blank\">Feb. 16<\/a>, defendant Michael Christopher Airo waived his right to a speedy trial and delayed his arraignment by 30 days. He verbally agreed to a <a href=\"http:\/\/www.scscourt.org\/self_help\/restraining\/crim_ro.shtml\" target=\"_blank\">no contact order<\/a> which mandates that he cannot come within 300 yards of the alleged victim.\r\n\r\nOn March 21 before Judge Rene Navarro, Airo appeared briefly at the stand to waive time for another 30 days and to set the date for his next appearance.\r\n\r\nThe arraignment will include a reading of charges against Airo. Subsequently, Airo is anticipated to enter a plea of guilty, not guilty or as otherwise permitted by the law, as per the common procedure of an arraignment. In a typical criminal proceeding, a preliminary hearing follows arraignment and determines if there is enough evidence to go to trial.\r\n\r\nAiro is charged with one count of continual sexual abuse of a child and three counts of lewd and lascivious acts on a child, according to a Jan. 15 <a href=\"http:\/\/www.cityofpaloalto.org\/civica\/press\/display.asp?layout=1&amp;Entry=1393\">press release<\/a> from the Palo Alto Police Department and a full police report by Officer Joel Hornung.","excerpt":"An Ohlone Elementary School teacher on unpaid compulsory leave is expected to enter a plea 9 a.m. Monday, April 18 at the Palo Alto Courthouse after postponing his arraignment in a case involving charges of child sexual abuse.","date":"2016-04-11 19:21:47","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/IMG_3324.jpg","categories":["News","Spotlight"],"tags":["airo","court","lewd and lascivious acts","michael christopher","ohlone elementary school","palo alto courthouse","plea","santa clara county superior court","sexual abuse of child","speedy trial","waive time"]},{"id":118763,"title":"Science Olympiad wins regional competition, heading to States","permalink":"http:\/\/palyvoice.com\/2016\/04\/03\/science-olympiad-wins-regional-competition-heading-to-states\/","content":"[caption id=\"attachment_118830\" align=\"alignnone\" width=\"527\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/12903484_546740605495972_1185575781_o1.jpeg\"><img class=\"wp-image-118830\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/12903484_546740605495972_1185575781_o1.jpeg\" alt=\"\" width=\"527\" height=\"360\" \/><\/a> Green Team members celebrate after winning the Santa Clara Regional Science Olympiad competition. The competition this year was extremely close and tough, according to green team member sophomore Celine Wang. \"I think this made us realize that there are other teams in regionals that are definitely capable of threatening us,\" Wang said. Photo: Celine Wang[\/caption]\r\n\r\nPalo Alto High School’s Science Olympiad team looks to win the North California Science Olympiad State competition after taking first at the <a href=\"http:\/\/palyvoice.com\/2016\/03\/16\/science-olympiad-prepares-for-regional-tournament\/\">Santa Clara Regional Science Olympiad competition<\/a> on March 19 in San Jose.\r\n\r\nThis first place win continues a seven-year streak, according to sophomore Chloe Hong.  With this win, Paly’s SciOly team will be advancing to the state competition on April 16 in Turlock to compete for a place at Science Olympiad National Tournament.\r\n\r\nThis year, the team won by a margin of seven points, according to Hong, a member of Paly's green team. The SciOly competition is split into two teams, green team, which is akin to a varsity team, and white team, or the junior varsity team.  This slim margin came as a surprise to the team, who in the past, had been the undisputed winner of regionals.\r\n\r\n“It is not that we got worse, per se, it is just that the other teams have been working harder,” SciOly adviser Ron Bowditch said. “We can see that the competition has gotten much more intense.”\r\n\r\nAccording to senior team captain James Wang, there were some complications during some events.\r\n\r\n“During the competition, someone stepped on one of our engineering builds and there was a mishap that almost disqualified us in an event,” Wang said. “Our team remained supportive and optimistic.”\r\n\r\nThe team plans to take this close win as a wake up call and continue studying and preparing for states\r\n\r\n“We will just prepare as we usually do,” Hong said. “But now we are a lot more aware of the competition we have to face, and we will have to work harder.”\r\n\r\nBowditch echoes these sentiments, stating that competition at States will be extremely tough and competitive.\r\n\r\nFor the past few years, Paly SciOly has finished second at states, each time placing after Mira Loma High School from Sacramento. According to Hong, the only time Paly received first at states was in 2013, breaking Paly’s three-year streak of second-place wins. At <a href=\"http:\/\/palyvoice.com\/2013\/05\/21\/paly-scioly-team-makes-impressive-debut-at-nationals\/\">Nationals<\/a>, the team went on to place 16th out of 60 teams.\r\n\r\nHowever, team members do not think that this close call at the regional competition will affect the way the club is run.\r\n\r\n“We do not want our club to become inorganic and rigidly structured, because at the core we are still a 100% student-run and student-established club,” Hong said. “As always we are a community and we will always have fun.”","excerpt":"Palo Alto High School’s Science Olympiad team looks to win the North California Science Olympiad State competition after taking first at the Santa Clara Regional Science Olympiad competition on March 19 in San Jose.","date":"2016-04-03 19:18:57","author":"Julia Qiao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/12903484_546740605495972_1185575781_o.jpeg","categories":["News","Spotlight"],"tags":["Bowditch","chloe hong","competition","james wang","nationals","Olympiad","paly scioly","regional","santa clara regionals","science","Science Olympiad National Tournament","state"]},{"id":118792,"title":"Boys&#8217; tennis loses to cross-town rival Gunn","permalink":"http:\/\/palyvoice.com\/2016\/04\/02\/boys-tennis-loses-to-cross-town-rival-gunn\/","content":"[caption id=\"attachment_118794\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/2016-03-31-05.10.29.jpg\"><img class=\" wp-image-118794\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/2016-03-31-05.10.29.jpg\" alt=\"Junior Henry Badger serves while junior Jerry Hong prepares for the return. Badger and Hong lost their match in two close sets. \" width=\"600\" height=\"413\" \/><\/a> Junior Henry Badger serves while junior Jerry Hong prepares for the return during the Vikings' match Thursday against the Titans at Gunn High School. Badger and Hong lost their match in two close sets. Photo by Chirag Akella.[\/caption]\r\n\r\nThe Palo Alto High School boys’ tennis team fell to cross-town rivals Gunn High School, 5-2, in a De Anza league match on Thursday at Gunn.\r\n\r\nThe Vikings were unable to take advantage of three-set wins by senior Shiv Matta and junior Adrian Smith, losing by the same score as they did earlier in the season.\r\n\r\nHead coach Andy Harader said that the team was missing a few key players, including senior Carl Goodfriend, which contributed to the loss.\r\n\r\n“It was a little disappointing in that respect because I thought that we had a real chance to pull it off,\" Harader said. “We had a couple guys who were not around because of Spring Break, but I still thought that we might be able to win it.”\r\n\r\nHarader said that absences have been a theme throughout the season and something that the team has struggled to deal with.\r\n\r\n“We have had a lot of guys out with injuries and sickness and it has been hard to gain any consistency,” Harader said.\r\n\r\nDespite the loss, senior captain Shiv Matta felt that the team showed some fight against a good team.\r\n\r\n“It was a tough match and the guys battled hard so that was good to see,\" Matta said. “Despite the loss, the encouraging thing was that everyone competed hard.”\r\n\r\nThe team has already clinched a spot in next year’s De Anza league, an achievement that both the coach and players are excited about.\r\n\r\n“We have stayed up in the league because we got three wins in our league already, which we feel very good about,” Harader said. “So we have already achieved that goal for the season.”\r\n\r\nJunior Noah Galper echoed his coach’s positive sentiments.\r\n\r\n“We're really happy about that because that means we get to play good tennis all through next year,” Galper said. “Dropping down would mean that we would win a lot more, but the tennis would not be as good.”\r\n\r\nDespite not making the Central Coast Section playoffs this year, junior Henry Badger expects the team to continue to improve in order to compete next year.\r\n\r\n“In the upcoming weeks, we are going to work on keeping up the work so we can pull out more wins in the future,” Badger said. “We will not be making CCS unfortunately, but I hope that whoever is chosen for SCVALS [Santa Clara Valley Athletic League] will perform well for Paly and show other schools that we will be much better next year.”\r\n\r\nThe Vikings' next match is against Saratoga High School at 3:30 p.m. on April 12 at Saratoga.","excerpt":"The Palo Alto High School boys’ tennis team fell to cross-town rivals Gunn High School, 5-2, in a De Anza league match on Thursday at Gunn.","date":"2016-04-02 10:54:06","author":"Chirag Akella","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/2016-03-31-05.10.29.jpg","categories":["Sports"],"tags":["andy harader","boys tennis","de anza league","gunn","henry badger","jerry hong","palo alto high school","paly","shiv matta","tennis"]},{"id":118768,"title":"News in Review: March 2016","permalink":"http:\/\/palyvoice.com\/2016\/03\/31\/news-in-review-march-2016\/","content":"<em>This installment of the News in Review series summarizes the most important news stories and events from the month of March in a timeline format.<\/em>\r\n\r\n<iframe src=\"https:\/\/cdn.knightlab.com\/libs\/timeline3\/latest\/embed\/index.html?source=1mnroZNo1cSJ5Z32XWLkpW16L4_JPbSEOwuBG9BJ-wFY&amp;font=Default&amp;lang=en&amp;initial_zoom=2&amp;height=650\" width=\"100%\" height=\"650\" frameborder=\"0\"><\/iframe>","excerpt":"This installment of the News in Review series summarizes the most important news stories and events from the month of March in a timeline format.","date":"2016-03-31 21:25:35","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/news-in-review-march-2016.png","categories":["Multimedia","Spotlight"],"tags":["2016","admin","ASB","board","career","cheerleading","debate","donation","gunn","in","march","month","news","night","pranks","rally","review","School","science","seniors","TEDx"]},{"id":118506,"title":"Dance team triumphs at national competition","permalink":"http:\/\/palyvoice.com\/2016\/03\/31\/dance-team-triumphs-at-national-competition\/","content":"[caption id=\"attachment_118568\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/Dance.jpg\"><img class=\" wp-image-118568\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/Dance.jpg\" alt=\"Photo by Nathalia Castillo.\" width=\"600\" height=\"375\" \/><\/a> After a five-year absence from the United Spirits Association national competition, the Palo Alto High School dance team placed first in the Extra Small Dance category and recieved the judges' award of excellence. Photo by Nathalia Castillo.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto High School dance team triumphed at <\/span><span style=\"font-weight: 400;\">the United Spirits Association national competition this weekend, clinching first place in the Lyrical Extra Small Dance category in Anaheim, California.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to junior Nathalia Castillo, it has been five years since the Paly dance team last went to the national competition and the first time competing in five categories. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It wasn't our first time competing at nationals, but the last time we went was almost 5 years ago,” Castillo said. “We competed in five different categories: jazz, hip hop,<\/span><span style=\"font-weight: 400;\"> lyrical with small dance, team lyrical and character dance.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to senior Catherine Yu, the team was very proud of placing in its first year back.<\/span>\r\n\r\n“This was the first year in a while that the dance team competed so going to nationals and placing first in the Lyrical Small Dance category was a huge success,” Yu said. “I feel incredibly proud of our team, especially because we definitely went into the competition feeling like the underdog and not expecting to win anything.”\r\n\r\n<span style=\"font-weight: 400;\">Nevertheless, the team faced complications in other categories due to changes in the rules.<\/span>\r\n\r\n“Unfortunately, we didn't do as well in other categories because of some complications with rules,” Yu said. “However, competing in five different categories qualified us to win the judges' award of excellence, which is only given to three teams out of the entire competition.”\r\n\r\n<span style=\"font-weight: 400;\">The merits at the tournament did not come without preparation, according to Yu. Dance members dedicated large portions of their time to get ready for the competition.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We practiced four times a week after school, just running through the dances and cleaning them,” Yu said. “We actually learned all of our dances the week of regionals and were still making changes to choreography the week of nationals. It was a creative process the entire time.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Although the team will not participate in another competition until the next school year, senior Emma Sternfield hopes the team will continue to improve year after year. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“As a senior, I’m passing the baton down but I hope the team will become better and better,” Sternfield said. “I’m extremely proud of the team and what we have achieved and could not have asked for a better ending.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">As for next season, Sternfield anticipates another appearance at nationals. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I’m not sure about the plans for next year but hopefully the team competes at nationals again,” Sternfield said. “I think the team has what it takes to do well and I’m excited to see where they go.”<\/span>\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School dance team triumphs at the United Spirits Association national competition this weekend clinching first place in the country in the lyrical dance category in Anaheim, California.","date":"2016-03-31 11:00:20","author":"Ethan Kao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/03\/Dance.jpg","categories":["News"],"tags":["dance team","nationals","paly"]},{"id":118740,"title":"ASB to hold special elections for vacant positions","permalink":"http:\/\/palyvoice.com\/2016\/03\/30\/asb-to-hold-special-elections-for-vacant-positions\/","content":"Palo Alto High School students will be able to digitally vote in special elections for vacant Associated Student Body positions on April 14 and 15.\r\n\r\nApplications for  positions of ASB Treasurer and Junior Class Vice President, identical to those of the regular election, were released March 28 and will be accepted until 3:30 p.m. on Thursday March 31, according to Student Activities Director Matthew Hall.\r\n\r\n“I had already had some [students] email me, but they weren’t allowed to get in on the regular election because ostensibly they didn’t make the original deadline,” Hall said.\r\n\r\nAccording to Hall, candidate statements and speeches will be recorded April 11 and 12 and released along with their photos.\r\n\r\n“They [special election candidates] probably won’t even be putting up posters, we’re just going to do it digitally and find out who wins,” Hall said. “We have to fill those positions [ASB Treasurer and Junior Vice President] prior to interviews for appointed positions.”\r\n\r\nSpecial elections are a rare occurrence and the system for special elections was created in the ASB 2012-13 election, according to Hall.\r\n\r\n“Special elections are only used when we have positions for which nobody originally ran,\" Hall said. \"That precedent goes back to [the election of] 2012 to 2013 when the ASB Vice Presidential position was unfilled,” Hall said.","excerpt":"Digital voting for Palo Alto High School Associated Student Body's special elections for the vacant positions of ASB Treasurer and Junior Class Vice President will be available April 14 and 15.","date":"2016-03-30 21:33:43","author":"Zahra Muzaffar","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/0000\/00\/matt.jpg","categories":["News"],"tags":["ASB","ASB elections","Associated Student Body","hall","matt","palo alto high school","paly","special elections","Student activities director"]}]