[{"id":119717,"title":"Sports Boosters to host auction tonight","permalink":"http:\/\/palyvoice.com\/2016\/04\/30\/sports-boosters-to-host-auction-tonight\/","content":"[caption id=\"attachment_119718\" align=\"aligncenter\" width=\"475\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_4691.jpeg\"><img class=\"wp-image-119718\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_4691.jpeg\" alt=\"IMG_4691\" width=\"475\" height=\"356\" \/><\/a> One of the items that will be available for bid tonight at the Palo Alto High School Sports Booster's auction is this painting of Hunter Pence from the Giant's. Photo by Melissa Anderson.[\/caption]\r\n\r\nEver want to own a piece of Palo Alto High School history or eat pasta with Principal Kim Diorio?\r\n\r\nIf so, then you may be interested in Paly Sports Boosters’ auction that is happening from 7 to 10 p.m. tonight at 1055 Forest Ave.\r\n\r\nThe auction is being held to support Paly Athletics, according to Sports Boosters co-president Melissa Anderson.\r\n\r\n“The district currently funds coaches stipends and facilities, and Sports Boosters raises the money to pay for everything else,” Anderson said. “At Paly, more than half the student body competes in at least one sport annually. Our student athletes learn lifelong skills, but with very limited financial support for Athletics from the school district. Paly Sports Boosters is charged with raising the necessary funds to ensure Paly’s competitiveness on the field. Paly Sports Boosters currently funds the vast majority of Paly’s Athletics budget including for more than 45 teams in a variety of sports.”\r\n\r\nSeveral items will be for bid this weekend, Anderson explains.\r\n\r\n“There will be lots of great stuff,” Anderson said. “Sports memorabilia, once in a lifetime experiences, sports, camps for younger kids, spa treatments, workout passes, and more.”\r\n\r\nThe full auction catalog can be seen <a href=\"https:\/\/docs.google.com\/document\/d\/1mNsfPwbFplGNOq2U9eISEfQb-Tb_MC4Bsa2OsTu4cdQ\/edit?usp=sharing\" target=\"_blank\">here. <\/a>\r\n\r\nThe event will include various forms of auction, according to Anderson.\r\n\r\n“Most of the items will be part of the ‘Silent’ auction,” Anderson said. “Meaning we’ll have bid sheets on tables and people will go around and write down their bid on the items they want. Whoever is the highest bidder at the end of the night, buys that item for that price. We will also do a live auction for five or six really special things like the Klay Thompson signed basketball and the golf outing with the new football coach.”\r\n\r\nAttendees can expect not only an auction, but also a social gathering  with other Paly parents, according to Anderson.\r\n\r\n“It’s a big, fun party in a beautiful back yard with lots of great things to bid on and fun fellow Paly parents to hang out with,” Anderson said. “It’s a nice way to wrap up the Athletic year!”\r\n\r\nThe auctions have been successful in the past and this year, sports boosters feels optimistic towards raising even more money.\r\n\r\n“There was a Sports Boosters auction in 2013 which raised $20K,” Anderson said. “ In 2015 it raised $30K and now in 2016 we’re hoping to raise $50K.”\r\n\r\nInterested community members can sign up <a href=\"https:\/\/www.eventbrite.com\/e\/this-saturday-the-paly-sports-boosters-silent-auction-cocktail-party-fundraiser-tickets-22591245022?aff=ehomecard\" target=\"_blank\">online here.<\/a> Tickets are $50 each and are available online or at the door.","excerpt":"Ever want to own a piece of Palo Alto High School history or eat pasta with Principal Kim Diorio? If so, then you may be interested in Paly Sports Boosters’ auction that is happening from 7 to 10 p.m. tonight at 1055 Forest Ave.","date":"2016-04-30 13:29:18","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_4691.jpeg","categories":["News"],"tags":["athletics","auction","bowers","palo alto high","paly","pe","sports boosters"]},{"id":119792,"title":"Anti-Trump protesters gather at California GOP convention","permalink":"http:\/\/palyvoice.com\/2016\/04\/30\/anti-trump-protesters-gather-at-california-gop-convention\/","content":"<span style=\"font-weight: 400;\">Hundreds of protesters including several Palo Alto High School students chanted messages and waved political banners to demonstrate against Republican presidential candidate Donald Trump at the California Republican Convention yesterday in Burlingame.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Demonstrators gathered at 11 a.m. outside the Hyatt Regency San Francisco Airport to express anger at Trump's views, which some protesters say are anti-immigrant and anti-women. While the protest generally remained peaceful, several brawls broke out between pro-Trump and anti-Trump attendees, and metal barriers surrounding the hotel were removed by protesters hoping to interrupt Trump’s speech inside the hotel.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Dozens of police officers were dispatched to the scene after crowds attempted multiple times to enter the building, first through the front entrance and side doors and later by crossing an overpass linked to the car garage.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">In addition, protesters carried signs with angry messages including “Mr. Hate leave my state,” “Trump is a rapist and conman” and “Dump Trump.” Others played musical instruments or form barriers by linking arms.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Christine Veria, one of hundreds of protesters, says she attended the demonstration to show her children the importance of being civically involved.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It’s so easy right now to sit back behind your phone screen or to be on social media being upset about things, but to actually take action is important,” Veria said.  “We want to lead by example. We feel very strongly that these are not the values we want our children to grow up on and that they [Trump’s values] are dangerous for the type of world we trying to build together.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Other protesters cited Trump’s alleged sexism or racism as reasons for protesting.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I hate Trump,” said Sheila, who declined to disclose her last name. “I hate that he’s fascist. I hate that he hates women. I am Muslim, he says all Muslims are terrorists. Do I look like a terrorist?”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Many protesters were eager to express their anger. Attendees carried Trump pi<\/span><span style=\"font-weight: 400;\">ñatas and threw eggs at Trump cardboard cutouts, while others threw eggs at the hotel windows and shouted expletives at police officers for committing “police brutality” after several protesters were shoved and arrested by officers for attempting to enter the building. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Some of Trump's supporters bore signs condemning the protesters, resulting in some hostile confrontations.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Palo Alto High School junior Andy Chang attended part of the protest and says that Trump remains popular because he can connect with conservative voters’ deeper fears. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I agree with many Republican values, however, I do not support any Republican candidates. Ted Cruz and Donald Trump are just disgusting human beings,” Chang said. “The media said that people vote for Trump is because he is ‘tapping into the fears’ of the people, a ‘successful’ businessman having confidence of not being politically correct, and so on. Most of their reasons are accurate. I remember the first time the media criticized Trump because he said many illegal immigrants are criminals, drug dealers and rapists, and the US should build a wall for them. This speech is indeed very extreme. But the general idea of strictly protecting the U.S. border is not extreme.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The protest largely dispersed by 2:30 p.m., when the shrinking crowds were told to leave by police because of unruly behavior. However, protesters say their ideas were loud and clear, as they hope to send a message that they will not tolerate hate in California.<\/span>\r\n\r\n<em>Photos by Aidan Maese-Czeropski.<\/em>\r\n<div id=\"cp_widget_200fe1a5-9848-416d-b12d-7346d9195816\">\r\n\r\n...\r\n<div id=\"cp_widget_aaef29d4-589b-4c16-b143-6380aa755a6a\">\r\n\r\n...<script type=\"text\/javascript\">\/\/ <![CDATA[\r\nvar cpo = []; cpo[\"_object\"] =\"cp_widget_aaef29d4-589b-4c16-b143-6380aa755a6a\"; cpo[\"_fid\"] = \"AcNAxf9oWZUK\"; var _cpmp = _cpmp || []; _cpmp.push(cpo); (function() { var cp = document.createElement(\"script\"); cp.type = \"text\/javascript\"; cp.async = true; cp.src = \"\/\/www.cincopa.com\/media-platform\/runtime\/libasync.js\"; var c = document.getElementsByTagName(\"script\")[0]; c.parentNode.insertBefore(cp, c); })();\r\n\/\/ ]]><\/script><noscript>Powered by Cincopa <a href='http:\/\/www.cincopa.com\/video-hosting'>Video Hosting Platform<\/a> for Business solution.<\/noscript>\r\n\r\n\r\n","excerpt":"Hundreds of protesters including several Palo Alto High School students chanted messages and waved political banners to demonstrate against Republican presidential candidate Donald Trump at the California Republican Convention yesterday in Burlingame.","date":"2016-04-30 12:09:27","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_7076.jpg","categories":["News","Spotlight"],"tags":["2016","burlingame","donald","election","hyatt","presidentiale","protest","Republican","Trump"]},{"id":119645,"title":"Annual Team Math competition to be held Tuesday","permalink":"http:\/\/palyvoice.com\/2016\/04\/29\/annual-team-math-competition-to-be-held-tuesday\/","content":"The Annual Team Math competition, run by Palo Alto High School’s Math Club, will be held this Tuesday from 3:15 p.m. to 5:30 p.m. in the math building.\r\n\r\n<span style=\"font-weight: 400;\">Students will compete in teams of three to solve math problems and are encouraged to find group members that are in a range of different math classes. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"We want teams to match up people from a diverse range of math classes in order to give everyone an opportunity to compete, so we designed a point system based on the highest math class a participant has taken,\" said junior Jerry Hong, co-president of the Math Club.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Hong, groups must have between 8-10 points in order to compete, with the point distribution working as follows:<\/span>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/ATM_Pts.png\"><img class=\"alignnone size-full wp-image-119650\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/ATM_Pts.png\" alt=\"ATM_Pts\" width=\"600\" height=\"700\" \/><\/a>\r\n\r\n<span style=\"font-weight: 400;\">According to Hong, the ATM competition features three rounds: an individual competition, a team round, and a \"guts\" round, where the teams solve problem sets and get graded in real time.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to senior Lilia Tang, co-president of the Paly Math Club, the club added new features to the competition this year.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“[The math club] had a lot of fun writing the contest this year,\" Tang said. \"We even added a new round called 'guts,' where participants can see their results updated live, and part of it includes estimation questions where you get partial credit depending on how close you get to the answer.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Participating students will get free pizza and receive extra credit from their math teachers. The three highest scoring teams will win Amazon gift cards ranging from $10 to $25 per individual.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior Kelsey Wang, vice-president of the Math Club, says she believes that students can gain a lot from the experience of competing in the competition.<\/span>\r\n\r\n“I think the ATM is a great way for students of all levels of math to come together in teams and work on interesting problems together,\" Wang said. \"It is a unique contest that many people can enjoy because it allows participants to collaborate on math problems together, which isn't often seen in other contests and many math classes. I think there's something for everyone to contribute to their team and learn from the contest.”\r\n\r\n<span style=\"font-weight: 400;\">Students interested in signing up with a group can sign up <a href=\"https:\/\/liliatangxy.typeform.com\/to\/HEZ6dP\">here<\/a><\/span><span style=\"font-weight: 400;\">, and for those who want to participate but don’t have a group, and would like to be matched with one, can sign up <a href=\"http:\/\/paly.io\/atm-reg-indiv\">here<\/a>.<\/span><span style=\"font-weight: 400;\"> Students have until the end of the day on May 1 to <\/span><span style=\"font-weight: 400;\">sign up and\/or change their team’s information by replying to the confirmation email.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">For more information about the event, students can visit the <a href=\"http:\/\/paly.io\/atm-fb\">Facebook event<\/a>, or <a href=\"http:\/\/palymathclub@gmail.com\">email<\/a> the Math Club.\r\n<\/span>","excerpt":"The Annual Team Math competition, run by Palo Alto High School’s Math Club, will be held this Tuesday from 3:15 - 5:30 p.m. in the math building.","date":"2016-04-29 21:06:27","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/ATM_Feature_Pic_final.jpg","categories":["News","Spotlight"],"tags":["amazon gift cards","Annual Team Math competition","atm","competition","extra credit","gift cards","jerry hong","kelsey wang","Lilia Tang","math","math building","math competition","palo alto high school","paly","Paly Math Club","prizes","teamwork"]},{"id":119738,"title":"Liveblog: John Kasich speaks at Republican Convention","permalink":"http:\/\/palyvoice.com\/2016\/04\/29\/liveblog-john-kasich-speaks-at-republican-convention\/","content":"[caption id=\"attachment_119779\" align=\"alignnone\" width=\"672\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_7617.jpg\"><img class=\"wp-image-119779\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_7617.jpg\" alt=\"kasich convention\" width=\"672\" height=\"448\" \/><\/a> Delegates and guests file into a room at the Hyatt Regency in Burlingame. The California Republican Convention kicked off this weekend's event with a speech by presidential candidate Donald Trump earlier in the day. John Kasich, also a candidate, speaks tonight at a dinner banquet. Photo: Adrienne Kwok[\/caption]\r\n\r\nRepublican presidential candidate and Ohio governor John Kasich will be speaking at the Hyatt Regency tonight in Burlingame, Calif. during dinner banquet.\r\n\r\nCheck back at 7:30 p.m. to receive live updates on his speech.\r\n\r\n<hr \/>\r\n\r\n<strong>8:55 p.m. — <\/strong>Kasich finishes delivering his speech, wrapping up tonight's Republican dinner banquet.\r\n\r\n<strong>8:55 —<\/strong> \"We can provide hope. We can win.\"\r\n\r\n<strong>8:53 p.m. —<\/strong> Kasich says we need to recapture our former confidence and spirit to drive our nation forward.\r\n\r\n<strong>8:46 p.m. —<\/strong> \"I'm worried about a divided, polarized country, but it does not have to be that way.\"\r\n\r\n<strong>8:44 p.m. —<\/strong> \"I've been endorsed by over 70 newspapers. As if it mattered.\" Seems like he doesn't have much self-confidence in winning this election.\r\n\r\n<strong>8:42 p.m. —<\/strong> Kasich shifts the discussion to mental health, stating that proper medical treatment and improvement is needed to combat this problem.\r\n\r\n<strong>8:36 p.m. —<\/strong> \"Here's what I tell young people: you can have all the free you want but at the end of the day with the nation $30 trillion in debt, you might go to a free college but you won't be able to get a job,\" says Kasich, in reference to positions taken by Democratic presidential candidate Bernie Sanders.\r\n\r\n<strong>8:33 p.m. —<\/strong> \"I have been a Republican all my life,\" Kasich said. What happened to growing up in a Democratic family?\r\n\r\n<strong>8:29 p.m. —<\/strong> Kasich's grandparents arrived from Czechoslovakia and Yugoslavia, and barely spoke English, he says.\r\n\r\n<strong>8:25 p.m. —<\/strong> Kasich introduces himself. Having grown up in a blue-collar, Democratic family, he had never met a Republican in his youth.\r\n\r\n<strong>8:22 p.m. —<\/strong> Seated to our left is Peter Ohtaki, former Menlo Park mayor and a current delegate.\r\n\r\n<strong>8:20 p.m. —<\/strong> \"He is prepared to be Commander In Chief on day one and he has the track record to prove it.\"\r\n\r\n<strong>8:16 p.m. —<\/strong> As the dinner comes to an end, Kasich is introduced as \"the only adult in the room.\"\r\n\r\n<strong>8:14 p.m. —<\/strong> Currently we are sitting in the audience as people finish up their meals. Speakers should (hopefully) begin speeches shortly.\r\n\r\n<strong>8:04 p.m. —<\/strong> Currently sitting next to Ron Unz, who is running for Senate in the upcoming election. His campaign posters say \"Keep English Vote Ron Unz!\"\r\n\r\n[caption id=\"attachment_119780\" align=\"alignright\" width=\"294\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_7613.jpg\"><img class=\"wp-image-119780\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_7613.jpg\" alt=\"kasich food\" width=\"294\" height=\"196\" \/><\/a> The banquet food consisted of a three course meal: a spinach salad with ginger and apple; a main course of broccoli, steak and potatoes; and a raspberry dessert. Photo: Adrienne Kwok.[\/caption]\r\n\r\n<strong>7:45 p.m. —<\/strong> The wifi password here is \"hillarycantbetrusted.\"\r\n\r\n<strong>7:41 p.m. —<\/strong> Group prayer finished, speaker moves on to the\r\nPledge of Allegiance.\r\n\r\n<strong>7:39 p.m. —<\/strong> Republican leaders, including Chad\r\nMayes and Jean Fuller enter.\r\n\r\n<strong>7:35 p.m. —<\/strong> Dinner consists of a salad, warm bread rolls and a colorful yet mysterious dessert. This is a very elegant meal.","excerpt":"Republican presidential candidate John Kasich will be speaking at the Hyatt Regency tonight in Burlingame, Calif.","date":"2016-04-29 18:46:49","author":"Nika Woodfill","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/image.jpeg","categories":["News","Spotlight"],"tags":["2016","banquet","burlingame","convention","election","Food","john","kasich","President","Republican","Ron","Trump","unz"]},{"id":119686,"title":"Choir to perform &#8216;From The Ground Up&#8217; spring concert","permalink":"http:\/\/palyvoice.com\/2016\/04\/29\/choir-to-perform-from-the-ground-up-spring-concert\/","content":"[caption id=\"attachment_119714\" align=\"aligncenter\" width=\"316\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_78971.jpg\"><img class=\" wp-image-119714\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_78971.jpg\" alt=\"Photo by Morgan Keller.\" width=\"316\" height=\"421\" \/><\/a> Paly choir members prepare for the upcoming concert before class.  Photo by Morgan Keller.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\"><a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/IMG_7897.jpg\">\r\n<\/a>Palo Alto High School's spring choir concert will take place at 7:30 p.m. Friday at Grace Lutheran Church.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The concert, titled \"From the Ground Up,\" will feature arrangements by Mozart and Schubert, and include performances from not only the Concert Choir but also by Madrigal Singers, Beginning Choir, Spectrum Singers and Men's Chorus.<\/span>\r\n\r\n\"I'm very excited because we are performing the entire 'Schubert Mass' in G with the orchestra,\" junior choir member Georgina Wu said. \"The most exciting part I think is we get to work with them and we sound really good together.\"\r\n\r\nWhile the Concert Choir is performing the 'Schubert Mass' and folk songs at the beginning of the concert, English love songs, pop songs and Jewish songs will be performed by the Beginning Choir, Spectrum Singers and Men's Chorus afterwards. There will also be multiple soloists throughout the concert, according to Wu.\r\n\r\nJunior choir member Anisha Patwardhan says that the choir has been working very hard to prepare for the concert.\r\n\r\n<span style=\"font-weight: 400;\">“<\/span><span style=\"font-weight: 400;\">The spring concert is always a performance that displays our hard work and dedication throughout the year, so I am looking forward to showing off our best efforts,” Patwardhan said.  “Concert Choir has been working really hard to make sure that all of the pieces have the right dynamics, phrasing and energy.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Tickets cost $10 for adults, $5 for seniors and students and children ages 12 and under are free. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to choir teacher Michael Najar, the concert “<\/span><span style=\"font-weight: 400;\">looks to the earth and sky for its inspiration.\"<\/span>","excerpt":"The Palo Alto High School Spring choir concert, “From The Ground Up” will take place on Friday at Grace Lutheran Church at 7:30 p.m.","date":"2016-04-29 17:04:18","author":"Annika Behal","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/0000\/00\/IMG_0300_0.jpg","categories":["News","Spotlight"],"tags":["choir","concert","from the ground up","paly","preview"]},{"id":119640,"title":"Admin responds to death of Gunn alumna","permalink":"http:\/\/palyvoice.com\/2016\/04\/28\/admin-responds-to-death-of-gunn-alumna\/","content":"<span style=\"font-weight: 400;\">The Palo Alto High School administration is reaching out to students and providing support services after the death of a Palo Alto Unified School District alumna over the weekend, says <\/span><span style=\"font-weight: 400;\">Principal Kim Diorio.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Diorio says that the administration worked quickly to follow standards, convene a crisis response team and decide how to inform students of the tragedy. The district has implemented numerous protocols aimed at responding to tragedy after previous suicide clusters involving district students occurred in 2009-2015. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">District Supt. Max McGee sent a letter notifying parents of the incident on Saturday, though at the time, details surrounding the death were unknown.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">On Monday morning, some teachers read aloud a <\/span><a href=\"https:\/\/docs.google.com\/document\/d\/1_pSSub74GYZ6eT4Kql0Q3k0Oe0csPZ3F_0uklKRTG5s\/edit\"><span style=\"font-weight: 400;\">message from the administration<\/span><\/a><span style=\"font-weight: 400;\"> to their first period classes, informing students that Sarah Longyear, a 2014 graduate of Gunn High School, had died by suicide. The message also directed students to various mental health related resources<\/span><span style=\"font-weight: 400;\">. Additionally, Diorio sent teachers a link to a <\/span><a href=\"https:\/\/www.youtube.com\/watch?v=tXQB7Mu5_BM&amp;feature=youtu.be\"><span style=\"font-weight: 400;\">video<\/span><\/a><span style=\"font-weight: 400;\"> that provides guidelines for discussing mental wellbeing with adolescents.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Diorio, administrators were unsure as to whether they wanted to prepare a standardized script for teachers to read off to students.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We just thought, and given how connected our students are with Gunn, that we wanted to be on the same page as them,” Diorio said. “It’s that balance — we don’t want to ignore this, and act like it didn’t happen, and at the same time, we have to be careful about how we message it.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Because the individual who died was an alumna rather than a current student, Diorio says district officials were more measured in their direct outreach to students.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We wanted to see how yesterday would unfold, before checking in directly with kids,” Diorio said. “We wanted to give them the opportunity to come to us on their own, if they need support. When it was our own student, or when it was a current Gunn student, we were much more specific in identifying kids we wanted to check in with. We took it more case by case, instead of doing a universal check-in.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Diorio says that she hopes the teachers who needed additional support talking to their classes could have received it. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I think one thing maybe I would have done differently, if a teacher was in that situation, I would have seen if we could have partnered them with someone who could have been in the classroom and talked with the kids,” she said. “We didn’t have enough time to put that plan together.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Above all, Diorio encourages students, parents and staff to be there for each other and be proactive in combating issues relating to mental health.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It’s keeping those conversations about mental health going, talking about it, noticing when people might be struggling,” Diorio said.<\/span>\r\n\r\nThe Santa Clara County Public Health Department is scheduled to release on May 4 the preliminary findings of its <a href=\"http:\/\/palyvoice.com\/2016\/02\/13\/county-to-begin-health-investigation\/\" target=\"_blank\">Epi-Aid project<\/a>, an investigation aimed at combating student suicides which began in February.\r\n\r\n<em>A list of school and community resources is available on the <a href=\"http:\/\/www.paly.net\/crisis-resources\">Paly crisis resources page<\/a>. If you need immediate assistance, the Santa Clara County Suicide and Crisis Hotline is available at 1-855-278-4204 at any time. These numbers are also available on the back of student ID cards. If you feel you or someone you know needs immediate support, please call 911.<\/em>","excerpt":"The Palo Alto High School administration is reaching out to students and providing support services after the death of a Palo Alto Unified School District alumna over the weekend, says Principal Kim Diorio.","date":"2016-04-28 11:11:38","author":"Dhara Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2015\/02\/IMG_0979.jpg","categories":["News","Spotlight"],"tags":["gunn high school","Kim Diorio","max mcgee","mental health","mental health resources","palo alto high school"]},{"id":119563,"title":"Social Justice Seminar to be held on Thursday","permalink":"http:\/\/palyvoice.com\/2016\/04\/27\/social-justice-seminar-to-be-held-on-thursday\/","content":"The Social Justice Pathway will be hosting its first student-run Social Justice Seminar in the Media Arts Center on April 28, during 4th and 6th period.\r\n\r\nMembers of SJP, a three-year program centered around helping the community and shedding light on local social justice issues through an experimental curriculum, hope that the seminar will educate the Paly community about social justice issues such as microaggressions, as well as about using social justice in education, according to Junior Social Justice Student Yotam Ponte.\r\n\r\n<span style=\"font-weight: 400;\">“The Social Justice Symposium is a conference with a number of guest speakers designed to educate the Paly population about social justice issues and matters,” Ponte said. <\/span>“Among these people are psychologists, social scientists, and parents of SJP students that are involved in social justice matters or have experienced things such as microaggressions.\"\r\n\r\nAccording to junior Social Justice student Nadia Leinhos, the event will focus on the subject of empathy.\r\n\r\n\"We're focusing on one of the most important topics we've explored in the pathway, and that's the idea of empathy,\" Leinhos said.\r\n\r\nAlong with guest speakers, students will be led in student organized empathy exercises and lunch and refreshments will be served to attending students, according to Ponte.\r\n\r\nJunior Social Justice student Molly Weitzman is excited about the event and hopes that students will make an effort to attend.\r\n\r\n\"I personally am very excited about our event and I'm curious to see what our efforts have produced,\" Weitzman said. \"I absolutely recommend that students attend, with a teacher's permission. If they don't have a prep we have worksheets available to bring back to teachers.\"\r\n\r\n[caption id=\"attachment_119638\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/SJP_Symposium.png\"><img class=\"size-full wp-image-119638\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/SJP_Symposium.png\" alt=\"The official schedule for the Social Justice Seminar, a conference aiming to educate the Palo Alto High School community about empathy and social justice in education.\" width=\"600\" height=\"800\" \/><\/a> The official schedule for the Social Justice Seminar, a conference aiming to educate the Palo Alto High School community about empathy and social justice in education.[\/caption]\r\n\r\nStudents interested in attending the seminar can find more information on the <a href=\"https:\/\/www.facebook.com\/events\/841355052637112\/\">SJP Seminar Facebook page<\/a>.","excerpt":"The Social Justice Pathway will be hosting its first student-run Social Justice Seminar in the Media Arts Center on April 28, during 4th and 6th period.","date":"2016-04-27 21:21:08","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/13100793_488703077988243_1706844010628389594_n.jpg","categories":["News"],"tags":["education","Empathy","events","Keynotes","learning","lunch","mac","media arts center","microagressions","Molly Weitzman","nadia leinhos","paly","seminar","SJP","social justice","Social Justice Pathway","speakers","speeches","symposium","Yotam Ponte"]},{"id":119551,"title":"Viking boys&#8217; tennis players advance to SCVAL finals","permalink":"http:\/\/palyvoice.com\/2016\/04\/26\/viking-boys-tennis-players-advance-to-scval-finals\/","content":"[caption id=\"attachment_118794\" align=\"alignnone\" width=\"620\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/2016-03-31-05.10.29.jpg\"><img class=\" wp-image-118794\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/2016-03-31-05.10.29.jpg\" alt=\"Junior Henry Badger serves while junior Jerry Hong prepares for the return. Badger and Hong lost their match in two close sets. \" width=\"620\" height=\"427\" \/><\/a> Juniors Jerry Hong and Henry Badger will be among the six Palo Alto High School players competing in the Santa Clara Valley Athletic League final today at 1:00 at Paly. Photo by Chirag Akella.[\/caption]\r\n\r\nSeveral members of the Palo Alto High School boys' tennis team will compete in Santa Clara Valley Athletic League finals at 1 p.m. today at Paly.\r\n\r\nJuniors Jerry Hong, Adrian Smith and Henry Badger, sophomore Hunter North, and freshmen Adam Love and Antony Georgiadis will be representing Paly in the competition. No senior players are participating in SCVAL finals this year.\r\n\r\nNorth said he anticipates that the experience will be good for the younger players.\r\n\r\n\"With all the seniors gone, all of the underclassmen and less experienced players get a good opportunity to play some of the best players in our league,\" North said.\r\n\r\nSCVAL results for tennis are based on the performances of the individuals and pairs rather than of the performance of the collective team.\r\n\r\n\"If one person wins they move on in the bracket,\" North said. \"If another person loses they are done, regardless of how people from their school are doing.\"\r\n\r\nSCVALs will draw the Vikings season to a close, as the team was unable to qualify for the Central Coast Section playoffs.\r\n\r\nDespite having a difficult season, Badger is looking forward to next year.\r\n\r\n\"Next year will be better,\" Badger said. \"I hope we can work on our team cohesiveness and hopefully make CCS next year.\"","excerpt":"Several members of the Palo Alto High School boys' tennis team will compete in Santa Clara Valley Athletic League finals at 1 p.m. on Tuesday at Paly.\r\n","date":"2016-04-26 12:54:40","author":"Jackson Doerr","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/0000\/00\/rsz_14_3.jpg","categories":["Sports","Spotlight"],"tags":["Boys","henry badger","Hunter North","scval","tennis"]},{"id":119499,"title":"Science Olympiad team places second at States","permalink":"http:\/\/palyvoice.com\/2016\/04\/25\/science-olympiad-team-places-second-at-states\/","content":"[caption id=\"attachment_119547\" align=\"alignnone\" width=\"618\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/Scioly-States-story1.jpeg\"><img class=\"wp-image-119547\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/Scioly-States-story1.jpeg\" alt=\"Scioly States story\" width=\"618\" height=\"464\" \/><\/a> The Palo Alto High School Science Olympiad team celebrates after placing second at the state competition. The team won multiple individual medals in multiple events, giving them a 78 point lead in front ofthem and the third place team. \"I am extremely proud of our team and what we were able to accomplish,\" said sophomore green team member, Celine Wang. Photo: Jianhao Meng.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Continuing a three-year streak, the Palo Alto High School Science Olympiad Team placed second out of 28 teams at the North California Science Olympiad State competition on April 16, in Turlock.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The team fell to Mira Loma High School from Sacramento by 27 points, according to sophomore Celine Wang, a member of the green team, or varsity team. The SciOly competition is split into two teams: the green team, akin to a varsity team, and the white team, or the junior varsity team. Except for one year, Mira Loma has consistently won first at states since 2005, according to their <a href=\"http:\/\/scioly.org\/wiki\/index.php\/Mira_Loma_High_School\">SciOly wiki page<\/a>. The only time this changed was in <\/span><a href=\"http:\/\/palyvoice.com\/2013\/05\/21\/paly-scioly-team-makes-impressive-debut-at-nationals\/\"><span style=\"font-weight: 400;\">2013<\/span><\/a><span style=\"font-weight: 400;\">, when Paly beat Mira Loma and advanced to the Science Olympiad National Tournament and placed 16th. According to <a href=\"http:\/\/scioly.org\/wiki\/index.php\/Palo_Alto_High_School\">Paly SciOly's wiki page<\/a>, Paly has placed in the top three teams in States since 2010.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Mira Loma is an incredibly strong school,” Wang said. “It is second in the nation as of last year. Considering we ended up pretty close to them is an achievement in itself.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Wang, the goal of teams at SciOly competitions is to get the lowest score possible, similar to golf. Higher-placing teams receive fewer points, while lower-placing teams successively receive higher scores. Competition events<span class=\"_5yl5\"> consist of testing, lab work and building, where teams build devices before the competition which are then tested onsite. Events range from building a robot arm to <span class=\"_5yl5\">testing identities of unknown powders.<\/span><\/span><\/span>\r\n\r\n“Although the team was somewhat disappointed that we were still stuck in a frustrating second place, we still improved from last year by three points,” sophomore green team member Chloe Hong said. “In fact, this is the smallest point gap between us and Mira Loma that we have had in all the years that we have placed second at States.”\r\n\r\n<span style=\"font-weight: 400;\">Despite the frustration, the team did well overall and finished in the top five in many events, according to senior team captain James Wang.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Event-wise, we did well across the board during States,” James Wang said. “Everyone’s preparation for their tests and builds really showed during the awards ceremony. I believe we placed 5th or better in 19 out of the 23 events.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">With many seniors leaving next year, some club members have voiced their anxiety about the team's future success, as Hong says that the green team will lose half of its members. SciOly adviser Ron Bowditch says he is not worried about filling the holes.<\/span>\r\n\r\n“We have promising, bright and hard-working students coming up the ranks,” Bowditch said. “The thing that is going to be different is that we are going to have a lot of students that are now on the Jordan SciOly team. Jordan did not have a SciOly team up until three years ago, so we will have a few students who were on the [Jordan SciOly] team before, giving them more experience with the competition.”\r\n\r\nAccording to James Wang, the next step would be to find adult mentors who could help students study for their events.\r\n\r\n<span style=\"font-weight: 400;\">“There is a huge wealth of science expertise in Palo Alto that we have not really tapped [into] yet,” James Wang said. “I am sure that mentors would really speed up our studying and engineering processes.”<\/span>\r\n\r\nPaly's competitor, Mira Loma, has various adult mentors that work with students one-on-one, according to Bowditch. However, he does not see Paly heading in that direction.\r\n\r\n<span style=\"font-weight: 400;\">“I personally do not really like that idea,” Bowditch said. “I think the team should be completely student-run and student-focused; so when they win, it will be that much sweeter.”<\/span>\r\n\r\nMembers are excited for next season and for what it may hold.\r\n\r\n<span class=\"_5yl5\">\"I am really sad the season's over, especially since we'll be losing so many amazing seniors, but I cannot wait for the all the fun times next season,\" Celine Wang said.\r\n<\/span>","excerpt":"Continuing a three-year streak, the Palo Alto High School Science Olympiad Team placed second out of 28 teams at the North California Science Olympiad State competition on April 16, in Turlock.","date":"2016-04-25 21:27:08","author":"Julia Qiao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/Scioly-States-story.jpeg","categories":["News","Spotlight"],"tags":["Bowditch","Celine Wang","chloe hong","competition","james wang","North California Science Olympiad Competition","paly scioly","science","scioly","states"]},{"id":119505,"title":"Fire alarms stall classes","permalink":"http:\/\/palyvoice.com\/2016\/04\/22\/fire-alarms-stall-classes\/","content":"[caption id=\"attachment_119526\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/Fire-alarm.jpg\"><img class=\"wp-image-119526\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/Fire-alarm.jpg\" alt=\"Fire alarm\" width=\"600\" height=\"450\" \/><\/a> Students converge on the football field during the start of first period. The fire alarm that went off this morning coincided with rain, causing students to seek shelter from the weather. \"I had an umbrella so it wasn't that bad, but a lot of other people didn't have anything so they were just freezing,\" freshman Sophie Relman said. \"I had band [first period] so we missed a lot of time that we could have spent practicing.\" Photo: Emily Hwang.[\/caption]Two fire alarms disturbed Palo Alto High School students and staff today during first and third period.\r\n\r\nA false fire alarm halted first period classes for over 15 minutes at 8:06 a.m., and a second alarm occurred at 11:02 a.m. before promptly turning off. According to Assistant Principal Jerry Berkson, construction workers in the Performing Arts Center accidentally triggered both alarms.\r\n\r\nThe first fire alarm went off before school started, forcing bewildered students to line up on the football field during the morning rain.\r\n\r\n“It was raining outside and the construction workers didn’t evacuate, so I was suspicious that a student pulled the alarm as a prank or to avoid their first period,” junior Annabelle Hu said. “I was pretty miserable in the rain. … It was a monumental waste of time.”\r\n\r\nJunior Gaby Pelayo was <span style=\"line-height: 1.5;\">recording a presentation in her third period Advanced Placement Spanish Language class when the fire alarm interrupted midway — ruining the recording. With the AP Spanish exam less than two weeks away, Pelayo says she feels the alarm was untimely.<\/span>\r\n\r\n\"We were in the middle of doing practice for AP Spanish test this coming May,\" Pelayo said. \"It was a bit annoying as it disrupted our time in class and our practice. All fire alarms are a hassle but considering the [AP] tests are around the corner, our classes need to be as productive as possible.\"\r\n\r\nWhile today’s alarms were accidental occurrences, Paly is not a new victim of false alarms. Approximately six fire alarms have disrupted classes this school year, according to Berkson.\r\n<div class=\"conversation\">\r\n<div data-reactroot=\"\">\r\n<div class=\"_4tdt\">\r\n<div class=\"_4tdv\">\r\n<div class=\"_5wd4 _1nc7 direction_ltr\">\r\n<div class=\"_5wd9\">\r\n<div class=\"_5wde _n4o\">\r\n<div class=\"_5w1r _3_om _5wdf\">\r\n<div class=\"_4gx_\">\r\n<div class=\"_d97\">\r\n\r\nBerkson says that since fire alarms have occurred frequently, some students might be caught off guard in the case of an actual fire in the future.\r\n\r\n“When it does happen, hopefully everyone is prepared and takes it seriously,” Berkson said.\r\n\r\nBerkson debunked suspicions that the first fire alarm had been caused by a cooking mishap in the Media Arts Center, stating that the administration’s switchboard showed that the alarm was triggered elsewhere.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","excerpt":"Two fire alarms disturbed Palo Alto High School students and staff today during first and third period.","date":"2016-04-22 23:21:06","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/04\/Fire-alarm.jpg","categories":["News","Spotlight"],"tags":["1","3","alarm","Alto","annabelle","Berkson","fax machine","fire","gaby","hu","junior","Palo","paly","pelayo","period","spanish"]}]