[{"id":126217,"title":"Slideshow: Students march through town","permalink":"http:\/\/palyvoice.com\/2016\/11\/16\/slideshow-students-march-through-town\/","content":"A group of students exercised their rights and organized a peace march during Flex period. The march not only included students from Palo Alto High School, but also from Gunn High School and Castilleja. According to the Palo Alto Peace March Facebook page, \"The goal of this march is to spread messages of love, unity, acceptance and equality.\"\r\n\r\nStudents marched from the Quad to the El Camino intersection which was blocked off with the aid of the Palo Alto Police Department. While walking, the students cheered, chanted and held up signs that were made. The main event was at Lytton Plaza on University Avenue in downtown Palo Alto. Many students gave testimonies that were emotional and personal.\r\n\r\n\"I didn't write anything down, it came from the heart and I felt like I made an impact in the community,\" junior and speaker Richard Islas said after speaking to the crowd.\r\n\r\nPhotos: Rachel Code\r\n\r\n<iframe src=\"https:\/\/docs.google.com\/presentation\/d\/1uia4saWn-AOzmybX1rkU6VhnQh0i4mxR-Vt46BykiEM\/embed?start=false&amp;loop=true&amp;delayms=5000\" width=\"720\" height=\"434\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"A group of students exercised their rights and organized a peace march during Flex period. The march not only included students from Palo Alto High School, but also from Gunn High School and Castilleja. ","date":"2016-11-16 22:05:16","author":"Bradley Smith","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/Screen-Shot-2016-11-16-at-10.04.00-PM.png","categories":["News","Spotlight"],"tags":["march","peace"]},{"id":125332,"title":"Bilingual education restored by Prop 58","permalink":"http:\/\/palyvoice.com\/2016\/11\/16\/bilingual-education-restored-by-prop-58\/","content":"[caption id=\"attachment_126129\" align=\"alignnone\" width=\"614\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/Alonso.jpg\"><img class=\" wp-image-126129\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/Alonso.jpg\" alt=\"Caption caption caption\" width=\"614\" height=\"409\" \/><\/a> Spanish teacher Pilar Alonso teaches her second period class this morning at Palo Alto High School. According to Alonso, a bilingual education helps immigrant students learn English while also preserving the culture of their own languages. \"The goal is that over four years students will still learn about the culture of their own language while becoming proficient in English,\" Alonso said. Photo: William Sallomi[\/caption]\r\n\r\nCalifornia's public schools will provide diverse options for elementary level students seeking proficiency in the English language after a proposition removing the mandate of exclusively English education was passed on the state ballot last week.\r\n\r\nProp. 58 is a legal measure that gives elementary level students who are learning English as a second language the choice of either beginning with  bilingual education, or being immediately integrated into English immersion classes. While students do have more educational options, the proposition -now law- still requires that all students become proficient in English.\r\n\r\nProp. 58 passed with a  remarkable approval rating of approximately 73 percent.\r\n\r\nAccording to Spanish teacher and former instructional supervisor of the Palo Alto High School World Languages department Kevin Duffy, English-only programs are detrimental to a young student's native language.\r\n\r\n\"According to many studies, a single language program will cause students to ignore their native language,\" Duffy said.  \"This is because your goal is just to learn English, and not to maintain your proficiency in your native language.\"\r\n\r\nAccording to Duffy, the proposition's emphasis on preserving students' bilingual status is important for America.\r\n\r\n\"The goal [for the students] should be that upon graduating from high school, they should be a strong group of bilingual students,\" Duffy said. \"In America, we need people who speak more than one language, so why not use the native abilities of immigrant students?\"\r\n\r\nDuffy said that although the proposition has its benefits, for some communities who have diverse immigrant populations, it may be impractical.\r\n\r\n\"Here in California we have a diverse group of students who speak a wide variety of languages, so it wouldn't be very practical to have a program for each native language,\" Duffy said. \"It's unfair to say that we can help students who speak one language over those who speak another, which can make the process difficult.\"\r\n\r\nAccording to Paly Spanish teacher Pilar Alonso, who taught English to young Latino children, a bilingual program is important for helping students learn English while still maintaining their cultural roots.\r\n\r\n\"The bilingual program [at which Alonso worked] was initially started because there was no system to help kindergarten students with no English speaking experience become integrated into a fully English school system,\" Alonso said. \"The goal was that the students would learn English over the course of four years, and during that time they also learned to read in their own language,\"\r\n\r\nAccording to Alonso, each year the classes gradually transitioned from Spanish to English until the students were able to make the leap into standard English classes.\r\n\r\n\"Kindergarten classes were carried out 90 percent in Spanish, and 10 percent in English,\" Alonso said. \"By the time they were in third grade, the students would be enrolled in the fully English courses.\"\r\n\r\nAlonso said that the bilingual education was crucial in preparing the students for success, while helping them draw connections between two languages and cultures.\r\n\r\n\"The program worked phenomenally because the kids left completely prepared, and transitioned what they learned about their own languages to English,\" Alonso said. \"Bilingual students need this kind of support in school.\"\r\n\r\nFollowing the passing of the proposition, the state will now be tasked with implementing these bilingual programs into public schools.","excerpt":"California's public schools will provide diverse options for elementary level students seeking proficiency in the English language after a proposition removing the mandate of exclusively English education was passed on the state ballot last week.","date":"2016-11-16 18:40:53","author":"William Sallomi","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/Alonso.jpg","categories":["Global Outlook","News","Uncategorized"],"tags":["education","election","Jose Ezcurra","Kevin Duffy","language","Pilar Alonso","Prop 58"]},{"id":125968,"title":"The aftermath of the election: Healing a divided country","permalink":"http:\/\/palyvoice.com\/2016\/11\/15\/the-aftermath-of-the-election-healing-a-divided-country\/","content":"[caption id=\"attachment_125969\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/15053216_1175480745861345_1744188533_o.jpg\"><img class=\"wp-image-125969\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/15053216_1175480745861345_1744188533_o.jpg\" alt=\"15053216_1175480745861345_1744188533_o\" width=\"600\" height=\"337\" \/><\/a> Students from multiple high schools around San Francisco lead a walk out in front of City Hall on Thursday in opposition to the election of Donald Trump as president. The students chanted \"I believe that love will win,\" and \"the people make the city.\" Photo: Emilia Diaz-Magaloni[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">In the days leading up to the election, our parents, American immigrants, prepared themselves to vote for the first time as new citizens of this country. They were already Americans in the broad sense, having raised their families here and created a life for themselves, teaching their children the American ideals of democracy, freedom and inalienable rights. They raised us in a society based on the principles of respect and tolerance. A society that allowed us to remain culturally faithful to our roots and yet still live a life plentiful in liberty, justice and the pursuit of happiness. However, as an immigrant, there is always a feeling of exclusion between the country you are from and the one you live in. Our families'<\/span><span style=\"font-weight: 400;\"> relationship with these two sides of our identities are often confusing, sometimes angry. <\/span><span style=\"font-weight: 400;\">Yet the day they cast their ballots, they felt unquestionably American, and for once there were no reservations attached to that feeling of patriotism. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">On election night, as votes rolled in we all sat in disbelief, in tears and in fear. The man who is now president-elect had targeted both of our cultures directly. We had watched on television as he claimed that all Mexicans were rapists and that most Muslims were terrorists, that he had plans to deport all illegal immigrants and that he planned to ban all Muslims from entering this country. The validity or extent to which these statements can be carried out does not matter. It is the fact that they were said on this incredibly powerful national platform, and that people chose to accept them or turn a blind eye to them. Therein lies our fear. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Donald Trump's victory speaks of a profound division in this country. It is a division between the white working class and the people who used to be in power. It is a division between targeted minorities and white America. For the marginalized white working class, a group of people left profoundly alone and afraid, this was their revolution, but also their call for help. In the same way, the groups of people targeted by the president-elect are now alone and extremely afraid. The result of this division is hate — hate on both sides that refuse to see the plight of the other. In the aftermath of this election, we braced ourselves for the angry social media posts from both sides, threats elevated in power by the anonymity of the screen. In our liberal “accepting” Palo Alto community, countless fingers angrily pointed at people who had voted for the president-elect, making them the enemy. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">We felt the same anger that day, in disbelief that someone could support a man who represented the epitome of white supremacy, bigotry and racism. But we were also part of the problem. As we spoke out against hatred we created hatred. As people forgot to put a face to the those they were directing their hatred towards morality was left behind. <\/span>\r\n\r\n[caption id=\"attachment_125970\" align=\"alignleft\" width=\"434\"]<img class=\"wp-image-125970\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/15049627_1175480739194679_759626863_n-1.jpg\" alt=\"15049627_1175480739194679_759626863_n (1)\" width=\"434\" height=\"244\" \/> During the walk-out at City Hall, high school students shared their stories amid cheering crowds and supportive peers. Photo: Emilia Diaz-Magaloni[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Locally, this hate speech transcen<\/span><span style=\"font-weight: 400;\">ded online platforms. At Gunn High School, Latino women were taunted by white males on three separate occasions according to a Facebook post shared by Palo Alto High School senior Santiago Ruiz. The media has exploded with multiple very real cases of hate speech in close proximity to our community.<\/span>\r\n\r\nThe Thursday after the election we went on a sociology field trip to learn about homelessness in San Fransisco. Our teacher Benjamin Bolanos bravely led our class into this adventure, despite the grief we had all felt the day before. <span style=\"font-weight: 400;\">In the city streets that day, we witnessed a man scream “I knew no bitch could run this country,” trying to provoke our class.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">As we walked away from the man who had intended to intimidate us with his hate, we were embraced by the loving community of San Francisco. Although we felt alone, helpless and angry, the city filled us with love and kindness. The calming aftermath of a storm.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Next, we encountered a man named Del. Del approached us in a flashy suit, a brown fedora and an American flag pin. The swagger and charm in his voice was captured in his story of triumph. Del had spent a long time homeless on University Avenue in Palo Alto and was now a leader of a movement to end homelessness in the city. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">We also met Kelly, and the little dog nestled in the pocket of her backpack. Kelly was fighting against homelessness as well. She daringly led our class of 30 high school juniors and seniors through the streets of San Francisco, showing us a raw and real city that moved us to tears, while spreading a message of growth and a focus on doing good.<\/span>\r\n\r\n[caption id=\"attachment_125971\" align=\"alignright\" width=\"393\"]<img class=\"gr-progress wp-image-125971\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/15049931_1175480732528013_981591586_n.jpg\" alt=\"15049931_1175480732528013_981591586_n\" width=\"393\" height=\"219\" \/> A female high school student raises a sign reading \"My body my choice\" during the walk out at City Hall. Photo: Emilia Diaz-Magaloni[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">We stopped to sit on the lawns of City Hall, listening to the chants of children saying “I hate Trump.” Although at first, we laughed, we were also taken aback by the toll that this election had taken on families and even children. As a completely unplanned event on this trip, we joined a peaceful walk-out lead b<\/span><span style=\"font-weight: 400;\">y high school students in front of city hall. <\/span><span style=\"font-weight: 400;\">We were enveloped in rainbow colors, in flags of every country and a message of love. The high school students in our area were speaking out, and their main message was against hate. A high school girl shared her story in the middle of the protest. Next to her stood two middle-aged African American men and a group of Latin American bikers, as well as high school students wrapped up in the colors of the rainbow, all listening intently and nodding their heads. This scene of love and empowerment stayed with us as we continued on to our next location.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">We entered <\/span><span style=\"font-weight: 400;\">St. Boniface Church<\/span><span style=\"font-weight: 400;\">, the center to the <a href=\"http:\/\/thegubbioproject.org\/\">Gubbio project<\/a>, and were immediately enveloped  in the scent of incense. The Gubbio project is an organization dedicated to giving the homeless population a place to sleep in the city. The pews were filled with rows and rows of resting people, basking in the colorful light coming from the large stained glass window.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Del's words, Kelly’s strength, the power of protest, the kindness of the Gubbio project and Bolanos' bravery, small acts in the name of decency and humanity, managed to inspire so much good, which led us to a new conclusion.<\/span>\r\n\r\n[caption id=\"attachment_125973\" align=\"alignleft\" width=\"385\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/15049931_1175480732528013_981591586_n.jpg\"><img class=\"wp-image-125973\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/15044709_1175480775861342_330741660_o.jpg\" alt=\"15044709_1175480775861342_330741660_o\" width=\"385\" height=\"288\" \/><\/a> A mural in Clarion Alley in the midst of the Mission District depicts a powerful message voicing the desires of the people to make housing affordable and end gentrification. Photo: Emilia Diaz-Magaloni[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">We must remember what we have control over and what we don't. We do not have control over the results of this election anymore. We must respect the system that we trusted to elect presidents like Barack Obama, Franklin D. Roosevelt and Abraham Lincoln. <\/span><span style=\"font-weight: 400;\">What we do have control over is the way we react. We do not believe in just accepting this outcome blindly. As Hillary Clinton said, “fighting for what’s right is always worth it.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\"> But we must remember that spreading hate from the roots of frustration and disbelief serves only to divide this country further. We must take the results of this election and the sparks that have been ignited and turn this into a powerful message. A message to those who feel alone and marginalized that they are accepted and loved by those around them regardless of the results of the election. We must teach each other that all people, regardless of color, race, sexual orientation, national origin, religious belief and gender are equal and deserving. We must teach each other to advocate for humanity and not just the portion of humanity that we personally identify with. In the midst of hate, we must be the ones to love, regardless of who you voted for. This is not about the election anymore, this is about healing a divided country. Donald Trump does not decide the direction that America goes in— that is for us to decide and for us to work on.<\/span>\r\n\r\n[caption id=\"attachment_125972\" align=\"alignright\" width=\"296\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/15049931_1175480732528013_981591586_n.jpg\"><img class=\"wp-image-125972\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/15065068_1175480765861343_772885374_o.jpg\" alt=\"15065068_1175480765861343_772885374_o\" width=\"296\" height=\"395\" \/><\/a> Celebrating the diversity of San Francisco a Mural in Clarion Alley reads \"We all deserve a healthy and safe community.\" Photo: Emilia Diaz-Magaloni[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">This was the first time our parents cast their ballot in America and their feelings shifted from pride to shame and anger. The results personally targeted the culture and people that we had grown up with. Yet, as their children, we feel that it is our obligation to show them that being American is still something you can be proud of.<\/span>\r\n\r\nHow can we help? Here are some places to start:\r\n\r\n<a href=\"https:\/\/secure.ppaction.org\/site\/Donation2?df_id=12913&amp;12913.donation=form1&amp;_ga=1.13995888.612856898.1478903209\"><strong>Planned Parenthood<\/strong>- <\/a>Providing health care and sex education to women and men worldwide\r\n\r\n<strong><a href=\"https:\/\/www.cair.com\/donations\/general-donation\/campaign\/#\/donation\">Council on American-Islamic Relations (CAIR)-<\/a> <\/strong>is the country’s largest Muslim civil liberties organization.\r\n\r\n<a href=\"https:\/\/donate.naacp.org\/page\/contribute\/make-a-contribution\"><strong>National Association for the Advancement of Colored People<\/strong>-<\/a> Fighting against racial discrimination\r\n\r\n<a href=\"https:\/\/nilc.z2systems.com\/np\/clients\/nilc\/donation.jsp?campaign=15\"><strong>National Immigration Law Center<\/strong>- <\/a>Defending the rights of immigrants\r\n\r\n<a href=\"https:\/\/action.aclu.org\/…\/protect-rights-freedoms-we-believ…\"><strong>American Civil Liberties Union<\/strong>-<\/a> They promise to take Trump to court if he implements any policies that violate our rights as citizens\r\n\r\n<a href=\"https:\/\/www.propublica.org\/donate\/\"><strong>ProPublica<\/strong>-<\/a> Non-partisan independent investigative journalism that works to keep people in power honest\r\n\r\n<a href=\"https:\/\/give.thetrevorproject.org\/checkout\/donation…\"><strong>The Trevor Project<\/strong>-<\/a> Counseling and education for LGBTQ youth\r\n\r\n<strong><a href=\"https:\/\/secure.earthjustice.org\/site\/Donation2?df_id=10960&amp;10960.donation=form1&amp;_ga=1.146521844.1974926048.1478708236\">EarthJustice- <\/a><\/strong>The largest nonprofit environmental law organization in the country, working to protect wildlife, for healthy communities, and for cleaner energy options.\r\n\r\nAnd a longer <a href=\"http:\/\/jezebel.com\/a-list-of-pro-women-pro-immigrant-pro-earth-anti-big-1788752078\">list of Pro-Women, Pro-Immigrant, Pro-Earth, Anti-Bigotry Organizations <\/a>that need your support.","excerpt":"As an immigrant, there is always a feeling of exclusion between the country you are from and the one you live in. Our family's relationship with these two sides of their identity is confusing, sometimes angry and filled with a constant struggle. Yet the day they cast their ballots, they felt unquestionably American, and for once there were no reservations attached to that feeling of patriotism.\r\n","date":"2016-11-15 20:52:36","author":"Emilia Diaz-Magaloni","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/15051979_1177705778972175_1125646517_o.jpg","categories":["Editor's Pick","Opinion","Opinion Editor's Pick","Spotlight"],"tags":["2016 election","Donald Trump","Hillary Clinton","protest","San Francisco"]},{"id":126088,"title":"Students react to California proposition results","permalink":"http:\/\/palyvoice.com\/2016\/11\/15\/students-react-to-california-proposition-results\/","content":"Californians face changes after citizens voted on a multitude of <a href=\"http:\/\/palyvoice.com\/2016\/10\/11\/opinion-should-these-state-propositions-pass\/\" target=\"_blank\">propositions <\/a>on Nov. 8, along with the presidential, statewide and local elections.\r\n\r\n<span style=\"font-weight: 400;\">Prop. 51, which passed by an eight percent margin, will put a $9 billion bond towards construction in schools. $7 billion will go towards K-12 schools, while the remaining $2 billion will be put towards community colleges. The bond, which will be paid off over 35 years, will cost the state a total of about $17.6 billion because of the interest on the $9 billion principle. Junior Maya Rebitzer was against Prop. 51 because she feels that it is aimed towards helping construction companies in California rather than school districts.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“In general, it’s better to have more locally funded schools because it is more efficient with the money, and it holds people more accountable when it’s local funding rather than state funding,” Rebitzer said. “The way this proposition is worded does not specify how the money is distributed. School districts just apply for it, and because of that, the richer districts who can afford to hire consultants are more likely to get the money than the districts who actually need it.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">This year, the ballot had two propositions regarding the death penalty, giving California the choice between speeding up or repealing the process. Sophomore Claire Chen is glad that Prop. 66 won and the death penalty will be sped up because she believes it will help reduce the amount of money spent on a process that many consider slow.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I think there has to be a death penalty, but it also has to get sped up or it has to cost us way less money because right now we’re spending hundreds of thousands of dollars trying to keep these prisoners who have committed murders in prison, and I don’t think we should be spending this much money on that,” Chen said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">However, junior Reza Navadeh disagrees, and thinks speeding up the death penalty will leave more room for error.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I think that it is not good to have a faster death row, and I believe that it is worth the tax dollars to keep innocent people alive rather than to possibly getting the wrong guy,” Navadeh said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Navadeh also thinks that the passage of Prop. 64, which legalized recreational marijuana for people ages 21 and over, has potential benefits and drawbacks.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I think that it will be very interesting to see how the marijuana industry in California will increase an already huge California economy,” Navadeh said. “But it seems that there are a lot of issues with its legalization. It is predicted that there will be harsher punishments for minors with marijuana, and that the price will increase, which would be bad for medical users. I think that it's about time we see weed legalized in California, and I’m interested in seeing if this will overall lead to a good or bad for outcome for consumers.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Prop. 55, which was passed by a 24.2 percent margin, extends the income tax increase that was voted for in 2012 via Prop. 30. This increased the taxes by one to three percent for people with annual incomes over $263,000. Prop. 55 extended the increase to those who make over $250,000 a year, and will be in effect until 2030. Senior Ben Beaudry supports the proposition.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I do ... agree with the increased taxes for people making over $250,000 since they are making enough to support themselves and can give a bit more. Plus, the government needs the money,” Beaudry said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">See the infographic below for a summary of how Californians voted on each proposition.<\/span>\r\n\r\n<iframe style=\"overflow-y: hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/17999105-california-propositions\" width=\"800\" height=\"3386\" frameborder=\"0\" scrolling=\"no\"><\/iframe>","excerpt":"Californians face changes after citizens voted on a multitude of propositions on Nov. 8, along with the presidential, statewide and local elections.","date":"2016-11-15 14:44:18","author":"Maya Akkaraju","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/voting-booth1.jpg","categories":["Features"],"tags":["2016 election","propostions","student reactions"]},{"id":126069,"title":"PAEA advises teachers on post election conduct","permalink":"http:\/\/palyvoice.com\/2016\/11\/15\/paea-advises-teachers-on-post-election-conduct\/","content":"<span style=\"font-weight: 400;\">The Palo Alto Educators Association is reminding teachers to reference their contracts before making any controversial remarks about the presidential election to their students. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Appendix G of the <\/span><a href=\"http:\/\/www.paeacta.org\/f\/PAEA_Contract_2015-2018_.pdf\"><span style=\"font-weight: 400;\">Collective Bargaining Agreement<\/span><\/a><span style=\"font-weight: 400;\"> between the PAEA and the Palo Alto Unified School District, teachers are obligated to “approach controversial issues in the spirit of inquiry rather than advocacy.” Additionally, teachers must “emphasize that differences of opinion and protest are to be exercised” and “respect for minority opinion should be encouraged.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">PAEA also gave teachers’ advice about how to conduct themselves during <a href=\"http:\/\/palyvoice.com\/2016\/11\/14\/students-plan-peace-march-and-rally-for-tomorrow\/\">The Palo Alto Peace March<\/a>, a student-led walkout scheduled for tomorrow afternoon. The march is scheduled to begin before the official end of school, presenting a large attendance issue. While the march’s <\/span><a href=\"https:\/\/www.facebook.com\/events\/1109804029117714\/\"><span style=\"font-weight: 400;\">Facebook event page<\/span><\/a><span style=\"font-weight: 400;\"> states that the march “is not directed towards trump specifically” and that “the demonstration is purely peaceful and NOT political,” PAEA urges teachers to keep their contracts in mind.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“<\/span><span style=\"font-weight: 400;\">While we would never suppress students' rights to free speech or the right to gather, as educators, we can not promote students leaving classes and possibly school grounds during school hours,” PAEA President Teri Baldwin said. “We need to make sure our classrooms and school campuses are a safe place for all of our students to feel they can share their opinions without judgment or fear of retaliation.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The issue was recently brought to light when a Mountain View High School teacher was put on paid administrative leave after allegedly comparing president-elect Donald Trump to Adolf Hitler. <\/span>\r\n\r\nThe current situation opens up important questions about what teachers should and shouldn't do post-election, in the classroom.\r\n\r\n\"I think it's important for teachers to be mindful of their verbiage as they discuss the election because there are students of differing political backgrounds and it could potentially make a student feel uncomfortable knowing their teacher feels a certain way about the topic,\" senior Alexandra Stump said.","excerpt":"The Palo Alto Educators Association is reminding teachers to reference their contracts before making any controversial remarks about the presidential election to their students. ","date":"2016-11-15 11:53:49","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/IMG_0979.jpg","categories":["News","Uncategorized"],"tags":["conduct","Contract","election","hitler","mountain view","paea","peace march","reminder","teachers","Trump"]},{"id":125982,"title":"Students plan &#8220;peace march&#8221; and rally for tomorrow","permalink":"http:\/\/palyvoice.com\/2016\/11\/14\/students-plan-peace-march-and-rally-for-tomorrow\/","content":"<span style=\"font-weight: 400;\">In response to the recent presidential election results, a rally organized by Palo Alto High School students to promote acceptance and equality will take place at 2:30 p.m. tomorrow at Lytton Plaza.<\/span>\r\n\r\nThe rally will begin with a \"peace march,\" as described by a Facebook <a href=\"https:\/\/www.facebook.com\/events\/1109804029117714\/?notif_t=plan_user_invited&amp;notif_id=1479014293748598\" target=\"_blank\">event page<\/a>, in which Paly students will participate in a walkout from their Flex period at 1:50 p.m., followed by a march downtown. According to Paly junior and co-organizer Zoe Stedman, protesters will then meet up with participating students from Gunn High School, Castilleja School and Stanford University at Lytton Plaza.\r\n\r\n[caption id=\"attachment_126086\" align=\"alignleft\" width=\"410\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/15058791_1177703345639085_1867680709_n.jpg\"><img class=\" wp-image-126086\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/15058791_1177703345639085_1867680709_n.jpg\" alt=\"Students and San Francisco residents participate in a  similar rally outside San Fransisco city hall that took place last week. Photo by Emilia Diaz-Magaloni\" width=\"410\" height=\"230\" \/><\/a> Students and San Francisco residents participate in a similar rally outside San Fransisco city hall. Photo by Emilia Diaz-Magaloni[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Paly students plan to congregate on the Quad at 1:50 p.m. The march will officially begin at 2 p.m., and students are scheduled to reach Lytton Plaza by 2:30 p.m.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Paly junior and co-organizer Hana Morita, the objective of the march is to spread love and unity in the wake of a particularly controversial presidential election.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We are demonstrating a peaceful march to show that we do not tolerate certain actions and things said during this election,” Morita said. “This is an act of unity to show compassion and respect to everyone, and also model the respect and dignity that we feel should have been modeled for us.”<\/span>\r\n\r\nOrganizers emphasize that the walkout is not a protest of the president-elect Donald Trump, and that any messages of hate will not be tolerated.\r\n\r\n<span style=\"font-weight: 400;\">“We are trying to make it clear that this is not supposed to be an anti-Trump protest,” Stedman said. \"Positive, peaceful messages only.” <\/span>\r\n\r\nIn line with this, organizers strongly discourage the use of any explicit signage, including that specifically targeting newly elected president Donald Trump.\r\n\r\nIn addition to keeping the content of the demonstration positive, safety remains a top priority.\r\n\r\n\"The main goal of the protest is to promote messages of love in a peaceful way,\" Stedman said. \"We have notified Palo Alto Police Department and Paly administration of the demonstration plans, and therefore have reassurance that the protest will remain completely peaceful.\"\r\n\r\nWhile administration is aware of the demonstration, students are discouraged from cutting class, and will be marked absent on their attendance record if they choose to participate, as per school policy. An email was sent out to parents by Assistant Principal Kathie Laurence reiterating this message.\r\n\r\n\"We want to make you aware that your student may participate tomorrow in a student-initiated event scheduled during school hours,\" Laurence stated. \"While we respect their freedom of speech and passion, we reminded them today that Flex time is instructional time, and they are supposed to be on campus.\"\r\n\r\nStudents were made aware of this information earlier in the day via a Schoology message, also posted by Laurence.\r\n\r\n\"We ask that you consider staying on campus tomorrow as we are responsible for your safety,\" Laurence stated.\r\n\r\n<span style=\"font-weight: 400;\">Although the prospect of cutting Flex may deter students, Morita encourages people to come out and join the march.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I understand that some people do not want a cut,\" Morita said. \"However, this is a small setback compared to people who fear for their family and do not feel safe at home. By coming out you are showing that you are committing to protecting your friends, peers and community.\"<\/span>","excerpt":"In response to the recent presidential election results, a rally organized by Palo Alto High School students to promote acceptance and equality will take place at 2:30 p.m. tomorrow at Lytton Plaza.","date":"2016-11-14 19:43:58","author":"Maya Reuven","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/15058791_1177703345639085_1867680709_n.jpg","categories":["News","Spotlight","Uncategorized"],"tags":["acceptance","election","flex","love","march","peace","protest","Trump","tuesday","unity","walkout"]},{"id":126019,"title":"Season Recap: Boys’ water polo falls in CCS first round","permalink":"http:\/\/palyvoice.com\/2016\/11\/14\/season-recap-boys-water-polo-falls-in-ccs-first-round\/","content":"[caption id=\"attachment_123652\" align=\"aligncenter\" width=\"646\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/DSC_0027.jpg\"><img class=\" wp-image-123652\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/DSC_0027.jpg\" alt=\"Senior field player Eric Maser scores on a volley from the left side of the pool in the 1st quarter. Photo by Ethan Kao. \" width=\"646\" height=\"452\" \/><\/a> Senior field player Eric Maser scores on a volley from the left side of the pool in the 1st quarter. Photo: Ethan Kao.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto High School boys’ water polo team (16-11, 12-2) ended its season Saturday with a 9-8 loss to Menlo-Atherton (15-15, 5-1) in the first round of the Central Coast Section playoffs. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Despite taking a quick 4-1 lead in the first quarter, the Vikings failed to finish the match strong. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior field player Jared Stanley is regretful of the loss. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Our offense and defense really clicked the first half and we were playing really well” Stanley said. “We got off to a quick lead but lost our focus near the end of the game.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">With a 7-3 lead after two quarters, the Vikings struggled defensively, letting in three more goals in the third quarter.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior field player Tommy Smale describes the struggles offensively and defensively.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“After the second quarter we started to fall apart,” Smale said. “Our offense wasn’t moving the ball as well and we were taking a lot more outside shots rather than going in. Defensively, we were not as strong either.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Vikings continued to struggle in the fourth quarter losing the match 9-8.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Despite the loss, senior field player Ethan Bundy said he was proud of the team. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Although we lost today I am super proud of our team,” said Bundy. “We have improved so much from where we started and we grew individually and as a team throughout the season.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Vikings will lose over half of the team next season to graduation, but the team is still optimistic about the future, according to Stanley. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The juniors stepped up a ton this season so I think the team will be just fine,” Stanley said. “We [the seniors] taught them well.”<\/span>\r\n\r\nSome players to look out for next season are juniors Mathew Nemeth, Benjamin Rapperport and John Andersen according to Stanley.","excerpt":"The Palo Alto High School boys’ water polo team (16-11, 12-2) ended its season Saturday with a 9-8 loss to Menlo-Atherton (15-15, 5-1) in their first Central Coast League playoff game.","date":"2016-11-14 09:36:44","author":"Ethan Kao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/DSC_0075.jpg","categories":["Sports","Spotlight","Uncategorized"],"tags":["Boys","CCS","Eric Maser","ethan bundy","jared stanley","MA","menlo-atherton","playoffs","polo","Tommy Smale","water","water polo"]},{"id":125929,"title":"Verbatim: Where were you during the election?","permalink":"http:\/\/palyvoice.com\/2016\/11\/13\/verbatim-where-were-you-during-the-election\/","content":"Palo Alto High School students and faculty watched closely as the 2016 presidential election results came in, anxious to see whether their preferred candidates would become the president-elect.\r\n\r\nThe following day, The Paly Voice walked around campus to ask the Paly community where they were, who they were with and the mood of the room during this historic election.\r\n\r\n<a href=\"http:\/\/&lt;iframe src=&quot;https:\/\/docs.google.com\/presentation\/d\/1h0eVd3j8oIggZnbaUYH4Qm6CxVIKxhyx2u8y67FTh70\/embed?start=true&amp;loop=true&amp;delayms=3000&quot; frameborder=&quot;0&quot; width=&quot;960&quot; height=&quot;569&quot; allowfullscreen=&quot;true&quot; mozallowfullscreen=&quot;true&quot; webkitallowfullscreen=&quot;true&quot;&gt;&lt;\/iframe&gt;\"><iframe src=\"https:\/\/docs.google.com\/presentation\/d\/1h0eVd3j8oIggZnbaUYH4Qm6CxVIKxhyx2u8y67FTh70\/embed?start=true&amp;loop=true&amp;delayms=60000\" width=\"700\" height=\"450\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe><\/a>","excerpt":"The Paly Voice asked the Paly community where they were, who they were with and the mood of the room during this historic election.","date":"2016-11-13 15:11:16","author":"Kasra Orumchian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/Trump-and-Clinton.jpg","categories":["Election 2016","News","Spotlight","Verbatims"],"tags":["2016","Clinton","diorio","election 2016","juniors","obama","palo alto","palo alto high school","paly","slideshow","Trump","vikings"]},{"id":125906,"title":"Video: Students react to 2016 presidential election","permalink":"http:\/\/palyvoice.com\/2016\/11\/11\/video-students-react-to-2016-presidential-election\/","content":"In a historic election, the United States elected Donald Trump as its 45th president on Tuesday. With many differing opinions on the outcome, The Paly Voice asked students what they thought about the election.\r\n\r\nhttps:\/\/youtu.be\/ZRR-BbVhm34\r\n\r\n&nbsp;","excerpt":"The Paly Voice asked students what they thought about the election.","date":"2016-11-11 21:37:56","author":"Julia Qiao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/Screen-Shot-2016-11-11-at-9.37.31-PM1.png","categories":["Election 2016","Multimedia","Spotlight"],"tags":["election","President","reaction","verbatim","video"]},{"id":125655,"title":"Storify: 2016 elections","permalink":"http:\/\/palyvoice.com\/2016\/11\/11\/storify-2016-elections\/","content":"This year's presidential, state and city-wide elections came into full swing on Nov. 8. Explore each candidate's social media presence through this interactive collection, and read Palo Altans' stances on these issues.\r\n\r\n<hr \/>\r\n\r\nRepublican candidate Donald Trump and democratic candidate Hillary Clinton face off for the presidential bid.\r\n\r\n<iframe style=\"border: none; overflow: hidden;\" src=\"https:\/\/www.facebook.com\/plugins\/post.php?href=https%3A%2F%2Fwww.facebook.com%2Fhillaryclinton%2Fposts%2F1324421317614394&amp;width=500\" width=\"500\" height=\"306\" frameborder=\"0\" scrolling=\"no\"><\/iframe>\r\n\r\n<iframe style=\"border: none; overflow: hidden;\" src=\"https:\/\/www.facebook.com\/plugins\/post.php?href=https%3A%2F%2Fwww.facebook.com%2Fibby.day.7%2Fposts%2F1283482721693300&amp;width=500\" width=\"500\" height=\"193\" frameborder=\"0\" scrolling=\"no\"><\/iframe>\r\n\r\n<iframe style=\"border: none; overflow: hidden;\" src=\"https:\/\/www.facebook.com\/plugins\/post.php?href=https%3A%2F%2Fwww.facebook.com%2Fpermalink.php%3Fstory_fbid%3D2007727962787325%26id%3D100006504230113&amp;width=500\" width=\"500\" height=\"441\" frameborder=\"0\" scrolling=\"no\"><\/iframe>\r\n\r\n<iframe style=\"border: none; overflow: hidden;\" src=\"https:\/\/www.facebook.com\/plugins\/video.php?href=https%3A%2F%2Fwww.facebook.com%2FDonaldTrump%2Fvideos%2F10158093111355725%2F&amp;show_text=0&amp;width=560\" width=\"560\" height=\"315\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n<iframe style=\"border: none; overflow: hidden;\" src=\"https:\/\/www.facebook.com\/plugins\/post.php?href=https%3A%2F%2Fwww.facebook.com%2Fethan.bundy.12%2Fposts%2F1321415197892983&amp;width=500\" width=\"500\" height=\"612\" frameborder=\"0\" scrolling=\"no\"><\/iframe>\r\n\r\n<iframe style=\"border: none; overflow: hidden;\" src=\"https:\/\/www.facebook.com\/plugins\/video.php?href=https%3A%2F%2Fwww.facebook.com%2FMileyCyrus%2Fvideos%2F10154808405142147%2F&amp;show_text=0&amp;width=400\" width=\"400\" height=\"400\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n<script src=\"\/\/platform.twitter.com\/widgets.js\" async=\"\" charset=\"utf-8\"><\/script><script src=\"\/\/platform.twitter.com\/widgets.js\" async=\"\" charset=\"utf-8\"><\/script>\r\n<blockquote class=\"twitter-tweet\" data-lang=\"en\">Don't stand still. Vote today: <a href=\"https:\/\/t.co\/jfd3CXLD1s\">https:\/\/t.co\/jfd3CXLD1s<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/ElectionDay?src=hash\">#ElectionDay<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/MannequinChallenge?src=hash\">#MannequinChallenge<\/a> <a href=\"https:\/\/t.co\/4KAv2zu0rd\">pic.twitter.com\/4KAv2zu0rd<\/a>\r\n\r\n<iframe style=\"border: none; overflow: hidden;\" src=\"https:\/\/www.facebook.com\/plugins\/post.php?href=https%3A%2F%2Fwww.facebook.com%2Fpermalink.php%3Fstory_fbid%3D10207782492137238%26id%3D1142166728&amp;width=500\" width=\"500\" height=\"601\" frameborder=\"0\" scrolling=\"no\"><\/iframe>\r\n\r\n<iframe style=\"border: none; overflow: hidden;\" src=\"https:\/\/www.facebook.com\/plugins\/post.php?href=https%3A%2F%2Fwww.facebook.com%2Fethan.bundy.12%2Fposts%2F1321247531243083&amp;width=500\" width=\"500\" height=\"454\" frameborder=\"0\" scrolling=\"no\"><\/iframe>\r\n\r\n— Hillary Clinton (@HillaryClinton) <a href=\"https:\/\/twitter.com\/HillaryClinton\/status\/795955854059171840\">November 8, 2016<\/a><\/blockquote>\r\n<blockquote class=\"twitter-tweet\" data-lang=\"en\">\r\n<p dir=\"ltr\" lang=\"en\">If only people with at least 4 grandparents born in America were voting, Trump would win in a 50-state landslide.<\/p>\r\n— Ann Coulter (@AnnCoulter) <a href=\"https:\/\/twitter.com\/AnnCoulter\/status\/795833821501460480\">November 8, 2016<\/a><\/blockquote>\r\n<script src=\"\/\/platform.twitter.com\/widgets.js\" async=\"\" charset=\"utf-8\"><\/script><script src=\"\/\/platform.twitter.com\/widgets.js\" async=\"\" charset=\"utf-8\"><\/script>\r\n<blockquote class=\"twitter-tweet\" data-lang=\"en\">\r\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/CrookedHillary?src=hash\">#CrookedHillary<\/a> is unfit to serve. <a href=\"https:\/\/t.co\/bSuGvInNF1\">pic.twitter.com\/bSuGvInNF1<\/a><\/p>\r\n— Donald J. Trump (@realDonaldTrump) <a href=\"https:\/\/twitter.com\/realDonaldTrump\/status\/794281898570825728\">November 3, 2016<\/a><\/blockquote>\r\n<script src=\"\/\/platform.twitter.com\/widgets.js\" async=\"\" charset=\"utf-8\"><\/script>\r\n\r\n<blockquote class=\"twitter-tweet\" data-lang=\"en\">Tomorrow, we have the chance to stand up for the America we believe in. RT this if you're voting. <a href=\"https:\/\/t.co\/jfd3CXLD1s\">https:\/\/t.co\/jfd3CXLD1s<\/a> <a href=\"https:\/\/t.co\/Wb7iYnjxdW\">pic.twitter.com\/Wb7iYnjxdW<\/a> — Hillary Clinton (@HillaryClinton) <a href=\"https:\/\/twitter.com\/HillaryClinton\/status\/795770626212503552\">November 7, 2016<\/a><\/blockquote>\r\n\r\n&nbsp;\r\n\r\n\r\n<hr \/>\r\n\r\n\r\n<script src=\"\/\/platform.twitter.com\/widgets.js\" async=\"\" charset=\"utf-8\"><\/script>\r\n\r\nSenate candidates Democrats Kamala Harris and Loretta Sanchez will be fighting for the first open Senate seat in California in decades.\r\n\r\n<iframe style=\"border: none; overflow: hidden;\" src=\"https:\/\/www.facebook.com\/plugins\/post.php?href=https%3A%2F%2Fwww.facebook.com%2Famypoehlersmartgirls%2Fposts%2F10155348028204338&amp;width=500\" width=\"500\" height=\"502\" frameborder=\"0\" scrolling=\"no\"><\/iframe>\r\n<blockquote class=\"twitter-tweet\" data-lang=\"en\">\r\n<p dir=\"ltr\" lang=\"en\">It was a moment I will cherish forever: casting my ballot for the first woman president. <a href=\"https:\/\/twitter.com\/hashtag\/ImWithHer?src=hash\">#ImWithHer<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/iVoted?src=hash\">#iVoted<\/a> <a href=\"https:\/\/t.co\/Z7I4RQ5JPc\">pic.twitter.com\/Z7I4RQ5JPc<\/a><\/p>\r\n— Kamala Harris (@KamalaHarris) <a href=\"https:\/\/twitter.com\/KamalaHarris\/status\/796078468664586240\">November 8, 2016<\/a><\/blockquote>\r\n<script src=\"\/\/platform.twitter.com\/widgets.js\" async=\"\" charset=\"utf-8\"><\/script><iframe style=\"border: none; overflow: hidden;\" src=\"https:\/\/www.facebook.com\/plugins\/post.php?href=https%3A%2F%2Fwww.facebook.com%2Fcnnpolitics%2Fposts%2F1302919056416591&amp;width=500\" width=\"500\" height=\"500\" frameborder=\"0\" scrolling=\"no\"><\/iframe> \r\n\r\n\r\n<hr \/>\r\n\r\n\r\nAt the state level, democrats Vicki Veenker and Marc Berman run a tight election for California Assembly. <iframe style=\"border: none; overflow: hidden;\" src=\"https:\/\/www.facebook.com\/plugins\/post.php?href=https%3A%2F%2Fwww.facebook.com%2Fmarcberman%2Fposts%2F10155523651668916&amp;width=500\" width=\"500\" height=\"557\" frameborder=\"0\" scrolling=\"no\"><\/iframe> \r\n\r\n<blockquote class=\"twitter-tweet\" data-lang=\"en\">\"I am absolutely convinced that Vicki Veenker is the best person to represent us in AD24.\" - Supervisor Joe Simitian <a href=\"https:\/\/t.co\/vzFAi7HGO8\">https:\/\/t.co\/vzFAi7HGO8<\/a> — Vicki Veenker (@Vicki4Assembly) <a href=\"https:\/\/twitter.com\/Vicki4Assembly\/status\/794671530869276672\">November 4, 2016<\/a><\/blockquote>\r\n\r\n<script src=\"\/\/platform.twitter.com\/widgets.js\" async=\"\" charset=\"utf-8\"><\/script>\r\n<blockquote class=\"twitter-tweet\" data-lang=\"en\">I stand w\/ her experience, credentials &amp; enviro leaders\/orgs <a href=\"https:\/\/twitter.com\/hashtag\/IStandWithVicki?src=hash\">#IStandWithVicki<\/a> <a href=\"https:\/\/twitter.com\/Vicki4Assembly\">@Vicki4Assembly<\/a> <a href=\"https:\/\/twitter.com\/clcv\">@clcv<\/a> <a href=\"https:\/\/twitter.com\/cejapower\">@cejapower<\/a> <a href=\"https:\/\/twitter.com\/SierraClubCA\">@SierraClubCA<\/a> <a href=\"https:\/\/twitter.com\/SenatorPavley\">@SenatorPavley<\/a> — Susan Frank (@suzfrankCA) <a href=\"https:\/\/twitter.com\/suzfrankCA\/status\/793265549849468929\">November 1, 2016<\/a><\/blockquote>\r\n<blockquote class=\"twitter-tweet\" data-lang=\"en\">Posting your completed ballot online is illegal, so here's a \"before\" photo. I bet you can guess what the \"after\" photo looks like. <a href=\"https:\/\/twitter.com\/hashtag\/AD24?src=hash\">#AD24<\/a> <a href=\"https:\/\/t.co\/cUt5KS7FWT\">pic.twitter.com\/cUt5KS7FWT<\/a> — Marc Berman (@Marc_Berman) <a href=\"https:\/\/twitter.com\/Marc_Berman\/status\/794326331240517632\">November 3, 2016<\/a><\/blockquote>\r\n<blockquote class=\"twitter-tweet\" data-lang=\"en\">Thank you <a href=\"https:\/\/twitter.com\/pydems\">@pydems<\/a> for being the first organization to endorse my campaign for the <a href=\"https:\/\/twitter.com\/hashtag\/California?src=hash\">#California<\/a> state assembly! <a href=\"http:\/\/t.co\/m8GcBjF3Cy\">pic.twitter.com\/m8GcBjF3Cy<\/a> — Marc Berman (@Marc_Berman) <a href=\"https:\/\/twitter.com\/Marc_Berman\/status\/624451164478648320\">July 24, 2015<\/a><\/blockquote>\r\n&nbsp;\r\n\r\n<hr \/>\r\n\r\nU.S. House of Representatives candidates are Democrat Anna Eshoo and Republican Richard Fox. Eshoo is expected to win the race. State senator Democrat Jerry Hill will be facing off against Republican opponent Rick Ciardella.\r\n\r\n<iframe style=\"border: none; overflow: hidden;\" src=\"https:\/\/www.facebook.com\/plugins\/post.php?href=https%3A%2F%2Fwww.facebook.com%2Fjan.hagge1%2Fposts%2F10153658274142939&amp;width=500\" width=\"500\" height=\"764\" frameborder=\"0\" scrolling=\"no\"><\/iframe>\r\n\r\n<hr \/>\r\n\r\nAt the city level, <a href=\"http:\/\/www.cityofpaloalto.org\/gov\/depts\/clk\/elections.asp\" target=\"_blank\">eleven candidates<\/a> are competing for nine spots.\r\n<blockquote class=\"twitter-tweet\" data-lang=\"en\">Today is the day! Please Re-elect Liz Kniss for Palo Alto City Council! <a href=\"https:\/\/twitter.com\/hashtag\/womeningov?src=hash\">#womeningov<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/paloalto?src=hash\">#paloalto<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/election2016?src=hash\">#election2016<\/a>🇺🇸 <a href=\"https:\/\/twitter.com\/hashtag\/elections?src=hash\">#elections<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/electionday?src=hash\">#electionday<\/a> <a href=\"https:\/\/t.co\/xgm7tft6hJ\">pic.twitter.com\/xgm7tft6hJ<\/a> — Liz Kniss (@LizKniss) <a href=\"https:\/\/twitter.com\/LizKniss\/status\/796082763505881088\">November 8, 2016<\/a><\/blockquote>\r\n<script src=\"\/\/platform.twitter.com\/widgets.js\" async=\"\" charset=\"utf-8\"><\/script>\r\n\r\n<blockquote class=\"twitter-tweet\" data-lang=\"en\">a new low in PA, lydia kou's attack ads are ugly. i'm with adrian fine <a href=\"https:\/\/twitter.com\/hashtag\/votefine?src=hash\">#votefine<\/a> <a href=\"https:\/\/t.co\/FCwuXiyaXQ\">https:\/\/t.co\/FCwuXiyaXQ<\/a> — Elaine Uang (@elaineuang) <a href=\"https:\/\/twitter.com\/elaineuang\/status\/787773888520335360\">October 16, 2016<\/a><\/blockquote>\r\n\r\n<script src=\"\/\/platform.twitter.com\/widgets.js\" async=\"\" charset=\"utf-8\"><\/script>\r\n\r\n<hr \/>\r\n\r\nFive candidates vie for three spots on the Palo Alto School Board. Melissa Baten Caswell, Jay Blas Cabrera, Todd Collins, Jennifer DiBrienza and Heidi Emberling have lobbied for these spots.\r\n<blockquote class=\"twitter-tweet\" data-lang=\"en\">Voting for Jennifer DiBrienza for Palo Alto School Board, and incumbents Heidi Emberling and Melissa Baten Caswell <a href=\"https:\/\/t.co\/wWp5rCsKHn\">pic.twitter.com\/wWp5rCsKHn<\/a> — Esther Wojcicki (@EstherWojcicki) <a href=\"https:\/\/twitter.com\/EstherWojcicki\/status\/794781740753502208\">November 5, 2016<\/a><\/blockquote>\r\n<script src=\"\/\/platform.twitter.com\/widgets.js\" async=\"\" charset=\"utf-8\"><\/script>Palo Alto High School journalism teacher Esther Wojcicki will be voting for Jennifer DiBrienza, Heidi Emberling and Melissa Baten Caswell. \r\n\r\n<blockquote class=\"twitter-tweet\" data-lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/supportingallstudents?src=hash\">#supportingallstudents<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/bridging?src=hash\">#bridging<\/a> the gap <a href=\"https:\/\/t.co\/cAjQGWnHer\">pic.twitter.com\/cAjQGWnHer<\/a> — Melissa Caswell (@mbcs) <a href=\"https:\/\/twitter.com\/mbcs\/status\/794204607140368384\">November 3, 2016<\/a><\/blockquote>\r\n\r\n<script src=\"\/\/platform.twitter.com\/widgets.js\" async=\"\" charset=\"utf-8\"><\/script>\r\n<blockquote class=\"twitter-tweet\" data-lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/VoteSV?src=hash\">#VoteSV<\/a> <a href=\"https:\/\/t.co\/hbCaDR9CBq\">pic.twitter.com\/hbCaDR9CBq<\/a> — Jay B Jacob Cabrera (@0e) <a href=\"https:\/\/twitter.com\/0e\/status\/738546913729863680\">June 3, 2016<\/a><\/blockquote>\r\n<script src=\"\/\/platform.twitter.com\/widgets.js\" async=\"\" charset=\"utf-8\"><\/script>\r\n\r\n<blockquote class=\"twitter-tweet\" data-lang=\"en\">Can male teacher hug female student on campus? Baten Caswell, Collins, Emberling and DiBrienza: No Cabrera: Depends on interaction and why — Palo Alto Weekly (@paloaltoweekly) <a href=\"https:\/\/twitter.com\/paloaltoweekly\/status\/778442228280590336\">September 21, 2016<\/a><\/blockquote>\r\n\r\n<script src=\"\/\/platform.twitter.com\/widgets.js\" async=\"\" charset=\"utf-8\"><\/script>\r\n<blockquote class=\"twitter-tweet\" data-lang=\"en\">Love our awesome high school Principals! <a href=\"https:\/\/twitter.com\/hashtag\/pausd?src=hash\">#pausd<\/a><a href=\"https:\/\/t.co\/oEjCjCbMOC\">pic.twitter.com\/oEjCjCbMOC<\/a>\r\n\r\n— Heidi Emberling (@HeidiEmberling) <a href=\"https:\/\/twitter.com\/HeidiEmberling\/status\/692083563911491584\">January 26, 2016<\/a>\r\n\r\n&nbsp;<\/blockquote>","excerpt":"This year's presidential, state and city-wide elections came into full swing on Nov. 8. Explore each candidate's social media presence through this interactive collection, and read Palo Altans' stances on these issues.","date":"2016-11-11 12:48:12","author":"Adrienne Kwok","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/Screenshot-2016-11-08-at-5.34.10-PM.png","categories":["Election 2016","Multimedia","Spotlight"],"tags":["2016","Clinton","Facebook","instagram","media","President","presidential","social","storify","Trump","twitter","voting"]}]